var addresses = [
    {
        "lnglat": [
            121.260559,
            31.345639
        ],
        "address": "阿克苏路1099号",
        "name": "宝龙城市广场_公寓楼",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.523879,
            31.202854
        ],
        "address": "北园路258弄",
        "name": "东方汇景苑",
        "count": 79,
        "style": 0
    },
    {
        "lnglat": [
            121.522256,
            31.21595
        ],
        "address": "北张家浜路88弄",
        "name": "左岸88",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.445173,
            31.237719
        ],
        "address": "海防路429弄8号",
        "name": "领航静安艺庭",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.20504,
            31.416662
        ],
        "address": "汇源路218号",
        "name": "中茂世纪财富广场",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.385118,
            31.106187
        ],
        "address": "闵城路199弄",
        "name": "好世鹿鸣苑",
        "count": 92,
        "style": 0
    },
    {
        "lnglat": [
            121.426441,
            31.076993
        ],
        "address": "颛兴东路745号",
        "name": "拉法叶园区B楼墨空间",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.260559,
            31.345639
        ],
        "address": "阿克苏路1099号",
        "name": "宝龙城市广场_公寓楼",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.259663,
            31.350355
        ],
        "address": "阿克苏路1358号",
        "name": "惟乐教育文化园（赢嘉商务楼）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.528402,
            31.3016
        ],
        "address": "安波路533弄1-3号，安波路569号",
        "name": "海上硕和国际办公楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.527855,
            31.301275
        ],
        "address": "安波路567号",
        "name": "海上硕和国际城",
        "count": 80,
        "style": 0
    },
    {
        "lnglat": [
            121.173491,
            31.284141
        ],
        "address": "安驰路509弄",
        "name": "尚都国际大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.50894,
            31.257097
        ],
        "address": "安国路28弄",
        "name": "荣胜公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.418232,
            31.201718
        ],
        "address": "安顺路158弄",
        "name": "金电大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.417866,
            31.202338
        ],
        "address": "安顺路158弄3-15号",
        "name": "新安公寓",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.414617,
            31.200083
        ],
        "address": "安顺路251号",
        "name": "虹桥银都大楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.414686,
            31.199912
        ],
        "address": "安顺路255弄",
        "name": "虹桥府邸",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.409708,
            31.200978
        ],
        "address": "安顺路358弄",
        "name": "联鑫虹桥苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.4219,
            31.20057
        ],
        "address": "安顺路89弄8号",
        "name": "浦江大厦",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.164485,
            31.3015
        ],
        "address": "安亭镇和静路986号",
        "name": "世康大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.180909,
            31.285752
        ],
        "address": "安谐路99弄",
        "name": "新城尚上城",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.449111,
            31.243356
        ],
        "address": "安远路16弄",
        "name": "宗鑫公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.440705,
            31.237757
        ],
        "address": "安远路501弄2-5号梅山大楼",
        "name": "梅山大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.437507,
            31.236934
        ],
        "address": "安远路518号",
        "name": "宝华名邸（晶典）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.43941,
            31.237521
        ],
        "address": "安远路531号",
        "name": "阳光商务广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437834,
            31.235973
        ],
        "address": "安远路597弄",
        "name": "静安四季公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.433973,
            31.235328
        ],
        "address": "安远路710号",
        "name": "大昌商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.435043,
            31.234955
        ],
        "address": "安远路777弄",
        "name": "静安阳光名都_上海",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.447315,
            31.242317
        ],
        "address": "安远路84号",
        "name": "新天大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.179268,
            31.286295
        ],
        "address": "安悦路100弄",
        "name": "新城尚上城二期",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.17209,
            31.268718
        ],
        "address": "安智路155号",
        "name": "万创坊",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.511331,
            31.276958
        ],
        "address": "鞍山路160弄",
        "name": "申安公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.512884,
            31.274314
        ],
        "address": "鞍山路5号",
        "name": "杨浦商城（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.596093,
            31.346504
        ],
        "address": "奥纳路188号",
        "name": "诚信国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.591246,
            31.343877
        ],
        "address": "奥纳路55号",
        "name": "金港大厦（上海）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.592469,
            31.344338
        ],
        "address": "奥纳路79号2幢",
        "name": "交能国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.441318,
            31.248462
        ],
        "address": "澳门路330弄",
        "name": "浅水湾恺悦名城",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.44153,
            31.247049
        ],
        "address": "澳门路356号",
        "name": "三维大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.440398,
            31.245915
        ],
        "address": "澳门路477号",
        "name": "中华1912创意园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.44029,
            31.24494
        ],
        "address": "澳门路519弄",
        "name": "华生大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.448819,
            31.246947
        ],
        "address": "澳门路58弄",
        "name": "圣骊澳门苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.436323,
            31.242861
        ],
        "address": "澳门路715号",
        "name": "715创意园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.435732,
            31.242611
        ],
        "address": "澳门路756弄",
        "name": "澳门公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.434809,
            31.24055
        ],
        "address": "澳门路872弄3号",
        "name": "绿洲尧舜公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.501739,
            31.219942
        ],
        "address": "白渡路188弄",
        "name": "申江新苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.50119,
            31.219729
        ],
        "address": "白渡路258弄",
        "name": "福鑫大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.575674,
            31.234623
        ],
        "address": "白桦路266弄",
        "name": "金色碧云",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.413586,
            31.237565
        ],
        "address": "白兰路169弄",
        "name": "沙田新苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.416215,
            31.234045
        ],
        "address": "白兰路5弄15支弄（白玉路）",
        "name": "上海长发白玉公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.347285,
            31.281085
        ],
        "address": "白丽路185弄",
        "name": "联星丽景苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.556013,
            31.208099
        ],
        "address": "白杨路199弄",
        "name": "大唐盛世花园一期",
        "count": 106,
        "style": 0
    },
    {
        "lnglat": [
            121.555057,
            31.205717
        ],
        "address": "白杨路360弄",
        "name": "环龙新纪园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.259214,
            31.351652
        ],
        "address": "白银路399号",
        "name": "晶鼎大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.42108,
            31.228113
        ],
        "address": "白玉路669弄",
        "name": "创世纪滨河花园",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.367807,
            31.173711
        ],
        "address": "白樟路99弄",
        "name": "中祥龙柏苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.176001,
            31.347655
        ],
        "address": "百安公路2699弄",
        "name": "路劲海尚苑三期",
        "count": 49,
        "style": 0
    },
    {
        "lnglat": [
            121.173318,
            31.354853
        ],
        "address": "百安公路2999弄",
        "name": "兰郡名苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.444898,
            31.141404
        ],
        "address": "百色路451弄",
        "name": "园南二村",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.516073,
            30.954627
        ],
        "address": "百团路326弄",
        "name": "聚贤雅苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.609489,
            31.179651
        ],
        "address": "百业路167弄31号",
        "name": "泊寓翡翠公园店",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.510362,
            31.163538
        ],
        "address": "板泉路1555弄",
        "name": "尚东国际名园一期",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.496522,
            31.201355
        ],
        "address": "半淞园路388号",
        "name": "越界世博园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.494143,
            31.200199
        ],
        "address": "半淞园路585弄",
        "name": "欣安基",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.54014,
            31.301278
        ],
        "address": "包头南路628弄",
        "name": "杨浦欣园二期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.53911,
            31.299792
        ],
        "address": "包头南路629弄",
        "name": "杨浦欣园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.292253,
            31.330736
        ],
        "address": "宝安公路2999弄",
        "name": "东方慧谷",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.287477,
            31.332922
        ],
        "address": "宝安公路3136号",
        "name": "清水湾上海",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.279844,
            31.330569
        ],
        "address": "宝安公路3386号",
        "name": "孩子王(上海大融城店)",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.190888,
            31.312978
        ],
        "address": "宝安公路4997号",
        "name": "上海安亭国际医疗产业园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.429491,
            31.372677
        ],
        "address": "宝安公路7弄1号",
        "name": "上坤极客公寓宝安公路店",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.474032,
            31.259488
        ],
        "address": "宝昌路399弄",
        "name": "绿景晓园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.470536,
            31.263986
        ],
        "address": "宝昌路738弄",
        "name": "广盛公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.391483,
            31.105161
        ],
        "address": "宝城路155弄",
        "name": "名都新城一二期",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.391518,
            31.110909
        ],
        "address": "宝城路500弄",
        "name": "利景花苑",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.498845,
            31.399854
        ],
        "address": "宝东路888弄",
        "name": "中艺花园",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.365238,
            31.34271
        ],
        "address": "宝菊路133弄",
        "name": "保利叶语",
        "count": 110,
        "style": 0
    },
    {
        "lnglat": [
            121.353642,
            31.146324
        ],
        "address": "宝联路88弄",
        "name": "枫荷兰庭",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.483474,
            31.400158
        ],
        "address": "宝林路458号",
        "name": "云派PARK",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.384236,
            31.356498
        ],
        "address": "宝绿路99号",
        "name": "环绿国际",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.359863,
            31.151644
        ],
        "address": "宝南路58号",
        "name": "宝南商务中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.476166,
            31.253753
        ],
        "address": "宝山路268弄",
        "name": "复地新都国际",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.479824,
            31.260184
        ],
        "address": "宝山路625号",
        "name": "上海金宝大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.479307,
            31.261419
        ],
        "address": "宝山路748号",
        "name": "鑫成大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.479472,
            31.262087
        ],
        "address": "宝山路778号",
        "name": "海伦国际",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.479036,
            31.265239
        ],
        "address": "宝山路888弄",
        "name": "虹祺花苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.26788,
            31.022824
        ],
        "address": "宝胜路18号",
        "name": "宝胜国际财富中心",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.479059,
            31.256168
        ],
        "address": "宝通路157弄",
        "name": "和馨苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.478755,
            31.2567
        ],
        "address": "宝通路239弄",
        "name": "包运大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.475795,
            31.25936
        ],
        "address": "宝通路425弄",
        "name": "宝通公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.326121,
            31.302651
        ],
        "address": "宝翔路158弄",
        "name": "旭辉U天地",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.318635,
            31.312832
        ],
        "address": "宝翔路888弄",
        "name": "上海绿色家园(朗诗绿色街区)",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.4712,
            31.391113
        ],
        "address": "宝杨路2000号",
        "name": "宝杨慧照商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.463627,
            31.388115
        ],
        "address": "宝杨路2033号",
        "name": "华泰大厦(上海)",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.455535,
            31.3839
        ],
        "address": "宝杨路2121号",
        "name": "2121创意园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.445343,
            31.378005
        ],
        "address": "宝杨路3003号",
        "name": "闿和阳光广场",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.437568,
            31.371166
        ],
        "address": "宝杨路3288弄",
        "name": "宝启花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.479982,
            31.258249
        ],
        "address": "宝源路301弄",
        "name": "申桂公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.451568,
            31.314729
        ],
        "address": "保德路831弄",
        "name": "保平小区",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.514236,
            31.254928
        ],
        "address": "保定路20弄10-40号",
        "name": "云舫小区",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.490516,
            31.205831
        ],
        "address": "保屯路129弄",
        "name": "北方花苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.393187,
            31.126169
        ],
        "address": "报春路128弄",
        "name": "东苑绿世界花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.384125,
            31.12383
        ],
        "address": "报春路558弄",
        "name": "绿茵苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.536244,
            31.181118
        ],
        "address": "北艾路1077弄",
        "name": "大华锦绣华城11街区",
        "count": 128,
        "style": 0
    },
    {
        "lnglat": [
            121.5277,
            31.1812
        ],
        "address": "北艾路1500号",
        "name": "大华锦绣华城2街区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.523338,
            31.177993
        ],
        "address": "北艾路1765弄",
        "name": "大华锦绣华城4街区",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.522521,
            31.180003
        ],
        "address": "北艾路1766号",
        "name": "大华锦绣国际写字楼",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.465633,
            31.272753
        ],
        "address": "北宝兴路158号",
        "name": "嘉利明珠商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.219492,
            31.037766
        ],
        "address": "北翠路1000弄",
        "name": "地中海小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.482247,
            31.232014
        ],
        "address": "北海路8号",
        "name": "福申大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.329908,
            31.228199
        ],
        "address": "北华路168弄",
        "name": "万博家园",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.332966,
            31.228823
        ],
        "address": "北华路22弄",
        "name": "虹桥乐贤居",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.487764,
            31.104565
        ],
        "address": "北江榉路588弄",
        "name": "万科早城",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.502705,
            31.079579
        ],
        "address": "北江燕路228弄(近江月路)",
        "name": "世博家园五街坊",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.501324,
            31.079801
        ],
        "address": "北江燕路338弄浦江世博家园6街坊(近浦池路)",
        "name": "世博家园六街坊",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.482329,
            31.239307
        ],
        "address": "北京东路431号",
        "name": "松柏公寓(上海)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.485281,
            31.232814
        ],
        "address": "北京东路668号",
        "name": "科技京城",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.454169,
            31.23033
        ],
        "address": "碧泉路36弄1号",
        "name": "金霄大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.448593,
            31.227419
        ],
        "address": "北京西路1399号",
        "name": "信达大厦（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.447959,
            31.227171
        ],
        "address": "北京西路1465号",
        "name": "国立大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.444227,
            31.225459
        ],
        "address": "北京西路1701号",
        "name": "静安中华大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.473014,
            31.237098
        ],
        "address": "北京西路1号",
        "name": "新金桥广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.467327,
            31.234807
        ],
        "address": "北京西路355弄",
        "name": "华盛大公馆",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.463465,
            31.232809
        ],
        "address": "北京西路605弄57号",
        "name": "嘉发大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.461782,
            31.232643
        ],
        "address": "北京西路669号",
        "name": "东展商业大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.459426,
            31.233412
        ],
        "address": "北京西路758弄",
        "name": "国际丽都城",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.459416,
            31.231524
        ],
        "address": "北京西路819号",
        "name": "北泰电信大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.458701,
            31.231207
        ],
        "address": "北京西路833号",
        "name": "京泰大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.349089,
            31.405277
        ],
        "address": "北欧新镇罗芬路1199弄",
        "name": "朗诗绿岛",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.335118,
            31.230969
        ],
        "address": "北沈路288弄",
        "name": "万博欣园",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.393769,
            31.247788
        ],
        "address": "北石路500弄30号",
        "name": "舒庭苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.401832,
            31.03997
        ],
        "address": "北松路489号",
        "name": "沫谷文创园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.454777,
            31.238873
        ],
        "address": "北苏州河路668号",
        "name": "河滨豪园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.472802,
            31.241196
        ],
        "address": "北苏州路1040号",
        "name": "JK1933",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.507684,
            30.969434
        ],
        "address": "北行路555弄",
        "name": "朗诗未来街区",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.520046,
            31.215974
        ],
        "address": "北张家浜路28弄",
        "name": "嘉德公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.555998,
            31.183777
        ],
        "address": "北中路187弄",
        "name": "北蔡休闲广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.514011,
            31.275452
        ],
        "address": "本溪路181号",
        "name": "同和凤凰园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.515086,
            31.276298
        ],
        "address": "本溪路152-222号",
        "name": "中通雅苑_华元豪庭",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.52195,
            31.277708
        ],
        "address": "本溪路61号",
        "name": "新凤城商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.587463,
            31.184849
        ],
        "address": "毕升路299弄",
        "name": "富海商务苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.584462,
            31.207335
        ],
        "address": "碧波路177号",
        "name": "华虹科技园办公楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.573784,
            31.236742
        ],
        "address": "碧云路199弄",
        "name": "金桥爱建园",
        "count": 85,
        "style": 0
    },
    {
        "lnglat": [
            121.57735,
            31.238108
        ],
        "address": "碧云路333弄",
        "name": "中天碧云苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.581987,
            31.238068
        ],
        "address": "碧云路580号",
        "name": "S8碧云花园",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.584938,
            31.241569
        ],
        "address": "碧云路777号",
        "name": "S4碧云花园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.576465,
            31.235968
        ],
        "address": "碧云路86弄",
        "name": "金洋十方庭",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.435863,
            31.164548
        ],
        "address": "宾阳路28弄",
        "name": "保利星苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.438514,
            31.164228
        ],
        "address": "宾阳路62弄",
        "name": "乾骏大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.437093,
            31.163602
        ],
        "address": "宾阳路9弄",
        "name": "宾阳苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.496383,
            30.964237
        ],
        "address": "博丰路158弄",
        "name": "金水和璟园北区",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.486192,
            31.182242
        ],
        "address": "博航路68号",
        "name": "招商局上海中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.565458,
            31.250597
        ],
        "address": "博山东路188弄1-24号",
        "name": "通联苑北区",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.563366,
            31.249208
        ],
        "address": "博山东路112弄",
        "name": "海德苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.559836,
            31.2454
        ],
        "address": "博山东路20弄",
        "name": "锦绣河山小区",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.552681,
            31.244804
        ],
        "address": "博山路200弄",
        "name": "名门河滨花园",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.278014,
            31.26264
        ],
        "address": "博园路1333号",
        "name": "北虹桥科创中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.277931,
            31.262713
        ],
        "address": "博园路1333号1号楼",
        "name": "北虹桥电子商务智慧产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.811635,
            30.898465
        ],
        "address": "彩云路357弄",
        "name": "云松翠庭",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.807228,
            30.897688
        ],
        "address": "彩云路567弄",
        "name": "云松景庭",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.807369,
            30.899604
        ],
        "address": "彩云路568弄",
        "name": "云松华庭",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.803576,
            30.897618
        ],
        "address": "彩云路717弄",
        "name": "云树欣居",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.803746,
            30.89939
        ],
        "address": "彩云路718弄",
        "name": "云树雅居",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.801261,
            30.89819
        ],
        "address": "彩云路843弄",
        "name": "云树仁居",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.606986,
            31.193811
        ],
        "address": "蔡伦路780号",
        "name": "推广大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.424147,
            31.023942
        ],
        "address": "沧源路1200号",
        "name": "思源创新园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.371268,
            31.251141
        ],
        "address": "曹安公路1509号",
        "name": "福瑞大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.364661,
            31.253937
        ],
        "address": "曹安公路1718号",
        "name": "威隆大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.360072,
            31.2528
        ],
        "address": "曹安公路1909号",
        "name": "锦银休闲广场银座印象",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.360948,
            31.255977
        ],
        "address": "曹安公路1930弄",
        "name": "曹安商办楼",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.274339,
            31.27171
        ],
        "address": "曹安公路3918号",
        "name": "协通大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.217779,
            31.275807
        ],
        "address": "曹安公路4671号",
        "name": "北虹桥协通科技大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.348801,
            31.258748
        ],
        "address": "曹安公路2038号",
        "name": "华拓大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.203668,
            31.287111
        ],
        "address": "曹安公路4908弄",
        "name": "曹安景林",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.16168,
            31.289956
        ],
        "address": "曹安公路5588号、5616号",
        "name": "安亭财富广场",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.363585,
            31.252809
        ],
        "address": "曹安路1775号",
        "name": "上海国际鞋城",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.382438,
            31.247827
        ],
        "address": "曹安路295，323号",
        "name": "振光大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.217887,
            31.276217
        ],
        "address": "曹安路4671号",
        "name": "上海北虹桥协通产业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.446225,
            31.041799
        ],
        "address": "曹家塘路220弄-1-35号",
        "name": "塘泾南苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.443367,
            31.043678
        ],
        "address": "曹家塘路390弄",
        "name": "塘泾北苑",
        "count": 100,
        "style": 0
    },
    {
        "lnglat": [
            121.096062,
            31.147704
        ],
        "address": "曹穗北路135弄",
        "name": "忆华里",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.282077,
            31.042837
        ],
        "address": "曹农路538号",
        "name": "上海娃娃谷工业园(上海宏隆包装制品有限公司)",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.409444,
            31.245213
        ],
        "address": "曹杨路1040弄1号",
        "name": "中友大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.410207,
            31.24524
        ],
        "address": "曹杨路1040弄2号",
        "name": "中谊大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.405775,
            31.25876
        ],
        "address": "曹杨路2168弄",
        "name": "金纺苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.408661,
            31.246975
        ],
        "address": "曹杨路1222弄1-16号",
        "name": "颐宁苑(上海)",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.406281,
            31.259652
        ],
        "address": "曹杨路2170弄",
        "name": "恒力锦沧花园",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.4055,
            31.260582
        ],
        "address": "曹杨路2288弄",
        "name": "曹杨新苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.420686,
            31.233599
        ],
        "address": "曹杨路303弄",
        "name": "锦绿新城二期",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.418219,
            31.237843
        ],
        "address": "曹杨路450号",
        "name": "绿地和创大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.418711,
            31.237587
        ],
        "address": "曹杨路500号",
        "name": "普陀科技馆",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.418741,
            31.236007
        ],
        "address": "曹杨路455弄",
        "name": "尚诚国际苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.419097,
            31.236418
        ],
        "address": "曹杨路505号",
        "name": "尚诚国际苑商务楼",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.410741,
            31.241536
        ],
        "address": "曹杨路903弄",
        "name": "中桥大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.415385,
            31.240225
        ],
        "address": "曹杨路710弄",
        "name": "中关村公寓_上海",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.418151,
            31.238065
        ],
        "address": "曹杨路540号",
        "name": "中联大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.411007,
            31.242864
        ],
        "address": "曹杨路922弄",
        "name": "枫桥苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.410336,
            31.242903
        ],
        "address": "曹杨路930号",
        "name": "汇尚商务楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.399386,
            31.16159
        ],
        "address": "漕宝路1011号",
        "name": "漕河泾印象城",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.37667,
            31.162141
        ],
        "address": "漕宝路1555弄",
        "name": "大上海国际花园",
        "count": 62,
        "style": 0
    },
    {
        "lnglat": [
            121.397776,
            31.160046
        ],
        "address": "漕宝路1108号",
        "name": "燎申漕宝大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.41165,
            31.163684
        ],
        "address": "漕宝路400号",
        "name": "明申商务广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.408413,
            31.164417
        ],
        "address": "漕宝路401号",
        "name": "漕宝路401号园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.404991,
            31.162518
        ],
        "address": "漕宝路650号",
        "name": "知汇大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.428628,
            31.167713
        ],
        "address": "漕宝路70-86号",
        "name": "光大会展中心",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.428188,
            31.169299
        ],
        "address": "漕宝路77弄",
        "name": "万科华尔兹花园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.436865,
            31.192855
        ],
        "address": "漕溪北路28-38号",
        "name": "实业公寓(上海)",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.437952,
            31.192762
        ],
        "address": "漕溪北路18号",
        "name": "实业大厦",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.438445,
            31.190551
        ],
        "address": "漕溪北路375号",
        "name": "中金国际广场",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.439296,
            31.192171
        ],
        "address": "漕溪北路41号",
        "name": "汇嘉大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.436503,
            31.187901
        ],
        "address": "漕溪北路398号",
        "name": "汇智大厦",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.4399,
            31.19191
        ],
        "address": "漕溪北路45号",
        "name": "航空科技大厦",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.437987,
            31.186271
        ],
        "address": "漕溪北路595号",
        "name": "上影广场",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.437599,
            31.191549
        ],
        "address": "漕溪北路88号",
        "name": "圣爱大厦",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.43752,
            31.185168
        ],
        "address": "漕溪北路737号",
        "name": "汇翠花园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.439246,
            31.191747
        ],
        "address": "漕溪北路99弄",
        "name": "尊园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.436611,
            31.176608
        ],
        "address": "漕溪路125号",
        "name": "金谷园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.436051,
            31.175859
        ],
        "address": "漕溪路135号",
        "name": "上海金浦大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436278,
            31.174917
        ],
        "address": "漕溪路167弄",
        "name": "铭源大楼（上海）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.434832,
            31.174209
        ],
        "address": "漕溪路190号",
        "name": "华林大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.435884,
            31.174594
        ],
        "address": "漕溪路169号",
        "name": "东宇商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.434092,
            31.170354
        ],
        "address": "漕溪路250号",
        "name": "银海大楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.434077,
            31.168921
        ],
        "address": "漕溪路280号",
        "name": "汇腾广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.440023,
            31.171476
        ],
        "address": "漕溪四村70号",
        "name": "兆嘉园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.434399,
            31.171086
        ],
        "address": "漕溪路222号",
        "name": "航天大厦（南楼）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.464971,
            31.198622
        ],
        "address": "茶陵北路20号",
        "name": "X2创意空间",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.468372,
            31.194468
        ],
        "address": "茶陵路1号",
        "name": "紫汇苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.327768,
            31.283078
        ],
        "address": "槎溪路222弄",
        "name": "万城银座",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.166182,
            31.295552
        ],
        "address": "昌吉路168号",
        "name": "龙安佳苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.435977,
            31.231694
        ],
        "address": "昌平路1009",
        "name": "昌平综合大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.448024,
            31.236048
        ],
        "address": "昌平路399号",
        "name": "良清公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.447215,
            31.236753
        ],
        "address": "昌平路418弄",
        "name": "贤居天下苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.447052,
            31.236195
        ],
        "address": "昌平路428弄",
        "name": "静安东海园一二期",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.44373,
            31.235167
        ],
        "address": "昌平路556号",
        "name": "金昌大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.443557,
            31.235084
        ],
        "address": "昌平路658弄",
        "name": "丽致公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.45336,
            31.239012
        ],
        "address": "昌平路68号",
        "name": "静安现代大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.441584,
            31.233745
        ],
        "address": "昌平路777弄",
        "name": "静安凤凰苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.437579,
            31.233205
        ],
        "address": "昌平路958号",
        "name": "自然美大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.438562,
            31.232867
        ],
        "address": "昌平路935号",
        "name": "昌平大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437291,
            31.232835
        ],
        "address": "昌平路988弄999弄",
        "name": "长丰公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.436498,
            31.233204
        ],
        "address": "昌平路990号",
        "name": "航创990",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.436573,
            31.23256
        ],
        "address": "昌平路994号",
        "name": "传媒文化园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.520602,
            31.241276
        ],
        "address": "昌邑路538弄5号",
        "name": "裕景国际商务广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.519799,
            31.242168
        ],
        "address": "昌邑路555弄",
        "name": "滨江茗园",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.512735,
            31.240435
        ],
        "address": "昌邑路55弄",
        "name": "浦江茗园(艺术传家堡)",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.522222,
            31.2412
        ],
        "address": "昌邑路600号",
        "name": "万源晶典公寓",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.43943,
            31.239549
        ],
        "address": "常德路1158弄",
        "name": "同德公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.438296,
            31.239383
        ],
        "address": "常德路1211号",
        "name": "宝华大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.436407,
            31.240751
        ],
        "address": "常德路1239号",
        "name": "常德大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.43712,
            31.241639
        ],
        "address": "常德路1258弄",
        "name": "上青佳园",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.433283,
            31.244278
        ],
        "address": "常德路1436号",
        "name": "德诚大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.434803,
            31.24164
        ],
        "address": "常德路1339号",
        "name": "金昌商务中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.435882,
            31.241151
        ],
        "address": "常德路1265号",
        "name": "兴运大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.447662,
            31.224451
        ],
        "address": "常德路175",
        "name": "轻工机械大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.446724,
            31.226631
        ],
        "address": "常德路319号",
        "name": "京德大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.443771,
            31.233715
        ],
        "address": "常德路800号",
        "name": "800秀创意园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.442964,
            31.234189
        ],
        "address": "常德路812弄1-3号",
        "name": "德安大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.442022,
            31.234903
        ],
        "address": "常德路818弄",
        "name": "德安商务楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.441127,
            31.235161
        ],
        "address": "常德路977弄1-12号",
        "name": "静安南洋家园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.445946,
            31.217095
        ],
        "address": "常熟路100弄10号",
        "name": "宝立大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.448885,
            31.217045
        ],
        "address": "常熟路113弄",
        "name": "创艺大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.447815,
            31.217274
        ],
        "address": "常熟路85弄",
        "name": "神州商务大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.430622,
            31.334516
        ],
        "address": "场北路399弄",
        "name": "新梅绿岛苑",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.446791,
            31.217718
        ],
        "address": "常熟路8号",
        "name": "静安广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.434673,
            31.33511
        ],
        "address": "场北路39弄",
        "name": "和欣国际花园",
        "count": 74,
        "style": 0
    },
    {
        "lnglat": [
            121.427918,
            31.330749
        ],
        "address": "场北路550弄",
        "name": "恒泰家园",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.427048,
            31.332782
        ],
        "address": "场北路551弄",
        "name": "中环国际公寓一期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.423996,
            31.33367
        ],
        "address": "场北路669弄",
        "name": "中环国际公寓三期",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.480267,
            31.308173
        ],
        "address": "场中路201号",
        "name": "元博商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.452181,
            31.304738
        ],
        "address": "场中路2018号",
        "name": "中建幸福空间",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.442307,
            31.304494
        ],
        "address": "场中路2600弄6-8号",
        "name": "海运小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.407462,
            31.259041
        ],
        "address": "潮州路536号",
        "name": "太安堂广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.276952,
            30.990304
        ],
        "address": "车墩镇车阳路177弄",
        "name": "松南城尚雅苑",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.279206,
            30.990069
        ],
        "address": "车墩镇车阳路77弄",
        "name": "松南城舒雅苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.315875,
            31.020443
        ],
        "address": "车泾路99号",
        "name": "三宝园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.327377,
            30.895499
        ],
        "address": "车亭公路3489弄",
        "name": "长三角物流园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.479289,
            31.307372
        ],
        "address": "场中路28弄1-10号",
        "name": "场中公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.292636,
            30.987358
        ],
        "address": "车阳路50号",
        "name": "文昌企业园一期",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.29069,
            30.987799
        ],
        "address": "车阳路116号",
        "name": "文昌企业园二期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.478655,
            31.296371
        ],
        "address": "车站北路177弄",
        "name": "虹口玫瑰苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.478681,
            31.295087
        ],
        "address": "车站南路198弄",
        "name": "虹口嘉苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.179787,
            31.039231
        ],
        "address": "辰塔路2155弄",
        "name": "云间传奇（金色云中苑）",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.559609,
            31.175139
        ],
        "address": "陈春东路88弄",
        "name": "德圣苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.560259,
            31.175747
        ],
        "address": "陈春东路99弄",
        "name": "德铭苑",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.464893,
            31.264188
        ],
        "address": "陈家宅路56",
        "name": "上海古林都市工业大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.458437,
            30.929013
        ],
        "address": "陈桥路299弄",
        "name": "同盛南桥花园",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.587864,
            31.200257
        ],
        "address": "晨晖路377弄",
        "name": "张江汤臣豪园一期",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.507393,
            31.097195
        ],
        "address": "陈行公路2388号",
        "name": "漕河泾浦江科技广场",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.59754,
            31.198679
        ],
        "address": "晨晖路828弄",
        "name": "张江汤臣豪园三期",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.581849,
            31.196909
        ],
        "address": "晨晖路88号",
        "name": "金蝶软件园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.466629,
            31.227024
        ],
        "address": "成都北路199号",
        "name": "海银国际大厦（恒利国际大厦）",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.466525,
            31.228088
        ],
        "address": "成都北路333号",
        "name": "招商局广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.467163,
            31.232134
        ],
        "address": "成都北路500号",
        "name": "峻岭广场",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.524494,
            31.176096
        ],
        "address": "成山路1339号",
        "name": "大华锦绣优嘉",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.466906,
            31.234098
        ],
        "address": "成都北路600号",
        "name": "中华保险华盛大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.75342,
            31.176397
        ],
        "address": "晨阳路225号",
        "name": "东方现代商业广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.52866,
            31.175248
        ],
        "address": "成山路1488弄",
        "name": "大华锦绣华城15街区二期",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.532534,
            31.177054
        ],
        "address": "成山路1850弄",
        "name": "大华锦绣华城17街区",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.538109,
            31.179229
        ],
        "address": "成山路2008弄",
        "name": "大华锦绣华城18街区",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.531776,
            31.176813
        ],
        "address": "成山路1728弄",
        "name": "大华锦绣华城16街区",
        "count": 170,
        "style": 0
    },
    {
        "lnglat": [
            121.495648,
            31.170883
        ],
        "address": "成山路220号",
        "name": "上海城建大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.54478,
            31.181175
        ],
        "address": "成山路2399弄",
        "name": "海上国际花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.508293,
            31.17206
        ],
        "address": "成山路588号",
        "name": "展峰大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.511762,
            31.170349
        ],
        "address": "成山路668弄",
        "name": "恒大星级公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.51371,
            31.172206
        ],
        "address": "成山路800号",
        "name": "云顶国际广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.221689,
            31.40581
        ],
        "address": "城北路1355号",
        "name": "上海大学国家大学科技园嘉定基地",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.276709,
            31.373918
        ],
        "address": "成泽路386弄",
        "name": "新城馥华里",
        "count": 98,
        "style": 0
    },
    {
        "lnglat": [
            121.763507,
            31.04448
        ],
        "address": "城东路96弄",
        "name": "惠城大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.680275,
            31.186276
        ],
        "address": "城丰路599弄",
        "name": "东方城市绿洲",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.758853,
            31.041812
        ],
        "address": "城南路555弄",
        "name": "鼎城丽景苑",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.461128,
            30.915293
        ],
        "address": "城乡路188号",
        "name": "亿星大厦(上海)",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.705348,
            31.19271
        ],
        "address": "城南路278弄",
        "name": "东方城市豪苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.114321,
            31.161473
        ],
        "address": "城中北路866弄",
        "name": "贺桥公寓",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.113934,
            31.157162
        ],
        "address": "城中北路588弄",
        "name": "城中公园",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.244265,
            31.386696
        ],
        "address": "城中路200号",
        "name": "冠寓_嘉定城中路店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.242882,
            31.388717
        ],
        "address": "城中路285号",
        "name": "桃园公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.371342,
            31.181486
        ],
        "address": "程家桥路175弄",
        "name": "虹桥奕境文创园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.375313,
            31.184778
        ],
        "address": "程家桥路258号",
        "name": "银洲国际商务大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.372045,
            31.185655
        ],
        "address": "程家桥路168弄39号",
        "name": "大树下新媒体创意产业园区",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.279979,
            31.382661
        ],
        "address": "澄浏中路2500弄",
        "name": "沧海绿苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.300134,
            31.339551
        ],
        "address": "澄浏中路2539弄",
        "name": "嘉乐东润广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.807515,
            30.901812
        ],
        "address": "池月路333弄",
        "name": "丽都华庭",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.495782,
            31.281865
        ],
        "address": "赤峰路301-303号",
        "name": "峰茂大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.484243,
            31.282105
        ],
        "address": "赤峰路525号",
        "name": "赤峰路525号小区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.502,
            31.279658
        ],
        "address": "赤峰路59弄",
        "name": "书香公寓",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.496661,
            31.281557
        ],
        "address": "赤峰路95、97号",
        "name": "赤峰冶金公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.139602,
            31.02547
        ],
        "address": "崇南公路599弄",
        "name": "佘山院子",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.609719,
            31.18561
        ],
        "address": "川和路55弄",
        "name": "张江人工智能岛",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.610869,
            31.181136
        ],
        "address": "川和路中科路",
        "name": "万科翡翠公园六期",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.706617,
            31.158803
        ],
        "address": "川宏路365号",
        "name": "圣御工业总部园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.711445,
            31.15922
        ],
        "address": "川宏路508号",
        "name": "贺海科技孵化器",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.605235,
            31.243405
        ],
        "address": "川桥路350号",
        "name": "华东资产产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.717443,
            31.157842
        ],
        "address": "川六公路1159弄",
        "name": "龙馨公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.60737,
            31.245437
        ],
        "address": "川桥路401号",
        "name": "由度工坊",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.691667,
            31.209573
        ],
        "address": "川沙路4000号",
        "name": "新馨白领公寓川沙路店",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.693167,
            31.20581
        ],
        "address": "川沙路4198号",
        "name": "爱情谷",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.698367,
            31.183261
        ],
        "address": "川沙路5558弄",
        "name": "绿地东海岸国际广场",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.670223,
            31.273136
        ],
        "address": "川沙路688号",
        "name": "浦江智汇创业园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.695049,
            31.200298
        ],
        "address": "川沙路718号",
        "name": "曹路创新产业园",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.673422,
            31.27044
        ],
        "address": "川沙路809号",
        "name": "超煜809文创园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.614465,
            31.144176
        ],
        "address": "川周公路2880号",
        "name": "旭辉亚瑟郡",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.709586,
            31.184359
        ],
        "address": "川周公路8682弄",
        "name": "鼎鑫名流苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.457269,
            31.185874
        ],
        "address": "船厂路36号",
        "name": "徐汇正大乐城",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.867685,
            30.976503
        ],
        "address": "船山街49弄",
        "name": "禹洲城市广场东区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.709631,
            31.178402
        ],
        "address": "川周公路8288弄",
        "name": "浦发馨汇佳苑",
        "count": 124,
        "style": 0
    },
    {
        "lnglat": [
            121.651631,
            31.201304
        ],
        "address": "创新西路333弄",
        "name": "唐丰苑",
        "count": 78,
        "style": 0
    },
    {
        "lnglat": [
            121.359776,
            31.066014
        ],
        "address": "春常路142号",
        "name": "抱家燕汇谷智慧产业园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.389413,
            31.086388
        ],
        "address": "春东路508号",
        "name": "如果创意产业园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.414312,
            31.083838
        ],
        "address": "春都路358弄1-35号",
        "name": "君莲宏润丽苑",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.420106,
            31.082703
        ],
        "address": "春都路75弄",
        "name": "君莲新城中城苑",
        "count": 90,
        "style": 0
    },
    {
        "lnglat": [
            121.387469,
            31.076855
        ],
        "address": "春光路99弄55号",
        "name": "广陆创客佳园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.586205,
            31.341731
        ],
        "address": "春晖路148弄",
        "name": "运银公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.582214,
            31.336982
        ],
        "address": "春晖路446弄",
        "name": "浦发春晖苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.579584,
            31.335487
        ],
        "address": "春晖路628弄",
        "name": "风信景苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.424414,
            31.112058
        ],
        "address": "春申路1955号",
        "name": "陇盛大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.646989,
            31.216693
        ],
        "address": "春泉路45弄",
        "name": "张江名流豪庭",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.41811,
            31.113413
        ],
        "address": "春申路2328弄12幢",
        "name": "M创客空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.414504,
            31.109677
        ],
        "address": "春申路2525号",
        "name": "欧银集心",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.396007,
            31.102501
        ],
        "address": "春申路3355弄",
        "name": "春申复地城一期",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.38829,
            31.100559
        ],
        "address": "春申路3755号",
        "name": "春申路3755号商务楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.387504,
            31.101253
        ],
        "address": "春申路3758弄",
        "name": "凯利大楼（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.212666,
            31.380381
        ],
        "address": "慈竹路836弄",
        "name": "同盛园",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.211208,
            31.3801
        ],
        "address": "慈竹路835弄",
        "name": "福莱锦苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.43525,
            31.31521
        ],
        "address": "萃浦路200弄",
        "name": "上海派嘉悦澜庭",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.58357,
            31.192999
        ],
        "address": "达尔文路88号",
        "name": "新希望半岛科技园",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.470892,
            31.204966
        ],
        "address": "打浦路1号",
        "name": "金玉兰广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.471071,
            31.200512
        ],
        "address": "打浦路258号",
        "name": "扬子江家园",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.468781,
            31.204749
        ],
        "address": "打浦路38弄",
        "name": "海华花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.47216,
            31.19763
        ],
        "address": "打浦路398弄",
        "name": "东晖花苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.472317,
            31.197867
        ],
        "address": "打浦路398弄4号-2临",
        "name": "衡辰商务楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.473328,
            31.197637
        ],
        "address": "打浦路443号",
        "name": "荣科大厦（上海）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.474225,
            31.195411
        ],
        "address": "打浦路585弄1-4号",
        "name": "中辉新苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.415263,
            31.301291
        ],
        "address": "大场镇场中路4098号",
        "name": "大华老镇嘉年华",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.539192,
            31.159292
        ],
        "address": "大道站路94弄",
        "name": "三林世博家园B区",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.395719,
            31.235244
        ],
        "address": "大渡河路1142号",
        "name": "长风大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.39647,
            31.246349
        ],
        "address": "大渡河路1516弄",
        "name": "真西驰骋苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.470287,
            31.203103
        ],
        "address": "打浦路88号",
        "name": "海丽大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.395275,
            31.222693
        ],
        "address": "大渡河路196号",
        "name": "长风大悦城",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.471134,
            31.226548
        ],
        "address": "大沽路186弄",
        "name": "宏泰公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.466749,
            31.225645
        ],
        "address": "大沽路398弄23号",
        "name": "中凯诚仕会",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.467451,
            31.226137
        ],
        "address": "大沽路368号",
        "name": "中凯城市之光花园",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.395738,
            31.220684
        ],
        "address": "大渡河路168弄6号",
        "name": "北岸长风",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.392551,
            31.247331
        ],
        "address": "大渡河路1550弄200支弄",
        "name": "宁馨家园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.418804,
            31.275986
        ],
        "address": "大华三路81号",
        "name": "美隆大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.41322,
            31.270433
        ],
        "address": "大华一路210号",
        "name": "嘉年华大厦（宝山）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.413178,
            31.278536
        ],
        "address": "大华路988弄",
        "name": "滨江雅苑",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.412348,
            31.271706
        ],
        "address": "大华一路239弄",
        "name": "大华虎城商务中心",
        "count": 55,
        "style": 0
    },
    {
        "lnglat": [
            121.42146,
            31.333618
        ],
        "address": "大康路1079弄",
        "name": "中环国际公寓二期",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.484553,
            31.214583
        ],
        "address": "大吉路135弄",
        "name": "实华公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.423352,
            31.330812
        ],
        "address": "大康路896弄",
        "name": "恒达家园",
        "count": 73,
        "style": 0
    },
    {
        "lnglat": [
            121.503532,
            31.273517
        ],
        "address": "大连路1548号",
        "name": "莱克大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.423119,
            31.330343
        ],
        "address": "大康路891弄",
        "name": "共康雅苑",
        "count": 195,
        "style": 0
    },
    {
        "lnglat": [
            121.502131,
            31.273654
        ],
        "address": "大连路1619号",
        "name": "骏丰国际财富广场",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.514688,
            31.255561
        ],
        "address": "大连路265号",
        "name": "振天商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.507236,
            31.263404
        ],
        "address": "大连路839号",
        "name": "合生财富广场",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.495336,
            31.276174
        ],
        "address": "大连西路100号",
        "name": "玉山大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.507413,
            31.2665
        ],
        "address": "大连路990号",
        "name": "海上海新城",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.491847,
            31.276912
        ],
        "address": "大连西路180号",
        "name": "玉四大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.493836,
            31.276077
        ],
        "address": "大连西路201弄1-2号",
        "name": "虹连大楼(上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.488566,
            31.27584
        ],
        "address": "大连西路253弄",
        "name": "玉龙大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.48797,
            31.276014
        ],
        "address": "大连西路257弄1-2号",
        "name": "文宇公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.486633,
            31.277075
        ],
        "address": "大连西路280号",
        "name": "马华大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.488098,
            31.213219
        ],
        "address": "大林路10弄",
        "name": "兴林公寓二期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.487745,
            31.213667
        ],
        "address": "大林路10弄1号",
        "name": "兴林公寓一期",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.487931,
            31.213715
        ],
        "address": "大林路10弄2号",
        "name": "兴林办公楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.497202,
            31.276522
        ],
        "address": "大连西路40弄",
        "name": "大连西路40弄小区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.461107,
            31.200774
        ],
        "address": "大木桥路100号",
        "name": "祥和公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.460938,
            31.198864
        ],
        "address": "大木桥路158弄",
        "name": "金色港湾公寓",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.461022,
            31.196478
        ],
        "address": "大木桥路340弄2号",
        "name": "银海苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.462945,
            31.196074
        ],
        "address": "大木桥路451号",
        "name": "协合徐汇公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.461383,
            31.20121
        ],
        "address": "大木桥路65号",
        "name": "新路大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.449232,
            31.274818
        ],
        "address": "大宁路535弄",
        "name": "绿色丽园",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.445571,
            31.271821
        ],
        "address": "大宁路701号",
        "name": "歌林汇",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.459265,
            31.256159
        ],
        "address": "大统路1038号",
        "name": "博苑公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.458814,
            31.255455
        ],
        "address": "大统路938弄",
        "name": "越秀苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.458537,
            31.255099
        ],
        "address": "大统路958弄1号",
        "name": "协诚中心大厦B座",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.511399,
            31.304541
        ],
        "address": "大学路63弄",
        "name": "创智坊SOHO办公楼",
        "count": 142,
        "style": 0
    },
    {
        "lnglat": [
            121.747988,
            30.962815
        ],
        "address": "大团镇南芦公路989弄",
        "name": "同润蓝美俊庭",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.077053,
            31.134141
        ],
        "address": "大盈浦路1800弄",
        "name": "中南君悦府",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.380938,
            31.22241
        ],
        "address": "丹巴路28弄",
        "name": "旭辉世纪广场",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.381985,
            31.222909
        ],
        "address": "丹巴路98弄7号",
        "name": "龙裕财富中心",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.627232,
            31.217836
        ],
        "address": "丹桂路799号",
        "name": "张江国创中心3期",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.62796,
            31.21986
        ],
        "address": "丹桂路899号",
        "name": "张江国创中心二号楼",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.629122,
            31.220834
        ],
        "address": "丹桂路999号",
        "name": "张江国创中心1期",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.501331,
            31.256904
        ],
        "address": "丹徒路405号",
        "name": "景泰大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.362661,
            31.358331
        ],
        "address": "丹霞山路50弄",
        "name": "龙湖北城天街南区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.242213,
            31.060975
        ],
        "address": "淡家浜街88弄",
        "name": "金色茸城苑(梦想派二期)",
        "count": 53,
        "style": 0
    },
    {
        "lnglat": [
            121.4743,
            31.212699
        ],
        "address": "淡水路361号",
        "name": "淡水公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.588683,
            31.300729
        ],
        "address": "德爱路450弄",
        "name": "阳光城MODO自由区",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.242607,
            31.060151
        ],
        "address": "淡家浜街99弄",
        "name": "信达蓝爵",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.606631,
            31.307547
        ],
        "address": "德堡路38号",
        "name": "沐远国际中心",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.258604,
            31.347608
        ],
        "address": "德富路1198号",
        "name": "太湖世家国际大厦（世家双塔）",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.566648,
            31.242748
        ],
        "address": "德平路1060号",
        "name": "天虹苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.556132,
            31.254385
        ],
        "address": "德平路12弄10号",
        "name": "沪东船厂大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.257768,
            31.347217
        ],
        "address": "德富路1199号",
        "name": "太湖世家环球大厦（世家双塔）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.163449,
            31.318453
        ],
        "address": "德友路77号",
        "name": "旭辉公元（上海）",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.558606,
            31.252008
        ],
        "address": "德平路58弄",
        "name": "金云苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.255982,
            31.352404
        ],
        "address": "德富路1388弄",
        "name": "阳光城新界",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.303388,
            31.305417
        ],
        "address": "德园路1055弄",
        "name": "海谊苑",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.255893,
            31.10006
        ],
        "address": "德悦路375弄",
        "name": "登云苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.300485,
            31.308056
        ],
        "address": "德园路1259弄",
        "name": "溪岸澜庭",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.485591,
            31.166559
        ],
        "address": "德州路382弄",
        "name": "德馨公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.502598,
            31.168886
        ],
        "address": "德州路60弄",
        "name": "中星云庭（上海）",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.421564,
            31.030474
        ],
        "address": "灯辉路555弄",
        "name": "银春小区（枫泽苑）",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.258234,
            31.099888
        ],
        "address": "登云路38号",
        "name": "塘和家园君康苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.080596,
            31.132501
        ],
        "address": "淀山湖大道1079弄",
        "name": "青浦万达茂商务楼",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.08438,
            31.135226
        ],
        "address": "淀山湖大道851号(淀山湖大道地铁站2号口步行180米)",
        "name": "青浦万达茂",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.564242,
            31.229547
        ],
        "address": "丁香路1399弄",
        "name": "仁恒河滨城",
        "count": 77,
        "style": 0
    },
    {
        "lnglat": [
            121.554606,
            31.228857
        ],
        "address": "丁香路1089弄",
        "name": "联洋花园三期",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.08008,
            31.132491
        ],
        "address": "淀山湖大道丁家港路路口",
        "name": "首创禧悦",
        "count": 55,
        "style": 0
    },
    {
        "lnglat": [
            121.564196,
            31.229408
        ],
        "address": "丁香路1399弄30号",
        "name": "仁恒邻里之家",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.541278,
            31.222743
        ],
        "address": "丁香路425号",
        "name": "东方艺术中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.55333,
            31.227139
        ],
        "address": "丁香路901弄",
        "name": "联洋花园一期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.554012,
            31.227039
        ],
        "address": "丁香路999弄",
        "name": "联洋花园二期",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.167274,
            31.030735
        ],
        "address": "鼎源路618弄",
        "name": "时尚谷创意园",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.361659,
            31.256656
        ],
        "address": "定边路35号",
        "name": "东方汽配城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.363105,
            31.260803
        ],
        "address": "定边路377弄",
        "name": "阳光建华城二期",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.365358,
            31.264664
        ],
        "address": "定边路629号",
        "name": "智谷S06园区",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.363804,
            31.257097
        ],
        "address": "定边路99弄",
        "name": "东珠苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.42344,
            31.212441
        ],
        "address": "定西路1118号",
        "name": "武夷坊文化创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.423604,
            31.211766
        ],
        "address": "定西路1100号",
        "name": "辽油大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.423084,
            31.214304
        ],
        "address": "定西路1232号",
        "name": "大盈商务中心",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.421217,
            31.215847
        ],
        "address": "定西路1277-1279号",
        "name": "长峰大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.421429,
            31.215816
        ],
        "address": "定西路1279号",
        "name": "名光大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.423711,
            31.216597
        ],
        "address": "定西路1310弄10号",
        "name": "建宁大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42297,
            31.215862
        ],
        "address": "定西路1310弄2号",
        "name": "南天大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.422498,
            31.216279
        ],
        "address": "定西路1310弄4号",
        "name": "国泰大厦(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.423214,
            31.216151
        ],
        "address": "定西路1310弄",
        "name": "金都苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.42286,
            31.216871
        ],
        "address": "定西路1310弄8号",
        "name": "长乐大厦(长宁)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.423717,
            31.206814
        ],
        "address": "定西路685号",
        "name": "新华商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.425552,
            31.207147
        ],
        "address": "定西路710弄59-67号",
        "name": "云阳花苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.426146,
            31.2075
        ],
        "address": "定西路710弄83号",
        "name": "达安长宁公寓",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.423604,
            31.207451
        ],
        "address": "定西路717弄",
        "name": "上海映巷创意园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.424591,
            31.207025
        ],
        "address": "定西路720弄1号",
        "name": "华云大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.423784,
            31.208016
        ],
        "address": "定西路768号",
        "name": "东方金门花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.4239,
            31.210401
        ],
        "address": "定西路988号",
        "name": "银统大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.423556,
            31.210046
        ],
        "address": "定西路778号",
        "name": "凯阳大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.451755,
            31.196085
        ],
        "address": "东安路149弄",
        "name": "四季园（上海）",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.455224,
            31.191949
        ],
        "address": "东安路271弄",
        "name": "广汇花苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.454808,
            31.190411
        ],
        "address": "东安路338弄1号",
        "name": "东安小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.456651,
            31.183553
        ],
        "address": "东安路562号",
        "name": "绿地国际广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.484118,
            31.256964
        ],
        "address": "东宝兴路118号",
        "name": "谊华大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.483846,
            31.257618
        ],
        "address": "东宝兴路157号",
        "name": "精武大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.513506,
            31.232675
        ],
        "address": "东昌路600号",
        "name": "东昌大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.528518,
            31.027855
        ],
        "address": "东城二路1号",
        "name": "中国留学人才创新港",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.422954,
            31.014407
        ],
        "address": "东川路1779号",
        "name": "新闵创意园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.371929,
            31.000921
        ],
        "address": "东川路3533号",
        "name": "上海天星苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.508673,
            31.251807
        ],
        "address": "东大名路1096号",
        "name": "长江大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.507715,
            31.251584
        ],
        "address": "东大名路1050号",
        "name": "绿地浦创商务大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.509885,
            31.251324
        ],
        "address": "东大名路1158号",
        "name": "浦江国际金融广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.505689,
            31.249982
        ],
        "address": "东大名路888弄19号",
        "name": "新外滩花苑综合楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.505359,
            31.250643
        ],
        "address": "东大名路908号",
        "name": "金岸大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.506235,
            31.250821
        ],
        "address": "东大名路948号",
        "name": "白金湾广场",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.52921,
            31.212836
        ],
        "address": "东方路1357-1369号",
        "name": "海富花园(上海)",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.502577,
            31.248934
        ],
        "address": "东大名路999号",
        "name": "北外滩来福士广场",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.520611,
            31.239285
        ],
        "address": "东方路135号",
        "name": "海东大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.528444,
            31.211235
        ],
        "address": "东方路1381号",
        "name": "兰村大厦",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.528491,
            31.211263
        ],
        "address": "东方路1381号、1383号",
        "name": "base(蓝村路)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.527343,
            31.209072
        ],
        "address": "东方路1523弄",
        "name": "金龙花园（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.525445,
            31.206302
        ],
        "address": "东方路1663弄1669弄",
        "name": "贵龙园",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.522468,
            31.20268
        ],
        "address": "东方路1800弄",
        "name": "东方城市花园一期",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.521128,
            31.200067
        ],
        "address": "东方路1870号",
        "name": "东方明珠商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.521789,
            31.199175
        ],
        "address": "东方路1881弄",
        "name": "东方城市花园二期",
        "count": 242,
        "style": 0
    },
    {
        "lnglat": [
            121.519514,
            31.195763
        ],
        "address": "东方路2851弄",
        "name": "明丰佳园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.520051,
            31.198946
        ],
        "address": "东方路1988号",
        "name": "华南大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.521293,
            31.236499
        ],
        "address": "东方路286号",
        "name": "IC_PARK",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.518833,
            31.195942
        ],
        "address": "东方路2880弄",
        "name": "临沂大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.519579,
            31.199959
        ],
        "address": "东方路1968弄",
        "name": "馥园(东方名筑）",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.518134,
            31.192475
        ],
        "address": "东方路3261号B座",
        "name": "振华企业广场B座",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.511683,
            31.188761
        ],
        "address": "东方路3539号",
        "name": "东方尚博园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.510513,
            31.188488
        ],
        "address": "东方路3601号",
        "name": "上海丰华园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.524226,
            31.229065
        ],
        "address": "东方路710号",
        "name": "汤臣金融大厦",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.524659,
            31.228544
        ],
        "address": "东方路738号",
        "name": "裕安大厦",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.524305,
            31.232823
        ],
        "address": "东方路573弄1号",
        "name": "市政大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.523474,
            31.227776
        ],
        "address": "东方路778号",
        "name": "上海紫金山大酒店（江苏大厦）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.524134,
            31.226564
        ],
        "address": "东方路800号",
        "name": "宝安大酒店",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.524828,
            31.227566
        ],
        "address": "东方路796号",
        "name": "陆家嘴96广场",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.525593,
            31.226655
        ],
        "address": "东方路818号",
        "name": "众城大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.52571,
            31.226031
        ],
        "address": "东方路838号",
        "name": "齐鲁大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.518914,
            31.243195
        ],
        "address": "勤政路88弄",
        "name": "华发四季",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.527975,
            31.224505
        ],
        "address": "东方路877号",
        "name": "嘉兴大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.529959,
            31.222845
        ],
        "address": "东方路971号",
        "name": "钱江大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.529176,
            31.221822
        ],
        "address": "东方路985号",
        "name": "一百杉杉大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.529685,
            31.221481
        ],
        "address": "东方路989号",
        "name": "中达广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.494385,
            31.251952
        ],
        "address": "东汉阳路309弄",
        "name": "名江七星城",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.496484,
            31.251371
        ],
        "address": "东汉阳路338弄",
        "name": "宇泰公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.527807,
            31.201332
        ],
        "address": "东环龙路181弄",
        "name": "欣晟家园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.532215,
            31.200889
        ],
        "address": "东建路228弄",
        "name": "东方龙苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.480535,
            31.267055
        ],
        "address": "东江湾路188号",
        "name": "空间188创意园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.480438,
            31.27088
        ],
        "address": "东江湾路444号",
        "name": "虹口足球场(商务区)",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.401694,
            31.157954
        ],
        "address": "东兰路238号",
        "name": "古美创智中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.385383,
            31.152902
        ],
        "address": "东兰路1111号",
        "name": "欧风花都",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.609543,
            31.262452
        ],
        "address": "东陆路2000弄、金高路2131弄",
        "name": "金桥新城",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.516308,
            31.156981
        ],
        "address": "东明路2000号",
        "name": "2049五玠坊",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.510919,
            31.184586
        ],
        "address": "东明路355弄",
        "name": "博爱家园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.508157,
            31.201379
        ],
        "address": "东三街30号",
        "name": "东三街大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.50907,
            31.177952
        ],
        "address": "东明路660弄",
        "name": "住友昌盛新苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.510611,
            31.180497
        ],
        "address": "东明路511弄",
        "name": "昌里雅苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.513874,
            31.200284
        ],
        "address": "东三里桥路211弄",
        "name": "爱嘉苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.481719,
            31.274209
        ],
        "address": "东体育会路100弄2号",
        "name": "兴华小区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.484065,
            31.278468
        ],
        "address": "东体育会路390号",
        "name": "上海外国语大学贤达经济人文学院",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.486075,
            31.285126
        ],
        "address": "东体育会路880弄",
        "name": "银联花园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.487213,
            31.283523
        ],
        "address": "东体育会路816号",
        "name": "置汇谷",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.423925,
            31.238634
        ],
        "address": "东新路355弄",
        "name": "地方天园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.426638,
            31.242843
        ],
        "address": "东新路88弄",
        "name": "新湖明珠城北区",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.430089,
            31.240225
        ],
        "address": "东新路99弄",
        "name": "新湖明珠城南区",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.42567,
            31.24339
        ],
        "address": "东新支路90弄8号",
        "name": "东新苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.535069,
            31.198824
        ],
        "address": "东绣路1155弄",
        "name": "中福公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.54114,
            31.21481
        ],
        "address": "东绣路99弄",
        "name": "陆家嘴中央公寓",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.532071,
            31.19958
        ],
        "address": "东绣路1389弄",
        "name": "涵合园",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.508837,
            31.261312
        ],
        "address": "东余杭路1320、1350号",
        "name": "唐山新苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.501491,
            31.241787
        ],
        "address": "东园路18号",
        "name": "中国金融信息中心",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.514647,
            31.230704
        ],
        "address": "东园三村331号、335号",
        "name": "东泰大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.496329,
            31.250094
        ],
        "address": "东长治路399号",
        "name": "双狮汇",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.511962,
            31.230189
        ],
        "address": "东园四村436号、439号",
        "name": "东安大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.269407,
            31.091729
        ],
        "address": "洞泾镇同乐路699号",
        "name": "智象中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.264926,
            31.103814
        ],
        "address": "洞伟路650弄",
        "name": "泗泾海康苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.240162,
            31.096412
        ],
        "address": "洞塔路500弄",
        "name": "樾山璟里",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.262559,
            31.103951
        ],
        "address": "洞伟路655弄1-13号",
        "name": "塘和家园文康苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.418228,
            31.06572
        ],
        "address": "都会路1999-2059号",
        "name": "上海晶碧科技园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.414574,
            31.057059
        ],
        "address": "都市路1800弄",
        "name": "金榜新苑",
        "count": 69,
        "style": 0
    },
    {
        "lnglat": [
            121.420933,
            31.059027
        ],
        "address": "都会路1699号",
        "name": "全方位科技园",
        "count": 91,
        "style": 0
    },
    {
        "lnglat": [
            121.404596,
            31.068685
        ],
        "address": "西江湾路230号",
        "name": "驰民大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.40375,
            31.073567
        ],
        "address": "都市路2888弄",
        "name": "都市府邸",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.424544,
            31.036426
        ],
        "address": "都市路388弄",
        "name": "复地北桥城三期",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.422167,
            31.035581
        ],
        "address": "都市路399弄",
        "name": "复地北桥城一二期",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.422102,
            31.037325
        ],
        "address": "都市路431号",
        "name": "铂客公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.394071,
            31.098022
        ],
        "address": "都市路4418号",
        "name": "金铭大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.39318,
            31.100234
        ],
        "address": "都市路4580弄",
        "name": "春申复地城二期",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.423028,
            31.035303
        ],
        "address": "都市路384号",
        "name": "铂晶商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.401357,
            31.097215
        ],
        "address": "都园路4288号",
        "name": "都园白领公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.391071,
            31.100662
        ],
        "address": "都市路4633弄",
        "name": "春申城四季苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.547542,
            31.201593
        ],
        "address": "杜鹃路58弄",
        "name": "锦绣前程阳光苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.389973,
            31.104037
        ],
        "address": "都市路4855号",
        "name": "解放日报大厦（莘庄总部）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.550272,
            31.202338
        ],
        "address": "杜鹃路188弄",
        "name": "上海市浦东新区花木星晨苑小区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.549805,
            31.202549
        ],
        "address": "杜鹃路192号",
        "name": "青慧谷",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.547017,
            31.118012
        ],
        "address": "渡桥路78弄",
        "name": "中骏柏景湾(上海)",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.546927,
            31.112387
        ],
        "address": "渡桥路288弄",
        "name": "保利首创颂",
        "count": 100,
        "style": 0
    },
    {
        "lnglat": [
            121.490341,
            31.249539
        ],
        "address": "峨眉路299弄",
        "name": "耀江国际公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.520223,
            31.214081
        ],
        "address": "峨山路679弄",
        "name": "浦江映象",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.521397,
            31.214402
        ],
        "address": "峨山路613号",
        "name": "尚街loft上海双创产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.525113,
            31.215156
        ],
        "address": "峨山路485弄",
        "name": "山泉花苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.519436,
            31.213734
        ],
        "address": "峨山路681弄",
        "name": "越富豪庭",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.531595,
            31.217034
        ],
        "address": "峨山路91弄101号5号楼",
        "name": "陆家嘴科技园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.391251,
            31.295615
        ],
        "address": "鄂尔多斯路98弄",
        "name": "南秀雅苑",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.399261,
            31.105894
        ],
        "address": "洱海路99弄",
        "name": "春申玫瑰苑",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.532983,
            31.21625
        ],
        "address": "峨山路91弄48号",
        "name": "开伦鑫座",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.531941,
            31.219041
        ],
        "address": "峨山路91弄200号",
        "name": "新鹏大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.43205,
            31.2032
        ],
        "address": "法华镇路123弄",
        "name": "法华苑酒店式公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.431603,
            31.203151
        ],
        "address": "法华镇路129号",
        "name": "上海新华豪庭",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42924,
            31.203427
        ],
        "address": "法华镇路310号",
        "name": "晶采名人大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426687,
            31.204997
        ],
        "address": "法华镇路457弄/483弄",
        "name": "海富公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.424197,
            31.205607
        ],
        "address": "法华镇路555号",
        "name": "法华门大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.41983,
            31.207718
        ],
        "address": "法华镇路881弄",
        "name": "东湖名苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.428241,
            31.205391
        ],
        "address": "番禺路290弄28号",
        "name": "长发花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.428779,
            31.20472
        ],
        "address": "番禺路300弄7号",
        "name": "鑫汉森商务园区(汉森商务园区)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.43005,
            31.20998
        ],
        "address": "番禺路5号",
        "name": "盛源大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.429918,
            31.200495
        ],
        "address": "番禺路617弄1号",
        "name": "淮新大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.429355,
            31.197834
        ],
        "address": "番禺路801弄",
        "name": "番禺路801弄",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.428204,
            31.195991
        ],
        "address": "番禺路888号",
        "name": "魔方公寓番禺路店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.429605,
            31.204393
        ],
        "address": "番愚路1099弄",
        "name": "东方时空公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.429605,
            31.204393
        ],
        "address": "番愚路390号",
        "name": "时代大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.584624,
            31.306133
        ],
        "address": "繁锦路1288弄",
        "name": "新城碧翠园",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.586163,
            31.31435
        ],
        "address": "繁锦路688弄",
        "name": "中冶尚城",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.290155,
            31.220081
        ],
        "address": "繁兴路1000弄",
        "name": "景平苑",
        "count": 62,
        "style": 0
    },
    {
        "lnglat": [
            121.294378,
            31.21108
        ],
        "address": "繁兴路300弄",
        "name": "西郊九韵城",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.293208,
            31.211035
        ],
        "address": "繁兴路333号",
        "name": "虹桥晶邸",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.291916,
            31.209911
        ],
        "address": "繁兴路399弄1号",
        "name": "华漕生活馆",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.298337,
            31.207817
        ],
        "address": "繁兴路46号",
        "name": "上寓极客公寓(国家会展中心店)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.247505,
            31.021022
        ],
        "address": "方塔北路605号",
        "name": "企德天地",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.483004,
            31.212548
        ],
        "address": "方斜路525号",
        "name": "明华大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.559858,
            31.226851
        ],
        "address": "芳甸路199弄",
        "name": "大拇指广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.561181,
            31.22512
        ],
        "address": "芳甸路333号",
        "name": "水清木华国际公寓",
        "count": 85,
        "style": 0
    },
    {
        "lnglat": [
            121.42351,
            31.045076
        ],
        "address": "放鹤路2323号",
        "name": "万顺苑小区",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.502246,
            31.263
        ],
        "address": "飞虹路238弄、258弄",
        "name": "金鑫怡苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.50362,
            31.265001
        ],
        "address": "飞虹路288弄",
        "name": "宇泰景苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.589967,
            31.347311
        ],
        "address": "菲拉路45号",
        "name": "众上文化大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.467863,
            31.315321
        ],
        "address": "汾西路88弄",
        "name": "临汾名城二期",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.454309,
            31.21079
        ],
        "address": "汾阳路77号",
        "name": "安盛商务楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.394719,
            31.305246
        ],
        "address": "丰皓路138弄",
        "name": "乾皓苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.333791,
            31.237787
        ],
        "address": "丰华路1200号",
        "name": "富锋科技园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.452942,
            31.210017
        ],
        "address": "汾阳路138号",
        "name": "轻科大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.389014,
            31.306517
        ],
        "address": "丰皓路658弄1-14号",
        "name": "丰皓苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.468315,
            31.304559
        ],
        "address": "海门路609号",
        "name": "远虹大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.359842,
            31.244083
        ],
        "address": "丰庄路99弄",
        "name": "金沙丽晶苑一期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.355385,
            31.245564
        ],
        "address": "丰庄西路460弄",
        "name": "绿地新丰苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.457683,
            31.191322
        ],
        "address": "枫林路380号",
        "name": "枫林国际中心一期",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.017257,
            30.897568
        ],
        "address": "枫湾路680号",
        "name": "正荣璟园",
        "count": 90,
        "style": 0
    },
    {
        "lnglat": [
            121.458451,
            31.190355
        ],
        "address": "枫林路420号",
        "name": "枫林国际中心二期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.525001,
            31.273902
        ],
        "address": "凤城路1号",
        "name": "同和凤城园（凤城巷）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.522856,
            31.278004
        ],
        "address": "凤城路51弄",
        "name": "新凤城银座",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.525102,
            31.27438
        ],
        "address": "凤城路5号",
        "name": "凤城巷二期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.237873,
            31.185414
        ],
        "address": "凤坚塘路65弄",
        "name": "欣乐苑东苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.228626,
            31.180532
        ],
        "address": "凤马塘路205弄",
        "name": "瑞和锦庭西区",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.22955,
            31.180953
        ],
        "address": "凤马塘路200弄",
        "name": "瑞和锦庭东区",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.229696,
            31.187185
        ],
        "address": "凤强塘路1120弄",
        "name": "春江三月二期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.231265,
            31.18745
        ],
        "address": "凤强塘路1000弄",
        "name": "春江三月一期",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.235233,
            31.18952
        ],
        "address": "凤徐路85弄",
        "name": "新丰公寓",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.470122,
            31.234004
        ],
        "address": "凤阳路288号",
        "name": "黄浦大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.469105,
            31.234013
        ],
        "address": "凤阳路358弄",
        "name": "金瓯万国大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.465289,
            31.233363
        ],
        "address": "凤阳路588弄",
        "name": "静安华庭一街区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.441191,
            30.987401
        ],
        "address": "扶兰路9弄",
        "name": "南渡新苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.394447,
            31.215203
        ],
        "address": "芙蓉江路388弄",
        "name": "仁恒河滨花园",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.241955,
            31.363872
        ],
        "address": "福海路777号",
        "name": "嘉福汇商务广场",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.481452,
            31.233983
        ],
        "address": "福建中路205号",
        "name": "中怡公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.357807,
            31.217571
        ],
        "address": "福泉路111号",
        "name": "神州数码（上海）科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.396788,
            31.217024
        ],
        "address": "芙蓉江路555号",
        "name": "新天地河滨花园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.335748,
            31.155473
        ],
        "address": "福泉路123弄",
        "name": "世纪之春花园",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.360355,
            31.202492
        ],
        "address": "福泉路550弄",
        "name": "樱源晶舍",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.529476,
            31.229392
        ],
        "address": "福山路309号",
        "name": "竹园商务公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.530656,
            31.224818
        ],
        "address": "福山路388号",
        "name": "越秀大厦",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.530955,
            31.223817
        ],
        "address": "福山路450号",
        "name": "新天国际大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.531382,
            31.223166
        ],
        "address": "福山路458号",
        "name": "同盛大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.596204,
            31.341861
        ],
        "address": "福特北路399号",
        "name": "华三实业",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.532075,
            31.224181
        ],
        "address": "福山路455号",
        "name": "全华信息大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.489377,
            31.228271
        ],
        "address": "福佑路333号",
        "name": "时代城隍广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.484182,
            31.234772
        ],
        "address": "福州路318号",
        "name": "华设大厦(浦汇大厦)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.478898,
            31.232002
        ],
        "address": "福州路655号",
        "name": "黄浦图书馆大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.477745,
            31.232515
        ],
        "address": "福州路666号",
        "name": "华鑫海欣大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.362746,
            31.408469
        ],
        "address": "抚远路1211弄",
        "name": "正荣国领(上海)",
        "count": 119,
        "style": 0
    },
    {
        "lnglat": [
            121.359793,
            31.408243
        ],
        "address": "抚远路1288弄",
        "name": "美兰湖中华园",
        "count": 189,
        "style": 0
    },
    {
        "lnglat": [
            121.367098,
            31.397693
        ],
        "address": "抚远路699弄",
        "name": "远洋博悦花园中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.183679,
            31.298416
        ],
        "address": "阜康路19弄",
        "name": "玉兰一村商住楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.499528,
            31.220501
        ],
        "address": "复兴东路248号",
        "name": "中复大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.503978,
            31.222209
        ],
        "address": "复兴东路2号",
        "name": "豫园股份",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.458836,
            31.212525
        ],
        "address": "复兴中路1199号",
        "name": "明园商务中心",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.482674,
            31.218478
        ],
        "address": "复兴中路1号",
        "name": "申能国际大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.47547,
            31.216116
        ],
        "address": "复兴中路369号",
        "name": "大同商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.40572,
            31.193161
        ],
        "address": "富贵东路229弄",
        "name": "古北国际广场",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.389694,
            31.102395
        ],
        "address": "富都路111弄",
        "name": "都市星城",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.499618,
            31.234455
        ],
        "address": "富城路99号",
        "name": "震旦国际大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.410104,
            31.374178
        ],
        "address": "富联二路99号",
        "name": "保集e智谷",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.450436,
            31.22089
        ],
        "address": "富民路83号",
        "name": "巨富大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.452753,
            31.21737
        ],
        "address": "富民路291号",
        "name": "悟锦世纪大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.404154,
            31.263575
        ],
        "address": "富平路889弄",
        "name": "万里雅筑",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.413298,
            31.263257
        ],
        "address": "富平路399弄",
        "name": "中环家园二期",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.450698,
            31.220488
        ],
        "address": "富民路89号",
        "name": "巨富大厦(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.595902,
            31.341469
        ],
        "address": "富特北路258号",
        "name": "高华大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.593134,
            31.347499
        ],
        "address": "富特北路33号",
        "name": "卓越金融大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.60133,
            31.336127
        ],
        "address": "富特北路353号",
        "name": "凯邦大楼",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.599943,
            31.33609
        ],
        "address": "富特北路432号",
        "name": "万荣大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.601867,
            31.334083
        ],
        "address": "富特北路500号",
        "name": "京贸大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.600621,
            31.343653
        ],
        "address": "富特东一路200号",
        "name": "嘉利斯大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.605531,
            31.309236
        ],
        "address": "富特西三路77号",
        "name": "北八道集团大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.612889,
            31.306435
        ],
        "address": "富特南路301号",
        "name": "松港U库",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.605677,
            31.309485
        ],
        "address": "富特西三路77号10幢",
        "name": "信泰融资大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.59422,
            31.339292
        ],
        "address": "富特西一路355号",
        "name": "高翔大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.246694,
            31.370522
        ],
        "address": "富蕴路555弄",
        "name": "景河名苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.591017,
            31.342553
        ],
        "address": "富特西一路135号",
        "name": "东上海石化商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.591625,
            31.342674
        ],
        "address": "富特西一路139号",
        "name": "中国石化物资大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.461823,
            30.929119
        ],
        "address": "富竹路39弄",
        "name": "秋月朗庭",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.856985,
            30.868918
        ],
        "address": "港辉路372号",
        "name": "海滨时代大厦",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.446433,
            31.202951
        ],
        "address": "高安路61弄",
        "name": "汇成花园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.335234,
            31.238843
        ],
        "address": "高潮路215号",
        "name": "北虹桥松日中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.20591,
            31.12682
        ],
        "address": "高登山路350弄",
        "name": "咏泽苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.445344,
            31.203461
        ],
        "address": "高安路30号",
        "name": "华绮公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.574738,
            31.334013
        ],
        "address": "金海路2449号",
        "name": "宝龙广场2期（曹路）",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.311682,
            31.160543
        ],
        "address": "高光路215弄99号",
        "name": "中国北斗产业技术创新西虹桥基地高光路园区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.293589,
            31.164192
        ],
        "address": "高泾路599号",
        "name": "中国北斗产业基地",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.293644,
            31.105357
        ],
        "address": "高技路655号",
        "name": "绿亮科创园(高技路)",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.653296,
            31.210851
        ],
        "address": "高科东路500弄",
        "name": "联明一番空间",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.291084,
            31.168778
        ],
        "address": "高泾路999弄",
        "name": "高景花园",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.727952,
            31.225688
        ],
        "address": "高科东路与庆利路交界口东北角",
        "name": "绿地海岸城",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.530489,
            31.18688
        ],
        "address": "高科西路1862号",
        "name": "浦东外贸大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.619578,
            31.198314
        ],
        "address": "高科中路1976号",
        "name": "衡谷1976",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.42995,
            31.288182
        ],
        "address": "高平路598弄",
        "name": "阳城美景",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.527377,
            31.160031
        ],
        "address": "高青路2878号",
        "name": "万科新里程二期",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.48796,
            31.324432
        ],
        "address": "高逸路111号",
        "name": "宝锦国际大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.24535,
            31.348173
        ],
        "address": "高台路1333弄",
        "name": "旭辉华庭",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.489388,
            31.198843
        ],
        "address": "高雄路189号",
        "name": "望江苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.486545,
            31.321041
        ],
        "address": "高逸路29号",
        "name": "复客北翼创想中心",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.439325,
            31.210554
        ],
        "address": "高邮路1号、3号",
        "name": "兴盛公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.472684,
            30.925523
        ],
        "address": "高州路100弄",
        "name": "金辉天鹅湾",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.499736,
            31.259403
        ],
        "address": "公平路761号",
        "name": "虹业大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.471431,
            31.31977
        ],
        "address": "高跃路176号，殷高西路608号，殷高西路638号",
        "name": "景瑞生活广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.501171,
            31.260327
        ],
        "address": "公平路768弄",
        "name": "东方都市景苑",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.119522,
            31.149681
        ],
        "address": "公园路348号",
        "name": "青浦科技园商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.774758,
            31.05575
        ],
        "address": "拱北路289弄29支弄1-28号",
        "name": "华钜御庭二期",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.774549,
            31.057741
        ],
        "address": "拱北路336弄",
        "name": "东原逸墅",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.743618,
            31.064468
        ],
        "address": "拱川路411弄",
        "name": "荣春苑北苑",
        "count": 65,
        "style": 0
    },
    {
        "lnglat": [
            121.112387,
            31.14842
        ],
        "address": "公园路700号",
        "name": "东方商厦青浦店",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.740003,
            31.069278
        ],
        "address": "拱海路240弄",
        "name": "民乐城惠康苑(东苑)",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.745577,
            31.071301
        ],
        "address": "拱海路459",
        "name": "兰丽苑西苑",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.74761,
            31.071668
        ],
        "address": "拱海路595弄",
        "name": "兰丽苑东苑",
        "count": 79,
        "style": 0
    },
    {
        "lnglat": [
            121.736829,
            31.068665
        ],
        "address": "拱海路78弄",
        "name": "民乐城惠康苑(西苑)",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.77703,
            31.053932
        ],
        "address": "拱极路2368弄29支弄",
        "name": "华钜御庭一期",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.736569,
            31.069595
        ],
        "address": "拱海路79弄",
        "name": "民乐城惠康苑",
        "count": 136,
        "style": 0
    },
    {
        "lnglat": [
            121.751177,
            31.072337
        ],
        "address": "拱海路755弄",
        "name": "民乐汇雅苑",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.774319,
            31.05348
        ],
        "address": "拱极路2626弄",
        "name": "新凤凰城",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.768505,
            31.063178
        ],
        "address": "拱乐路2400弄",
        "name": "荣春苑南苑",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.750943,
            31.070489
        ],
        "address": "拱优路79弄",
        "name": "汇雅苑南苑",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.744681,
            31.059798
        ],
        "address": "拱鸣路60弄",
        "name": "丽冬苑",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.429058,
            31.349354
        ],
        "address": "共富路228弄",
        "name": "共富花园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.425327,
            31.34511
        ],
        "address": "共富路476弄",
        "name": "富隆苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.46012,
            31.261454
        ],
        "address": "共和新路1158号",
        "name": "达誉商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.460319,
            31.263889
        ],
        "address": "共和新路1301号",
        "name": "蓝天绿地商务广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.460289,
            31.263439
        ],
        "address": "共和新路1301号-1",
        "name": "现代交通商务区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.459348,
            31.266544
        ],
        "address": "共和新路1453弄",
        "name": "新柳公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.458513,
            31.264604
        ],
        "address": "共和新路1346号",
        "name": "通用大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.459047,
            31.267161
        ],
        "address": "共和新路1481号",
        "name": "红墙创意园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.451851,
            31.274057
        ],
        "address": "共和新路1988号",
        "name": "大宁国际商业广场办公楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.453809,
            31.280145
        ],
        "address": "共和新路2449弄",
        "name": "宝华现代大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.454166,
            31.280606
        ],
        "address": "共和新路2399弄",
        "name": "宝华现代城",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.452472,
            31.282955
        ],
        "address": "共和新路2623号",
        "name": "企联大厦（上海）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.450585,
            31.284751
        ],
        "address": "共和新路2802号",
        "name": "智苑文创空间",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.452044,
            31.288172
        ],
        "address": "共和新路2993号",
        "name": "中环企业广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.447691,
            31.294667
        ],
        "address": "共和新路3088弄",
        "name": "祥腾财富广场",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.450242,
            31.304781
        ],
        "address": "共和新路3699号、3737号",
        "name": "共和国际商务广场",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.462743,
            31.249003
        ],
        "address": "共和新路340号",
        "name": "宝丰大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.448434,
            31.318897
        ],
        "address": "共和新路4703弄100号",
        "name": "民主花苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.447653,
            31.319201
        ],
        "address": "共和新路4727号",
        "name": "新陆国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.444227,
            31.322036
        ],
        "address": "共和新路5000号",
        "name": "绿地新都会（风尚天地）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.445371,
            31.325546
        ],
        "address": "共和新路5199号",
        "name": "骏利财富大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.441925,
            31.327783
        ],
        "address": "共和新路5308弄32号",
        "name": "上海共康创意设计园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.454475,
            31.288973
        ],
        "address": "共和新路2999弄",
        "name": "明园森林都市一期森林都市滴翠苑",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.463278,
            31.254082
        ],
        "address": "共和新路638号",
        "name": "博隆商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.462859,
            31.254842
        ],
        "address": "共和新路688弄",
        "name": "广兴广隆公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.463215,
            31.255246
        ],
        "address": "共和新路708弄",
        "name": "天道俪晶大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.463249,
            31.256255
        ],
        "address": "共和新路736弄1号",
        "name": "灵广花园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.462403,
            31.258628
        ],
        "address": "共和新路912号",
        "name": "云华科技大厦",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.206005,
            31.128492
        ],
        "address": "贡嘎山路525弄",
        "name": "佘北家园凤尾苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.462158,
            31.25911
        ],
        "address": "共和新路938号",
        "name": "共和大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.402731,
            31.188231
        ],
        "address": "古北路1699号",
        "name": "古北1699",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.400435,
            31.209441
        ],
        "address": "古北路458号",
        "name": "佰威商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.400994,
            31.208863
        ],
        "address": "古北路507号（仙霞路）",
        "name": "申菱大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.400821,
            31.209083
        ],
        "address": "古北路505号",
        "name": "古北路505号",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.40024,
            31.187233
        ],
        "address": "古北路1700弄",
        "name": "名都古北",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.400714,
            31.207104
        ],
        "address": "古北路585号",
        "name": "古北公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.39972,
            31.20535
        ],
        "address": "古北路666号",
        "name": "嘉麒大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.399515,
            31.204868
        ],
        "address": "古北路678号",
        "name": "同诠大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.400005,
            31.21787
        ],
        "address": "古北路69弄",
        "name": "虹桥万博花园",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.399598,
            31.204376
        ],
        "address": "古北路686号",
        "name": "长福公寓(上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.402278,
            31.132612
        ],
        "address": "古方路18号",
        "name": "南方休闲广场商务大厦",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.401575,
            31.133743
        ],
        "address": "古方路76号",
        "name": "南方休闲广场",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.417632,
            31.190285
        ],
        "address": "古井路165号",
        "name": "锦馨公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.395934,
            31.281235
        ],
        "address": "古浪路183弄",
        "name": "祥和星宇二期",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.385018,
            31.145256
        ],
        "address": "古龙路1065弄",
        "name": "新时代富嘉花园",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.398116,
            31.280799
        ],
        "address": "古浪路55弄",
        "name": "祥和星宇",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.401546,
            31.15014
        ],
        "address": "古龙路287弄",
        "name": "新时代景庭",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.250332,
            31.10577
        ],
        "address": "古楼公路1198弄",
        "name": "同润·山河小城",
        "count": 85,
        "style": 0
    },
    {
        "lnglat": [
            121.400386,
            31.159959
        ],
        "address": "古美路1458弄",
        "name": "中友嘉园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.397353,
            31.161991
        ],
        "address": "古美路1515号",
        "name": "凤凰楼",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.395212,
            31.16449
        ],
        "address": "古美路1595号",
        "name": "宝石园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.398855,
            31.160058
        ],
        "address": "古美路1471号",
        "name": "华城广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.398603,
            31.164405
        ],
        "address": "古美路1528号",
        "name": "漕河泾现代服务业园区",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.405312,
            31.14049
        ],
        "address": "古美路377弄、莲花路288弄",
        "name": "阳光美景城_西区",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.401407,
            31.146844
        ],
        "address": "古美路675弄",
        "name": "望族新城",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.396786,
            31.132471
        ],
        "address": "古美西路313弄70号",
        "name": "上艺艺园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.416159,
            31.190979
        ],
        "address": "古羊路158号",
        "name": "虹三产业园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.318291,
            31.288298
        ],
        "address": "古猗园路88弄",
        "name": "骏丰嘉骊花园",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.424792,
            31.187528
        ],
        "address": "古宜路182号",
        "name": "徐虹中路25号",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.426147,
            31.185262
        ],
        "address": "古宜路99弄",
        "name": "天杰徐汇宜德苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.235534,
            31.033941
        ],
        "address": "谷阳北路1500号",
        "name": "永翔大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.918005,
            30.884084
        ],
        "address": "古棕路168弄1-190号",
        "name": "绿地东岸涟城",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.235646,
            31.04909
        ],
        "address": "谷阳北路2399弄",
        "name": "御上海",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.424018,
            31.187727
        ],
        "address": "古宜路181号",
        "name": "西岸才谷",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.233236,
            31.050962
        ],
        "address": "谷阳北路2501弄",
        "name": "御上海MC街",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.272967,
            31.115654
        ],
        "address": "鼓浪路550号",
        "name": "晶尚坊",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.268452,
            31.111141
        ],
        "address": "鼓浪路801弄",
        "name": "润和苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.237073,
            31.053729
        ],
        "address": "谷阳北路2558弄",
        "name": "冠寓_谷阳北路店",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.415243,
            31.362507
        ],
        "address": "顾北东路39弄",
        "name": "和家欣苑D区",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.388688,
            31.349303
        ],
        "address": "顾北路666弄",
        "name": "旭辉依云湾",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.38605,
            31.139542
        ],
        "address": "顾戴路2337号",
        "name": "维璟中心A座",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.403351,
            31.144407
        ],
        "address": "顾戴路251弄",
        "name": "成亿家园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.354513,
            31.127551
        ],
        "address": "顾戴路2959号",
        "name": "中展大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.396986,
            31.141319
        ],
        "address": "顾戴路645弄",
        "name": "风荷云墅",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.389545,
            31.352894
        ],
        "address": "顾荻路161弄",
        "name": "韶光花园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.671376,
            31.204956
        ],
        "address": "顾唐路3281号",
        "name": "齐友佳苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.554843,
            31.244461
        ],
        "address": "崮山路322弄",
        "name": "名门世家",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.557246,
            31.242078
        ],
        "address": "崮山路538号",
        "name": "浦东中港汇大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.433238,
            31.163991
        ],
        "address": "冠生园路20号",
        "name": "科苑新村",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.560608,
            31.239128
        ],
        "address": "崮山路717号",
        "name": "魔方公寓羽山路店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.427417,
            31.162923
        ],
        "address": "冠生园路223-227号",
        "name": "智慧线创意园冠生园路分园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.423764,
            31.162979
        ],
        "address": "冠生园路403号",
        "name": "康沁苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.468392,
            31.240093
        ],
        "address": "光复路195号",
        "name": "创意仓库",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.424337,
            31.230819
        ],
        "address": "光复西路1003号",
        "name": "开伦江南场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.422697,
            31.228797
        ],
        "address": "光复西路1107号",
        "name": "苏河汇",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.385231,
            31.220981
        ],
        "address": "光复西路2899弄",
        "name": "赢华国际广场",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.424993,
            31.235132
        ],
        "address": "光复西路777弄",
        "name": "燕宁苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.397505,
            31.073109
        ],
        "address": "光华路18号",
        "name": "晶森商务大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.432872,
            31.251766
        ],
        "address": "光新路128弄",
        "name": "阳光大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.386469,
            31.069654
        ],
        "address": "光华路598号",
        "name": "598创业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.431852,
            31.253919
        ],
        "address": "光新路256弄",
        "name": "城公大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.433886,
            31.252843
        ],
        "address": "光新路182弄",
        "name": "一品国际",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.430935,
            31.256415
        ],
        "address": "光新路428弄",
        "name": "万千公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.240752,
            31.057433
        ],
        "address": "光星路1599号",
        "name": "马利来广场",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.394822,
            31.072944
        ],
        "address": "光中路133弄99号5栋",
        "name": "海创汇诺旋智能孵化基地",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.394362,
            31.072571
        ],
        "address": "光中路133弄118号",
        "name": "茸桥科创园_光中路133弄118号园区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.484596,
            31.232315
        ],
        "address": "广东路339号",
        "name": "中福现代城",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.481864,
            31.23254
        ],
        "address": "广东路500号",
        "name": "上海世界贸易大厦",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.478848,
            31.230715
        ],
        "address": "广东路689号",
        "name": "海通证券大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.483184,
            31.232204
        ],
        "address": "广东路429号",
        "name": "天赐公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.496766,
            30.959082
        ],
        "address": "广丰路100弄",
        "name": "金水佳苑",
        "count": 65,
        "style": 0
    },
    {
        "lnglat": [
            121.233761,
            31.059335
        ],
        "address": "广富林路1188弄",
        "name": "保利西子湾",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.233098,
            31.058492
        ],
        "address": "广富林路1238号",
        "name": "上海律必尊酒店式公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.163696,
            31.047687
        ],
        "address": "广富林路4855弄",
        "name": "星月大业领地",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.243195,
            31.058112
        ],
        "address": "广富林路658号",
        "name": "孩子王(上海松江万达店)",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.482275,
            31.284152
        ],
        "address": "广纪路173弄",
        "name": "香杉商务中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.48207,
            31.281255
        ],
        "address": "广纪路65弄1号",
        "name": "合虹公寓",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.481789,
            31.280576
        ],
        "address": "广纪路19号",
        "name": "翰林苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.484001,
            31.291621
        ],
        "address": "广纪路700号",
        "name": "上海明珠创意产业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.484294,
            31.294177
        ],
        "address": "广纪路838号",
        "name": "国家数字出版基地",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.472354,
            31.284834
        ],
        "address": "广灵二路298弄",
        "name": "典雅公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.471522,
            31.281209
        ],
        "address": "广灵二路385弄7~9号",
        "name": "#N/A",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.480134,
            31.286644
        ],
        "address": "广灵四路116号",
        "name": "智慧桥创意产业园二期",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.482277,
            31.286054
        ],
        "address": "广灵四路24号",
        "name": "上海开隆大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.468173,
            31.286054
        ],
        "address": "广灵四路561弄",
        "name": "中虹翡翠苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.476424,
            31.238142
        ],
        "address": "广西北路528号",
        "name": "地王中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.456787,
            31.291393
        ],
        "address": "广延路1199弄",
        "name": "明园森林都市叠翠苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.455026,
            31.291183
        ],
        "address": "广延路1188弄",
        "name": "明园森林都市涵翠苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.45556,
            31.278569
        ],
        "address": "广延路415号",
        "name": "广延路415号小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.478711,
            31.233353
        ],
        "address": "广西北路228弄",
        "name": "中福城二期",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.433119,
            31.195256
        ],
        "address": "广元西路303号",
        "name": "丰业广元公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432408,
            31.195026
        ],
        "address": "广元西路315号",
        "name": "联峰汇",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.4341,
            31.195998
        ],
        "address": "广元西路333弄",
        "name": "紫元大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46797,
            31.286408
        ],
        "address": "广粤路150弄",
        "name": "虹韵家园",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.468738,
            31.303404
        ],
        "address": "广粤路1500弄",
        "name": "学府花苑（上海）",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.466549,
            31.304155
        ],
        "address": "广粤路1601弄",
        "name": "广裕小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.466459,
            31.292183
        ],
        "address": "广粤路501号",
        "name": "上海信南实业大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.465488,
            31.293485
        ],
        "address": "广粤支路1号",
        "name": "临港新业坊虹口智立方",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.475509,
            31.276985
        ],
        "address": "广中路208号",
        "name": "吉联大厦裙房",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.462433,
            31.280193
        ],
        "address": "广中路657号",
        "name": "ID657创意园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.462428,
            31.279685
        ],
        "address": "广中路680弄",
        "name": "珊瑚苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.453796,
            31.274658
        ],
        "address": "广中西路1207号",
        "name": "大宁创业大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.439331,
            31.277202
        ],
        "address": "广中西路777弄2号楼",
        "name": "多媒体产业大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.438705,
            31.278214
        ],
        "address": "广中西路777弄88号",
        "name": "华清大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.439497,
            31.27848
        ],
        "address": "广中西路777弄55号",
        "name": "启迪大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.438858,
            31.278807
        ],
        "address": "广中西路777弄99号",
        "name": "江裕大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.549883,
            31.27473
        ],
        "address": "贵阳路398号",
        "name": "文通国际广场",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.415215,
            31.173357
        ],
        "address": "桂林路406号",
        "name": "华鑫中心",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.417833,
            31.171691
        ],
        "address": "桂林路399弄",
        "name": "桂林花苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42351,
            31.154582
        ],
        "address": "桂林东街28弄",
        "name": "海上名邸",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.414594,
            31.177713
        ],
        "address": "桂林路418号",
        "name": "中电科华鑫创享园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.415333,
            31.178162
        ],
        "address": "桂林路565号",
        "name": "明佳公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.407168,
            31.158499
        ],
        "address": "桂平路277弄",
        "name": "桂竹香小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.405889,
            31.160577
        ],
        "address": "桂平路333号",
        "name": "桂林聚科商务园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.405364,
            31.164308
        ],
        "address": "桂平路410号",
        "name": "科技广场及科技广场裙楼",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.412564,
            31.149226
        ],
        "address": "桂平路88弄",
        "name": "紫藤苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.403927,
            31.164259
        ],
        "address": "桂平路391号",
        "name": "漕河泾国际商务中心",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.603838,
            31.241074
        ],
        "address": "桂桥路25号",
        "name": "上海保利N加金桥青年社区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.412564,
            31.149226
        ],
        "address": "桂平路88弄、126弄",
        "name": "紫藤苑综合楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.593997,
            31.210422
        ],
        "address": "郭守敬路277号",
        "name": "凯顿酒店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.597926,
            31.208902
        ],
        "address": "郭守敬路498号",
        "name": "浦东软件园郭守敬园及祖冲之园",
        "count": 49,
        "style": 0
    },
    {
        "lnglat": [
            121.505525,
            31.311228
        ],
        "address": "国安路200号",
        "name": "君庭广场",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.503859,
            31.312978
        ],
        "address": "国安路259弄",
        "name": "上和园一期（世嘉园）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.505218,
            31.317605
        ],
        "address": "国安路558弄",
        "name": "建发新江湾华苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.505267,
            31.319871
        ],
        "address": "国安路758弄",
        "name": "星汇广场一期",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.502496,
            31.319683
        ],
        "address": "国安路789弄",
        "name": "新江湾中凯城市之光名苑",
        "count": 55,
        "style": 0
    },
    {
        "lnglat": [
            121.513286,
            31.30072
        ],
        "address": "国宾路36号",
        "name": "五角场万达广场",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.52122,
            31.29884
        ],
        "address": "国定东路233号、国定东路275-8号",
        "name": "绿地汇创国际大厦",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.514687,
            31.293677
        ],
        "address": "国定路101弄",
        "name": "兴平昌苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.505464,
            31.324288
        ],
        "address": "国泓路818弄",
        "name": "绿地海珀璞晖",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.52198,
            31.315568
        ],
        "address": "国和路777号(近民庆路)",
        "name": "孩子王(上海中原店)",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.509,
            31.297299
        ],
        "address": "国定路335号3号楼",
        "name": "杨浦科技创业中心",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.49404,
            31.208871
        ],
        "address": "国货路288号",
        "name": "南国大厦（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.494997,
            31.208805
        ],
        "address": "国货路236弄",
        "name": "东物公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.493677,
            31.210445
        ],
        "address": "国货路333弄",
        "name": "海洲国际华园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.513208,
            31.308595
        ],
        "address": "国京路50弄",
        "name": "平安佳苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.492912,
            31.208653
        ],
        "address": "国货路370弄",
        "name": "惠国公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.502171,
            31.286968
        ],
        "address": "国康路100号",
        "name": "上海国际设计中心",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.51935,
            31.286414
        ],
        "address": "国科路29弄",
        "name": "黄兴雅苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.519646,
            31.286495
        ],
        "address": "国科路39弄",
        "name": "贵仁绿苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.503381,
            31.341161
        ],
        "address": "国权北路1688弄",
        "name": "湾谷科技园",
        "count": 69,
        "style": 0
    },
    {
        "lnglat": [
            121.495364,
            31.309231
        ],
        "address": "国权北路6弄",
        "name": "国权北路6弄",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.491984,
            31.329446
        ],
        "address": "国权北路828弄",
        "name": "美岸栖庭",
        "count": 82,
        "style": 0
    },
    {
        "lnglat": [
            121.525027,
            31.289839
        ],
        "address": "国权东路99弄",
        "name": "文化佳园",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.505008,
            31.289164
        ],
        "address": "国权后路15弄",
        "name": "复旦书馨公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.516213,
            31.288055
        ],
        "address": "国权路100号",
        "name": "国阳大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.517349,
            31.287993
        ],
        "address": "国权路85弄",
        "name": "市益小区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.514655,
            31.291328
        ],
        "address": "国顺路128弄",
        "name": "上海东方家园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.541828,
            31.304083
        ],
        "address": "国顺东路19号",
        "name": "首东大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.524922,
            31.29383
        ],
        "address": "国顺东路800号",
        "name": "国顺东路800号东楼",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.515269,
            31.290046
        ],
        "address": "国顺路131弄10号",
        "name": "复华商业大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.513341,
            31.291362
        ],
        "address": "国顺路280号",
        "name": "华丰大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.533364,
            31.331774
        ],
        "address": "国伟路300号",
        "name": "爱久家园",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.454106,
            30.93109
        ],
        "address": "国顺路668弄",
        "name": "万科南桥传奇(海尚华庭)",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.507842,
            31.287944
        ],
        "address": "国泰路11号",
        "name": "上海复旦科技园大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.506037,
            31.314304
        ],
        "address": "国霞路258、259号",
        "name": "复旦绿地科创中心",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.525755,
            31.332901
        ],
        "address": "国伟路800号",
        "name": "新江湾城雍景苑",
        "count": 55,
        "style": 0
    },
    {
        "lnglat": [
            121.505386,
            31.316293
        ],
        "address": "国霞路399弄",
        "name": "三湘未来海岸",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.505803,
            31.317729
        ],
        "address": "国霞路458弄",
        "name": "星汇广场二期",
        "count": 63,
        "style": 0
    },
    {
        "lnglat": [
            121.506572,
            31.310799
        ],
        "address": "国霞路60号",
        "name": "君庭广场7号楼",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.505666,
            31.310641
        ],
        "address": "国霞路55号",
        "name": "君庭公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.604339,
            31.194971
        ],
        "address": "哈雷路998号",
        "name": "悦颂生命科学园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.368398,
            31.19494
        ],
        "address": "哈密路1945弄",
        "name": "虹桥中园",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.329988,
            31.270009
        ],
        "address": "海波路1000弄",
        "name": "水岸丽苑（一期）",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.345751,
            31.267729
        ],
        "address": "海波路118弄",
        "name": "雅颂湾",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.340996,
            31.265969
        ],
        "address": "海波路333号",
        "name": "华江景城",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.496979,
            31.208154
        ],
        "address": "海潮路222弄",
        "name": "雅士公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.498453,
            31.210644
        ],
        "address": "海潮路23号",
        "name": "中福花苑",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.349248,
            31.264539
        ],
        "address": "海川路58弄",
        "name": "嘉城新航域",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.348476,
            31.263531
        ],
        "address": "海川路77弄",
        "name": "香馥湾",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.448897,
            31.239771
        ],
        "address": "海防路198号",
        "name": "海防商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.446757,
            31.237926
        ],
        "address": "海防路387号",
        "name": "大闻丽都苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.448269,
            31.239604
        ],
        "address": "海防路228号",
        "name": "福安大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.443181,
            31.23716
        ],
        "address": "海防路538弄",
        "name": "达安锦园小区",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.445435,
            31.237788
        ],
        "address": "海防路421号",
        "name": "静工园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.44335,
            31.23665
        ],
        "address": "海防路555号",
        "name": "同乐坊",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.450394,
            31.240401
        ],
        "address": "海防路58弄1-14号",
        "name": "静安康鑫家园",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.347146,
            30.750691
        ],
        "address": "海芙路186弄",
        "name": "金山悦立方商业广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.341873,
            31.263942
        ],
        "address": "海蓝路398弄",
        "name": "嘉城馥邸",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.494272,
            31.257025
        ],
        "address": "海伦路178号",
        "name": "宏伦大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.493535,
            31.257558
        ],
        "address": "海伦路188弄",
        "name": "海伦都市佳苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.491954,
            31.257722
        ],
        "address": "海伦路306弄",
        "name": "海昌苑虹口",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.486871,
            31.258401
        ],
        "address": "海伦路555弄",
        "name": "国贸花园(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.495729,
            31.25553
        ],
        "address": "海伦路75号",
        "name": "海伦大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.496606,
            31.257211
        ],
        "address": "海伦路88号",
        "name": "浦江名邸",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.533723,
            30.824687
        ],
        "address": "海马路2155弄(近海佳路)",
        "name": "嘉业海悦苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.487193,
            31.250623
        ],
        "address": "海宁路307号",
        "name": "爱思大厦",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.485686,
            31.250711
        ],
        "address": "海宁路358号",
        "name": "国际商厦大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.477189,
            31.245862
        ],
        "address": "海宁路899号",
        "name": "长泰企业天地广场",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.603821,
            31.177202
        ],
        "address": "海趣路218号",
        "name": "绿地M-TOWN",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.352791,
            30.752477
        ],
        "address": "海盛路500弄",
        "name": "旭新华庭",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.60318,
            31.178137
        ],
        "address": "海趣路236号",
        "name": "绿地loft",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.551691,
            31.209983
        ],
        "address": "海桐路336弄",
        "name": "建华钻石公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.571372,
            30.853602
        ],
        "address": "海兴路1881弄",
        "name": "绿地香溢",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.513499,
            31.160556
        ],
        "address": "海阳路1333弄",
        "name": "尚东国际名园二期",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.497161,
            31.155557
        ],
        "address": "海阳路654弄、612弄",
        "name": "日月新殿",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.912252,
            30.865176
        ],
        "address": "海洋二路88弄1-38号",
        "name": "智英科技中心创新魔坊二期",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.497808,
            31.294476
        ],
        "address": "邯郸路159号",
        "name": "上豪大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.499719,
            31.293898
        ],
        "address": "邯郸路173号",
        "name": "冠寓_复旦大学二店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.498522,
            31.296181
        ],
        "address": "邯郸路178弄",
        "name": "东方文苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.493243,
            31.293377
        ],
        "address": "邯郸路43号",
        "name": "中观产业园（中观大厦）",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.494761,
            31.294624
        ],
        "address": "邯郸路98号",
        "name": "上海无锡大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.402541,
            31.332844
        ],
        "address": "涵青路100弄",
        "name": "经纬城市绿洲学府阳光家园",
        "count": 122,
        "style": 0
    },
    {
        "lnglat": [
            121.39672,
            31.332758
        ],
        "address": "涵青路398弄",
        "name": "经纬城市绿洲学府涵青家园",
        "count": 241,
        "style": 0
    },
    {
        "lnglat": [
            121.482601,
            31.235579
        ],
        "address": "汉口路400号",
        "name": "华盛大厦（上海）",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.480642,
            31.234136
        ],
        "address": "汉口路515号",
        "name": "汇金大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.478101,
            31.23384
        ],
        "address": "汉口路650号",
        "name": "亚洲大厦",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.477367,
            31.233247
        ],
        "address": "汉口路689弄",
        "name": "中福城三期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.457672,
            31.241932
        ],
        "address": "汉中路188号",
        "name": "青年文化活动中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.455718,
            31.241409
        ],
        "address": "汉中路261号",
        "name": "苏河融景",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.458,
            31.24213
        ],
        "address": "汉中路158号",
        "name": "汉中广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.455261,
            31.240847
        ],
        "address": "汉中路333弄",
        "name": "河滨花园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.546412,
            31.26799
        ],
        "address": "杭州路895号",
        "name": "鼎隆公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.34855,
            31.17018
        ],
        "address": "航北路669弄",
        "name": "小桥里",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.354881,
            31.176699
        ],
        "address": "航东路528弄45支弄",
        "name": "新明星花园三期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.210337,
            31.277894
        ],
        "address": "杭桂路1118号",
        "name": "中波研发中心商务大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.58855,
            31.025187
        ],
        "address": "航鹤路78弄",
        "name": "长泰东郊御园",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.55262,
            30.98228
        ],
        "address": "航南公路1981弄8号",
        "name": "申亚花满庭",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.462647,
            30.930048
        ],
        "address": "航南公路5699号",
        "name": "奉贤宝龙城市广场(商务楼)",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.46831,
            30.932155
        ],
        "address": "航南公路5088号",
        "name": "绿庭国际大厦",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.592388,
            31.070879
        ],
        "address": "航瑞路175弄-1-119号",
        "name": "鹤沙航城汇康锦苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.441636,
            30.925383
        ],
        "address": "航南公路6666号",
        "name": "上海魏晋文化创意产业园",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.44455,
            30.925415
        ],
        "address": "航南公路6161号",
        "name": "奉贤农机综合大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.34943,
            31.16848
        ],
        "address": "航新路260弄",
        "name": "横泾苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.379135,
            31.18022
        ],
        "address": "合川路3051号",
        "name": "莱茵虹桥中心",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.354331,
            31.167129
        ],
        "address": "航中路99弄",
        "name": "七韵美地苑",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.37958,
            31.178467
        ],
        "address": "合川路3089号",
        "name": "富群商务大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.461706,
            30.947364
        ],
        "address": "航谊路8号",
        "name": "宏普信息园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.476261,
            31.214727
        ],
        "address": "合肥路215号",
        "name": "精益商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.474468,
            31.213985
        ],
        "address": "合肥路289弄（淡水路）",
        "name": "复兴苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.474002,
            31.213842
        ],
        "address": "合肥路315号",
        "name": "海文商务楼(合肥路)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.492801,
            31.33087
        ],
        "address": "何家湾路111弄",
        "name": "美岸栖庭三期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.254842,
            31.335733
        ],
        "address": "合作路719弄",
        "name": "领峰华庭一期",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.462177,
            31.265356
        ],
        "address": "和田路229弄",
        "name": "紫薇阁",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.512875,
            31.1287
        ],
        "address": "和佳路105",
        "name": "东方康德家园北区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.539585,
            31.268912
        ],
        "address": "河间路555弄",
        "name": "明月坊",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.544109,
            31.271959
        ],
        "address": "河间路688弄",
        "name": "水月坊",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.481072,
            31.246596
        ],
        "address": "河南北路233号",
        "name": "圣和圣广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.479376,
            31.249658
        ],
        "address": "河南北路485号",
        "name": "银历大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.49412,
            31.213578
        ],
        "address": "河南南路1009弄",
        "name": "明日星城",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.486518,
            31.230466
        ],
        "address": "河南南路16号",
        "name": "中汇大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.487127,
            31.230567
        ],
        "address": "河南南路1号",
        "name": "星腾大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.487424,
            31.229794
        ],
        "address": "河南南路33号",
        "name": "新上海城市广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.488506,
            31.222716
        ],
        "address": "河南南路398弄",
        "name": "太阳都市花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.490962,
            31.220704
        ],
        "address": "河南南路555弄",
        "name": "士林华苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.487876,
            31.223852
        ],
        "address": "河南南路368弄",
        "name": "太阳都市花园二期",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.492806,
            31.215713
        ],
        "address": "河南南路747号",
        "name": "申升公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.528875,
            31.061445
        ],
        "address": "鹤坡南路169弄",
        "name": "闵浦新苑三村",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.529355,
            31.059188
        ],
        "address": "鹤坡南路55弄56弄",
        "name": "闵浦新苑二村",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.41379,
            31.009857
        ],
        "address": "鹤庆路358弄",
        "name": "金铭城市之光",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.593318,
            31.081866
        ],
        "address": "鹤沙路588弄",
        "name": "昱星家园东区",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.589271,
            31.081555
        ],
        "address": "鹤沙路688弄",
        "name": "昱星家园西区",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.590902,
            31.081406
        ],
        "address": "鹤沙路699弄",
        "name": "昱丽家园",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.319886,
            31.243661
        ],
        "address": "鹤望路679弄",
        "name": "亿达北虹桥创业城",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.308405,
            31.238894
        ],
        "address": "鹤旋路500弄",
        "name": "水岸秀苑",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.60283,
            31.074415
        ],
        "address": "鹤永路600弄",
        "name": "鹤沙航城东茗苑(上海)",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.451411,
            31.255275
        ],
        "address": "恒丰北路100号",
        "name": "林顿大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.325788,
            31.23831
        ],
        "address": "鹤友路336弄",
        "name": "万达城市公寓（上海）",
        "count": 96,
        "style": 0
    },
    {
        "lnglat": [
            121.45856,
            31.239926
        ],
        "address": "恒丰路31号",
        "name": "金峰大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.456664,
            31.24125
        ],
        "address": "恒丰路218号",
        "name": "现代交通商务大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.458755,
            31.239307
        ],
        "address": "恒丰路1号",
        "name": "创智联合大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.453321,
            31.244848
        ],
        "address": "恒丰路500号",
        "name": "宝矿洲际商务中心",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.451697,
            31.247682
        ],
        "address": "恒丰路638号",
        "name": "苏河1号",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.450882,
            31.247212
        ],
        "address": "恒丰路610号",
        "name": "金岸610",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.312223,
            31.121326
        ],
        "address": "恒江路8号",
        "name": "elife生活社区",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.513134,
            31.084776
        ],
        "address": "恒南路1325号",
        "name": "闿鑫商务园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.512446,
            31.08663
        ],
        "address": "恒南路1355号",
        "name": "禾谷文创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.515786,
            31.069255
        ],
        "address": "恒南路399号",
        "name": "茸锦浦江科技园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.514859,
            31.077802
        ],
        "address": "恒南路851号、899号",
        "name": "浦江国际",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.459215,
            31.241446
        ],
        "address": "恒通路222号",
        "name": "地铁恒通大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.175576,
            31.351001
        ],
        "address": "恒荣路589号",
        "name": "恒荣府邸",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.45714,
            31.240441
        ],
        "address": "恒通路360号",
        "name": "一天下大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.512312,
            31.084233
        ],
        "address": "恒西路18号",
        "name": "优麦文创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.475664,
            31.268395
        ],
        "address": "恒业路129弄",
        "name": "德华苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.185221,
            31.345272
        ],
        "address": "恒永路328号",
        "name": "联东U谷上海嘉定国际企业港",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.478803,
            31.264092
        ],
        "address": "横浜路123弄",
        "name": "金机大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.47887,
            31.263224
        ],
        "address": "横浜路158弄",
        "name": "宝虹新苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.439481,
            31.194916
        ],
        "address": "衡山路922号",
        "name": "建汇大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.446264,
            31.204644
        ],
        "address": "衡山路20号",
        "name": "衡安大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.486619,
            31.254395
        ],
        "address": "衡水路89弄1号",
        "name": "国际明佳城",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.408001,
            31.194928
        ],
        "address": "红宝石路19弄11、12号",
        "name": "古北长乐苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.399403,
            31.198041
        ],
        "address": "红宝石路500号",
        "name": "东银中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.587904,
            31.243796
        ],
        "address": "红枫路108弄",
        "name": "金桥酒店公寓",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.589343,
            31.242603
        ],
        "address": "红枫路300弄，碧云路1188,1202,1218号",
        "name": "碧云东方公寓",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.418202,
            31.363676
        ],
        "address": "红林路576号",
        "name": "和家欣园B区",
        "count": 168,
        "style": 0
    },
    {
        "lnglat": [
            121.419182,
            31.362286
        ],
        "address": "红林路589弄",
        "name": "和家欣苑A区",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.429459,
            31.367053
        ],
        "address": "红林路58弄、158弄",
        "name": "飘鹰锦和花园",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.432332,
            31.366799
        ],
        "address": "红林路99弄",
        "name": "印象苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.229181,
            31.377819
        ],
        "address": "红石路333弄",
        "name": "新城悠活城",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.227615,
            31.387297
        ],
        "address": "红石路730号",
        "name": "汇丰凯苑",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.40438,
            31.187986
        ],
        "address": "红松东路321弄",
        "name": "古北大成公馆",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.372318,
            31.18036
        ],
        "address": "红松路175弄",
        "name": "金汇名人苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.377387,
            31.180108
        ],
        "address": "红松路81弄169支弄",
        "name": "龙柏识庐",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.36751,
            31.180725
        ],
        "address": "红松路333弄",
        "name": "汇金公寓",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.409594,
            31.170604
        ],
        "address": "虹漕路39号",
        "name": "华鑫科技园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.408026,
            31.17716
        ],
        "address": "虹漕路421号",
        "name": "漕河泾二期",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.409707,
            31.177283
        ],
        "address": "虹漕路448号",
        "name": "现代物流大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.40952,
            31.178445
        ],
        "address": "虹漕路456号",
        "name": "光启园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.407067,
            31.178474
        ],
        "address": "虹漕路461号",
        "name": "钦州工业园区（虹钦园）",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.409392,
            31.171949
        ],
        "address": "虹漕路77号",
        "name": "华鑫慧享城",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.418016,
            31.14745
        ],
        "address": "虹漕南路718弄之1-2号",
        "name": "迎春园(虹漕南路)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.413399,
            31.162447
        ],
        "address": "虹漕南路99弄",
        "name": "金桂苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.398621,
            31.202715
        ],
        "address": "虹古路11弄",
        "name": "虹景花苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.398691,
            31.203573
        ],
        "address": "虹古路8弄之1-11号",
        "name": "虹景家苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.496829,
            31.264993
        ],
        "address": "虹关路323弄",
        "name": "瑞虹新城璟庭",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.371403,
            31.175428
        ],
        "address": "虹井路120号",
        "name": "新华红星国际广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.370553,
            31.175014
        ],
        "address": "虹井路185号",
        "name": "虹淞大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.372477,
            31.177038
        ],
        "address": "虹井路280弄",
        "name": "虹桥晶座",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.372697,
            31.176696
        ],
        "address": "虹井路280弄1号",
        "name": "瑞都大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.371912,
            31.176499
        ],
        "address": "虹井路288号",
        "name": "燎申虹桥国际中心",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.370318,
            31.179024
        ],
        "address": "虹井路482弄",
        "name": "金汇鸿锦苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.368435,
            31.18834
        ],
        "address": "虹井路888号",
        "name": "嘉利豪园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.46241,
            31.297167
        ],
        "address": "虹口江场路1067弄、江场路1099弄",
        "name": "海虹欣苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.491624,
            31.291257
        ],
        "address": "虹口区曲阳路930号",
        "name": "大柏树930科技创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.498069,
            31.272529
        ],
        "address": "虹口区四平路773号",
        "name": "金大地商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.400365,
            31.164259
        ],
        "address": "虹梅路1535号",
        "name": "星联科技园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.402833,
            31.15996
        ],
        "address": "虹梅路1123号",
        "name": "上企置业广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.397836,
            31.168463
        ],
        "address": "虹梅路1801号",
        "name": "宏业大厦(上海)",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.397782,
            31.169069
        ],
        "address": "虹梅路1905号",
        "name": "远中科研楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.397852,
            31.168543
        ],
        "address": "虹梅路1801号A区",
        "name": "凯科国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.393846,
            31.171877
        ],
        "address": "虹梅路2007号",
        "name": "远中产业园6号楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.391961,
            31.172604
        ],
        "address": "虹梅路2071号",
        "name": "远中产业园三四期",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.398994,
            31.16926
        ],
        "address": "虹梅路2008号",
        "name": "虹梅大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.395044,
            31.173676
        ],
        "address": "虹梅路2125、2588弄",
        "name": "永兆豪庭",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.393522,
            31.173869
        ],
        "address": "虹梅路2159弄",
        "name": "荣信虹桥世嘉",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.40985,
            31.143521
        ],
        "address": "虹梅路263号",
        "name": "金梅公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.409569,
            31.144065
        ],
        "address": "虹梅路269号",
        "name": "宝城大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.394113,
            31.179565
        ],
        "address": "虹梅路2838弄",
        "name": "虹桥晶典苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.387983,
            31.18755
        ],
        "address": "虹梅路3200弄",
        "name": "虹桥花苑",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.386258,
            31.186161
        ],
        "address": "虹梅路3213号",
        "name": "红春大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.387878,
            31.185727
        ],
        "address": "虹梅路3201弄",
        "name": "虹桥紫京苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.384802,
            31.184459
        ],
        "address": "虹梅路3215弄201号",
        "name": "圣伦兰商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.385213,
            31.189448
        ],
        "address": "虹梅路3325弄",
        "name": "金泉苑二期",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.387421,
            31.187514
        ],
        "address": "虹梅路3219号",
        "name": "九洲生活广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.384062,
            31.191309
        ],
        "address": "虹梅路3721号",
        "name": "森晟世洋国际广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.382416,
            31.193214
        ],
        "address": "虹梅路3887弄",
        "name": "虹梅君悦花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.434942,
            31.097011
        ],
        "address": "虹梅南路2588号",
        "name": "绿亮科创园总部",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.383151,
            31.194531
        ],
        "address": "虹梅路3990弄",
        "name": "晨韵公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.442312,
            31.076643
        ],
        "address": "虹梅南路3966号",
        "name": "上海时代汽车商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.44295,
            31.067734
        ],
        "address": "虹梅南路4289号",
        "name": "绿亮科创园(虹梅南路)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.449351,
            31.051265
        ],
        "address": "虹梅南路4999弄",
        "name": "燎申智城",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.422268,
            31.128098
        ],
        "address": "虹梅南路698号",
        "name": "秀水苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.422892,
            31.126446
        ],
        "address": "虹梅南路786号",
        "name": "上海雍辰商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.421833,
            31.125313
        ],
        "address": "虹梅南路833号",
        "name": "国民新能源环保孵化园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.41753,
            31.19561
        ],
        "address": "虹桥路1060弄",
        "name": "虹桥丽景苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.40938,
            31.197836
        ],
        "address": "虹桥路1163弄",
        "name": "长发虹桥公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.406804,
            31.197263
        ],
        "address": "虹桥路1380-7、1386号",
        "name": "文广大厦(虹桥路)",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.431357,
            31.190728
        ],
        "address": "虹桥路178弄",
        "name": "青之杰花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.432084,
            31.191906
        ],
        "address": "虹桥路188号",
        "name": "元福大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.380455,
            31.192356
        ],
        "address": "虹桥路2222弄33号",
        "name": "王子公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.381583,
            31.192068
        ],
        "address": "虹桥路2222弄55号",
        "name": "爱都公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.376563,
            31.191406
        ],
        "address": "虹桥路2272号",
        "name": "虹桥商务大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.370699,
            31.189711
        ],
        "address": "虹桥路2328弄",
        "name": "西郊家园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.431149,
            31.192454
        ],
        "address": "虹桥路400弄",
        "name": "南丹小区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.428726,
            31.194134
        ],
        "address": "虹桥路591弄",
        "name": "虹桥丽园（上海）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.431161,
            31.193191
        ],
        "address": "虹桥路355号",
        "name": "城开国际大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.426173,
            31.193661
        ],
        "address": "虹桥路666弄",
        "name": "虹桥乐庭",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.423921,
            31.194469
        ],
        "address": "虹桥路808号",
        "name": "加华广场(汇宜众创空间)",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.419644,
            31.19633
        ],
        "address": "虹桥路953弄",
        "name": "南洋虹桥公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.422723,
            31.195028
        ],
        "address": "虹桥路888号",
        "name": "阳光名邸",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.37501,
            31.17039
        ],
        "address": "虹泉路1000号",
        "name": "井亭大厦",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.4171,
            31.197342
        ],
        "address": "虹桥路977号",
        "name": "中山广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.385312,
            31.127777
        ],
        "address": "虹莘路1518弄28支弄",
        "name": "春意苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.387866,
            31.124305
        ],
        "address": "虹莘路1200弄",
        "name": "新梅商住楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.374893,
            31.161827
        ],
        "address": "虹莘路3333弄",
        "name": "天安豪园",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.373298,
            31.168144
        ],
        "address": "虹莘路3800弄",
        "name": "风度国际",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.474461,
            31.313071
        ],
        "address": "虹湾路86弄",
        "name": "蔷薇里",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.389511,
            31.190817
        ],
        "address": "虹许路731号",
        "name": "老外街国际文创生活园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.393951,
            31.190128
        ],
        "address": "虹许路788号",
        "name": "名都城",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.378923,
            31.186902
        ],
        "address": "虹中路525号",
        "name": "黔香阁(虹桥店)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.378343,
            31.189027
        ],
        "address": "虹中路786弄3-6号",
        "name": "奥森公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.243429,
            31.3505
        ],
        "address": "洪德路1125弄",
        "name": "新城香溢澜庭",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.377746,
            31.188992
        ],
        "address": "虹中路796弄1-6号",
        "name": "延虹公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.237046,
            31.348757
        ],
        "address": "洪德路1500弄",
        "name": "嘉德豪庭",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.44302,
            31.343168
        ],
        "address": "呼兰路799号9号楼",
        "name": "乐活家时尚公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.44266,
            31.342861
        ],
        "address": "呼兰路799号",
        "name": "智汇园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.439956,
            31.343787
        ],
        "address": "呼兰路911弄11号",
        "name": "博济上海智汇园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.43207,
            31.339136
        ],
        "address": "呼兰西路123号",
        "name": "龙盛活力小镇",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.435129,
            31.338719
        ],
        "address": "呼兰西路60号",
        "name": "卓越时代广场公寓楼",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.4301,
            31.340743
        ],
        "address": "呼兰西路129号",
        "name": "栋霖科技园6号楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.481869,
            31.231377
        ],
        "address": "湖北路20号",
        "name": "中信福申大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.439478,
            31.343262
        ],
        "address": "呼青路158号",
        "name": "上海交运智慧湾科创园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.493402,
            30.935309
        ],
        "address": "湖堤路199弄",
        "name": "万景峰二期",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.460681,
            31.330777
        ],
        "address": "虎林路159弄",
        "name": "丽雅花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.423227,
            31.082708
        ],
        "address": "沪光东路89号",
        "name": "福克斯连锁商务大厦（千奥园区）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.410884,
            31.076783
        ],
        "address": "沪光路425弄",
        "name": "君莲闵都雅苑",
        "count": 155,
        "style": 0
    },
    {
        "lnglat": [
            121.406813,
            31.074728
        ],
        "address": "沪光路555弄",
        "name": "招商雍华府（招商雍华苑）",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.445557,
            30.949135
        ],
        "address": "沪杭公路1588号",
        "name": "凤创谷园区",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.419034,
            31.022468
        ],
        "address": "沪闵路1391号",
        "name": "华宜万创新所",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.422916,
            31.008259
        ],
        "address": "沪闵路269号",
        "name": "香樟时尚广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.385518,
            31.096399
        ],
        "address": "沪闵路5366弄",
        "name": "春申府邸",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.380911,
            31.1029
        ],
        "address": "沪闵路5600弄88支弄",
        "name": "邻里苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.42283,
            31.008754
        ],
        "address": "沪闵路277号",
        "name": "冠寓_闵行公园店",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.379167,
            31.107792
        ],
        "address": "沪闵路6088号",
        "name": "凯德龙之梦莘庄店（闵行凯德商业中心）",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.393986,
            31.12638
        ],
        "address": "沪闵路6988弄",
        "name": "莲浦花苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.399614,
            31.132782
        ],
        "address": "沪闵路7580弄111支弄",
        "name": "南方城(上海)",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.382243,
            31.111199
        ],
        "address": "沪闵路6269号",
        "name": "银霄大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.414361,
            31.142558
        ],
        "address": "沪闵路8075号",
        "name": "虹梅商务大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.406946,
            31.136873
        ],
        "address": "沪闵路7940号",
        "name": "宁谷（国际）商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.402538,
            31.133711
        ],
        "address": "沪闵路7866弄",
        "name": "莲花国际广场",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.422744,
            31.008472
        ],
        "address": "沪闵路8390弄",
        "name": "迎春园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.433595,
            31.163631
        ],
        "address": "沪闵路9450号",
        "name": "农资大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.570547,
            31.10475
        ],
        "address": "沪南公路3665号",
        "name": "上海金盾大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.565302,
            31.159413
        ],
        "address": "沪南路2199号",
        "name": "万科海上传奇(御桥芳澜苑)",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.433937,
            31.166167
        ],
        "address": "沪闵路9510号",
        "name": "泰成商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.565195,
            31.155827
        ],
        "address": "沪南路2419弄",
        "name": "地杰商业大厦",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.564914,
            31.150375
        ],
        "address": "沪南路2518弄",
        "name": "百舸馨苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.174064,
            31.147685
        ],
        "address": "沪青平公路3938弄",
        "name": "移动智地青浦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.56355,
            31.137773
        ],
        "address": "沪南路2688弄",
        "name": "绿地康桥新苑（上海）",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.329681,
            31.144534
        ],
        "address": "沪松公路1177号",
        "name": "佳预信息科技大厦",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.328751,
            31.143944
        ],
        "address": "沪松公路1197号",
        "name": "星汇大厦(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.326633,
            31.142776
        ],
        "address": "沪松公路1251号",
        "name": "云端电商家园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.327845,
            31.142867
        ],
        "address": "沪松公路1221号",
        "name": "星晨商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.320293,
            31.137109
        ],
        "address": "沪松公路1399弄",
        "name": "九久青年城",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.30699,
            31.134414
        ],
        "address": "沪松公路1658号",
        "name": "九润商务大厦(九亭)",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.278619,
            31.109317
        ],
        "address": "沪松公路2749弄1-2号",
        "name": "新南丽都",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.274167,
            31.108927
        ],
        "address": "沪松公路2972弄22号",
        "name": "绿波景园",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.278446,
            31.109203
        ],
        "address": "沪松公路2751号",
        "name": "新南丽都商务大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.241095,
            31.024368
        ],
        "address": "沪淞公路565弄",
        "name": "水清年华花园",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.427165,
            31.279733
        ],
        "address": "沪太路1111号",
        "name": "孩子王(上海静安大融城店)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42676,
            31.280139
        ],
        "address": "沪太路1111弄",
        "name": "静安大融城",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.45654,
            31.253409
        ],
        "address": "沪太路140弄",
        "name": "展望大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42541,
            31.27881
        ],
        "address": "沪太路1228号",
        "name": "魔方公寓行知路店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.420848,
            31.290285
        ],
        "address": "沪太路1861弄39号",
        "name": "岛里创新园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.285247,
            31.113965
        ],
        "address": "沪松公路2517弄",
        "name": "丽水豪庭",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.41697,
            31.290873
        ],
        "address": "沪太路1866号",
        "name": "诺诚M7创意园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.407582,
            31.31618
        ],
        "address": "沪太路2899弄",
        "name": "绿地科技中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.452944,
            31.255493
        ],
        "address": "沪太路315弄2号",
        "name": "华舟公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.397145,
            31.344933
        ],
        "address": "沪太路4361号",
        "name": "海宝示范园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.452147,
            31.256504
        ],
        "address": "沪太路453弄88号",
        "name": "兴联公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.45233,
            31.257651
        ],
        "address": "沪太路555弄",
        "name": "和泰花园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.447889,
            31.261846
        ],
        "address": "沪太路655弄2号，3号",
        "name": "金纺大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.443847,
            31.266486
        ],
        "address": "沪太路799号",
        "name": "上海新慧谷科技产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.35732,
            31.388175
        ],
        "address": "沪太路6598号",
        "name": "金岷大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.436493,
            31.273448
        ],
        "address": "沪太路903弄",
        "name": "佳宁花园",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.312314,
            31.155797
        ],
        "address": "沪亭北路1080弄",
        "name": "金丰蓝庭一期",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.423353,
            31.291534
        ],
        "address": "裕德路92弄",
        "name": "江南裕德大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.431363,
            31.27436
        ],
        "address": "沪太路941弄1-12号",
        "name": "绿柳苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.317783,
            31.148732
        ],
        "address": "沪亭北路618弄",
        "name": "九城湖滨国际公寓",
        "count": 111,
        "style": 0
    },
    {
        "lnglat": [
            121.315241,
            31.148565
        ],
        "address": "沪亭北路199弄10号楼",
        "name": "宝龙公寓(九亭中心)",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.321717,
            31.137543
        ],
        "address": "沪亭北路199弄",
        "name": "九亭中心",
        "count": 49,
        "style": 0
    },
    {
        "lnglat": [
            121.312936,
            31.153378
        ],
        "address": "沪亭北路900弄",
        "name": "金丰蓝庭二期",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.310825,
            31.152765
        ],
        "address": "沪亭北路901弄",
        "name": "金丰蓝庭三期",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.325795,
            31.133542
        ],
        "address": "沪亭路240弄",
        "name": "美丽星城",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.327959,
            31.12482
        ],
        "address": "沪亭南路208弄",
        "name": "紫金花园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.303439,
            31.295496
        ],
        "address": "沪宜公路1158号",
        "name": "久友大厦",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.26087,
            31.365184
        ],
        "address": "沪宜公路3051号",
        "name": "香溢都荟",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.261409,
            31.365263
        ],
        "address": "沪宜公路3066弄",
        "name": "南北周嘉苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.257641,
            31.36838
        ],
        "address": "沪宜公路3099号",
        "name": "绿地嘉创国际商务广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.265467,
            31.357606
        ],
        "address": "沪宜公路2857号",
        "name": "明发嘉定商业广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.300766,
            31.294717
        ],
        "address": "沪宜路1101号",
        "name": "越界南翔智地产业园（ 南翔智地三期越界产业园）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.260093,
            31.367989
        ],
        "address": "沪宜公路3128号",
        "name": "嘉尚国际广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.543405,
            31.210764
        ],
        "address": "花木路500弄",
        "name": "花木苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.57005,
            31.21778
        ],
        "address": "花木路1983号",
        "name": "四季雅苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.548309,
            31.209647
        ],
        "address": "花木路718弄",
        "name": "绿缘公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.5522,
            31.210873
        ],
        "address": "花木路838号",
        "name": "影城小筑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.553109,
            31.211306
        ],
        "address": "花木路908号",
        "name": "雍景台（上海）",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.553866,
            31.21105
        ],
        "address": "花木路916弄",
        "name": "四季全景台",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.569309,
            31.346256
        ],
        "address": "花山路333弄",
        "name": "宝厦雅苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.579121,
            31.34876
        ],
        "address": "花山路796弄",
        "name": "花山锦地苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.478456,
            31.26955
        ],
        "address": "花园路16号",
        "name": "嘉和国际大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.500452,
            31.234036
        ],
        "address": "花园石桥路33号",
        "name": "花旗集团大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.502327,
            31.234107
        ],
        "address": "花园石桥路66号",
        "name": "东亚银行金融大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.474868,
            31.263874
        ],
        "address": "华昌路183号",
        "name": "华清名苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.478384,
            31.261337
        ],
        "address": "华昌路9号",
        "name": "金象大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.477465,
            31.262033
        ],
        "address": "华昌路79号",
        "name": "华昌公寓(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.700585,
            31.176092
        ],
        "address": "华戴路599弄",
        "name": "凯佳公寓二期",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.453731,
            31.125658
        ],
        "address": "华发路99弄",
        "name": "明丰新纪苑",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.450018,
            31.12717
        ],
        "address": "华发路258号",
        "name": "东阔生活广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.381354,
            31.18882
        ],
        "address": "华光路300弄",
        "name": "凯迪华光公寓",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.397916,
            31.291466
        ],
        "address": "华和路602弄",
        "name": "华和路600弄",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.329387,
            31.245036
        ],
        "address": "华江路720号",
        "name": "歆翱商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.324182,
            31.227961
        ],
        "address": "华江路1260弄12号",
        "name": "上海禾智谷科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.454218,
            31.118717
        ],
        "address": "华泾路507号",
        "name": "华泾广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.340646,
            31.259804
        ],
        "address": "华江支路328弄",
        "name": "天际蓝桥",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.451524,
            31.119508
        ],
        "address": "华泾路599弄",
        "name": "漓江花园（上海漓江山水）",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.137019,
            31.157897
        ],
        "address": "华科路399弄",
        "name": "青水湾公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.145968,
            31.160243
        ],
        "address": "华科东路218号",
        "name": "新城盛景",
        "count": 131,
        "style": 0
    },
    {
        "lnglat": [
            121.424089,
            31.271661
        ],
        "address": "华灵路81弄",
        "name": "南华苑东座",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.21331,
            31.220693
        ],
        "address": "华隆路1758号",
        "name": "增洲大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.212549,
            31.218906
        ],
        "address": "华隆路1777号",
        "name": "e通世界科技园(华新园）",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.211701,
            31.221337
        ],
        "address": "华隆路1788号",
        "name": "境琦科创园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.205528,
            31.228039
        ],
        "address": "华南路555号",
        "name": "顺丰上海产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.201081,
            31.229239
        ],
        "address": "华南路680号",
        "name": "梁杭电商U库",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.382049,
            31.056269
        ],
        "address": "华宁路3333号",
        "name": "海联智谷",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.525786,
            31.174891
        ],
        "address": "华鹏路300弄",
        "name": "大华锦绣华城14街区",
        "count": 107,
        "style": 0
    },
    {
        "lnglat": [
            121.42075,
            31.000713
        ],
        "address": "华坪路100号",
        "name": "上海帝景园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.129625,
            31.178686
        ],
        "address": "华青路995弄",
        "name": "亿燕人才公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.133873,
            31.146219
        ],
        "address": "华青南路481-485号",
        "name": "芊岱大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.133421,
            31.140312
        ],
        "address": "华青南路99弄",
        "name": "仁恒运杰河滨花园",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.379317,
            31.325806
        ],
        "address": "华秋路349弄",
        "name": "保利叶之林",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.432599,
            31.20506
        ],
        "address": "华山路1520弄25号",
        "name": "华山嘉苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.431763,
            31.20501
        ],
        "address": "华山路1520弄",
        "name": "恒力公寓（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.432265,
            31.204862
        ],
        "address": "华山路1520弄55号",
        "name": "正力公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.43778,
            31.194983
        ],
        "address": "华山路1643弄",
        "name": "华山花苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.436521,
            31.201597
        ],
        "address": "华山路1765弄",
        "name": "海斯大厦（裙楼）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437072,
            31.196716
        ],
        "address": "华山路2088号",
        "name": "汇银广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.43778,
            31.194983
        ],
        "address": "华山路1765弄2号",
        "name": "海斯大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.444299,
            31.223165
        ],
        "address": "华山路2号",
        "name": "静安高和大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.446685,
            31.218919
        ],
        "address": "华山路301号",
        "name": "上海静安商楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.438801,
            31.213774
        ],
        "address": "华山路868弄",
        "name": "总统公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.599135,
            31.340473
        ],
        "address": "华申路150号",
        "name": "华申路150号",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.600783,
            31.340986
        ],
        "address": "华申路180号",
        "name": "唯恩富勤大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.601446,
            31.341247
        ],
        "address": "华申路198号",
        "name": "六宁大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.365522,
            31.067926
        ],
        "address": "华西路600号",
        "name": "优大科技园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.697991,
            31.201149
        ],
        "address": "华夏东路2345弄",
        "name": "水景豪园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.234843,
            31.240397
        ],
        "address": "华新镇华强街203弄",
        "name": "三友星墅",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.526907,
            31.184117
        ],
        "address": "华绣路179弄255弄",
        "name": "艾南花苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.262292,
            31.201943
        ],
        "address": "华徐公路1199号",
        "name": "碧家国际社区(国家会展中心店)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.253575,
            31.21214
        ],
        "address": "华徐公路3029弄5号",
        "name": "梁杭智慧园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.267241,
            31.190874
        ],
        "address": "华徐公路569号",
        "name": "麦迪睿医械e港",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.265968,
            31.201097
        ],
        "address": "华徐公路966号",
        "name": "法姬娜大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.421279,
            31.224849
        ],
        "address": "华阳路81号",
        "name": "兆丰苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.215979,
            31.130636
        ],
        "address": "华莹山路300弄",
        "name": "惠泽苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.353594,
            31.134847
        ],
        "address": "华友路550弄",
        "name": "碧林湾二期",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.212758,
            31.231176
        ],
        "address": "华志路859、903弄",
        "name": "绿地逸湾",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.214978,
            31.133383
        ],
        "address": "华莹山路450弄",
        "name": "莘泽苑",
        "count": 72,
        "style": 0
    },
    {
        "lnglat": [
            121.358746,
            31.134604
        ],
        "address": "华中路88号",
        "name": "金茂商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.499604,
            31.379275
        ],
        "address": "化成路366弄-8",
        "name": "三水国际广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.526638,
            31.256728
        ],
        "address": "怀德路366弄",
        "name": "保利香槟花园二期保利香槟花园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.451237,
            31.239689
        ],
        "address": "淮安路717号",
        "name": "717工坊",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.482368,
            31.226274
        ],
        "address": "淮海东路45号",
        "name": "东淮海国际大厦(东淮海壹号)",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.526454,
            31.255528
        ],
        "address": "怀德路383弄",
        "name": "保利香槟苑一期",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.481509,
            31.225896
        ],
        "address": "淮海东路85号",
        "name": "淮海商业大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.481047,
            31.225394
        ],
        "address": "淮海东路99号",
        "name": "恒积大厦",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.428866,
            31.199925
        ],
        "address": "淮海西路288弄",
        "name": "淮海花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.426859,
            31.199579
        ],
        "address": "淮海西路358弄",
        "name": "淮海世纪花苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.42412,
            31.201407
        ],
        "address": "淮海西路442弄124支弄86-88号",
        "name": "爱迪公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.43443,
            31.201471
        ],
        "address": "淮海西路55号",
        "name": "申通信息广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.456123,
            31.216079
        ],
        "address": "淮海中路1010号",
        "name": "嘉华中心（上海）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.42266,
            31.196943
        ],
        "address": "淮海西路666号",
        "name": "中山万博国际中心",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.477881,
            31.22524
        ],
        "address": "淮海中路138号",
        "name": "上海广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.456413,
            31.215106
        ],
        "address": "淮海中路1045号",
        "name": "淮海国际广场",
        "count": 70,
        "style": 0
    },
    {
        "lnglat": [
            121.445873,
            31.209222
        ],
        "address": "淮海中路1500号",
        "name": "鸿艺豪苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.437409,
            31.203954
        ],
        "address": "淮海中路1950弄2号",
        "name": "兴国大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.480119,
            31.225106
        ],
        "address": "淮海中路1号",
        "name": "柳林大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.479704,
            31.225888
        ],
        "address": "淮海中路2--8号",
        "name": "兰生大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.472059,
            31.222427
        ],
        "address": "淮海中路398号",
        "name": "博银国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.470889,
            31.22194
        ],
        "address": "淮海中路438号",
        "name": "兴城商厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.470237,
            31.221586
        ],
        "address": "淮海中路468号",
        "name": "淮海中路沿线跨街户外LED_2",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.474764,
            31.223687
        ],
        "address": "淮海中路282号",
        "name": "香港广场",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.470549,
            31.221451
        ],
        "address": "淮海中路469号",
        "name": "淮海中路沿线跨街户外LED_1",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.469847,
            31.221427
        ],
        "address": "淮海中路478号",
        "name": "淮海中路沿线跨街户外LED_4",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.469411,
            31.220998
        ],
        "address": "淮海中路503号",
        "name": "淮海中路沿线跨街户外LED_5",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.469875,
            31.221117
        ],
        "address": "淮海中路481号",
        "name": "淮海中路沿线跨街户外LED_3",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.469374,
            31.221265
        ],
        "address": "淮海中路510号",
        "name": "淮海中路沿线跨街户外LED_6",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.468992,
            31.220494
        ],
        "address": "淮海中路523号",
        "name": "淮海中路沿线跨街户外LED_7",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46887,
            31.220485
        ],
        "address": "淮海中路527号",
        "name": "淮海中路沿线跨街户外LED_9",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.46843,
            31.22092
        ],
        "address": "淮海中路550号",
        "name": "淮海中路沿线跨街户外LED_42",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.468961,
            31.221069
        ],
        "address": "淮海中路530号",
        "name": "淮海中路沿线跨街户外LED_8",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.468275,
            31.220817
        ],
        "address": "淮海中路558号",
        "name": "淮海中路沿线跨街户外LED_10",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.467845,
            31.220876
        ],
        "address": "淮海中路572号",
        "name": "淮海中路沿线跨街户外LED_12",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.467983,
            31.220329
        ],
        "address": "淮海中路575号",
        "name": "淮海中路沿线跨街户外LED_11",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.467437,
            31.220448
        ],
        "address": "淮海中路598号",
        "name": "淮海中路沿线跨街户外LED_14",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.467438,
            31.22012
        ],
        "address": "淮海中路603号",
        "name": "淮海中路沿线跨街户外LED_13",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46721,
            31.220063
        ],
        "address": "淮海中路609号",
        "name": "淮海中路沿线跨街户外LED_15",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.467183,
            31.220345
        ],
        "address": "淮海中路610号",
        "name": "淮海中路沿线跨街户外LED_16",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46672,
            31.220145
        ],
        "address": "淮海中路624号",
        "name": "淮海中路沿线跨街户外LED_18",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.465408,
            31.219333
        ],
        "address": "淮海中路627号",
        "name": "淮海中路沿线跨街户外LED_19",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.466978,
            31.219904
        ],
        "address": "淮海中路621号",
        "name": "淮海中路沿线跨街户外LED_17",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.466447,
            31.220072
        ],
        "address": "淮海中路642号",
        "name": "淮海中路沿线跨街户外LED_20",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.466199,
            31.219539
        ],
        "address": "淮海中路651号",
        "name": "淮海中路沿线跨街户外LED_21",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46603,
            31.219888
        ],
        "address": "淮海中路666号",
        "name": "淮海中路沿线跨街户外LED_22",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.465691,
            31.219441
        ],
        "address": "淮海中路671号",
        "name": "淮海中路沿线跨街户外LED_23",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46558,
            31.219379
        ],
        "address": "淮海中路681号",
        "name": "淮海中路沿线跨街户外LED_25",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.465293,
            31.219728
        ],
        "address": "淮海中路688号",
        "name": "淮海中路沿线跨街户外LED_24",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46509,
            31.219049
        ],
        "address": "淮海中路701号",
        "name": "淮海中路沿线跨街户外LED_27",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.464886,
            31.219826
        ],
        "address": "淮海中路706号",
        "name": "淮海中路沿线跨街户外LED_26",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.464957,
            31.219091
        ],
        "address": "淮海中路717号",
        "name": "淮海中路沿线跨街户外LED_29",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.479996,
            31.225143
        ],
        "address": "淮海中路728号",
        "name": "淮海中路沿线跨街户外LED_28",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46787,
            31.220364
        ],
        "address": "淮海中路746号",
        "name": "淮海中路沿线跨街户外LED_30",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.464432,
            31.218693
        ],
        "address": "淮海中路755号",
        "name": "淮海中路沿线跨街户外LED_31",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.46378,
            31.218934
        ],
        "address": "淮海中路758号",
        "name": "淮海中路沿线跨街户外LED_32",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.463054,
            31.218303
        ],
        "address": "淮海中路807号",
        "name": "淮海中路沿线跨街户外LED_35",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46257,
            31.218864
        ],
        "address": "淮海中路796号",
        "name": "淮海中路沿线跨街户外LED_34",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.463715,
            31.218401
        ],
        "address": "淮海中路775号",
        "name": "淮海中路沿线跨街户外LED_33",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.462622,
            31.218171
        ],
        "address": "淮海中路821号",
        "name": "淮海中路沿线跨街户外LED_37",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.462169,
            31.218232
        ],
        "address": "淮海中路854号",
        "name": "淮海中路沿线跨街户外LED_36",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.461503,
            31.217968
        ],
        "address": "淮海中路868号",
        "name": "淮海中路沿线跨街户外LED_38",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46148,
            31.217689
        ],
        "address": "淮海中路871号",
        "name": "淮海中路沿线跨街户外LED_39",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.462093,
            31.218212
        ],
        "address": "淮海中路888号",
        "name": "淮海中路沿线跨街户外LED_40",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.461058,
            31.217249
        ],
        "address": "淮海中路887号",
        "name": "淮海中路沿线跨街户外LED_41",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.460338,
            31.217014
        ],
        "address": "淮海中路911号",
        "name": "淮海中路沿线跨街户外LED_45",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.479996,
            31.225143
        ],
        "address": "淮海中路890号",
        "name": "淮海中路沿线跨街户外LED_43",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.459564,
            31.217713
        ],
        "address": "淮海中路900号",
        "name": "淮海中路沿线跨街户外LED_44",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.459144,
            31.217605
        ],
        "address": "淮海中路918号",
        "name": "百盛购物中心（淮海店）",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.459532,
            31.216399
        ],
        "address": "淮海中路939号",
        "name": "淮海中路沿线跨街户外LED_48",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.460233,
            31.217093
        ],
        "address": "淮海中路915号",
        "name": "淮海中路沿线跨街户外LED_47",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.479157,
            31.224613
        ],
        "address": "淮海中路93号",
        "name": "大上海时代广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.114812,
            31.147044
        ],
        "address": "环城东路68号",
        "name": "综星大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.114738,
            31.147205
        ],
        "address": "环城东路58号",
        "name": "南上海人才大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.254262,
            31.393619
        ],
        "address": "环城路200号",
        "name": "徐行大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.239767,
            31.386463
        ],
        "address": "环城路2222号",
        "name": "嘉乐园商务大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.247614,
            31.396286
        ],
        "address": "环城路762弄5号楼",
        "name": "信业未来中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.248011,
            31.014025
        ],
        "address": "环城路886弄",
        "name": "同济城市雅筑",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.439119,
            30.937615
        ],
        "address": "环城西路2511号1栋",
        "name": "菱光大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.439423,
            30.937758
        ],
        "address": "环城西路2511号2栋",
        "name": "上海现代服务业南桥科创园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.603101,
            31.1768
        ],
        "address": "环科路515号",
        "name": "绿地智创商务中心",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.902029,
            30.871147
        ],
        "address": "环湖西路588号",
        "name": "广昊世纪大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.524368,
            31.148196
        ],
        "address": "环林东路270弄",
        "name": "樱桃苑",
        "count": 128,
        "style": 0
    },
    {
        "lnglat": [
            121.614245,
            31.181818
        ],
        "address": "环科路999弄",
        "name": "浦东国际人才港",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.530225,
            31.140498
        ],
        "address": "环林东路875弄",
        "name": "杉林新月三期",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.529765,
            31.139706
        ],
        "address": "环林东路879弄",
        "name": "杉林新月一期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.526994,
            31.203284
        ],
        "address": "环龙路263弄",
        "name": "怡东花园",
        "count": 49,
        "style": 0
    },
    {
        "lnglat": [
            121.724786,
            31.229014
        ],
        "address": "环庆南路239",
        "name": "庆利苑",
        "count": 78,
        "style": 0
    },
    {
        "lnglat": [
            121.402149,
            31.309589
        ],
        "address": "环镇北路699弄",
        "name": "上大阳光乾泽园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.384091,
            31.173731
        ],
        "address": "环镇南路200弄",
        "name": "万源新城四期",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.390778,
            31.175937
        ],
        "address": "环镇南路88弄58号",
        "name": "苹果园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.39764,
            31.295145
        ],
        "address": "环镇南路858-888号",
        "name": "中环天地",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.470474,
            31.229291
        ],
        "address": "黄陂北路227号",
        "name": "中区广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.476811,
            31.214822
        ],
        "address": "黄陂南路688号",
        "name": "上海轻玻外贸大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.476765,
            31.214126
        ],
        "address": "黄陂南路700号",
        "name": "卓维700西区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.470984,
            31.233581
        ],
        "address": "黄河路21号",
        "name": "鸿祥大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.364539,
            31.180123
        ],
        "address": "黄桦路247号",
        "name": "俊领国际_黄桦路247号",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.469569,
            31.237707
        ],
        "address": "黄河路288号",
        "name": "福海公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.363663,
            31.183461
        ],
        "address": "黄桦路369弄",
        "name": "嘉富丽苑",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.482667,
            31.209182
        ],
        "address": "黄家撅路92号",
        "name": "海文商务楼黄家厥路",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.487408,
            31.215551
        ],
        "address": "黄家阙路65-69号",
        "name": "惠德大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.4974,
            31.215314
        ],
        "address": "黄家路18号",
        "name": "南门大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.487996,
            31.214931
        ],
        "address": "黄家阙路99号",
        "name": "惠德公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.777148,
            31.025745
        ],
        "address": "黄家路88弄",
        "name": "浩城华苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.408143,
            31.193809
        ],
        "address": "黄金城道258号",
        "name": "古北嘉年华庭",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.403317,
            31.195192
        ],
        "address": "黄金城道500弄",
        "name": "古北瑞仕花园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.403744,
            31.194351
        ],
        "address": "黄金城道555弄",
        "name": "华丽家族",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.399264,
            31.196218
        ],
        "address": "黄金城道688弄9号",
        "name": "御翠豪庭",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.397596,
            31.195397
        ],
        "address": "黄金城道777号",
        "name": "黄金豪园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.491652,
            31.244506
        ],
        "address": "黄浦路53号",
        "name": "海湾大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.470818,
            31.267983
        ],
        "address": "黄山路77 99 131号",
        "name": "黄山坊",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.532105,
            31.271804
        ],
        "address": "黄兴路156号",
        "name": "五星大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.452937,
            31.156816
        ],
        "address": "黄石路80弄",
        "name": "龙龙家园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.532659,
            31.270861
        ],
        "address": "黄兴路1599弄",
        "name": "新纪元国际广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.520281,
            31.28882
        ],
        "address": "黄兴路1675号",
        "name": "五角场科技大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.519329,
            31.290477
        ],
        "address": "黄兴路1725号",
        "name": "怡富商务广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.52102,
            31.29058
        ],
        "address": "黄兴路1778号1号楼",
        "name": "东方蓝海国际广场公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.5212,
            31.289979
        ],
        "address": "黄兴路1728号2号楼",
        "name": "东方蓝海国际广场写字楼",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.519943,
            31.292115
        ],
        "address": "黄兴路1818号",
        "name": "海上财智商务中心",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.532442,
            31.269523
        ],
        "address": "黄兴路1号",
        "name": "中通大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.518141,
            31.292564
        ],
        "address": "黄兴路1999弄",
        "name": "皇朝新城",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.517828,
            31.293762
        ],
        "address": "黄兴路2005弄2号",
        "name": "杨浦科技大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.517332,
            31.299766
        ],
        "address": "黄兴路2218号",
        "name": "合生国际中心",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.516181,
            31.297777
        ],
        "address": "黄兴路2077号",
        "name": "上海蓝天大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.498938,
            31.290429
        ],
        "address": "辉河路100号",
        "name": "复旦科技园_创业基地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.589422,
            31.241622
        ],
        "address": "黄杨路69弄",
        "name": "信和花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.492017,
            31.244936
        ],
        "address": "黄浦路99号",
        "name": "上海滩国际大厦",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.498563,
            31.290792
        ],
        "address": "辉河路118号",
        "name": "辉华大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.46232,
            30.967937
        ],
        "address": "汇丰北路1515弄",
        "name": "德国科创中心",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.417032,
            31.216922
        ],
        "address": "汇川路99弄",
        "name": "新时空国际商务广场",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.467229,
            30.955808
        ],
        "address": "汇丰西路1399号",
        "name": "汇丰名都",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.152998,
            31.162264
        ],
        "address": "汇金路590号",
        "name": "青浦宝龙广场",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.52222,
            31.030812
        ],
        "address": "汇秋路16弄",
        "name": "浦江瑞和城陆街区(南区)",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.518342,
            31.029607
        ],
        "address": "汇舒路54弄",
        "name": "浦江瑞和城柒街区",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.516224,
            31.021249
        ],
        "address": "汇延路59弄",
        "name": "瑞和城",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.516531,
            31.023916
        ],
        "address": "昭化路508号",
        "name": "新衡商务楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.200118,
            31.413584
        ],
        "address": "汇源路518弄",
        "name": "首创旭辉城",
        "count": 80,
        "style": 0
    },
    {
        "lnglat": [
            121.286944,
            31.185183
        ],
        "address": "会恒路200弄：会恒路666弄",
        "name": "中建锦绣名都",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.198446,
            31.410841
        ],
        "address": "汇源路778弄",
        "name": "首创旭辉城2期",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.472835,
            31.252476
        ],
        "address": "会文路50号",
        "name": "永会大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.527538,
            31.260999
        ],
        "address": "惠民路1018弄",
        "name": "尚发华苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.521263,
            31.258028
        ],
        "address": "惠民路694号",
        "name": "华申大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.769951,
            31.04038
        ],
        "address": "惠南镇城南路918弄",
        "name": "人生港湾南欧城",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.514091,
            31.256316
        ],
        "address": "霍山路340号",
        "name": "霍山大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.515873,
            31.257222
        ],
        "address": "霍山路398号",
        "name": "光大安石中心",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.590653,
            31.350325
        ],
        "address": "基隆路89号",
        "name": "振丰大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.52023,
            31.261419
        ],
        "address": "吉林路60号",
        "name": "三九商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.491955,
            31.305607
        ],
        "address": "吉浦路355号",
        "name": "财大公寓",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.489397,
            31.266614
        ],
        "address": "吉祥路38号",
        "name": "吉祥苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.49093,
            31.308715
        ],
        "address": "吉浦路395弄",
        "name": "吉浦路395弄小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.489247,
            31.298572
        ],
        "address": "纪念路289弄",
        "name": "三湘世纪花城",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.485902,
            31.297882
        ],
        "address": "纪念路335弄8号",
        "name": "凯阳新寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.485994,
            31.296745
        ],
        "address": "纪念路486弄",
        "name": "荣振大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.485378,
            31.296065
        ],
        "address": "纪念路488弄",
        "name": "荣振馨苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.43669,
            31.339262
        ],
        "address": "纪蕰路588号",
        "name": "智力产业园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.266592,
            31.216453
        ],
        "address": "纪潭路75弄1-19号",
        "name": "虹桥茗雅苑",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.589033,
            31.336715
        ],
        "address": "季景路259弄",
        "name": "永久城市花园",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.591061,
            31.33413
        ],
        "address": "季景路333弄",
        "name": "阳明花园二期",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.593547,
            31.332674
        ],
        "address": "季景路555弄",
        "name": "仁恒家园",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.605051,
            31.3133
        ],
        "address": "加枫路26号",
        "name": "科技楼",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.605622,
            31.312963
        ],
        "address": "加枫路28号",
        "name": "新康楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.604058,
            31.333149
        ],
        "address": "加太路29号2幢",
        "name": "兰宝大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.605498,
            31.333209
        ],
        "address": "加太路29号",
        "name": "柴火空间",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.612298,
            31.269104
        ],
        "address": "佳乐路77弄",
        "name": "阳光国际公寓",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.232527,
            31.368798
        ],
        "address": "嘉安公路200弄1-30号",
        "name": "绿洲丰怡园",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.535388,
            31.293711
        ],
        "address": "佳木斯路353号",
        "name": "白玉兰环保广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.429542,
            31.139253
        ],
        "address": "嘉川路225弄",
        "name": "嘉川公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.429362,
            31.138582
        ],
        "address": "嘉川路245号",
        "name": "华东理工科技园嘉川路园区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.262795,
            31.379302
        ],
        "address": "嘉罗公路336号",
        "name": "嘉定科创大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.275763,
            31.377086
        ],
        "address": "嘉戬公路301弄",
        "name": "保利梧桐语（上海）",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.459785,
            31.204538
        ],
        "address": "嘉善路508号",
        "name": "尚街LOFT",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.283339,
            31.303344
        ],
        "address": "嘉美路777号",
        "name": "瑞华文化科技创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.220472,
            31.286926
        ],
        "address": "嘉松北路6130弄176-183号、187-188、195-196号",
        "name": "上城名都南区",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.218917,
            31.220743
        ],
        "address": "嘉松中路2335号",
        "name": "帆洋大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.221946,
            31.208639
        ],
        "address": "嘉松中路3199弄228号",
        "name": "梁杭众创空间",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.222428,
            31.185263
        ],
        "address": "嘉松中路4528号",
        "name": "8090青年创业基地华新园",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.227963,
            31.134165
        ],
        "address": "嘉松中路6688弄",
        "name": "龙湖滟澜山二期",
        "count": 83,
        "style": 0
    },
    {
        "lnglat": [
            121.226222,
            31.152074
        ],
        "address": "嘉松中路5888号",
        "name": "熊猫广场",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.244171,
            31.39768
        ],
        "address": "嘉唐公路88弄",
        "name": "御江金都1期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.343687,
            31.266368
        ],
        "address": "嘉怡路279弄260~264号",
        "name": "#N/A",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.348417,
            31.26436
        ],
        "address": "嘉怡路296号",
        "name": "雯婕商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.335838,
            31.269387
        ],
        "address": "嘉涌路99号",
        "name": "MAX未来广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.335382,
            31.270316
        ],
        "address": "嘉涌路99弄",
        "name": "Max未来",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.468257,
            31.209944
        ],
        "address": "建德路1号",
        "name": "瑞建小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.458938,
            31.205068
        ],
        "address": "建国西路285号",
        "name": "科投大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.493706,
            30.959599
        ],
        "address": "嘉园路361弄",
        "name": "金水丽苑",
        "count": 104,
        "style": 0
    },
    {
        "lnglat": [
            121.462749,
            31.207264
        ],
        "address": "建国西路287弄",
        "name": "阳光四季公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.465388,
            31.206646
        ],
        "address": "建国西路91弄",
        "name": "瑞金花园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.465284,
            31.206585
        ],
        "address": "建国西路91弄5号",
        "name": "瑞金花园商务中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.483809,
            31.214975
        ],
        "address": "建国新路28弄",
        "name": "建新公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.482354,
            31.214388
        ],
        "address": "建国新路77弄",
        "name": "老西门公馆",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.481529,
            31.213838
        ],
        "address": "建国新路91号",
        "name": "南鼎建国大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.468739,
            31.209235
        ],
        "address": "建国中路115弄",
        "name": "思南公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.468739,
            31.209235
        ],
        "address": "建国中路115弄之1-4号",
        "name": "吉大公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.471686,
            31.210246
        ],
        "address": "建国中路1号",
        "name": "建国大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.471259,
            31.210219
        ],
        "address": "建国中路25号",
        "name": "8号桥建国园南区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.471328,
            31.21073
        ],
        "address": "建国中路8-10号",
        "name": "八号桥（8号桥建国园北区）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.4709,
            31.20974
        ],
        "address": "建国中路29号",
        "name": "国信商务大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.5723,
            31.094832
        ],
        "address": "建豪路91-99号",
        "name": "圣太科技园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.568758,
            31.097997
        ],
        "address": "建韵路399号",
        "name": "澄天伟业",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.443808,
            31.29853
        ],
        "address": "江场二路99号",
        "name": "莱赛现代生活港",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.458731,
            31.297575
        ],
        "address": "江场路1228弄",
        "name": "东贤大厦",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.459014,
            31.297876
        ],
        "address": "江场路1228弄6B",
        "name": "环亚科技大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.455519,
            31.299022
        ],
        "address": "江场路1313号",
        "name": "金谷中环大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.436028,
            31.295363
        ],
        "address": "江场三路258号",
        "name": "上海新市北工业园区一期",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.438056,
            31.296138
        ],
        "address": "江场三路305号",
        "name": "上海新市北工业园区二期",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.424016,
            31.296267
        ],
        "address": "江场西路1366弄",
        "name": "中星馨恒苑",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.446933,
            31.298651
        ],
        "address": "江场西路160号",
        "name": "美邦大楼",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.442259,
            31.296815
        ],
        "address": "江场西路299弄",
        "name": "中铁中环时代广场",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.44207,
            31.297162
        ],
        "address": "江场西路299弄1号楼",
        "name": "海棠大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.445732,
            31.298575
        ],
        "address": "江场西路180号",
        "name": "和典创意园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.447568,
            31.298618
        ],
        "address": "江场一路18号",
        "name": "华瑞大厦（上海）",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.447339,
            31.298835
        ],
        "address": "江场一路28号",
        "name": "电信发展公司大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.439072,
            31.297111
        ],
        "address": "江场西路395号",
        "name": "江场西路395号商务楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.37368,
            30.994091
        ],
        "address": "江川路1551号",
        "name": "美惠全商业广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.41703,
            31.002525
        ],
        "address": "江川路291弄20号",
        "name": "上企创业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.401419,
            31.001725
        ],
        "address": "江川路680弄",
        "name": "友好佳苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.492289,
            31.062839
        ],
        "address": "江汉路751弄",
        "name": "滨浦新苑9村",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.53956,
            31.046977
        ],
        "address": "江航路60弄",
        "name": "瑞和新苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.536113,
            31.051972
        ],
        "address": "江航路378弄",
        "name": "浦江丽都二期",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.539134,
            31.039784
        ],
        "address": "江航南路801弄-1-15号",
        "name": "瑞和华苑（上海）",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.494332,
            31.100938
        ],
        "address": "江桦路199弄、200弄、399弄、400弄、600弄，江柳路200弄、400弄",
        "name": "华侨城一二期（新浦江城一期）",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.517144,
            31.088148
        ],
        "address": "江凯路177号",
        "name": "鑫广科创园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.514317,
            31.087875
        ],
        "address": "江凯路199号1号楼",
        "name": "蕾特商务中心一期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.514238,
            31.087791
        ],
        "address": "江凯路199号2,3,4,6号楼",
        "name": "蕾特商务中心二期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.518466,
            31.089277
        ],
        "address": "江凯路98号",
        "name": "海宏科创园",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.444527,
            31.243043
        ],
        "address": "江宁路1078号",
        "name": "玉佛城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.443546,
            31.242919
        ],
        "address": "江宁路1145弄",
        "name": "圣天地公寓",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.444391,
            31.243799
        ],
        "address": "江宁路1158号",
        "name": "友力国际大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.443379,
            31.243632
        ],
        "address": "江宁路1165号",
        "name": "圣天地商务大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.442669,
            31.245206
        ],
        "address": "江宁路1220弄",
        "name": "音乐广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.441955,
            31.246461
        ],
        "address": "江宁路1306弄10、12号",
        "name": "燕兴大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.443111,
            31.245942
        ],
        "address": "江宁路1306弄17号",
        "name": "富丽花苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.439378,
            31.24748
        ],
        "address": "江宁路1415弄",
        "name": "世纪之门",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.442355,
            31.246054
        ],
        "address": "江宁路1306弄7号",
        "name": "富丽大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.440212,
            31.248312
        ],
        "address": "江宁路1600号",
        "name": "浅水湾1600",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.454945,
            31.23107
        ],
        "address": "江宁路188号",
        "name": "亚盛大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.454466,
            31.2306
        ],
        "address": "江宁路167号",
        "name": "新城大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.454794,
            31.231658
        ],
        "address": "江宁路212号",
        "name": "凯迪克大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.453309,
            31.233915
        ],
        "address": "江宁路356弄5号",
        "name": "静安紫苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.453802,
            31.234898
        ],
        "address": "江宁路420号",
        "name": "和一大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.45194,
            31.234593
        ],
        "address": "江宁路445号",
        "name": "时美大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.451564,
            31.235114
        ],
        "address": "江宁路495号",
        "name": "博鸿大厦",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.450227,
            31.236456
        ],
        "address": "江宁路599弄",
        "name": "静安新格公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450589,
            31.235965
        ],
        "address": "江宁路565、575号",
        "name": "康宁雅庭",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.449801,
            31.236739
        ],
        "address": "江宁路631号",
        "name": "新建大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.448256,
            31.240493
        ],
        "address": "江宁路826弄",
        "name": "天香公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.448025,
            31.238889
        ],
        "address": "江宁路777号",
        "name": "内外联公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.447707,
            31.240093
        ],
        "address": "江宁路838号",
        "name": "富容大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.521998,
            31.269387
        ],
        "address": "江浦路1178弄",
        "name": "阳明苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.519479,
            31.274098
        ],
        "address": "江浦路1508号",
        "name": "东方星座酒店公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.515549,
            31.281673
        ],
        "address": "江浦路2089弄",
        "name": "恒联新天地",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.51951,
            31.274067
        ],
        "address": "江浦路1500号",
        "name": "智慧树（智慧树创意产业园）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.524975,
            31.260278
        ],
        "address": "江浦路627号",
        "name": "E朋汇",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.527627,
            31.261363
        ],
        "address": "江浦路666弄",
        "name": "星慧佳苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.523649,
            31.263287
        ],
        "address": "江浦路821弄",
        "name": "平盛苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.759101,
            30.874404
        ],
        "address": "江山路6899弄",
        "name": "保利玲玥公馆",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.426709,
            31.225095
        ],
        "address": "江苏北路30号",
        "name": "荣兆园区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.424365,
            31.226996
        ],
        "address": "江苏北路125号",
        "name": "华联创意广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42584,
            31.225702
        ],
        "address": "江苏北路100号",
        "name": "银鑫大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.42636,
            31.224798
        ],
        "address": "江苏北路89号",
        "name": "新亚药业大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.431592,
            31.218984
        ],
        "address": "江苏路369号",
        "name": "兆丰世贸大厦",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.43089,
            31.217603
        ],
        "address": "江苏路470号",
        "name": "香樟公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.434497,
            31.211732
        ],
        "address": "江苏路813号",
        "name": "华山花园上海",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.431833,
            31.216205
        ],
        "address": "江苏路502弄",
        "name": "公信绿地大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.270395,
            31.029314
        ],
        "address": "江田东路185号",
        "name": "智汇科创园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.433721,
            31.211507
        ],
        "address": "江苏路876号",
        "name": "贵冠商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.535874,
            31.062823
        ],
        "address": "江玮路450弄",
        "name": "闵浦新苑五村",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.542858,
            31.061636
        ],
        "address": "江文路125弄",
        "name": "浦江宝邸三期",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.533044,
            31.061197
        ],
        "address": "江文路688弄",
        "name": "闵浦新苑四村",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.535669,
            31.054791
        ],
        "address": "江协路51弄",
        "name": "金硕河畔景园西区",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.48715,
            31.234518
        ],
        "address": "江西中路181号",
        "name": "工投大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.21459,
            31.03292
        ],
        "address": "江学路558弄",
        "name": "湖畔天地",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.466782,
            31.321316
        ],
        "address": "江杨南路880号",
        "name": "新杨湾科创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.520763,
            31.084963
        ],
        "address": "江月路1059号",
        "name": "旭和环保产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.51712,
            31.085935
        ],
        "address": "江月路1188号",
        "name": "寰泰商务园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.420368,
            31.263972
        ],
        "address": "交暨路207弄5号",
        "name": "齐成创业园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.435356,
            31.257762
        ],
        "address": "交通路2107弄",
        "name": "工汇花苑_上海",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.389775,
            31.26765
        ],
        "address": "交通路4703弄",
        "name": "李子园商务区",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.390687,
            31.268278
        ],
        "address": "交通路4711号",
        "name": "李子园大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.448341,
            31.256209
        ],
        "address": "交通西路108弄、188弄",
        "name": "平江盛世家园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.447044,
            31.255899
        ],
        "address": "交通西路129弄",
        "name": "智荟苑",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.594223,
            31.25422
        ],
        "address": "胶东路266弄",
        "name": "金燕家苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.43438,
            31.239375
        ],
        "address": "胶州路1077弄",
        "name": "宝华雅苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.432807,
            31.240735
        ],
        "address": "胶州路1118弄1-19号",
        "name": "绿洲城市花园一期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.448821,
            31.254805
        ],
        "address": "交通西路48弄",
        "name": "嘉华苑（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.431713,
            31.241315
        ],
        "address": "胶州路1216弄",
        "name": "绿洲城市花园三期",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.432378,
            31.240276
        ],
        "address": "胶州路1155弄1-19号",
        "name": "绿洲城市花园2期",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.441902,
            31.230218
        ],
        "address": "胶州路397号",
        "name": "阳光科技广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.442495,
            31.229822
        ],
        "address": "胶州路343号",
        "name": "诺安1919",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.445209,
            31.225507
        ],
        "address": "胶州路58号",
        "name": "胶州大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.439708,
            31.234802
        ],
        "address": "胶州路699号",
        "name": "恒森广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.436544,
            31.23754
        ],
        "address": "胶州路941号",
        "name": "长久商务楼",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.436055,
            31.237443
        ],
        "address": "胶州路959弄1号",
        "name": "长久大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.597003,
            31.25049
        ],
        "address": "金藏路51号",
        "name": "森晟世洋国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.508358,
            30.971468
        ],
        "address": "金碧路1980弄",
        "name": "金碧汇虹苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.390583,
            31.258346
        ],
        "address": "金鼎路298弄",
        "name": "上海家园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.429054,
            31.091382
        ],
        "address": "金都路1128号",
        "name": "屹创中心(梅陇)创意园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.43126,
            31.08853
        ],
        "address": "金都路1165弄150号",
        "name": "慧峰创意园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.428933,
            31.090054
        ],
        "address": "金都路1199号",
        "name": "越界1199",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.440943,
            31.093598
        ],
        "address": "金都路618号",
        "name": "大量科创园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.350467,
            31.066282
        ],
        "address": "金都西路688号",
        "name": "上海喜乐嘉工业园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.347361,
            31.063517
        ],
        "address": "金都西路833号",
        "name": "松港商务园_金都西路",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.344844,
            31.063556
        ],
        "address": "金都西路999号",
        "name": "上海乐港电器园区",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.610817,
            31.256451
        ],
        "address": "金港路211号",
        "name": "中新传媒大厦",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.610496,
            31.257298
        ],
        "address": "金港路199弄",
        "name": "禹洲蓝爵",
        "count": 55,
        "style": 0
    },
    {
        "lnglat": [
            121.612031,
            31.255299
        ],
        "address": "金港路299号",
        "name": "禹洲广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.612705,
            31.254796
        ],
        "address": "金港路333号",
        "name": "禹洲国际大厦(一期)",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.614277,
            31.252013
        ],
        "address": "金港路501号",
        "name": "北大资源科技园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.605142,
            31.262123
        ],
        "address": "金高路2216弄",
        "name": "金桥谷创意园区",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.605644,
            31.260298
        ],
        "address": "金高路2330号",
        "name": "金桥盛汇商业广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.587554,
            31.256139
        ],
        "address": "金工路133弄",
        "name": "金桥新家园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.60549,
            31.259402
        ],
        "address": "金高路2366号",
        "name": "金海商业广场",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.496585,
            30.90094
        ],
        "address": "金海公路3199号",
        "name": "上海杨王高新技术产业园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.491346,
            30.935506
        ],
        "address": "金海公路4808号",
        "name": "万景峰一期",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.482016,
            30.950949
        ],
        "address": "金海公路6055号（临港南桥科技城）",
        "name": "漕河泾开发区南桥园区（临港南桥园区）",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.512723,
            30.849689
        ],
        "address": "金海公路99号",
        "name": "上海佳源梦想广场",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.621105,
            31.263139
        ],
        "address": "金海路1286弄",
        "name": "金海苑(上海)",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.621105,
            31.263139
        ],
        "address": "金海路1809号",
        "name": "佳农广场",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.376064,
            31.178084
        ],
        "address": "金汇路460弄",
        "name": "韵动时代（金汇丽舍）",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.653604,
            31.266584
        ],
        "address": "金海路2505号",
        "name": "曹路宝龙城市广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.374353,
            31.17844
        ],
        "address": "金汇路465-1临",
        "name": "星发大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.379286,
            31.17137
        ],
        "address": "金汇南路60弄",
        "name": "锦绣江南一期",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.374491,
            31.183531
        ],
        "address": "金汇路588弄",
        "name": "金汇华光城",
        "count": 97,
        "style": 0
    },
    {
        "lnglat": [
            121.376778,
            31.17209
        ],
        "address": "金汇南路91弄",
        "name": "锦绣江南家园二期",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.630926,
            31.265575
        ],
        "address": "金吉路778号",
        "name": "中国浦发囯机园区",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.60167,
            31.206748
        ],
        "address": "金科路2889弄",
        "name": "长泰广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.599228,
            31.20516
        ],
        "address": "金科路2966号",
        "name": "创智空间_张江信息园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.216002,
            31.417078
        ],
        "address": "金兰路333号",
        "name": "全通上海金融谷",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.482381,
            31.228301
        ],
        "address": "金陵东路368号",
        "name": "金陵商厦（兴业证券）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.47343,
            31.224466
        ],
        "address": "金陵西路28号",
        "name": "金陵大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.480847,
            31.226849
        ],
        "address": "金陵东路569号",
        "name": "汇通大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.600947,
            31.177545
        ],
        "address": "金科路4560号",
        "name": "金创大厦(金科路)",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.314094,
            31.119776
        ],
        "address": "金马路159号",
        "name": "春乐投资商务园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.313833,
            31.118676
        ],
        "address": "金马路59号",
        "name": "松港商务园_金马路",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.408106,
            31.013029
        ],
        "address": "金平路328弄",
        "name": "丽都城假日景苑",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.62009,
            31.253819
        ],
        "address": "金桥经济技术开发区宁桥路825号",
        "name": "9号楼公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.598916,
            31.251536
        ],
        "address": "金桥经济技术开发区浙桥路99号",
        "name": "悦樘公寓(碧云店)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.584925,
            31.255782
        ],
        "address": "金桥路1221弄",
        "name": "融都金桥园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.587659,
            31.253858
        ],
        "address": "金桥路1389号",
        "name": "上海金桥大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.587806,
            31.252176
        ],
        "address": "金桥路1398号",
        "name": "金台大厦(上海)",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.580143,
            31.257754
        ],
        "address": "金桥路939号",
        "name": "宏南投资大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.577686,
            31.259211
        ],
        "address": "金桥路989弄",
        "name": "今达花园",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.391569,
            31.231904
        ],
        "address": "金沙江路1060号",
        "name": "申汉商务小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.387345,
            31.233615
        ],
        "address": "金沙江路1340弄",
        "name": "新曹杨工业园区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.387096,
            31.232984
        ],
        "address": "金沙江路1340弄172支弄A区",
        "name": "上海新曹杨高新技术工业园区一街坊（A区）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.386626,
            31.234282
        ],
        "address": "金沙江路1340弄57号",
        "name": "上海新曹杨高新技术工业园区一街坊三期(D区)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.382265,
            31.232942
        ],
        "address": "金沙江路1518弄",
        "name": "近铁城市广场",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.379659,
            31.23486
        ],
        "address": "金沙江路1698弄",
        "name": "绿洲湖畔花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.379688,
            31.234619
        ],
        "address": "金沙江路1688弄",
        "name": "绿洲商业中心",
        "count": 146,
        "style": 0
    },
    {
        "lnglat": [
            121.372353,
            31.234712
        ],
        "address": "金沙江路1989号",
        "name": "金沙商务广场",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.373252,
            31.233684
        ],
        "address": "金沙江路1959号",
        "name": "金环商务花园",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.36486,
            31.235657
        ],
        "address": "金沙江路2299弄",
        "name": "金沙雅苑未来街区ABC区",
        "count": 85,
        "style": 0
    },
    {
        "lnglat": [
            121.366934,
            31.239787
        ],
        "address": "金沙江路2348弄",
        "name": "金沙雅苑一期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.359579,
            31.241935
        ],
        "address": "金沙江路2890弄",
        "name": "金沙丽晶苑二期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.407273,
            31.231157
        ],
        "address": "金沙江路65弄",
        "name": "金沙江小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.398755,
            31.232494
        ],
        "address": "金沙江路788号",
        "name": "788PLAZA",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.367683,
            31.236704
        ],
        "address": "金沙江路2145弄",
        "name": "普罗娜商务广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.323918,
            31.23987
        ],
        "address": "金沙江西路1051号",
        "name": "孩子王(上海江桥万达店)",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.382911,
            31.249977
        ],
        "address": "金汤路155弄",
        "name": "时代星园",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.628707,
            31.257035
        ],
        "address": "金苏路200号",
        "name": "金桥万创中心",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.635823,
            31.266299
        ],
        "address": "金穗路1501号",
        "name": "金穗园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.61973,
            31.255466
        ],
        "address": "金皖路389号",
        "name": "金门广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.333553,
            31.291394
        ],
        "address": "金通路1118号",
        "name": "同进理想城",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.255886,
            31.381133
        ],
        "address": "金沙路75、77号",
        "name": "泰宸汇金商务楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.621325,
            31.25441
        ],
        "address": "金皖路501号",
        "name": "金皖路501号园区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.61244,
            31.255838
        ],
        "address": "金湘路201弄15号",
        "name": "禹洲燕海国际大厦(三期)",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.612421,
            31.255438
        ],
        "address": "金湘路268号",
        "name": "中新传媒广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.610503,
            31.254557
        ],
        "address": "金湘路333号",
        "name": "爱立诚大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.610237,
            31.254079
        ],
        "address": "金湘路345号",
        "name": "同华大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.609403,
            31.253554
        ],
        "address": "金湘路399弄",
        "name": "中惠广场",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.599238,
            31.252611
        ],
        "address": "金新路58号",
        "name": "银桥大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.308331,
            31.243179
        ],
        "address": "金耀路333弄",
        "name": "中房公寓",
        "count": 90,
        "style": 0
    },
    {
        "lnglat": [
            121.309379,
            31.248545
        ],
        "address": "金耀路555弄",
        "name": "金沙鼎苑",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.613729,
            31.25581
        ],
        "address": "金豫路50弄",
        "name": "禹洲国际大厦（二期）",
        "count": 55,
        "style": 0
    },
    {
        "lnglat": [
            121.306814,
            31.260087
        ],
        "address": "金园五路208号",
        "name": "梁杭文化创意园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.30764,
            31.257987
        ],
        "address": "金园五路366号",
        "name": "梁杭科创商务园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.366467,
            31.220792
        ],
        "address": "金钟路340弄之1-85号",
        "name": "新泾六村",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.359518,
            31.220042
        ],
        "address": "金钟路633号",
        "name": "晨讯科技大楼",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.359072,
            31.222344
        ],
        "address": "金钟路658弄",
        "name": "东华大学国家大学科技园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.314858,
            31.248851
        ],
        "address": "金园一路1118弄",
        "name": "双佳翠庭",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.316487,
            31.242254
        ],
        "address": "金园一路1359弄",
        "name": "缘圆宝邸",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.355472,
            31.220196
        ],
        "address": "金钟路767号5号楼",
        "name": "魔方公寓金钟路店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.352131,
            31.219567
        ],
        "address": "金钟路999号D栋",
        "name": "虹桥国际科技广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.544871,
            31.201601
        ],
        "address": "锦安东路289弄",
        "name": "东城家园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.539809,
            31.198395
        ],
        "address": "锦安东路567弄",
        "name": "锦绣一方名苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.540261,
            31.204001
        ],
        "address": "锦安东路88弄",
        "name": "锦绣满堂花园",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.537248,
            31.20461
        ],
        "address": "锦和路289弄",
        "name": "锦绣天第",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.408111,
            31.111196
        ],
        "address": "锦梅路1500弄",
        "name": "锦梅馨苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.375192,
            31.316667
        ],
        "address": "锦秋路1588弄",
        "name": "丰宝苑",
        "count": 74,
        "style": 0
    },
    {
        "lnglat": [
            121.60654,
            31.23945
        ],
        "address": "锦绣东路1999号",
        "name": "麦腾智慧天地",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.277251,
            31.039338
        ],
        "address": "锦昔路626号",
        "name": "佳才天地",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.508083,
            31.273961
        ],
        "address": "锦西路185号",
        "name": "爱联大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.622967,
            31.242559
        ],
        "address": "锦绣东路2777弄",
        "name": "锦绣申江（金桥华虹创新园）",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.535774,
            31.192452
        ],
        "address": "锦绣路2580弄",
        "name": "浦东星河湾",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.564418,
            31.225961
        ],
        "address": "锦绣路300弄",
        "name": "浦东虹桥花园",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.53905,
            31.181208
        ],
        "address": "锦绣路3088弄",
        "name": "大华锦绣华城12街区",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.547173,
            31.166437
        ],
        "address": "锦绣路3891号",
        "name": "中环锦绣商务",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.564929,
            31.222535
        ],
        "address": "锦绣路333号",
        "name": "金樽花园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.548009,
            31.150462
        ],
        "address": "锦绣路4899弄55号",
        "name": "天成科创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.556822,
            31.222357
        ],
        "address": "锦绣路666弄",
        "name": "华丽家族花园",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.554922,
            31.222375
        ],
        "address": "锦绣路800弄",
        "name": "天安花园",
        "count": 78,
        "style": 0
    },
    {
        "lnglat": [
            121.542055,
            31.215924
        ],
        "address": "锦延路329号",
        "name": "锦绣坊",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.536939,
            31.266085
        ],
        "address": "锦州湾路27弄",
        "name": "和瑞雅苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.428249,
            31.281252
        ],
        "address": "晋城路663弄",
        "name": "阳城世家",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.468911,
            31.24349
        ],
        "address": "晋元路228弄",
        "name": "华祺苑",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.462678,
            31.248845
        ],
        "address": "京江路299号",
        "name": "宝丰大厦南楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.552483,
            31.220898
        ],
        "address": "锦绣路888弄",
        "name": "御景园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.51414,
            31.26072
        ],
        "address": "荆州路334弄108号",
        "name": "荣广商务中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.436333,
            31.258807
        ],
        "address": "泾惠路91弄",
        "name": "洛川公寓_上海",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.251721,
            31.182029
        ],
        "address": "泾茉路118弄",
        "name": "招商虹桥公馆",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.39988,
            31.013214
        ],
        "address": "景谷路176弄1号",
        "name": "景谷大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.44891,
            31.100293
        ],
        "address": "景联路257号",
        "name": "绿亮科创园(景联路)",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.542992,
            31.292563
        ],
        "address": "靖宇东路55弄",
        "name": "靖宇家园",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.44328,
            31.099305
        ],
        "address": "景联路439号",
        "name": "上海电子物联产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.525474,
            31.282785
        ],
        "address": "靖宇南路99弄",
        "name": "九州花苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.524427,
            31.282951
        ],
        "address": "靖宇南路118弄",
        "name": "金宇名邸",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.324759,
            31.256242
        ],
        "address": "靖远路1288弄",
        "name": "嘉旺苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.310333,
            31.142466
        ],
        "address": "九杜路349号",
        "name": "立同商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.309536,
            31.143518
        ],
        "address": "九杜路477号",
        "name": "九杜生活广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.306944,
            31.142609
        ],
        "address": "九杜路505弄",
        "name": "摩卡小城",
        "count": 53,
        "style": 0
    },
    {
        "lnglat": [
            121.448155,
            30.925249
        ],
        "address": "九华路908弄",
        "name": "悦丰新苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.483206,
            31.235733
        ],
        "address": "九江路333号",
        "name": "金融广场（上海）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.298256,
            31.136274
        ],
        "address": "九泾路262号",
        "name": "恒瑞中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.293464,
            31.139312
        ],
        "address": "九泾路655号",
        "name": "上海嘉南红塔商务广场",
        "count": 61,
        "style": 0
    },
    {
        "lnglat": [
            121.291633,
            31.139997
        ],
        "address": "九泾路701号",
        "name": "新雅创业园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.491091,
            31.253496
        ],
        "address": "九龙路575号",
        "name": "新亚小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.289893,
            31.143004
        ],
        "address": "九泾路898号",
        "name": "898国际商务中心",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.319434,
            31.126016
        ],
        "address": "九亭大街851弄",
        "name": "富顿苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.323119,
            31.134256
        ],
        "address": "九亭镇伴亭路488号",
        "name": "磊鑫大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.315558,
            31.135235
        ],
        "address": "九新公路10弄",
        "name": "亭园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.317475,
            31.103867
        ],
        "address": "九新公路338号",
        "name": "佳钢智慧园_九新公路",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.317238,
            31.134781
        ],
        "address": "九新公路33弄1～6号",
        "name": "青春驿站",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.316641,
            31.132435
        ],
        "address": "长宁路888弄9号",
        "name": "兆丰嘉园二期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.31721,
            31.13285
        ],
        "address": "九新公路76号",
        "name": "嘉和阳光大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.314433,
            31.11853
        ],
        "address": "九新公路800号",
        "name": "临港电姆产业园",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.316929,
            31.132114
        ],
        "address": "九新公路90弄3号",
        "name": "九新商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.316721,
            31.095582
        ],
        "address": "九新公路877号",
        "name": "临港卓越科技园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.316538,
            31.120395
        ],
        "address": "久富路225号",
        "name": "玖福大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.112074,
            31.182026
        ],
        "address": "久业路89号",
        "name": "松港智造工坊",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.480368,
            31.207771
        ],
        "address": "局门路153号",
        "name": "千羽创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.562825,
            31.257626
        ],
        "address": "居家桥路199弄",
        "name": "昕泰苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.479768,
            31.208966
        ],
        "address": "局门路1号（徐家汇路）",
        "name": "中汇公寓上海",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.481806,
            31.205093
        ],
        "address": "局门路295弄",
        "name": "江南世纪新苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.482339,
            31.203111
        ],
        "address": "局门路427号",
        "name": "智造局二期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.4834,
            31.200648
        ],
        "address": "局门路599弄",
        "name": "东怡花园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.482965,
            31.199845
        ],
        "address": "局门路620号",
        "name": "重矿大厦(局门路)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.371865,
            31.360649
        ],
        "address": "菊泉街1280弄",
        "name": "馨佳园十二街坊",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.375592,
            31.352756
        ],
        "address": "菊泉街158弄",
        "name": "中怡雅苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.372984,
            31.362676
        ],
        "address": "菊泉街1281弄1-15号",
        "name": "馨佳园十三街坊",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.371205,
            31.356429
        ],
        "address": "菊盛路468弄",
        "name": "宝翔苑",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.6092,
            31.279811
        ],
        "address": "巨峰路1058号",
        "name": "乐坊（晨达广场）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.609123,
            31.279721
        ],
        "address": "巨峰路1058弄",
        "name": "新紫茂国际城",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.466373,
            31.222686
        ],
        "address": "巨鹿路137号",
        "name": "鑫兴大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.457635,
            31.22206
        ],
        "address": "巨鹿路417号",
        "name": "欣广大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.4657,
            31.222762
        ],
        "address": "巨鹿路149号",
        "name": "紫勋雍邸",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.542612,
            31.244437
        ],
        "address": "巨野路22号",
        "name": "陆家嘴滨江公馆（申城公寓）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.544845,
            31.244167
        ],
        "address": "巨野路61弄",
        "name": "旭辉雅苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.419393,
            30.904547
        ],
        "address": "钜庭路99弄",
        "name": "香溢雅园",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.544932,
            31.314174
        ],
        "address": "军工路1599号",
        "name": "上海环保科技园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.455306,
            31.182174
        ],
        "address": "凯滨路183号",
        "name": "保利西岸中心A栋、B栋",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.66969,
            31.235586
        ],
        "address": "卡园二路58号",
        "name": "银信创智园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.417433,
            31.208047
        ],
        "address": "凯旋路1010号A栋",
        "name": "上汽凯旋坊",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.418745,
            31.203765
        ],
        "address": "凯旋路1205号",
        "name": "东风商务园区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.419078,
            31.203797
        ],
        "address": "凯旋路1222弄1-5号",
        "name": "凯旋都市花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.419896,
            31.20014
        ],
        "address": "凯旋路1415号",
        "name": "凯旋商务大厦（中心）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.432708,
            31.181681
        ],
        "address": "凯旋路3131号",
        "name": "明申中心大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.421924,
            31.194924
        ],
        "address": "凯旋路1669号",
        "name": "天星城",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.431549,
            31.183655
        ],
        "address": "凯旋路3188弄",
        "name": "凯旋豪庭",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.4337,
            31.181867
        ],
        "address": "凯旋路3500弄",
        "name": "华苑大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.597608,
            31.122457
        ],
        "address": "康达路508弄",
        "name": "昱龙家园",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.437531,
            31.230307
        ],
        "address": "康定路1033号5A",
        "name": "同济佳苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.436604,
            31.231237
        ],
        "address": "康定路1038弄",
        "name": "静安艺阁",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.416127,
            31.215371
        ],
        "address": "凯旋路369号",
        "name": "龙之梦雅仕大厦",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.430198,
            31.229218
        ],
        "address": "康定路1588弄",
        "name": "三鑫花苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.432257,
            31.230404
        ],
        "address": "康定路1268弄",
        "name": "静鼎安邦府邸",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.449941,
            31.235091
        ],
        "address": "康定路358号",
        "name": "越界陕康里",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.430198,
            31.229218
        ],
        "address": "康定路1588弄(1590弄)",
        "name": "三鑫花园(三鑫花苑商务中心)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.546449,
            31.116329
        ],
        "address": "康涵路58弄",
        "name": "世茂云图",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.551981,
            31.147138
        ],
        "address": "康花路499号",
        "name": "中天科技商务园(东园)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.433545,
            31.165383
        ],
        "address": "康健路2号",
        "name": "徐汇南天中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.433193,
            31.306381
        ],
        "address": "康宁路1021弄",
        "name": "幸福创智园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.628295,
            31.155225
        ],
        "address": "康桥东路1088号",
        "name": "松港1088创意园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.60958,
            31.153292
        ],
        "address": "康桥东路518号",
        "name": "绿太阳园区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.633433,
            31.160098
        ],
        "address": "康桥东路1159弄105号",
        "name": "松港产业园_康桥东路",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.563694,
            31.14786
        ],
        "address": "康桥路1001弄",
        "name": "阳光城愉景公馆",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.565105,
            31.148704
        ],
        "address": "康桥路1029弄",
        "name": "建华铂中环",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.58623,
            31.150897
        ],
        "address": "康桥路1789号",
        "name": "丰动力康桥中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.55902,
            31.156062
        ],
        "address": "康杉路108弄3号",
        "name": "沃众创业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.549371,
            31.146152
        ],
        "address": "康桥路787号",
        "name": "中天科技商务园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.561527,
            31.151713
        ],
        "address": "康杉路359弄",
        "name": "颐盛云锦苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.571659,
            31.139081
        ],
        "address": "康沈公路3001弄",
        "name": "桃园新城汇枫公寓",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.58174,
            31.105389
        ],
        "address": "康沈路2039号",
        "name": "荻达公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.573977,
            31.132688
        ],
        "address": "康沈路726弄",
        "name": "周康五村",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.572595,
            31.136101
        ],
        "address": "康沈路686弄",
        "name": "中邦城市园",
        "count": 145,
        "style": 0
    },
    {
        "lnglat": [
            121.628884,
            31.083213
        ],
        "address": "康新公路2333号",
        "name": "天慈生物医药生产基地（天慈国际产业园）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.564691,
            31.146628
        ],
        "address": "康士路1弄",
        "name": "瑞景商务公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.419495,
            31.334203
        ],
        "address": "康文路330弄",
        "name": "共康雅苑三期",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.340437,
            31.330625
        ],
        "address": "科福路368号",
        "name": "华强科技园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.622945,
            31.167814
        ],
        "address": "科农路99弄",
        "name": "张江国际人才公寓一期（张江纳仕国际社区）",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.336822,
            31.341947
        ],
        "address": "科福路825号",
        "name": "梁杭产业园(嘉定)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.588328,
            31.210512
        ],
        "address": "科苑路99号",
        "name": "魔方公寓张江店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.543788,
            31.287661
        ],
        "address": "控江路128弄",
        "name": "韵都城（上海）",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.521386,
            31.276702
        ],
        "address": "控江路1500弄",
        "name": "新凤城",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.515436,
            31.27459
        ],
        "address": "控江路1688号",
        "name": "卫百辛大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.514196,
            31.273473
        ],
        "address": "控江路1777号",
        "name": "君欣时代广场",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.508266,
            31.271403
        ],
        "address": "控江路2063号",
        "name": "五环大厦西座",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.507619,
            31.270861
        ],
        "address": "控江路2075号",
        "name": "贵人大厦（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.507312,
            31.271472
        ],
        "address": "控江路2200号",
        "name": "和平花苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.514862,
            31.274466
        ],
        "address": "控江路1690号",
        "name": "凤凰大厦(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.542485,
            31.286665
        ],
        "address": "控江路568弄",
        "name": "大众苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.539065,
            31.282995
        ],
        "address": "控江路669弄",
        "name": "公园首府(上海)",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.531948,
            31.281107
        ],
        "address": "控江路980弄",
        "name": "杨浦公寓",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.531874,
            31.281154
        ],
        "address": "控江路980弄5号楼",
        "name": "杨浦公寓商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.469103,
            31.299834
        ],
        "address": "奎照路790弄",
        "name": "奎照路790弄",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.466968,
            31.299998
        ],
        "address": "奎照路890号",
        "name": "奎江公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.148055,
            31.019469
        ],
        "address": "昆港公路1088号",
        "name": "光塑科技园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.512347,
            31.260002
        ],
        "address": "昆明路518号A座",
        "name": "北美广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.514288,
            31.261825
        ],
        "address": "昆明路640号",
        "name": "岚亭园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.515456,
            31.26355
        ],
        "address": "昆明路739号",
        "name": "文通大厦",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.584608,
            31.309453
        ],
        "address": "莱阳路2328弄",
        "name": "高弘家苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.584225,
            31.311701
        ],
        "address": "莱阳路2450弄",
        "name": "高海家苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.577451,
            31.337363
        ],
        "address": "莱阳路4279弄",
        "name": "高桥新城紫薇和苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.30478,
            31.148329
        ],
        "address": "涞坊路1033弄1-145",
        "name": "馨亭家苑",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.30572,
            31.149732
        ],
        "address": "涞坊路1000号",
        "name": "新虹桥企业天地",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.307736,
            31.149798
        ],
        "address": "涞坊路699弄",
        "name": "汇贤阁",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.324657,
            31.150357
        ],
        "address": "涞寅路106弄",
        "name": "上海奥林匹克花园北区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.304161,
            31.141915
        ],
        "address": "涞寅路1200弄",
        "name": "上海源花城",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.302734,
            31.142946
        ],
        "address": "涞寅路1200弄2号",
        "name": "上海源花城物业楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.313458,
            31.145141
        ],
        "address": "涞寅路658弄",
        "name": "绿庭尚城",
        "count": 96,
        "style": 0
    },
    {
        "lnglat": [
            121.659806,
            30.908203
        ],
        "address": "兰博路1455弄",
        "name": "新城花屿湾",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.663671,
            30.911694
        ],
        "address": "兰博路1189弄",
        "name": "绿地风清苑",
        "count": 81,
        "style": 0
    },
    {
        "lnglat": [
            121.420251,
            31.009304
        ],
        "address": "兰坪路301弄22支弄",
        "name": "鹤庆高层小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.592588,
            31.295614
        ],
        "address": "兰谷路2133号",
        "name": "仁恒森兰运动中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.594527,
            31.31745
        ],
        "address": "兰嵩路555号",
        "name": "森兰美伦公寓楼",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.413291,
            31.239475
        ],
        "address": "兰溪路10弄",
        "name": "曹杨君悦苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.404623,
            31.239417
        ],
        "address": "兰溪路145号",
        "name": "安天大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.408106,
            31.237396
        ],
        "address": "兰溪路180号",
        "name": "安居兰庭",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.402692,
            31.243148
        ],
        "address": "兰溪路182号",
        "name": "安居兰庭商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.402812,
            31.256168
        ],
        "address": "兰溪路900弄",
        "name": "天汇广场一期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.523026,
            31.27144
        ],
        "address": "兰州路1333弄",
        "name": "信通浦皓园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.530701,
            31.260726
        ],
        "address": "兰州路667弄",
        "name": "圣骊名苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.423696,
            31.247948
        ],
        "address": "岚皋西路61弄10支弄",
        "name": "实地公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.532476,
            31.212434
        ],
        "address": "蓝村路31弄",
        "name": "新都花园（上海）",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.53167,
            31.214192
        ],
        "address": "蓝村路55弄",
        "name": "仕嘉名苑（上海）",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.635132,
            31.09813
        ],
        "address": "蓝靛路1488号",
        "name": "阳光城丽景湾",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.293289,
            31.150069
        ],
        "address": "朗亭路288弄",
        "name": "朗庭上郡苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.64169,
            31.098314
        ],
        "address": "蓝靛路1688弄",
        "name": "保利艾庐",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.525192,
            31.220707
        ],
        "address": "崂山路689号",
        "name": "潍坊综合楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.437447,
            31.130156
        ],
        "address": "老沪闵路1068弄",
        "name": "绿洲庭苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.401461,
            31.070596
        ],
        "address": "老沪闵路3105号",
        "name": "东苑米蓝城",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.435931,
            31.112903
        ],
        "address": "老沪闵路1482号",
        "name": "瑞星商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.428984,
            31.145062
        ],
        "address": "老沪闵路666弄",
        "name": "幽澜苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.42903,
            31.145257
        ],
        "address": "老沪闵路668号",
        "name": "幽澜苑办公楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.4291,
            31.144811
        ],
        "address": "老沪闵路680弄",
        "name": "协合紫薇园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.434486,
            31.133433
        ],
        "address": "老沪闵路875弄1、2号",
        "name": "松枫花园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.867854,
            30.976401
        ],
        "address": "老芦公路857号895号",
        "name": "禹洲城市广场西区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.867772,
            30.97879
        ],
        "address": "老芦公路868号",
        "name": "金港世纪广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.193528,
            31.011608
        ],
        "address": "乐都西路1455弄",
        "name": "华亭新家银杏苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.189535,
            31.014746
        ],
        "address": "乐都西路1558弄",
        "name": "万科金色华亭",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.203777,
            31.012672
        ],
        "address": "乐都西路959弄",
        "name": "乐都新界",
        "count": 49,
        "style": 0
    },
    {
        "lnglat": [
            121.187351,
            31.014758
        ],
        "address": "乐都西路1636弄",
        "name": "荣乐雅筑",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.431207,
            31.195241
        ],
        "address": "乐山路71号",
        "name": "独乐山公寓楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432365,
            31.195764
        ],
        "address": "乐山路33号",
        "name": "交大慧谷创业园三部",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.241532,
            31.181523
        ],
        "address": "乐天路318弄",
        "name": "海棠馨苑北区",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.610314,
            31.276893
        ],
        "address": "乐园路198号",
        "name": "FSPACE金桥中心",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.445018,
            31.258224
        ],
        "address": "骊山路34弄12号",
        "name": "华经大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.240103,
            31.179888
        ],
        "address": "乐高路200弄1-13号",
        "name": "徐泾北城馨浦苑东区",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.367401,
            31.128729
        ],
        "address": "黎安路688号",
        "name": "强劲大厦",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.515115,
            31.090288
        ],
        "address": "立跃路2795号",
        "name": "上海由谷产业园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.559561,
            31.106088
        ],
        "address": "立跃路519号",
        "name": "乐乎城市青年社区周浦店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.482664,
            31.208259
        ],
        "address": "丽园路448号",
        "name": "高城苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.490195,
            31.228313
        ],
        "address": "丽水路58号",
        "name": "城隍珠宝",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.483538,
            31.209896
        ],
        "address": "丽园路333弄",
        "name": "黄浦新苑（上海）",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.481366,
            31.208014
        ],
        "address": "丽园路501号",
        "name": "丽园路501号二期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.474898,
            31.204976
        ],
        "address": "丽园路501弄",
        "name": "soho丽园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.479389,
            31.206922
        ],
        "address": "丽园路700号",
        "name": "经纬天地园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.475147,
            31.206207
        ],
        "address": "丽园路888弄",
        "name": "东都公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.489856,
            31.210974
        ],
        "address": "丽园路8号",
        "name": "丽南公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.488925,
            31.210204
        ],
        "address": "丽园路68弄",
        "name": "海洲丽园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.586999,
            31.275309
        ],
        "address": "利津路555弄",
        "name": "璞真园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.592683,
            31.281026
        ],
        "address": "利津路1313弄",
        "name": "证大家园五期",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.488493,
            31.262434
        ],
        "address": "溧阳路1155号",
        "name": "溧阳公馆",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.489044,
            31.255215
        ],
        "address": "溧阳路735号",
        "name": "半岛湾时尚文化创意产业园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.398265,
            31.151237
        ],
        "address": "莲花路1058弄1-3号",
        "name": "东苑怡景园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.317774,
            31.117191
        ],
        "address": "连富路155号",
        "name": "久仰科创园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.39274,
            31.160304
        ],
        "address": "莲花路1559号",
        "name": "旺琦商业广场(勇卫商务大厦)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.488875,
            31.260928
        ],
        "address": "溧阳路1088号",
        "name": "龙邸大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.390131,
            31.170061
        ],
        "address": "莲花路1733号",
        "name": "华纳商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.392489,
            31.171864
        ],
        "address": "莲花路2080弄50号",
        "name": "金茂园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.397598,
            31.146959
        ],
        "address": "莲花路755弄",
        "name": "万源城E1",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.411836,
            31.100559
        ],
        "address": "莲花南路1388号8号楼",
        "name": "北建华清商业广场商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.411089,
            31.107577
        ],
        "address": "莲花南路1111弄",
        "name": "春申景城一期(春申景城湖滨晨韵)",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.412752,
            31.096971
        ],
        "address": "莲花南路1500弄",
        "name": "麦多生活广场",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.406116,
            31.131464
        ],
        "address": "莲花南路155弄",
        "name": "世纪苑",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.427782,
            31.070496
        ],
        "address": "莲花南路2338号",
        "name": "沫谷城市空间",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.42558,
            31.072906
        ],
        "address": "莲花南路2228号",
        "name": "开幕啦城市更新园区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.4335,
            31.063218
        ],
        "address": "莲花南路2899号",
        "name": "莲谷新兴科技产业园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.445039,
            31.038801
        ],
        "address": "莲花南路3999弄",
        "name": "万乐城小区",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.422318,
            31.125218
        ],
        "address": "莲花南路588弄",
        "name": "未名园",
        "count": 83,
        "style": 0
    },
    {
        "lnglat": [
            121.436087,
            31.361163
        ],
        "address": "莲花山路817弄",
        "name": "康桥水都第一街区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.43735,
            31.361724
        ],
        "address": "莲花山路700弄",
        "name": "康桥水都第二街区",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.565915,
            31.173237
        ],
        "address": "莲溪路1099弄",
        "name": "鹏裕苑",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.567856,
            31.16797
        ],
        "address": "莲振路269号",
        "name": "贤诺国际青年社区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.524657,
            31.080237
        ],
        "address": "联航路1188号",
        "name": "浦江智谷商务园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.52138,
            31.07753
        ],
        "address": "联航路1369号",
        "name": "浦江人才公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.518007,
            31.076407
        ],
        "address": "联航路1505弄",
        "name": "复地浦江商务中心",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.518456,
            31.077922
        ],
        "address": "联航路1588号",
        "name": "坤大科技楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.521098,
            31.076219
        ],
        "address": "联航路1399弄",
        "name": "浦江智汇园",
        "count": 79,
        "style": 0
    },
    {
        "lnglat": [
            121.505292,
            31.071932
        ],
        "address": "联航路2015弄1-43",
        "name": "世博家园十四街坊",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.51656,
            31.077003
        ],
        "address": "联航路1588号1幢",
        "name": "产业大楼",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.249912,
            31.268025
        ],
        "address": "联民路100弄",
        "name": "正荣府",
        "count": 92,
        "style": 0
    },
    {
        "lnglat": [
            121.346849,
            31.144102
        ],
        "address": "联明路389号",
        "name": "麦可将文创园区",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.398014,
            31.061689
        ],
        "address": "联农路179号",
        "name": "福克斯连锁商务大厦（联农）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.278963,
            31.158455
        ],
        "address": "联民路88弄",
        "name": "上海捷克住宅小区",
        "count": 106,
        "style": 0
    },
    {
        "lnglat": [
            121.429517,
            31.345995
        ],
        "address": "联泰路63弄",
        "name": "共富经济园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.428943,
            31.346069
        ],
        "address": "联泰路56号",
        "name": "鑫鑫花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.354368,
            31.345231
        ],
        "address": "联杨路1078弄",
        "name": "保利叶上海",
        "count": 172,
        "style": 0
    },
    {
        "lnglat": [
            121.24679,
            31.364701
        ],
        "address": "良舍路199号",
        "name": "右岸嘉园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.468874,
            31.282268
        ],
        "address": "凉城路139弄",
        "name": "锦秀文华",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.4724,
            31.302362
        ],
        "address": "凉城路1188弄",
        "name": "一品新筑苑",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.471793,
            31.309919
        ],
        "address": "凉城路2289号",
        "name": "泽元文化广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.468599,
            31.28409
        ],
        "address": "凉城路215弄",
        "name": "中虹新都苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.469543,
            31.285839
        ],
        "address": "凉城路357弄",
        "name": "中虹花园(丽都苑)",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.470052,
            31.280825
        ],
        "address": "凉城路68弄",
        "name": "凉城路68弄",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.491221,
            31.25516
        ],
        "address": "辽宁路244号",
        "name": "1930鑫鑫创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.606136,
            31.199775
        ],
        "address": "亮秀路180弄",
        "name": "汇智湖畔家园",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.514508,
            31.262929
        ],
        "address": "辽阳路508弄",
        "name": "文通雅苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.509853,
            31.129501
        ],
        "address": "林德路718弄",
        "name": "东方康德家园二期",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.493542,
            31.139607
        ],
        "address": "林悦路125弄",
        "name": "源浦秀苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.461575,
            31.310674
        ],
        "address": "临汾路299弄",
        "name": "恒安小区",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.457964,
            31.311957
        ],
        "address": "临汾路380弄之1-9号",
        "name": "星城花苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.353613,
            31.232225
        ],
        "address": "临虹路128弄6号",
        "name": "红蜻蜓品牌中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.351363,
            31.229781
        ],
        "address": "临虹路289弄1号楼",
        "name": "虹桥金座1号楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.465821,
            31.312109
        ],
        "address": "临汾路80弄",
        "name": "临汾名城三期",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.493328,
            31.262529
        ],
        "address": "临平北路2号",
        "name": "金殿苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.492263,
            31.262671
        ],
        "address": "临平北路60弄",
        "name": "银欣花苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.491496,
            31.263481
        ],
        "address": "临平北路68号",
        "name": "虹临大厦（虹临宝都）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.49155,
            31.26382
        ],
        "address": "临平北路88号",
        "name": "虹诚大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.495951,
            31.26335
        ],
        "address": "临平路333号",
        "name": "瑞虹新城一期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.499332,
            31.260961
        ],
        "address": "临平路133弄",
        "name": "瑞虹新城二期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.537647,
            31.268355
        ],
        "address": "临青路555号",
        "name": "银河经典苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.3346,
            31.26727
        ],
        "address": "临洮路1000弄",
        "name": "宁兴上尚湾",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.328457,
            31.257933
        ],
        "address": "临夏路800弄",
        "name": "汇丰沁苑北区",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.512906,
            31.254386
        ],
        "address": "临潼路188号",
        "name": "临潼188金融创新中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.516903,
            31.20586
        ],
        "address": "临沂北路150弄",
        "name": "东南华庭",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.518233,
            31.204285
        ],
        "address": "临沂北路210弄",
        "name": "盛族家园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.513768,
            31.195327
        ],
        "address": "临沂路115弄1-3号",
        "name": "上海汇景阁",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.513617,
            31.195629
        ],
        "address": "临沂路128号",
        "name": "惠盛大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.518412,
            31.198335
        ],
        "address": "临沂路61弄",
        "name": "龙阳花苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.51659,
            31.200728
        ],
        "address": "临沂路8弄",
        "name": "光鸿苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.548394,
            31.230818
        ],
        "address": "灵山路708弄",
        "name": "申立苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.24104,
            31.344091
        ],
        "address": "临泽路88弄/89弄/188弄/189弄，崇信路1518弄，云屏路1399弄，白银路1563，,165号",
        "name": "新城金郡（上海）",
        "count": 87,
        "style": 0
    },
    {
        "lnglat": [
            121.547408,
            31.231225
        ],
        "address": "灵山路717弄",
        "name": "中星景园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.552808,
            31.23134
        ],
        "address": "灵山路866弄",
        "name": "新城海上名园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.55317,
            31.232625
        ],
        "address": "灵山路898号",
        "name": "融汇898创意园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.426794,
            31.271533
        ],
        "address": "灵石路1188号",
        "name": "华仁商务大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.421809,
            31.265723
        ],
        "address": "灵石路1669弄",
        "name": "东旺雍景苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.445773,
            31.282805
        ],
        "address": "灵石路658号",
        "name": "大宁财智中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.445591,
            31.282122
        ],
        "address": "灵石路666弄",
        "name": "大宁八一坊",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.449643,
            31.284196
        ],
        "address": "灵石路695号",
        "name": "合金工厂商务园",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.446905,
            31.283437
        ],
        "address": "灵石路697-3号",
        "name": "巨丰国际商务广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.431483,
            31.276116
        ],
        "address": "灵石路697号",
        "name": "健康智谷",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.433374,
            31.279
        ],
        "address": "灵石路885号",
        "name": "新普荟商业广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.441195,
            31.283354
        ],
        "address": "灵石路721号",
        "name": "乐平方园区8号楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.440284,
            31.2824
        ],
        "address": "灵石路712号",
        "name": "大宁人才公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.443252,
            31.284044
        ],
        "address": "灵石路709号60幢",
        "name": "万灵谷花园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.496746,
            31.157042
        ],
        "address": "灵岩南路295号",
        "name": "三林世博创意园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.498708,
            31.14964
        ],
        "address": "灵岩南路769弄",
        "name": "源城锦苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.49893,
            31.147771
        ],
        "address": "灵岩南路801弄",
        "name": "凌云公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.596924,
            31.275545
        ],
        "address": "凌河路200弄",
        "name": "浦沁苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.603031,
            31.273889
        ],
        "address": "凌河路777弄",
        "name": "金桥一方雅苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.918161,
            30.919538
        ],
        "address": "铃兰路508弄",
        "name": "保利铃兰公馆",
        "count": 97,
        "style": 0
    },
    {
        "lnglat": [
            121.419792,
            31.138092
        ],
        "address": "凌云路梅陇四村95号",
        "name": "梅陇四村凌云公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.465201,
            31.196383
        ],
        "address": "零陵北路9弄",
        "name": "日晖新城",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.459507,
            31.192685
        ],
        "address": "零陵路231号",
        "name": "天迈商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.466644,
            31.196419
        ],
        "address": "零陵路29弄",
        "name": "丝庐花语",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.456928,
            31.191323
        ],
        "address": "零陵路342号",
        "name": "汇成民聚商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.447739,
            31.188637
        ],
        "address": "零陵路583号",
        "name": "海洋石油大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.447425,
            31.188244
        ],
        "address": "零陵路585号",
        "name": "爱邦大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.446855,
            31.188223
        ],
        "address": "零陵路629号",
        "name": "爱和大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.44647,
            31.188
        ],
        "address": "零陵路631号",
        "name": "爱乐大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.446193,
            31.188543
        ],
        "address": "零陵路635号",
        "name": "爱博大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.440982,
            31.186362
        ],
        "address": "零陵路777弄68号",
        "name": "鑫国家园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.455162,
            31.32112
        ],
        "address": "岭南路1115号",
        "name": "中铁商务楼 ",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.43748,
            31.183167
        ],
        "address": "零陵路899号",
        "name": "飞洲国际广场",
        "count": 73,
        "style": 0
    },
    {
        "lnglat": [
            121.583102,
            31.264176
        ],
        "address": "柳埠路196弄",
        "name": "新沪东公寓",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.247255,
            31.397987
        ],
        "address": "柳湖路299弄",
        "name": "御江金都2期",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.480213,
            31.223562
        ],
        "address": "柳林路150号",
        "name": "建发柳林大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.4566,
            31.324587
        ],
        "address": "岭南路1288弄",
        "name": "岭南雅苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.499017,
            31.213052
        ],
        "address": "柳市路1弄",
        "name": "长峰馨园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.456664,
            31.322445
        ],
        "address": "岭南路1118弄",
        "name": "珺乐苑(上海)",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.46685,
            31.271963
        ],
        "address": "柳营路127号",
        "name": "明光公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.460884,
            31.266159
        ],
        "address": "柳营路515弄",
        "name": "鑫安公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.458278,
            31.266611
        ],
        "address": "柳营路635弄",
        "name": "惠龙公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.455632,
            31.265403
        ],
        "address": "柳营路669弄",
        "name": "盛源家豪城",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.457521,
            31.263665
        ],
        "address": "柳营路650弄",
        "name": "心族公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.455813,
            31.262785
        ],
        "address": "柳营路768弄",
        "name": "上海枫景苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.426636,
            31.159223
        ],
        "address": "柳州路128弄",
        "name": "康馨家园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.427993,
            31.159284
        ],
        "address": "柳州路181弄",
        "name": "海上名门",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.425791,
            31.166922
        ],
        "address": "柳州路399号甲",
        "name": "恒地仓国际大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.424846,
            31.169619
        ],
        "address": "柳州路431号",
        "name": "锦和越界尚勤园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.424667,
            31.169958
        ],
        "address": "柳州路523弄",
        "name": "平成阁公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.420112,
            31.178145
        ],
        "address": "柳州路600弄",
        "name": "金丽广场(上海)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.421023,
            31.186548
        ],
        "address": "柳州路980弄",
        "name": "中瑞公寓",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.474907,
            31.236561
        ],
        "address": "六合路98号",
        "name": "港陆黄浦中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.436634,
            31.168426
        ],
        "address": "龙漕路38弄",
        "name": "龙漕家园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.436859,
            31.16923
        ],
        "address": "龙漕路51弄1号",
        "name": "金海大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.436296,
            31.168741
        ],
        "address": "龙漕路51弄3号",
        "name": "澳龙公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.420869,
            31.185963
        ],
        "address": "柳州路928号",
        "name": "上海百丽国际广场",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.437472,
            31.169224
        ],
        "address": "龙漕路51弄4号",
        "name": "现代商务中心",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.436214,
            31.169229
        ],
        "address": "龙漕路一弄一号",
        "name": "龙漕大楼(上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.63527,
            31.223725
        ],
        "address": "龙东大道3000号",
        "name": "弘源科创大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.637792,
            31.223808
        ],
        "address": "龙东大道3000号11号楼",
        "name": "凯龙科技大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.476086,
            31.194566
        ],
        "address": "龙华东路647号",
        "name": "电科滨江中心",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.473239,
            31.19263
        ],
        "address": "龙华东路810号",
        "name": "黄浦绿地缤纷城",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.471277,
            31.193068
        ],
        "address": "龙华东路888弄",
        "name": "南园大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.47329,
            31.19283
        ],
        "address": "龙华东路868号",
        "name": "绿地海外滩中心",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.45381,
            31.178131
        ],
        "address": "龙华路2518弄",
        "name": "盛大花园",
        "count": 65,
        "style": 0
    },
    {
        "lnglat": [
            121.446918,
            31.168208
        ],
        "address": "龙华路3208弄",
        "name": "龙兆苑",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.444286,
            31.175782
        ],
        "address": "龙华西路398弄",
        "name": "强生花苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.442717,
            31.176234
        ],
        "address": "龙华西路525号",
        "name": "明安馨苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.44203,
            31.176558
        ],
        "address": "龙华西路535弄",
        "name": "明佳苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.45879,
            31.186263
        ],
        "address": "龙华中路596号",
        "name": "绿地滨江国际中心",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.440631,
            31.176378
        ],
        "address": "龙华西路591弄",
        "name": "宜仕怡家",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.530704,
            31.25783
        ],
        "address": "龙江路317弄",
        "name": "圣骊河滨苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.529362,
            31.25629
        ],
        "address": "龙江路370弄",
        "name": "丹江商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.52983,
            31.257156
        ],
        "address": "龙江路289弄",
        "name": "浦江风景苑",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.44147,
            31.177058
        ],
        "address": "龙华西路585号",
        "name": "上海华富大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.532145,
            31.257285
        ],
        "address": "龙江路388弄",
        "name": "圣骊河滨苑二期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.55779,
            31.25589
        ],
        "address": "龙居路2弄",
        "name": "龙居苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.532053,
            31.266758
        ],
        "address": "龙口路29弄7号",
        "name": "魔方公寓宁国路店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.456515,
            31.165879
        ],
        "address": "龙兰路277号(云锦路龙兰路路口)",
        "name": "东航滨江中心",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.297692,
            31.197254
        ],
        "address": "龙联路58弄",
        "name": "玉兰清苑",
        "count": 73,
        "style": 0
    },
    {
        "lnglat": [
            121.297387,
            31.196208
        ],
        "address": "龙联路59弄",
        "name": "城投玉兰清苑二期",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.227117,
            31.057085
        ],
        "address": "龙马路433号",
        "name": "合景天悦",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.382442,
            31.151846
        ],
        "address": "龙茗路1597弄",
        "name": "东兰世茗雅苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.382001,
            31.150675
        ],
        "address": "龙茗路1699弄",
        "name": "东兰雅苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.380094,
            31.165182
        ],
        "address": "龙茗路2822弄18-35号",
        "name": "九歌茗园",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.453829,
            31.135485
        ],
        "address": "龙吴路1500号",
        "name": "交大海科大厦A楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.449534,
            31.144671
        ],
        "address": "龙吴路1137弄17.18号",
        "name": "百龙小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.45344,
            31.1357
        ],
        "address": "龙吴路1500号B幢",
        "name": "上海交大科技园海科园区B楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.44793,
            31.172932
        ],
        "address": "龙水北路998弄",
        "name": "龙缘公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.453673,
            31.153051
        ],
        "address": "龙水南路336号",
        "name": "龙南佳苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.456015,
            31.09253
        ],
        "address": "龙吴路3389号",
        "name": "滨江商务生活广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.451753,
            31.158679
        ],
        "address": "龙吴路410弄87号",
        "name": "纺运商务中心大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.445961,
            31.166119
        ],
        "address": "龙吴路288弄",
        "name": "徐汇御景苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.449028,
            31.157678
        ],
        "address": "龙吴路515号",
        "name": "鑫龙苑（上海）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.452247,
            31.107773
        ],
        "address": "龙吴路2715号",
        "name": "上海聚科生物园区_龙吴路",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.444267,
            31.171424
        ],
        "address": "龙吴路51号",
        "name": "智慧线创意产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.318905,
            30.745233
        ],
        "address": "龙轩路1998弄15号",
        "name": "正荣御首府",
        "count": 74,
        "style": 0
    },
    {
        "lnglat": [
            121.448037,
            31.153807
        ],
        "address": "龙吴路777号",
        "name": "L777新媒体产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.44859,
            31.156778
        ],
        "address": "龙吴路555号",
        "name": "绿邑翠苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.553608,
            31.201216
        ],
        "address": "龙阳路1880弄",
        "name": "万邦都市花园",
        "count": 61,
        "style": 0
    },
    {
        "lnglat": [
            121.5564,
            31.202848
        ],
        "address": "龙阳路1990号",
        "name": "龙阳商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.548738,
            31.269498
        ],
        "address": "隆昌路210号",
        "name": "博海商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.542878,
            31.275673
        ],
        "address": "隆昌路590-612号",
        "name": "复旦软件园裙房",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.56737,
            31.20465
        ],
        "address": "龙阳路2277弄",
        "name": "永达国际大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.543567,
            31.275601
        ],
        "address": "隆昌路588号",
        "name": "复旦软件园（杨浦）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.403635,
            31.210201
        ],
        "address": "娄山关路555号",
        "name": "长房国际广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.402435,
            31.204096
        ],
        "address": "娄山关路83号",
        "name": "新虹桥中心大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.403451,
            31.217147
        ],
        "address": "娄山关路999弄",
        "name": "上海春天花园",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.402285,
            31.205323
        ],
        "address": "娄山关路８５号",
        "name": "东方国际大厦A座",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.854955,
            30.866802
        ],
        "address": "芦安路268弄",
        "name": "保利玲珑公馆",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.475051,
            31.204689
        ],
        "address": "鲁班路209号",
        "name": "兴城商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.389465,
            31.234282
        ],
        "address": "泸定路180号",
        "name": "嘉庭国际广场商场（东渡国际企业中心）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.475642,
            31.204237
        ],
        "address": "鲁班路277号",
        "name": "银杏家园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.47458,
            31.201544
        ],
        "address": "鲁班路388弄",
        "name": "海悦花园",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.477812,
            31.201558
        ],
        "address": "鲁班路509弄",
        "name": "卢湾都市花园",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.475642,
            31.204237
        ],
        "address": "鲁班路277号299号",
        "name": "银杏家园2",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.476255,
            31.198873
        ],
        "address": "鲁班路558号",
        "name": "经纬国际大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.476277,
            31.197871
        ],
        "address": "鲁班路600号",
        "name": "江南造船大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.478601,
            31.197163
        ],
        "address": "鲁班路721弄",
        "name": "鲁班大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.47226,
            31.20777
        ],
        "address": "鲁班路88号",
        "name": "大同花园三期",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.475281,
            31.259081
        ],
        "address": "陆丰路9号",
        "name": "宝通大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.489071,
            31.212564
        ],
        "address": "陆家浜路1011号",
        "name": "新世纪大厦酒店式公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.488442,
            31.211628
        ],
        "address": "陆家浜路1060弄",
        "name": "东方苑大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.487186,
            31.212462
        ],
        "address": "陆家浜路1141号",
        "name": "六角大楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.485311,
            31.21197
        ],
        "address": "陆家浜路1235弄",
        "name": "雅庐苑(上海)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.483789,
            31.211184
        ],
        "address": "陆家浜路1332号",
        "name": "南开大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.48316,
            31.211111
        ],
        "address": "陆家浜路1378号",
        "name": "万事利大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.500771,
            31.211777
        ],
        "address": "陆家浜路305弄",
        "name": "上海阳光里",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.497884,
            31.211476
        ],
        "address": "陆家浜路285弄",
        "name": "三角大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.499695,
            31.212392
        ],
        "address": "陆家浜路413弄",
        "name": "金南新苑（群英荟）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.49917,
            31.211046
        ],
        "address": "陆家浜路428号",
        "name": "中福轻纺面料商城",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.497991,
            31.210971
        ],
        "address": "陆家浜路456号",
        "name": "赛元大酒店",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.497942,
            31.211171
        ],
        "address": "陆家浜路468弄28号",
        "name": "百汇公寓（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.497774,
            31.212924
        ],
        "address": "陆家浜路521弄",
        "name": "阳光翠竹苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.495574,
            31.212161
        ],
        "address": "陆家浜路688弄",
        "name": "金日世家",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.490129,
            31.211869
        ],
        "address": "陆家浜路976号",
        "name": "富南大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.297017,
            31.087404
        ],
        "address": "陆家圈路168弄（陆家圈路269弄）",
        "name": "中海悦庭（中海悦府）",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.504164,
            31.240987
        ],
        "address": "陆家嘴环路1233号",
        "name": "汇亚大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.500321,
            31.235349
        ],
        "address": "陆家嘴环路166号",
        "name": "未来资产大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.508954,
            31.237631
        ],
        "address": "陆家嘴东路161号",
        "name": "招商局大厦（上海）",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.508125,
            31.239183
        ],
        "address": "陆家嘴环路958号",
        "name": "华能联合大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.499114,
            31.236751
        ],
        "address": "陆家嘴西路168号",
        "name": "正大广场",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.362005,
            31.358728
        ],
        "address": "陆翔路1018号",
        "name": "龙湖北城天街铂金岛",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.3714,
            31.345158
        ],
        "address": "陆翔路111号",
        "name": "宝山正大乐城",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.337594,
            31.40051
        ],
        "address": "陆翔路3489弄",
        "name": "佳翔苑",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.354636,
            31.401989
        ],
        "address": "罗芬路1288号",
        "name": "远洋美兰公寓",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.354481,
            31.401286
        ],
        "address": "罗芬路888号",
        "name": "美兰湖国际会议中心",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.341807,
            31.381543
        ],
        "address": "罗和路118弄",
        "name": "美罗家园慧苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.481364,
            31.252342
        ],
        "address": "罗浮路89弄",
        "name": "金芙世纪公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.334179,
            31.393218
        ],
        "address": "罗和路935弄",
        "name": "金丰苑二区",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.334507,
            31.391252
        ],
        "address": "罗和路855弄",
        "name": "金丰苑三区",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.400485,
            31.121596
        ],
        "address": "罗锦路",
        "name": "游悉谷",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.421671,
            31.12429
        ],
        "address": "罗锦路42号",
        "name": "西岸蓝海企业天地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.42073,
            31.12538
        ],
        "address": "罗锦路55号",
        "name": "锦宏产业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.341492,
            31.389654
        ],
        "address": "罗南路368号",
        "name": "美罗家园雅苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.338117,
            31.463034
        ],
        "address": "罗宁路1846号",
        "name": "联东U谷宝山国际企业港",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.166812,
            30.883272
        ],
        "address": "罗星南路115号",
        "name": "万祥金邸",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.415478,
            31.129428
        ],
        "address": "罗秀路1399号；罗秀路1459弄；上中西路855弄",
        "name": "中梅苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.411781,
            31.127661
        ],
        "address": "罗秀路1555弄1-23号",
        "name": "罗秀苑南区",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.4033,
            31.127079
        ],
        "address": "罗秀路1955弄",
        "name": "嘉和花苑",
        "count": 115,
        "style": 0
    },
    {
        "lnglat": [
            121.439874,
            31.131655
        ],
        "address": "罗秀路200弄",
        "name": "长桥八村",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.43492,
            31.13129
        ],
        "address": "罗秀路717弄",
        "name": "舒乐公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.451168,
            31.134277
        ],
        "address": "罗秀路55弄",
        "name": "华馨公寓(上海)",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.461893,
            31.270036
        ],
        "address": "洛川东路360号",
        "name": "东方公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.342143,
            31.395709
        ],
        "address": "罗真路188弄1-21号",
        "name": "罗兰佳苑东区",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.458651,
            31.268072
        ],
        "address": "洛川东路494号",
        "name": "洛川大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.448423,
            31.26279
        ],
        "address": "洛川中路1158号",
        "name": "上海名仕街",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.452331,
            31.265368
        ],
        "address": "洛川中路840号",
        "name": "E构空间",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.452773,
            31.266662
        ],
        "address": "洛川中路777弄",
        "name": "悠和家园",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.49447,
            31.250186
        ],
        "address": "旅顺路199弄",
        "name": "白金府邸",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.023203,
            31.121049
        ],
        "address": "绿湖路888弄",
        "name": "海上湾华庭闻涧",
        "count": 111,
        "style": 0
    },
    {
        "lnglat": [
            121.216705,
            31.381804
        ],
        "address": "绿菊路300弄",
        "name": "福莱馨苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.413366,
            31.094805
        ],
        "address": "绿莲路99弄、绿莲路100弄",
        "name": "银河新都",
        "count": 149,
        "style": 0
    },
    {
        "lnglat": [
            121.475816,
            31.210562
        ],
        "address": "马当路588弄",
        "name": "淡水湾花园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.587855,
            31.348119
        ],
        "address": "马吉路2号",
        "name": "高帆大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.403235,
            31.192576
        ],
        "address": "玛瑙路58弄",
        "name": "玛瑙苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.3852,
            31.210813
        ],
        "address": "茅台路830弄（威宁路）",
        "name": "天申综合小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.383132,
            31.211097
        ],
        "address": "茅台路868号",
        "name": "光华大厦（上海）",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.51432,
            31.20967
        ],
        "address": "茂兴路88号",
        "name": "仁恒广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.462977,
            31.213618
        ],
        "address": "茂名南路205号",
        "name": "瑞金大厦（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.534705,
            31.261577
        ],
        "address": "眉州路381号",
        "name": "华谊星城大厦",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.533761,
            31.263235
        ],
        "address": "眉州路513弄",
        "name": "浦江天第苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.530215,
            31.268333
        ],
        "address": "眉州路888弄",
        "name": "凯阳公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.529695,
            31.270564
        ],
        "address": "眉州路988弄",
        "name": "东田公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.384355,
            31.241017
        ],
        "address": "梅川路1247号",
        "name": "新长征商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.384322,
            31.241696
        ],
        "address": "梅川路1209号",
        "name": "加速器金融园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.376067,
            31.242454
        ],
        "address": "梅川路1333弄",
        "name": "祥和名邸",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.379077,
            31.245027
        ],
        "address": "梅川路145号",
        "name": "西部秀苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.39801,
            31.238047
        ],
        "address": "梅川路255弄",
        "name": "怒江苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.39039,
            31.241451
        ],
        "address": "梅川路888弄",
        "name": "海上名庭（三期）",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.418382,
            31.108625
        ],
        "address": "梅富路228号",
        "name": "春申创意园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.53835,
            31.209786
        ],
        "address": "梅花路50弄",
        "name": "香梅花园一期",
        "count": 79,
        "style": 0
    },
    {
        "lnglat": [
            121.554315,
            31.21039
        ],
        "address": "梅花路777弄",
        "name": "建华新苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.410287,
            31.236723
        ],
        "address": "梅岭南路380弄",
        "name": "常高公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.438366,
            31.362769
        ],
        "address": "梅林路97弄",
        "name": "康桥水都第四街区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.424347,
            31.133657
        ],
        "address": "梅陇十村17～21号",
        "name": "徐汇锦梅苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.408311,
            31.135183
        ],
        "address": "梅陇西路413号",
        "name": "莲花商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.460188,
            31.242032
        ],
        "address": "梅园路77号",
        "name": "人才大厦(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.342725,
            31.387022
        ],
        "address": "美安路628弄",
        "name": "美罗家园宝欣苑九村",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.362322,
            31.393918
        ],
        "address": "美艾路198弄",
        "name": "美兰湖颐景园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.416554,
            31.136984
        ],
        "address": "梅陇路565弄",
        "name": "森陇家园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.337253,
            31.395366
        ],
        "address": "美丹路1058弄",
        "name": "佳欣苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.337576,
            31.39211
        ],
        "address": "美丹路1033弄",
        "name": "佳境苑（上海）",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.351869,
            31.403509
        ],
        "address": "美丹路188弄",
        "name": "信达郡庭",
        "count": 53,
        "style": 0
    },
    {
        "lnglat": [
            121.356136,
            31.405487
        ],
        "address": "美丹路222号",
        "name": "上置美兰优湖",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.354919,
            31.405118
        ],
        "address": "美丹路8号",
        "name": "美兰湖花园（办公楼）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.340146,
            31.395423
        ],
        "address": "美丹路998弄1-27号",
        "name": "罗兰佳苑西区",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.332644,
            31.395907
        ],
        "address": "美康路818弄",
        "name": "金丰苑一区",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.349966,
            31.401949
        ],
        "address": "美兰湖地铁站2号口",
        "name": "中集金地美兰城",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.335883,
            31.387947
        ],
        "address": "美平路1060弄1-15号",
        "name": "美罗家园宝欣苑三村",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.342913,
            31.389633
        ],
        "address": "美平路500弄1-14号",
        "name": "美罗家园绣苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.338936,
            31.388671
        ],
        "address": "美平路696弄",
        "name": "美罗家园宝欣苑一村",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.340236,
            31.387195
        ],
        "address": "美平路745弄12号",
        "name": "美罗家园宝欣苑二村",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.336447,
            31.387068
        ],
        "address": "美平路999弄1-16号",
        "name": "美罗家园宝欣苑四村",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.604484,
            31.338933
        ],
        "address": "美盛路255号",
        "name": "众原企业天地",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.595952,
            31.334953
        ],
        "address": "美盛路27号",
        "name": "烨博大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.627973,
            31.300761
        ],
        "address": "美约路166号",
        "name": "美约路166号园区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.478178,
            31.206352
        ],
        "address": "蒙自路169号",
        "name": "智造局一期",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.478425,
            31.20582
        ],
        "address": "蒙自路207号",
        "name": "宏慧盟智园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.630956,
            31.300503
        ],
        "address": "美约路222号",
        "name": "生物医药园_上海",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.478471,
            31.204717
        ],
        "address": "蒙自路255号",
        "name": "华电公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.482107,
            31.197597
        ],
        "address": "蒙自路757号",
        "name": "平安滨江金融中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.482521,
            31.196766
        ],
        "address": "蒙自路763号",
        "name": "丰盛创建大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.480185,
            31.201216
        ],
        "address": "蒙自路501弄",
        "name": "德福苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.21494,
            31.130592
        ],
        "address": "米筛浜路699弄",
        "name": "佘北家园松和苑",
        "count": 92,
        "style": 0
    },
    {
        "lnglat": [
            121.548322,
            31.243248
        ],
        "address": "苗圃路218弄",
        "name": "维多利华庭",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.548478,
            31.240934
        ],
        "address": "苗圃路303弄",
        "name": "心中家园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.550179,
            31.239007
        ],
        "address": "苗圃路400弄",
        "name": "弘扬沁园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.697346,
            31.176238
        ],
        "address": "妙川路300弄",
        "name": "凯佳公寓",
        "count": 84,
        "style": 0
    },
    {
        "lnglat": [
            121.703455,
            31.177782
        ],
        "address": "妙川路800弄",
        "name": "阳光城愉景湾",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.37835,
            31.115658
        ],
        "address": "庙泾路58号",
        "name": "莘庄经济城",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.379064,
            31.116253
        ],
        "address": "庙泾路52弄",
        "name": "水清三村",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.498918,
            31.314675
        ],
        "address": "民府路1258弄",
        "name": "旭辉江湾墅",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.519985,
            31.320978
        ],
        "address": "民京路658弄",
        "name": "民庆家园二期",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.521456,
            31.322175
        ],
        "address": "民京路828弄",
        "name": "世晶花苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.521711,
            31.322549
        ],
        "address": "民京路838弄",
        "name": "民京路838弄",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.564779,
            30.861781
        ],
        "address": "民乐路28弄",
        "name": "世茂爱马尚郡",
        "count": 55,
        "style": 0
    },
    {
        "lnglat": [
            121.297586,
            31.044041
        ],
        "address": "民强路485号",
        "name": "佳钢智慧园(民强路)",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.549906,
            31.226561
        ],
        "address": "民生路1199号",
        "name": "证大五道口广场",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.549024,
            31.224681
        ],
        "address": "民生路1286号",
        "name": "上海汇商大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.551364,
            31.224185
        ],
        "address": "民生路1403号",
        "name": "上海信息大厦",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.550428,
            31.220473
        ],
        "address": "民生路1518号",
        "name": "金鹰大厦（上海)",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.550634,
            31.224255
        ],
        "address": "民生路1399号",
        "name": "太平人寿大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.544254,
            31.312162
        ],
        "address": "民星路270号",
        "name": "谊客科技园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.548733,
            31.229538
        ],
        "address": "民生路999弄",
        "name": "中星恬园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.284036,
            31.041266
        ],
        "address": "民益路1698号",
        "name": "联东U谷上海松江新桥国际企业港",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.303018,
            31.288344
        ],
        "address": "民主街495弄",
        "name": "绿洲茗馨公寓",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.540376,
            31.311632
        ],
        "address": "民星路376弄",
        "name": "锦都玫瑰园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.539396,
            31.044765
        ],
        "address": "闵驰二路58弄、59弄、256弄、257弄",
        "name": "欣佳宝邸",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.536236,
            31.04387
        ],
        "address": "闵驰二路256弄",
        "name": "欣佳宝邸三期",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.543288,
            31.03959
        ],
        "address": "闵驰一路197弄",
        "name": "汇秀景苑三街坊",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.542989,
            31.040451
        ],
        "address": "闵驰一路208弄",
        "name": "汇秀景苑二街坊",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.541089,
            31.039122
        ],
        "address": "闵驰一路299弄-1-13号",
        "name": "瑞和华苑南区",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.546334,
            31.039666
        ],
        "address": "闵驰一路29弄1-22号",
        "name": "聚缘南庭",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.545413,
            31.04046
        ],
        "address": "闵驰一路50弄",
        "name": "聚缘中庭",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.539607,
            31.040336
        ],
        "address": "闵驰一路302弄",
        "name": "瑞和华苑北区",
        "count": 63,
        "style": 0
    },
    {
        "lnglat": [
            121.391183,
            31.107598
        ],
        "address": "名都路20弄",
        "name": "名都新城三期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.39643,
            31.132806
        ],
        "address": "闵虹路166弄",
        "name": "中庚环球创意中心",
        "count": 80,
        "style": 0
    },
    {
        "lnglat": [
            121.340224,
            31.085834
        ],
        "address": "明兴路528弄",
        "name": "新南路1（壹）号",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.576735,
            31.232601
        ],
        "address": "明月路188号",
        "name": "世茂湖滨花园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.32501,
            31.073689
        ],
        "address": "明中路1777弄",
        "name": "新弘国际城",
        "count": 112,
        "style": 0
    },
    {
        "lnglat": [
            121.328049,
            31.075157
        ],
        "address": "明中路1588弄1-1086号",
        "name": "沿海丽水馨庭",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.320781,
            31.074338
        ],
        "address": "明中路1800弄",
        "name": "明中苑",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.260508,
            31.194295
        ],
        "address": "明珠路1018号",
        "name": "e通世界商务园（双子楼）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.264805,
            31.182896
        ],
        "address": "明珠路838号",
        "name": "恒润大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.469332,
            31.406805
        ],
        "address": "漠河路600弄",
        "name": "东鼎国际大厦",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.162644,
            31.290121
        ],
        "address": "墨玉路28号",
        "name": "嘉正国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.16269,
            31.300865
        ],
        "address": "墨玉路398号",
        "name": "承安翡翠公馆",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.162775,
            31.287504
        ],
        "address": "墨玉南路1033号",
        "name": "嘉亭大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.487843,
            31.393607
        ],
        "address": "牡丹江路1248号",
        "name": "安信财富中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.486239,
            31.396298
        ],
        "address": "牡丹江路1288号",
        "name": "宝莲府邸",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.487724,
            31.393994
        ],
        "address": "牡丹江路1211号",
        "name": "安信广场",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.544773,
            31.205483
        ],
        "address": "牡丹路60号",
        "name": "东辰大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.48576,
            31.39657
        ],
        "address": "牡丹江路1378号",
        "name": "璟都新园（景都新苑）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.606546,
            31.178775
        ],
        "address": "纳贤路799号",
        "name": "科荣大楼",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.470474,
            31.218859
        ],
        "address": "南昌路45号",
        "name": "城汇大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.458687,
            31.214276
        ],
        "address": "南昌路555号",
        "name": "东方巴黎霞飞苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.605331,
            31.178332
        ],
        "address": "纳贤路800号",
        "name": "众创园（科海大楼）",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.491901,
            31.207382
        ],
        "address": "南车站路318弄",
        "name": "豫景公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.490669,
            31.210994
        ],
        "address": "南车站路69弄1-3号",
        "name": "华教大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.458199,
            31.214366
        ],
        "address": "南昌路559号",
        "name": "南昌路559号大楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.440715,
            31.188957
        ],
        "address": "南丹东路168号",
        "name": "徐家汇新贵_福源汇居",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.44036,
            31.189723
        ],
        "address": "南丹东路181号",
        "name": "莱诗邸商务裙楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.439501,
            31.189509
        ],
        "address": "南丹东路223弄",
        "name": "莱诗邸",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.445575,
            31.190795
        ],
        "address": "南丹东路18号",
        "name": "兴都大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.439696,
            31.188397
        ],
        "address": "南丹东路228弄",
        "name": "金轩公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.43853,
            31.189445
        ],
        "address": "南丹东路255号-275号",
        "name": "南天1号楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.439133,
            31.188906
        ],
        "address": "南丹东路238号",
        "name": "新东亚酒店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.444652,
            31.191342
        ],
        "address": "南丹东路99弄",
        "name": "天际花园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.43842,
            31.188651
        ],
        "address": "南丹东路300弄",
        "name": "亚都国际名园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.428758,
            31.190954
        ],
        "address": "南丹路118弄",
        "name": "光启公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.432296,
            31.189061
        ],
        "address": "南丹路138弄",
        "name": "明华苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.43165,
            31.189755
        ],
        "address": "南丹路189号",
        "name": "南虹公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.431674,
            31.189937
        ],
        "address": "南丹路191号",
        "name": "诚品商务中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.427818,
            31.191403
        ],
        "address": "南丹路368弄",
        "name": "汇贤雅居",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.556182,
            30.926972
        ],
        "address": "南奉公路4025号",
        "name": "上海铭基科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.483668,
            30.916401
        ],
        "address": "南奉公路6899弄",
        "name": "金昊雅苑",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.456711,
            31.229851
        ],
        "address": "南汇路69号",
        "name": "上海宁波联谊大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.48204,
            31.23615
        ],
        "address": "南京东路409-459号",
        "name": "申能置地广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.483547,
            31.237366
        ],
        "address": "南京东路328号雅戈尔大厦",
        "name": "雅戈尔大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.491049,
            30.919123
        ],
        "address": "南奉公路7298号",
        "name": "浦南财富广场",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.488536,
            31.238373
        ],
        "address": "南京东路61号",
        "name": "新黄浦金融大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.503297,
            31.07763
        ],
        "address": "南江燕路229弄1-106边门",
        "name": "世博家园八街坊",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.488041,
            31.238198
        ],
        "address": "南京东路99号（四川中路346号）",
        "name": "嘉陵大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.456858,
            31.229065
        ],
        "address": "南京西路1038号",
        "name": "梅龙镇广场",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.455673,
            31.228285
        ],
        "address": "南京西路1168号",
        "name": "中信泰富广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.451874,
            31.22681
        ],
        "address": "南京西路1376号",
        "name": "上海商城",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.449739,
            31.225566
        ],
        "address": "南京西路1468号",
        "name": "中欣大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.448932,
            31.226096
        ],
        "address": "南京西路1486号（铜仁路）",
        "name": "东海广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.443825,
            31.22263
        ],
        "address": "南京西路1788号",
        "name": "1788国际大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.470279,
            31.232243
        ],
        "address": "南京西路288号",
        "name": "创兴金融中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.469693,
            31.230375
        ],
        "address": "南京西路399号",
        "name": "明天广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.465886,
            31.231407
        ],
        "address": "南京西路580号",
        "name": "仲益大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.460921,
            31.230432
        ],
        "address": "南京西路819号",
        "name": "中创大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.460911,
            31.231125
        ],
        "address": "南京西路818号",
        "name": "长春藤运通大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.459311,
            31.230402
        ],
        "address": "南京西路920号",
        "name": "南泰大厦（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.45856,
            31.228909
        ],
        "address": "南京西路993号",
        "name": "上海锦江向阳大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.469052,
            31.231439
        ],
        "address": "南京西路388号",
        "name": "仙乐斯广场",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.279426,
            31.020502
        ],
        "address": "南乐路1276弄115号",
        "name": "创亿园（创亿国际企业园）",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.706482,
            31.062752
        ],
        "address": "南六公路399号",
        "name": "艺泰安邦花园",
        "count": 169,
        "style": 0
    },
    {
        "lnglat": [
            121.711441,
            31.077117
        ],
        "address": "南六公路851号",
        "name": "翔灵电商园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.514813,
            31.180431
        ],
        "address": "南码头路1136号",
        "name": "卢湾教工楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.507338,
            31.200918
        ],
        "address": "南码头路101号",
        "name": "海博大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.819214,
            30.91039
        ],
        "address": "南芦公路1755弄",
        "name": "鸿音广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.514093,
            31.181956
        ],
        "address": "南码头路1288弄",
        "name": "逸翠公馆",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.444045,
            31.164912
        ],
        "address": "南宁路501弄",
        "name": "馨汇南苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.696546,
            31.188887
        ],
        "address": "南桥路707弄",
        "name": "永达城市公寓",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.434171,
            31.157434
        ],
        "address": "南宁路970号",
        "name": "徐汇万科中心",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.439401,
            30.941402
        ],
        "address": "南桥镇程普路377号",
        "name": "悠口创意园",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.46103,
            30.942548
        ],
        "address": "南桥镇奉浦大道97号",
        "name": "绿地智尊",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.518966,
            31.226198
        ],
        "address": "南泉北路1015弄、1017弄",
        "name": "光明小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.515962,
            31.235582
        ],
        "address": "南泉北路201号",
        "name": "房地大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.462464,
            31.240836
        ],
        "address": "南苏州路1393弄1号",
        "name": "良友高层",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.465637,
            31.256171
        ],
        "address": "南山路88弄",
        "name": "南顺公寓（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.402733,
            31.245228
        ],
        "address": "南石二路135弄",
        "name": "兰溪公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.48439,
            31.242518
        ],
        "address": "南苏州路325号",
        "name": "物资大厦(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.484203,
            31.241984
        ],
        "address": "南苏州路333号",
        "name": "华隆大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.475492,
            31.24079
        ],
        "address": "南苏州路877弄",
        "name": "河畔明珠",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.471864,
            31.203297
        ],
        "address": "南塘浜路133号",
        "name": "华业公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.474249,
            31.203799
        ],
        "address": "南溏浜路139弄",
        "name": "绿洲仕格维花园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.471449,
            31.239117
        ],
        "address": "南苏州路999号",
        "name": "象屿集团大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.474249,
            31.203799
        ],
        "address": "南溏浜路18弄1-7号",
        "name": "桃源",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.45074,
            31.22744
        ],
        "address": "南阳路183弄1-2号",
        "name": "南阳大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.553133,
            31.238456
        ],
        "address": "南洋泾路280号",
        "name": "中新公寓",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.556021,
            31.231936
        ],
        "address": "南洋泾路578号",
        "name": "界龙总部园御龙湾",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.429455,
            31.340152
        ],
        "address": "南蕴藻路408号",
        "name": "栋霖科技园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.334318,
            31.399414
        ],
        "address": "年吉路650弄",
        "name": "美罗家园润苑",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.548138,
            31.278362
        ],
        "address": "内江路221号",
        "name": "科技大厦(杨浦)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.593828,
            31.115432
        ],
        "address": "年家浜东路129弄",
        "name": "印象春城",
        "count": 86,
        "style": 0
    },
    {
        "lnglat": [
            121.416811,
            31.249681
        ],
        "address": "宁川路139弄",
        "name": "申兴华庭",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.490689,
            30.898543
        ],
        "address": "宁富路288号",
        "name": "上海磐业网络科技园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.33779,
            31.398732
        ],
        "address": "年喜路29弄",
        "name": "中集金地美兰城澜都(北区南区公寓）",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.593874,
            31.115433
        ],
        "address": "年家浜东路159弄",
        "name": "印象生活广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.537355,
            31.263091
        ],
        "address": "宁国路129号",
        "name": "城建大厦(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.537296,
            31.264819
        ],
        "address": "宁国路228号B座",
        "name": "郡江国际大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.535532,
            31.265046
        ],
        "address": "宁国路313弄",
        "name": "龙泽大厦(上海)",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.533634,
            31.267569
        ],
        "address": "宁国路503号",
        "name": "四季广场（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.616102,
            31.252474
        ],
        "address": "宁桥路615号",
        "name": "由度工场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.481835,
            31.229198
        ],
        "address": "宁海东路200号",
        "name": "申鑫大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.62009,
            31.253819
        ],
        "address": "宁桥路825号",
        "name": "金桥825",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.62347,
            31.254161
        ],
        "address": "宁桥路999号",
        "name": "金桥开发区T15",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.543325,
            31.271177
        ],
        "address": "宁武路510弄",
        "name": "珠江香樟园北园",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.419,
            31.232425
        ],
        "address": "宁夏路353弄",
        "name": "绿地世纪城世纪花园",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.416659,
            31.219129
        ],
        "address": "宁夏路201号",
        "name": "绿地科创大厦",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.417524,
            31.234808
        ],
        "address": "宁夏路366弄",
        "name": "绿地世家",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.511149,
            30.951965
        ],
        "address": "农民街118弄",
        "name": "汇贤雅苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.411287,
            31.230679
        ],
        "address": "宁夏路777号",
        "name": "坤田社区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.391777,
            31.236641
        ],
        "address": "怒江北路302弄",
        "name": "中天新曹杨商务楼",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.394555,
            31.235099
        ],
        "address": "怒江北路219弄1号",
        "name": "开开大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.39037,
            31.235734
        ],
        "address": "怒江北路399号",
        "name": "新曹杨科技大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.387533,
            31.23515
        ],
        "address": "怒江北路449弄8，9号（C区B区）",
        "name": "上海新曹杨高新技术工业园区二街坊(B区C区)",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.488316,
            31.26664
        ],
        "address": "欧阳路196号",
        "name": "法兰桥",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.488148,
            31.267616
        ],
        "address": "欧阳路218弄之1-3号",
        "name": "明杨豪苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.487973,
            31.273077
        ],
        "address": "欧阳路501弄50号",
        "name": "裕群公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.487405,
            31.269566
        ],
        "address": "欧阳路318弄",
        "name": "绿缘大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.486233,
            31.275311
        ],
        "address": "欧阳路681弄1-7号",
        "name": "山水苑(上海)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.48619,
            31.273741
        ],
        "address": "欧阳路568号",
        "name": "庐迅大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.486903,
            31.273929
        ],
        "address": "欧阳路561号",
        "name": "欧阳大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.489511,
            31.265881
        ],
        "address": "欧阳路85号",
        "name": "金陵国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.65591,
            31.025437
        ],
        "address": "牌楼东路528弄",
        "name": "清林径",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.359753,
            31.36185
        ],
        "address": "潘广路1018弄",
        "name": "龙湖北城天街",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.359231,
            31.362559
        ],
        "address": "潘广路1765号",
        "name": "馨佳园七街坊",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.339725,
            31.481458
        ],
        "address": "潘沪路159号",
        "name": "雍和府",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.349462,
            31.462297
        ],
        "address": "潘泾路4655弄",
        "name": "旭辉城",
        "count": 95,
        "style": 0
    },
    {
        "lnglat": [
            121.34881,
            31.465285
        ],
        "address": "潘泾路4777弄",
        "name": "宝山上河苑",
        "count": 83,
        "style": 0
    },
    {
        "lnglat": [
            121.331659,
            31.486187
        ],
        "address": "潘新路255弄",
        "name": "信达北苑(信达蓝庭)",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.482976,
            31.407758
        ],
        "address": "盘古路388弄",
        "name": "祥腾国际广场",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.280998,
            31.211306
        ],
        "address": "盘阳路66弄",
        "name": "融信绿地商务广场二期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.280388,
            31.210987
        ],
        "address": "盘阳路59弄",
        "name": "融信绿地商务广场一期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.813183,
            30.90574
        ],
        "address": "彭平东路88弄",
        "name": "丽都景苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.470225,
            31.403309
        ],
        "address": "盘古路708号",
        "name": "宝建大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.591306,
            31.254846
        ],
        "address": "平度路258号",
        "name": "金桥大拇指广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.592207,
            31.253352
        ],
        "address": "平度路388弄",
        "name": "金桥和苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.456685,
            31.200514
        ],
        "address": "平江路25号",
        "name": "平江大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.524711,
            31.257797
        ],
        "address": "平凉路1000弄",
        "name": "天科国际大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.532306,
            31.260974
        ],
        "address": "平凉路1055号",
        "name": "上海创意联盟产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.524711,
            31.257797
        ],
        "address": "平凉路1090弄",
        "name": "天科国际商务楼",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.533133,
            31.260851
        ],
        "address": "通阁路150号",
        "name": "长信公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.535567,
            31.263277
        ],
        "address": "平凉路1289号",
        "name": "联升大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.531107,
            31.254322
        ],
        "address": "平凉路1398号",
        "name": "上海杨浦工贸大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.540498,
            31.265781
        ],
        "address": "平凉路1550弄",
        "name": "金凤大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.518106,
            31.25355
        ],
        "address": "平凉路207号",
        "name": "平凉园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.549072,
            31.274262
        ],
        "address": "平凉路2241号",
        "name": "智慧坊",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.552273,
            31.277738
        ],
        "address": "平凉路2545弄",
        "name": "益民小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.551633,
            31.275062
        ],
        "address": "平凉路2440号",
        "name": "芯工创意园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.524272,
            31.256951
        ],
        "address": "平凉路618号",
        "name": "界龙商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.525322,
            31.257841
        ],
        "address": "平凉路624号",
        "name": "德昌园创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432503,
            31.208777
        ],
        "address": "平武路168号",
        "name": "玉嘉大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.430403,
            31.207703
        ],
        "address": "平武路31弄1-3号",
        "name": "平武公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.45959,
            31.28168
        ],
        "address": "平型关路1083弄",
        "name": "慧芝湖花园二期",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.457506,
            31.280636
        ],
        "address": "平型关路1088弄",
        "name": "慧芝湖花园三期(嘉悦天地)",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.465869,
            31.267022
        ],
        "address": "平型关路108弄",
        "name": "108广场（金银108创意广场）",
        "count": 74,
        "style": 0
    },
    {
        "lnglat": [
            121.52617,
            31.258205
        ],
        "address": "平凉路716号",
        "name": "实益大厦（实业大厦）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.465636,
            31.267274
        ],
        "address": "平型关路108弄37号、39号",
        "name": "108广场(品座尚座)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.459604,
            31.293439
        ],
        "address": "平型关路1700号",
        "name": "宏慧视界BOX",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.467808,
            31.264503
        ],
        "address": "平型关路18号",
        "name": "和源大楼商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.463875,
            31.27328
        ],
        "address": "平型关路377弄",
        "name": "上海嘉利明珠城",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.46742,
            31.265416
        ],
        "address": "平型关路68弄",
        "name": "申地苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.467697,
            31.264924
        ],
        "address": "平型关路38号",
        "name": "和源大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.460184,
            31.275206
        ],
        "address": "平型关路680弄",
        "name": "崇文园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.384035,
            31.133738
        ],
        "address": "平阳路1465弄",
        "name": "平阳苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.383079,
            31.133476
        ],
        "address": "平阳路1515弄",
        "name": "龙祥嘉园（闵行）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.383589,
            31.134212
        ],
        "address": "平阳路1481号",
        "name": "古美现代服务企业中心",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.406727,
            31.142289
        ],
        "address": "平阳路151弄",
        "name": "金领华庭",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.401231,
            31.052456
        ],
        "address": "瓶安路1358号",
        "name": "久创科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.324784,
            31.139466
        ],
        "address": "蒲汇路168-178号",
        "name": "旭辉丰禄纯真中心（九亭U天地）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.435754,
            31.186501
        ],
        "address": "蒲汇塘路11号",
        "name": "博大商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.433438,
            31.187205
        ],
        "address": "蒲汇塘路101号",
        "name": "沪贵苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432218,
            31.187636
        ],
        "address": "蒲汇塘路123号",
        "name": "宏景商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.431524,
            31.187976
        ],
        "address": "蒲汇塘路163弄",
        "name": "泰德苑（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.43524,
            31.186094
        ],
        "address": "蒲汇塘路50号",
        "name": "玉兰花苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.418518,
            31.153397
        ],
        "address": "浦北路388号",
        "name": "康健星辰",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.413314,
            31.149355
        ],
        "address": "浦北路999弄1-3号",
        "name": "百合花苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.512876,
            31.228046
        ],
        "address": "浦城路366弄",
        "name": "菊园",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.504192,
            31.074866
        ],
        "address": "浦驰路188弄1-109号",
        "name": "世博家园十一街坊",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.515048,
            31.223531
        ],
        "address": "浦城路680号",
        "name": "上海滨江世茂52",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.50231,
            31.075213
        ],
        "address": "浦驰路235弄1-4号",
        "name": "世博家园十二街坊",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.500941,
            31.076736
        ],
        "address": "浦驰路345弄1-39号",
        "name": "世博家园九街坊",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.515572,
            31.217238
        ],
        "address": "浦电路29弄之1-35号",
        "name": "滨江大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.530353,
            31.221812
        ],
        "address": "浦电路360号",
        "name": "陆家嘴投资大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.51803,
            31.211118
        ],
        "address": "浦电路400弄",
        "name": "兴业嘉园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.535176,
            31.222693
        ],
        "address": "浦电路489号",
        "name": "由由燕乔大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.533272,
            31.22285
        ],
        "address": "浦电路438号",
        "name": "双鸽大厦",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.533683,
            31.241523
        ],
        "address": "浦东大道1000弄",
        "name": "巨洋豪园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.530541,
            31.241605
        ],
        "address": "浦东大道1081-1089号",
        "name": "中信五牛城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.531924,
            31.243578
        ],
        "address": "浦东大道1097弄",
        "name": "珠江玫瑰花园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.533159,
            31.242217
        ],
        "address": "浦东大道1139号",
        "name": "惠扬大厦",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.530135,
            31.243
        ],
        "address": "浦东大道1093弄",
        "name": "名门滨江苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.533096,
            31.242195
        ],
        "address": "浦东大道1141号",
        "name": "惠扬大厦裙楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.525858,
            31.24113
        ],
        "address": "浦东大道1200弄",
        "name": "巨洋大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.514236,
            31.238474
        ],
        "address": "浦东大道138号",
        "name": "上海永华大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.53804,
            31.24385
        ],
        "address": "浦东大道1525-1539号",
        "name": "中国石化大厦(上海)",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.545572,
            31.247319
        ],
        "address": "浦东大道1819弄",
        "name": "和达家园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.536341,
            31.242488
        ],
        "address": "浦东大道1476号",
        "name": "山海大厦(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.547261,
            31.246551
        ],
        "address": "浦东大道1868号",
        "name": "东方城市大厦",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.524159,
            31.243966
        ],
        "address": "浦东大道1号",
        "name": "船舶大厦",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.549007,
            31.247651
        ],
        "address": "浦东大道2000号",
        "name": "阳光世界大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.550114,
            31.250092
        ],
        "address": "浦东大道2123号",
        "name": "龙珠广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.550928,
            31.249472
        ],
        "address": "浦东大道2188号",
        "name": "上安商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.551156,
            31.249628
        ],
        "address": "浦东大道2220号、2160号",
        "name": "上安大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.559399,
            31.259106
        ],
        "address": "浦东大道2511弄19号",
        "name": "柚米国际公寓(浦东大道店)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.560859,
            31.258774
        ],
        "address": "浦东大道2515号、2521号",
        "name": "金茂花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.562888,
            31.259019
        ],
        "address": "浦东大道2554号",
        "name": "仙都绿苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.564108,
            31.259853
        ],
        "address": "浦东大道2568弄",
        "name": "军官公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.516381,
            31.239225
        ],
        "address": "浦东大道288号",
        "name": "SDL智汇东信",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.568195,
            31.264438
        ],
        "address": "浦东大道2742弄",
        "name": "中环滨江大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.522927,
            31.240923
        ],
        "address": "浦东大道637号(近福山路)",
        "name": "同科公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.52396,
            31.240314
        ],
        "address": "浦东大道688号",
        "name": "浦东大道688号基地",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.524798,
            31.239899
        ],
        "address": "浦东大道720号2B",
        "name": "上海国际航运大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.515044,
            31.229016
        ],
        "address": "浦东南路1036号",
        "name": "隆宇大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.516758,
            31.229426
        ],
        "address": "浦东南路1085号",
        "name": "上海华申大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.525405,
            31.241116
        ],
        "address": "浦东大道727弄1号",
        "name": "VIP大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.51737,
            31.22914
        ],
        "address": "浦东南路1101号",
        "name": "上海远东大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.518559,
            31.225256
        ],
        "address": "浦东南路1341弄2号",
        "name": "紫金瀚宫",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.515414,
            31.227672
        ],
        "address": "浦东南路1118号",
        "name": "鄂尔多斯大厦",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.518793,
            31.220826
        ],
        "address": "浦东南路1525号",
        "name": "振环大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.517878,
            31.220678
        ],
        "address": "浦东南路1550弄",
        "name": "天科苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.518424,
            31.219515
        ],
        "address": "浦东南路1630号",
        "name": "闻通商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.517603,
            31.215859
        ],
        "address": "浦东南路1862弄",
        "name": "众鑫大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.516906,
            31.207584
        ],
        "address": "浦东南路2157、2159号",
        "name": "众城商厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.519166,
            31.215451
        ],
        "address": "浦东南路1877号",
        "name": "东旅大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.51528,
            31.208222
        ],
        "address": "浦东南路2162号",
        "name": "浦江2162",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.516577,
            31.207175
        ],
        "address": "浦东南路2169号",
        "name": "久事大桥公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.516132,
            31.206519
        ],
        "address": "浦东南路2179弄",
        "name": "宏润公寓",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.513924,
            31.205608
        ],
        "address": "浦东南路2240号",
        "name": "永业商业大楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.513755,
            31.204908
        ],
        "address": "浦东南路2250号",
        "name": "滨江2250",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.508804,
            31.2397
        ],
        "address": "浦东南路256号",
        "name": "华夏银行大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.509393,
            31.23884
        ],
        "address": "浦东南路360号",
        "name": "新上海国际大厦",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.507916,
            31.195347
        ],
        "address": "浦东南路3456号",
        "name": "江天大厦（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.510407,
            31.23928
        ],
        "address": "浦东南路379号",
        "name": "金穗大厦（上海）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.500686,
            31.183055
        ],
        "address": "浦东南路4250弄",
        "name": "雪野家园",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.510467,
            31.237063
        ],
        "address": "浦东南路500号",
        "name": "国家开发银行大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.50078,
            31.181847
        ],
        "address": "浦东南路4301、4401、4501号",
        "name": "云台苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.514972,
            31.232368
        ],
        "address": "浦东南路855号",
        "name": "世界广场",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.516128,
            31.229462
        ],
        "address": "浦东南路999号",
        "name": "新梅联合广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.924825,
            30.897325
        ],
        "address": "浦东新区临港新城申港大道87号",
        "name": "毓阳泓智大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.549578,
            31.247656
        ],
        "address": "浦东新区栖山路401弄7号",
        "name": "雅华公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.511326,
            31.235982
        ],
        "address": "浦东南路528号",
        "name": "证券大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.542642,
            31.043277
        ],
        "address": "浦航路178弄",
        "name": "汇秀景苑一街坊",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.545959,
            31.044094
        ],
        "address": "浦航路36弄",
        "name": "聚缘北庭",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.53404,
            31.041676
        ],
        "address": "浦航路718弄",
        "name": "浦润苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.519705,
            31.208396
        ],
        "address": "浦建路118号",
        "name": "巴黎春天(浦建店)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.522539,
            31.208783
        ],
        "address": "浦建路145号",
        "name": "强生大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.545907,
            31.200711
        ],
        "address": "浦建路1578弄",
        "name": "龙昌苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.544131,
            31.202365
        ],
        "address": "浦建路1458弄",
        "name": "志豪公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.527633,
            31.208719
        ],
        "address": "浦建路365弄",
        "name": "金龙东苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.519174,
            31.210598
        ],
        "address": "浦建路47号",
        "name": "东源大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.518298,
            31.207376
        ],
        "address": "浦建路60弄",
        "name": "澳丽花苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.530832,
            31.208286
        ],
        "address": "延安中路596号",
        "name": "天壹坊",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.533818,
            31.16725
        ],
        "address": "浦锦街道联航路2165弄世博家园(近联航路)",
        "name": "世博家园十五街坊",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.493302,
            31.093205
        ],
        "address": "浦锦路1266-1328号",
        "name": "新浦江城四期LOFT",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.485276,
            31.110409
        ],
        "address": "浦锦路2049号",
        "name": "中粮万科VMO",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.483819,
            31.113395
        ],
        "address": "浦锦路2159弄",
        "name": "浦恒馨苑",
        "count": 176,
        "style": 0
    },
    {
        "lnglat": [
            121.53599,
            31.055187
        ],
        "address": "浦连路388弄",
        "name": "金硕河畔景园东区",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.537378,
            31.054323
        ],
        "address": "浦连路439弄",
        "name": "浦江丽都一期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.534169,
            31.052597
        ],
        "address": "浦连路598弄",
        "name": "金硕河畔景园南区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.514532,
            31.214468
        ],
        "address": "浦明路1188弄",
        "name": "家化滨江苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.515221,
            31.213167
        ],
        "address": "浦明路1221号",
        "name": "香园商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.51414,
            31.21054
        ],
        "address": "浦明路1333号",
        "name": "浦江海景",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.510709,
            31.226751
        ],
        "address": "浦明路233弄",
        "name": "江临天下",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.508907,
            31.225884
        ],
        "address": "浦明路258弄",
        "name": "财富海景花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.512436,
            31.219347
        ],
        "address": "浦明路868弄",
        "name": "保利one56",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.508604,
            31.230173
        ],
        "address": "浦明路99弄",
        "name": "仁恒滨江园",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.493735,
            31.069614
        ],
        "address": "浦瑞路53弄、浦瑞路56弄",
        "name": "景舒苑十村",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.495178,
            31.063329
        ],
        "address": "浦瑞南路76弄",
        "name": "滨浦新苑8村",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.510577,
            31.196693
        ],
        "address": "浦三路12弄",
        "name": "海浦小区",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.520147,
            31.180915
        ],
        "address": "浦三路895号",
        "name": "冠寓_杨高南路店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.537353,
            31.15175
        ],
        "address": "浦三路3058号",
        "name": "长青企业广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.501627,
            31.082575
        ],
        "address": "浦申路633弄1-57号",
        "name": "世博家园二街坊",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.543674,
            31.05174
        ],
        "address": "浦涛路100弄",
        "name": "中虹浦江苑北区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.53785,
            31.049779
        ],
        "address": "浦涛路400弄",
        "name": "瑞和新苑北区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.536182,
            31.045956
        ],
        "address": "浦涛路505弄",
        "name": "虹浦新城南区",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.535985,
            31.047572
        ],
        "address": "浦涛路510弄",
        "name": "虹浦新城北区",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.510561,
            31.080125
        ],
        "address": "浦星公路1919弄",
        "name": "绿地峰尚汇",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.544442,
            31.049903
        ],
        "address": "浦涛路75弄",
        "name": "中虹浦江苑南区",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.51097,
            31.07647
        ],
        "address": "浦星公路1969号",
        "name": "红星国际广场(上海)",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.48909,
            31.086509
        ],
        "address": "浦秀路1139弄",
        "name": "浦秀馨苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.494271,
            31.071823
        ],
        "address": "浦雪路179弄",
        "name": "景舒苑九村",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.491833,
            31.075153
        ],
        "address": "浦雪路351弄",
        "name": "景舒苑七村",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.498023,
            31.064156
        ],
        "address": "浦雪南路206弄",
        "name": "滨浦新苑六村",
        "count": 87,
        "style": 0
    },
    {
        "lnglat": [
            121.498287,
            31.067206
        ],
        "address": "浦雪南路366弄1-55号",
        "name": "滨浦新苑5村",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.494833,
            31.066535
        ],
        "address": "浦雪南路369弄",
        "name": "滨浦新苑7村",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.478334,
            31.223332
        ],
        "address": "普安路177号",
        "name": "十方大厦名都商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.478894,
            31.22255
        ],
        "address": "普安路189号",
        "name": "曙光大厦(上海)",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.456191,
            31.258024
        ],
        "address": "普善路239弄，521弄",
        "name": "北美公寓",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.388088,
            31.277477
        ],
        "address": "普陀区武威东路888弄",
        "name": "恒盛鼎城圣都汇",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.453761,
            31.260169
        ],
        "address": "普善路390弄",
        "name": "普善新苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.433894,
            31.252074
        ],
        "address": "普陀区中山北路1759号",
        "name": "浦发广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.495667,
            31.207939
        ],
        "address": "普育东路200弄",
        "name": "东元坊",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.47493,
            31.244273
        ],
        "address": "七浦路535号",
        "name": "七浦商厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.532361,
            31.046159
        ],
        "address": "浦涛路751弄",
        "name": "水语人家南苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.363151,
            31.136063
        ],
        "address": "七莘路1728弄",
        "name": "蓼花汀",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.362237,
            31.134848
        ],
        "address": "七莘路1839号",
        "name": "财富108广场",
        "count": 70,
        "style": 0
    },
    {
        "lnglat": [
            121.37814,
            31.112338
        ],
        "address": "七莘路182号",
        "name": "182花园办公园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.362216,
            31.139769
        ],
        "address": "七莘路1890弄",
        "name": "东碧林湾",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.343541,
            31.15862
        ],
        "address": "七莘路3333号",
        "name": "万科城市花园老区",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.341823,
            31.163079
        ],
        "address": "七莘路3599弄",
        "name": "华商时代",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.379039,
            31.110745
        ],
        "address": "七莘路50号",
        "name": "乾锦创业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.34123,
            31.16458
        ],
        "address": "七莘路3655号",
        "name": "凯德七宝购物广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.318155,
            31.309669
        ],
        "address": "栖林路265弄",
        "name": "金地格林风范城高尔夫公馆",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.318118,
            31.309073
        ],
        "address": "栖林路392弄",
        "name": "金地格林风范城城市公馆",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.565674,
            31.257442
        ],
        "address": "栖山路1578弄",
        "name": "云山苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.551151,
            31.247615
        ],
        "address": "栖山路465弄16号",
        "name": "鼎隆大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.549599,
            31.246675
        ],
        "address": "栖山路401弄1号",
        "name": "凌高小区",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.503303,
            31.180336
        ],
        "address": "齐河路257弄21号",
        "name": "上南花苑",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.503606,
            31.181092
        ],
        "address": "齐河路257弄",
        "name": "上南花苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.515784,
            31.184841
        ],
        "address": "齐河路909弄",
        "name": "华业翠都",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.573268,
            31.260362
        ],
        "address": "栖山路1876弄",
        "name": "弘扬雅苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.522183,
            31.186525
        ],
        "address": "齐恒路177弄",
        "name": "凯德嘉博名邸",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.384412,
            31.293226
        ],
        "address": "祁安路365弄5-125号",
        "name": "安居金祁新城一期",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.385899,
            31.28644
        ],
        "address": "祁安路88弄1-22号",
        "name": "安居古浪苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.53167,
            31.25719
        ],
        "address": "齐齐哈尔路240弄",
        "name": "丹江新苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.372703,
            31.24911
        ],
        "address": "祁连山南路1988号",
        "name": "嘉龙大厦_上海",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.372189,
            31.252689
        ],
        "address": "祁连山南路2199号",
        "name": "真新商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.374072,
            31.267356
        ],
        "address": "祁连山南路2891弄100号",
        "name": "智创壹佰",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.36708,
            31.235248
        ],
        "address": "祁连山南路588弄1号",
        "name": "康帅大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.366187,
            31.243472
        ],
        "address": "祁连山南路999弄",
        "name": "金沙嘉年华",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.374062,
            31.267253
        ],
        "address": "祁连山南路2891弄",
        "name": "未来岛科技园区",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.252298,
            31.396894
        ],
        "address": "棋盘路1150弄",
        "name": "嘉康坊",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.390605,
            31.29359
        ],
        "address": "祁顺路1388弄",
        "name": "复地香栀花园",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.283415,
            31.418121
        ],
        "address": "启源路1000弄",
        "name": "汇丰颐苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.284299,
            31.415571
        ],
        "address": "启源路900弄",
        "name": "绿洲香润苑",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.275755,
            31.41828
        ],
        "address": "启悦路700弄",
        "name": "碧桂园嘉誉",
        "count": 89,
        "style": 0
    },
    {
        "lnglat": [
            121.326163,
            31.090403
        ],
        "address": "千帆路288弄",
        "name": "G60科创云廊",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.412288,
            31.177621
        ],
        "address": "钦江路28弄",
        "name": "东方康洛",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.399938,
            31.173032
        ],
        "address": "钦江路333号41幢",
        "name": "上海大唐移动商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.403332,
            31.178937
        ],
        "address": "钦州北路1122号",
        "name": "漕河泾_新汇园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.400417,
            31.177789
        ],
        "address": "钦州北路1198号",
        "name": "智汇园(桂平科技园)",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.420993,
            31.180862
        ],
        "address": "钦州北路188号",
        "name": "华京商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.419093,
            31.179985
        ],
        "address": "钦州北路399弄",
        "name": "金祥苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.416854,
            31.180483
        ],
        "address": "钦州北路475号",
        "name": "广厦公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.420419,
            31.18055
        ],
        "address": "钦州北路567号",
        "name": "长春新苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.411651,
            31.18
        ],
        "address": "钦州北路927弄",
        "name": "航天公寓1期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.431175,
            31.162001
        ],
        "address": "钦州路109号",
        "name": "逸安商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.41074,
            31.180093
        ],
        "address": "钦州北路953号",
        "name": "上海航天公寓长春商务楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.430387,
            31.162632
        ],
        "address": "钦州路108号",
        "name": "梓树园",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.430703,
            31.167332
        ],
        "address": "钦州路428弄之1-9号",
        "name": "中虹汇之苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.427663,
            31.175738
        ],
        "address": "钦州路760、780、820号",
        "name": "钦州公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.427147,
            31.177706
        ],
        "address": "钦州路840号-900号",
        "name": "钦州花苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.428465,
            31.16237
        ],
        "address": "钦州南路8号",
        "name": "中海馨园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.426322,
            31.177966
        ],
        "address": "钦州路920号",
        "name": "钦州路920号",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.156429,
            31.29034
        ],
        "address": "秦安路27弄",
        "name": "大名城",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.369354,
            31.092415
        ],
        "address": "沁春路717号",
        "name": "青春商务园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.117048,
            31.149302
        ],
        "address": "青安路40号",
        "name": "凯特利广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.619879,
            31.096244
        ],
        "address": "青黛路508号",
        "name": "新菲尔生物科技园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.467887,
            31.237968
        ],
        "address": "青岛路66弄",
        "name": "金色家园（上海）",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.464443,
            31.229026
        ],
        "address": "青海路118号",
        "name": "云海苑商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46461,
            31.228278
        ],
        "address": "青海路132号",
        "name": "云海苑（公寓楼）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.133221,
            31.145864
        ],
        "address": "青湖路998-1002号",
        "name": "万福财富中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.809095,
            30.906306
        ],
        "address": "青鸟路269弄",
        "name": "东亚阳光里",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.805148,
            30.907128
        ],
        "address": "青鸟路599号",
        "name": "碧桂园浦东星作",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.684986,
            31.196994
        ],
        "address": "青厦路200弄",
        "name": "华夏银桂苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.366349,
            31.178254
        ],
        "address": "青杉路150弄",
        "name": "龙柏四季花园",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.366241,
            31.175212
        ],
        "address": "青杉路169弄、157弄",
        "name": "龙柏香榭苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.364405,
            31.180006
        ],
        "address": "青杉路200弄1号",
        "name": "俊领国际（青杉路200弄1号）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.118505,
            31.139609
        ],
        "address": "青松路405弄",
        "name": "帕缇欧香苑三期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.129906,
            31.154214
        ],
        "address": "青竹路161弄",
        "name": "中铁逸都",
        "count": 214,
        "style": 0
    },
    {
        "lnglat": [
            121.091871,
            31.168162
        ],
        "address": "清河湾路425弄",
        "name": "旭辉百合宫馆",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.476046,
            31.265468
        ],
        "address": "青云路108弄",
        "name": "虹口花苑三期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.102433,
            31.169383
        ],
        "address": "清河湾路486弄",
        "name": "富力桃园(上海)",
        "count": 62,
        "style": 0
    },
    {
        "lnglat": [
            121.096644,
            31.165876
        ],
        "address": "清河湾路699弄",
        "name": "旭辉玫瑰湾",
        "count": 110,
        "style": 0
    },
    {
        "lnglat": [
            121.099071,
            31.167906
        ],
        "address": "清河湾路819弄",
        "name": "青浦卓越世纪中心",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.514223,
            30.941764
        ],
        "address": "清宁路359弄",
        "name": "白沙通苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.512016,
            30.941656
        ],
        "address": "清宁路469弄",
        "name": "白沙西苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.518231,
            30.942768
        ],
        "address": "清宁路58弄218弄",
        "name": "东原郦湾",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.519597,
            30.940948
        ],
        "address": "清宁路85弄",
        "name": "白沙东苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.516522,
            30.941849
        ],
        "address": "清宁路239弄",
        "name": "白沙恒苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.371575,
            31.241348
        ],
        "address": "清峪路258弄",
        "name": "上海豪园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.370323,
            31.241965
        ],
        "address": "清峪路368弄",
        "name": "金沙雅苑三期滨湖世家",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.459984,
            31.199527
        ],
        "address": "清真路55弄",
        "name": "大闻公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.794851,
            30.912473
        ],
        "address": "秋兴路875号",
        "name": "中汽联（临港）全球汽车零部件创新中心",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.487934,
            30.954852
        ],
        "address": "庆园路189弄",
        "name": "桐南美麓",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.761991,
            31.097684
        ],
        "address": "秋亭路88弄",
        "name": "朗诗未来树",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.227386,
            31.371842
        ],
        "address": "秋竹路118弄",
        "name": "胜悦嘉苑东区",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.209471,
            31.367206
        ],
        "address": "秋竹路119弄",
        "name": "胜悦嘉苑西区",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.219983,
            31.379875
        ],
        "address": "秋竹路655弄",
        "name": "叠翠峰苑二期",
        "count": 65,
        "style": 0
    },
    {
        "lnglat": [
            121.46684,
            31.24944
        ],
        "address": "虬江路1368弄",
        "name": "长城苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.218408,
            31.382598
        ],
        "address": "秋竹路801弄",
        "name": "金色榴乡园",
        "count": 79,
        "style": 0
    },
    {
        "lnglat": [
            121.22205,
            31.380739
        ],
        "address": "秋竹路618弄",
        "name": "叠翠峰苑一期",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.465392,
            31.24922
        ],
        "address": "虬江路1488弄",
        "name": "精文城市花园",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.487257,
            31.256823
        ],
        "address": "虬江路49弄60号",
        "name": "虬龙公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.473761,
            31.252113
        ],
        "address": "虬江路997弄",
        "name": "东新大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.483169,
            31.254166
        ],
        "address": "虬江支路181号",
        "name": "虹口商城楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.467296,
            31.24105
        ],
        "address": "曲阜西路268号（乌镇路）",
        "name": "上海恒安大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.445962,
            31.306997
        ],
        "address": "曲沃路66弄",
        "name": "闻喜华庭(上海)",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.332496,
            31.133007
        ],
        "address": "虬泾路99弄",
        "name": "九亭明珠苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.454751,
            31.053861
        ],
        "address": "曲吴路589号",
        "name": "中国梦谷南上海文化创意产业园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.492709,
            31.270596
        ],
        "address": "曲阳路167号",
        "name": "宏城公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.493669,
            31.268456
        ],
        "address": "曲阳路1号",
        "name": "华西证券大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.493235,
            31.26911
        ],
        "address": "曲阳路31号",
        "name": "曲阳公寓(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.491549,
            31.272133
        ],
        "address": "曲阳路299号",
        "name": "宝莲大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.490324,
            31.271376
        ],
        "address": "曲阳路269号",
        "name": "德阳花苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.491155,
            31.273694
        ],
        "address": "曲阳路428弄",
        "name": "曲阳公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.49117,
            31.274185
        ],
        "address": "曲阳路440号",
        "name": "东渡名人大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.489207,
            31.27482
        ],
        "address": "曲阳路489弄8号",
        "name": "虹口创客服务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.489805,
            31.279091
        ],
        "address": "曲阳路501号-551号",
        "name": "曲一花苑(曲一小区)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.495052,
            31.284573
        ],
        "address": "曲阳路630弄",
        "name": "曲阳小区",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.491481,
            31.287027
        ],
        "address": "曲阳路800号",
        "name": "上海商务中心大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.490964,
            31.291892
        ],
        "address": "曲阳路990弄",
        "name": "运光大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.491467,
            31.290152
        ],
        "address": "曲阳路910号",
        "name": "复城国际办公楼",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.474194,
            31.198656
        ],
        "address": "瞿溪路1072弄",
        "name": "南园新村",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.472753,
            31.198148
        ],
        "address": "瞿溪路1168号",
        "name": "开源大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.471191,
            31.19852
        ],
        "address": "瞿溪路1199弄",
        "name": "复兴南苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.470987,
            31.197885
        ],
        "address": "瞿溪路1236号",
        "name": "瞿溪路1236号商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.491872,
            31.204893
        ],
        "address": "瞿溪路301弄",
        "name": "蓬莱家园(二期)",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.483232,
            31.201695
        ],
        "address": "瞿溪路694号",
        "name": "汇典商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.480999,
            31.201168
        ],
        "address": "瞿溪路811弄",
        "name": "大众家园",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.477713,
            31.19878
        ],
        "address": "瞿溪路988号",
        "name": "汇暻生活广场",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.45412,
            31.140193
        ],
        "address": "群峰路128弄",
        "name": "新元盛璟苑",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.223365,
            31.054648
        ],
        "address": "人民北路2908弄",
        "name": "龙湖好望山",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.761795,
            31.049041
        ],
        "address": "人民东路2729弄38支弄",
        "name": "东方城市豪庭",
        "count": 96,
        "style": 0
    },
    {
        "lnglat": [
            121.58232,
            30.926435
        ],
        "address": "人民路255号",
        "name": "东方华璟园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.484893,
            31.227221
        ],
        "address": "人民路777弄",
        "name": "东淮海公寓",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.483349,
            31.225604
        ],
        "address": "人民路889号",
        "name": "淮海中华大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.482906,
            31.223105
        ],
        "address": "人民路998号",
        "name": "金天地国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.727054,
            31.047541
        ],
        "address": "人民西路1533弄",
        "name": "艺泰一品花园",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.460749,
            31.19647
        ],
        "address": "日晖六村33号",
        "name": "新徐汇商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.703901,
            31.245137
        ],
        "address": "仁庆路356号",
        "name": "2号地块张江东区商业办公楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.593406,
            31.340216
        ],
        "address": "日京路35号",
        "name": "凯兴大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.25254,
            31.034042
        ],
        "address": "茸平路333弄",
        "name": "国乐广场",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.24874,
            31.033804
        ],
        "address": "茸平路515弄",
        "name": "福都商务广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.598283,
            31.342979
        ],
        "address": "日京路161号",
        "name": "商都大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.257683,
            31.034916
        ],
        "address": "茸平路8号",
        "name": "汇甲大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.248958,
            31.065012
        ],
        "address": "茸兴路280弄",
        "name": "恒大帝景一期",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.249742,
            31.038603
        ],
        "address": "茸兴路285号",
        "name": "时亦商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.249354,
            31.047439
        ],
        "address": "茸兴路407号",
        "name": "茸407创意园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.395483,
            31.195623
        ],
        "address": "荣华东道119号",
        "name": "巴黎花园（上海）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.394702,
            31.19532
        ],
        "address": "荣华东道119弄",
        "name": "巴黎经典",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.395285,
            31.193907
        ],
        "address": "荣华东道19弄",
        "name": "鹿特丹花园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.394186,
            31.195602
        ],
        "address": "荣华东道128号",
        "name": "维多利亚E座",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.396467,
            31.193679
        ],
        "address": "荣华东道46-49号",
        "name": "雅典花园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.394992,
            31.195485
        ],
        "address": "荣华东道59弄",
        "name": "里昂花园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.396563,
            31.194085
        ],
        "address": "荣华东道35号-25号",
        "name": "广场大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.396358,
            31.196
        ],
        "address": "荣华东道98号",
        "name": "维多利亚C座",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.393471,
            31.193895
        ],
        "address": "荣华西道19弄",
        "name": "金狮公寓",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.396369,
            31.195765
        ],
        "address": "荣华东道79弄",
        "name": "马赛花园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.392258,
            31.19471
        ],
        "address": "荣华西道79号",
        "name": "金象公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.392477,
            31.194948
        ],
        "address": "荣华西道19弄1-4号",
        "name": "金龙公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.39263,
            31.19434
        ],
        "address": "荣华西道99号",
        "name": "金马公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.60739,
            31.178354
        ],
        "address": "荣科路177弄",
        "name": "张江荣科苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.192344,
            31.018105
        ],
        "address": "荣乐西路1058号",
        "name": "松江颐景园",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.24629,
            31.016795
        ],
        "address": "荣乐东路2369号",
        "name": "绿地松江商务广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.225998,
            31.016655
        ],
        "address": "荣乐西路266弄",
        "name": "维罗纳贵都",
        "count": 82,
        "style": 0
    },
    {
        "lnglat": [
            121.391772,
            31.194755
        ],
        "address": "荣华西道79弄、39弄",
        "name": "金鹿公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.203472,
            31.015098
        ],
        "address": "荣乐西路399号",
        "name": "海尚名都",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.19747,
            31.29316
        ],
        "address": "荣轩路60弄",
        "name": "君悦华庭（上海）",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.533002,
            31.240217
        ],
        "address": "乳山路505弄",
        "name": "上海滩花园洋房_南北区",
        "count": 134,
        "style": 0
    },
    {
        "lnglat": [
            121.520216,
            31.234583
        ],
        "address": "乳山路98号",
        "name": "普联大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.364366,
            31.143751
        ],
        "address": "荣谊路108弄",
        "name": "东方花园三期",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.46889,
            31.200538
        ],
        "address": "瑞金南路185弄",
        "name": "瑞南新苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.467629,
            31.204537
        ],
        "address": "瑞金南路1号",
        "name": "海兴广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.469427,
            31.198558
        ],
        "address": "瑞金南路333弄",
        "name": "名盛苑",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.469802,
            31.197207
        ],
        "address": "瑞金南路345号",
        "name": "裕兴大厦（商务楼）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.467894,
            31.198441
        ],
        "address": "瑞金南路500号",
        "name": "新视觉500",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.467559,
            31.199779
        ],
        "address": "瑞金南路458弄",
        "name": "瑞金南苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.469873,
            31.197221
        ],
        "address": "瑞金南路345弄",
        "name": "裕兴大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.467801,
            31.196855
        ],
        "address": "瑞金南路546,570号",
        "name": "双晖小区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.46947,
            31.195788
        ],
        "address": "瑞金南路628弄",
        "name": "环龙新苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.403365,
            31.018805
        ],
        "address": "瑞丽路918弄",
        "name": "海赋尚品苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.456232,
            31.180836
        ],
        "address": "瑞宁路908弄",
        "name": "保利西岸",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.584987,
            31.095645
        ],
        "address": "瑞浦路287弄-1-82号",
        "name": "桃园新城中虹佳园（中虹佳园）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.585403,
            31.098711
        ],
        "address": "瑞浦路8弄",
        "name": "桃园新城中虹佳园北区（中虹佳园北区）",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.080571,
            30.87311
        ],
        "address": "润兴路8弄",
        "name": "金山玫瑰公馆",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.704585,
            31.242803
        ],
        "address": "瑞庆路528号、胜利路836号",
        "name": "张江医疗器械园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.520617,
            31.06242
        ],
        "address": "三达路25号",
        "name": "鸣欣苑小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.49587,
            31.136116
        ],
        "address": "三林路158号",
        "name": "前滩尚博园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.506483,
            31.141318
        ],
        "address": "三林路738号",
        "name": "上海谨泛创意产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.518117,
            31.14382
        ],
        "address": "三林路1300弄",
        "name": "金色雅筑(中林苑)",
        "count": 87,
        "style": 0
    },
    {
        "lnglat": [
            121.509757,
            31.142742
        ],
        "address": "三林路1466弄1662弄",
        "name": "阳辰美景（衡辰三林苑）",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.494355,
            31.134851
        ],
        "address": "三林路88弄",
        "name": "明通文化创意产业园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.524468,
            31.071796
        ],
        "address": "三鲁公路2799号",
        "name": "禾谷文创四达园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.521687,
            31.082296
        ],
        "address": "三鲁公路3398号",
        "name": "上海国茸浦江科创园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.496028,
            31.309115
        ],
        "address": "三门路318弄",
        "name": "同济北苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.468898,
            31.31037
        ],
        "address": "三门路1266弄",
        "name": "恒大江湾华庭",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.501247,
            31.311997
        ],
        "address": "三门路333弄",
        "name": "三门路333弄（空军干部家属院）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.500172,
            31.312382
        ],
        "address": "三门路351弄",
        "name": "尊堡园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.43618,
            31.330029
        ],
        "address": "三泉路1859弄",
        "name": "宝宸怡景园",
        "count": 104,
        "style": 0
    },
    {
        "lnglat": [
            121.4374,
            31.332941
        ],
        "address": "三泉路1858弄",
        "name": "宝宸共和家园",
        "count": 72,
        "style": 0
    },
    {
        "lnglat": [
            121.185771,
            31.044395
        ],
        "address": "三新北路1333弄-1-90号",
        "name": "恒杰丁香花园",
        "count": 49,
        "style": 0
    },
    {
        "lnglat": [
            121.407577,
            31.261023
        ],
        "address": "三源路41弄",
        "name": "曹杨五月天",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.406356,
            31.261339
        ],
        "address": "三源路66弄",
        "name": "曹杨雅苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.332524,
            31.240207
        ],
        "address": "沙河路58号",
        "name": "美好中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.388523,
            31.356735
        ],
        "address": "沙浦路128弄",
        "name": "上海绿洲花园",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.341969,
            31.309687
        ],
        "address": "山连路799号",
        "name": "新天地创意园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.480297,
            31.244324
        ],
        "address": "山西北路222弄",
        "name": "联富假日公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.387126,
            31.355445
        ],
        "address": "沙浦路311弄",
        "name": "新天地荻泾花园三期",
        "count": 75,
        "style": 0
    },
    {
        "lnglat": [
            121.481428,
            31.239501
        ],
        "address": "山西南路350号(北京东路）",
        "name": "上海物资大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.444808,
            31.239794
        ],
        "address": "陕西北路1155弄",
        "name": "静安晶华园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.442594,
            31.241392
        ],
        "address": "陕西北路1283弄3号",
        "name": "宝都大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.442471,
            31.240963
        ],
        "address": "陕西北路1283弄9号",
        "name": "玉城大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.437939,
            31.245928
        ],
        "address": "陕西北路1789弄",
        "name": "都华名苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.45676,
            31.22496
        ],
        "address": "陕西北路66号",
        "name": "科恩国际中心",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.454839,
            31.228476
        ],
        "address": "陕西北路278号",
        "name": "金鹰国际购物中心(上海店)",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.462931,
            31.204656
        ],
        "address": "陕西南路333弄5号",
        "name": "联兴大厦（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450406,
            31.234316
        ],
        "address": "陕西北路688号",
        "name": "静工创意智社（智社iCommune）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.461437,
            31.20383
        ],
        "address": "陕西南路888号",
        "name": "汇景苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.510382,
            31.227911
        ],
        "address": "商城路108弄",
        "name": "汇豪天下",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.537785,
            31.237656
        ],
        "address": "商城路1900号",
        "name": "金桃大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.4576,
            31.222785
        ],
        "address": "陕西南路3号",
        "name": "城市一品苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.53906,
            31.238205
        ],
        "address": "商城路1986号",
        "name": "商城商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.539482,
            31.238293
        ],
        "address": "商城路2000号",
        "name": "宜嘉商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.510327,
            31.229434
        ],
        "address": "商城路297号",
        "name": "申金大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.510898,
            31.229468
        ],
        "address": "商城路341号",
        "name": "紫光大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.517189,
            31.230036
        ],
        "address": "商城路518号",
        "name": "内外联大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.518107,
            31.230233
        ],
        "address": "商城路618号",
        "name": "上海良友大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.518649,
            31.230572
        ],
        "address": "商城路660号",
        "name": "乐凯大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.519255,
            31.230488
        ],
        "address": "商城路738号",
        "name": "胜康廖氏大厦",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.521472,
            31.232859
        ],
        "address": "商城路889号",
        "name": "波特营园区",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.408156,
            31.313805
        ],
        "address": "上大路1号",
        "name": "文景楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.408725,
            31.313279
        ],
        "address": "上大路2弄",
        "name": "锦秀苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.33981,
            31.384714
        ],
        "address": "上海市宝山区天家路116弄",
        "name": "美罗家园宝欣苑七村",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.486611,
            31.239484
        ],
        "address": "上海黄浦区宁波路1号",
        "name": "申华金融大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.33786,
            31.384072
        ],
        "address": "上海市宝山区天家路200弄",
        "name": "美罗家园宝欣苑五村",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.33859,
            31.382569
        ],
        "address": "上海市宝山区天家路199弄",
        "name": "美罗家园宝欣苑六村",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.340548,
            31.383253
        ],
        "address": "上海市宝山区天家路99弄",
        "name": "美罗家园宝欣苑八村",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.486303,
            31.298842
        ],
        "address": "上海市虹口区逸仙路288弄",
        "name": "逸虹景苑(上海)",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.428977,
            31.233395
        ],
        "address": "上海市普陀区武宁路19号",
        "name": "丽晶阳光大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.912955,
            30.864608
        ],
        "address": "上海市浦东新区海洋四路99弄1-35号",
        "name": "智菁科技中心创新魔方一期",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.615393,
            31.315836
        ],
        "address": "上海外高桥保税区港澳路239号",
        "name": "兴江国贸大楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.495052,
            31.170038
        ],
        "address": "上南路1500弄",
        "name": "城建公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.497263,
            31.166859
        ],
        "address": "上南路2779号",
        "name": "大桥海达楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.497535,
            31.165364
        ],
        "address": "上南路2985号",
        "name": "海宏大厦（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.504159,
            31.155069
        ],
        "address": "上南路3521号",
        "name": "宝丰生活广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.507192,
            31.151241
        ],
        "address": "上南路3855号",
        "name": "如日商务园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.443508,
            31.13924
        ],
        "address": "上中路303号",
        "name": "万街303创意园区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.447756,
            31.141162
        ],
        "address": "上中路479号",
        "name": "上中路483弄（479弄）商办楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.448449,
            31.141468
        ],
        "address": "上中路495号",
        "name": "汇达商务园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.547698,
            31.117239
        ],
        "address": "上南路6500弄",
        "name": "阳光城丽景湾PLUS",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.433992,
            31.135034
        ],
        "address": "上中路51弄",
        "name": "书香逸居",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.516656,
            31.146457
        ],
        "address": "尚博路366弄",
        "name": "湾流域三期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.437801,
            31.137013
        ],
        "address": "上中路55弄",
        "name": "长桥一村",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.519372,
            31.148597
        ],
        "address": "尚博路518弄",
        "name": "湾流域一期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.519158,
            31.149194
        ],
        "address": "尚博路569弄",
        "name": "湾流域二期",
        "count": 103,
        "style": 0
    },
    {
        "lnglat": [
            121.523173,
            31.149547
        ],
        "address": "尚博路650弄",
        "name": "金橘新苑南区",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.524708,
            31.151032
        ],
        "address": "尚博路799弄",
        "name": "金橘新苑北区",
        "count": 101,
        "style": 0
    },
    {
        "lnglat": [
            121.490566,
            31.215105
        ],
        "address": "尚文路168号",
        "name": "东波大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.49028,
            31.215441
        ],
        "address": "尚文路185号",
        "name": "平利大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.490346,
            31.215222
        ],
        "address": "尚文路198号",
        "name": "中华大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.452135,
            31.037731
        ],
        "address": "尚义路39弄2号",
        "name": "吴泾宝龙中心（一期）",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.451152,
            31.041109
        ],
        "address": "尚义路91号",
        "name": "吴泾宝龙中心（二期）",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.431066,
            31.299841
        ],
        "address": "少年村路479弄",
        "name": "白玉兰馨园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.428566,
            31.299414
        ],
        "address": "少年村路451弄68号",
        "name": "景和创意园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.384508,
            31.091734
        ],
        "address": "申北路168弄",
        "name": "正峰苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.30937,
            31.19412
        ],
        "address": "申滨路9号",
        "name": "九星虹桥商务中心",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.312787,
            31.191794
        ],
        "address": "申滨南路1126号",
        "name": "龙湖虹桥天街",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.923841,
            30.898233
        ],
        "address": "申港大道158号",
        "name": "昊坤国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.343953,
            31.066326
        ],
        "address": "申港路660号",
        "name": "科溢智慧园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.317077,
            31.21318
        ],
        "address": "申虹路1188弄",
        "name": "恒基旭辉中心",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.315489,
            31.201745
        ],
        "address": "申虹路663号",
        "name": "虹桥协信中心",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.316759,
            31.203082
        ],
        "address": "申虹路666弄",
        "name": "正荣中心",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.316231,
            31.209015
        ],
        "address": "申虹路988弄",
        "name": "虹桥富力悦都商办区域",
        "count": 53,
        "style": 0
    },
    {
        "lnglat": [
            121.626327,
            31.209205
        ],
        "address": "申江路5005弄",
        "name": "星创科技广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.32396,
            31.205828
        ],
        "address": "申昆路1999号",
        "name": "长三角电子商务中心",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.395011,
            31.077826
        ],
        "address": "申南路59弄",
        "name": "凯龙莘庄商务园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.374667,
            31.081267
        ],
        "address": "申旺路789号",
        "name": "慧高光创园(光创园)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.315007,
            31.208548
        ],
        "address": "申长路1466弄",
        "name": "虹桥富力中心",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.31315,
            31.210894
        ],
        "address": "申长路1588弄1号楼",
        "name": "虹桥平安财富中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.31965,
            31.184066
        ],
        "address": "申长路288弄",
        "name": "隆视广场",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.313081,
            31.202847
        ],
        "address": "申长路519号",
        "name": "上海富力环球中心",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.313342,
            31.192178
        ],
        "address": "申长路869号",
        "name": "孩子王(上海虹桥天街店)",
        "count": 87,
        "style": 0
    },
    {
        "lnglat": [
            121.315383,
            31.196671
        ],
        "address": "申长路988号",
        "name": "虹桥万科中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.311372,
            31.203531
        ],
        "address": "申郑路18弄",
        "name": "万科时一区一期(虹桥万科润园)",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.379566,
            31.10716
        ],
        "address": "莘浜路10弄2号",
        "name": "上海银星大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.36132,
            31.107031
        ],
        "address": "莘福路388号",
        "name": "莘东置业大厦",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.376515,
            31.109704
        ],
        "address": "莘东路298弄",
        "name": "东苑世纪茗苑(世纪茗苑)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.38493,
            31.112769
        ],
        "address": "莘建东路198弄",
        "name": "地铁明珠苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.387155,
            31.115858
        ],
        "address": "莘建东路58号",
        "name": "绿地科技岛",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.710112,
            31.058981
        ],
        "address": "莘建东路388 399弄",
        "name": "众众家园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.378919,
            31.106242
        ],
        "address": "莘松路380号",
        "name": "智慧园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.364555,
            31.098832
        ],
        "address": "莘松路855号",
        "name": "青春商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.36333,
            31.131733
        ],
        "address": "莘松路958弄",
        "name": "上海康城三期",
        "count": 144,
        "style": 0
    },
    {
        "lnglat": [
            121.36333,
            31.131733
        ],
        "address": "莘松路958弄大浪湾道",
        "name": "上海康城四期",
        "count": 142,
        "style": 0
    },
    {
        "lnglat": [
            121.36333,
            31.131733
        ],
        "address": "莘松路958弄三林道89号",
        "name": "上海康城二期",
        "count": 119,
        "style": 0
    },
    {
        "lnglat": [
            121.35878,
            31.103881
        ],
        "address": "莘松路980弄",
        "name": "上海康城一期",
        "count": 83,
        "style": 0
    },
    {
        "lnglat": [
            121.425311,
            31.123505
        ],
        "address": "莘朱路2111弄1-7号",
        "name": "朱莘苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.39598,
            31.113963
        ],
        "address": "莘朱路718弄",
        "name": "莘东两湾苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.396047,
            31.111894
        ],
        "address": "莘朱路695号",
        "name": "莘南综合楼(稷下商务中心)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.51456,
            31.0608
        ],
        "address": "沈杜公路3872弄",
        "name": "显贵商务楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.514171,
            31.061253
        ],
        "address": "沈杜公路3872弄4号楼",
        "name": "上海节能环保科技孵化基地",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.513586,
            31.059913
        ],
        "address": "沈杜公路4285号",
        "name": "程文商务中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.578475,
            31.084228
        ],
        "address": "沈杜路118号",
        "name": "118空间",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.57774,
            31.091534
        ],
        "address": "沈梅路99号",
        "name": "智慧产业园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.534641,
            31.261151
        ],
        "address": "沈阳路123弄",
        "name": "华谊星城名苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.251417,
            31.093107
        ],
        "address": "沈砖公路5599号",
        "name": "伟凯科技产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.260811,
            31.091215
        ],
        "address": "沈砖公路6000号",
        "name": "创异工房",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.310176,
            31.103905
        ],
        "address": "盛富路490号",
        "name": "佳钢科创园_盛富路",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.104805,
            31.182995
        ],
        "address": "胜利路1680号",
        "name": "联东U谷青浦国际企业港",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.269797,
            31.406195
        ],
        "address": "胜竹路1364号（双坪路285弄）",
        "name": "景悦名苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.606302,
            31.170751
        ],
        "address": "盛荣路188弄",
        "name": "盛大天地创意中心一期（青春里）",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.605796,
            31.169961
        ],
        "address": "盛荣路288弄",
        "name": "盛大天地创意中心二期（青春里）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.628652,
            31.209524
        ],
        "address": "盛夏路500弄",
        "name": "张江光大园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.628536,
            31.208356
        ],
        "address": "盛夏路570号",
        "name": "盛夏路570号大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.626499,
            31.208394
        ],
        "address": "盛夏路560号",
        "name": "盛夏路560号大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.62884,
            31.20564
        ],
        "address": "盛夏路666号",
        "name": "普洛斯盛银大厦(上投盛银大厦)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.751147,
            31.151512
        ],
        "address": "施湾航城三路518弄",
        "name": "东亚启航公馆",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.4418,
            31.156129
        ],
        "address": "石龙路329号",
        "name": "智慧谷(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.440912,
            31.153004
        ],
        "address": "石龙路345弄28号",
        "name": "大树下创意空间",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.436154,
            31.153812
        ],
        "address": "石龙路569号",
        "name": "S569园区",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.440782,
            31.155242
        ],
        "address": "石龙路345弄3号",
        "name": "杰初智园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.433628,
            31.152773
        ],
        "address": "石龙路666号",
        "name": "上海长途客运南站",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.4311,
            31.14816
        ],
        "address": "石龙路951号",
        "name": "美通科创空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.428571,
            31.147904
        ],
        "address": "石龙路980弄",
        "name": "麦克花园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.429459,
            31.147378
        ],
        "address": "石龙路999弄",
        "name": "汇京佳丽园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.459363,
            31.236018
        ],
        "address": "石门二路333弄3号",
        "name": "振安广场_恒安大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.460762,
            31.235245
        ],
        "address": "石门二路258号",
        "name": "现代建筑设计大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.458292,
            31.2375
        ],
        "address": "石门二路503号",
        "name": "恒丰大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.463274,
            31.226597
        ],
        "address": "石门一路116号",
        "name": "中邦艾格美国际公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.462189,
            31.227868
        ],
        "address": "石门一路211号",
        "name": "旺旺大厦(上海)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.43516,
            31.255613
        ],
        "address": "石泉东路168弄",
        "name": "香溢花城",
        "count": 98,
        "style": 0
    },
    {
        "lnglat": [
            121.432932,
            31.254204
        ],
        "address": "石泉东路215号",
        "name": "香溢花城三期",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.429154,
            31.252267
        ],
        "address": "石泉路49弄1号",
        "name": "石泉大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.416716,
            31.247449
        ],
        "address": "石泉路450弄",
        "name": "宁泉新苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.41326,
            31.22976
        ],
        "address": "石湾路7弄51号101室",
        "name": "康泰公寓（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.520144,
            31.230322
        ],
        "address": "世纪大道1090号",
        "name": "斯米克大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.533524,
            31.223802
        ],
        "address": "世纪大道1568号",
        "name": "中建大厦（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.532613,
            31.224865
        ],
        "address": "世纪大道1500号",
        "name": "东方大厦（上海）",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.528238,
            31.22708
        ],
        "address": "世纪大道1198号",
        "name": "上海世纪汇广场",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.535107,
            31.224889
        ],
        "address": "世纪大道1589号",
        "name": "长泰国际金融大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.534527,
            31.223638
        ],
        "address": "世纪大道1600号",
        "name": "陆家嘴商务广场（浦项商务广场）",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.508405,
            31.23479
        ],
        "address": "世纪大道160号",
        "name": "览海国际广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.536126,
            31.224405
        ],
        "address": "世纪大道1701号",
        "name": "中国钻石交易中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.509842,
            31.235819
        ],
        "address": "世纪大道201号",
        "name": "渣打银行大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.505476,
            31.235345
        ],
        "address": "世纪大道88号",
        "name": "金茂大厦",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.509859,
            31.234281
        ],
        "address": "世纪大道210号",
        "name": "上海二十一世纪中心大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.510627,
            31.235526
        ],
        "address": "世纪大道211号",
        "name": "上海信息大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.525606,
            31.321968
        ],
        "address": "世界路133号",
        "name": "133绿源天地广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.52414,
            31.316209
        ],
        "address": "世界路15弄",
        "name": "明丰阳光苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.517471,
            31.318151
        ],
        "address": "市光路390号",
        "name": "盛世豪园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.349402,
            31.31851
        ],
        "address": "市台路555弄",
        "name": "金地宝山艺境城",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.541396,
            31.316532
        ],
        "address": "市光二村103-106号",
        "name": "新钢大楼(市光二村)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.585964,
            31.272589
        ],
        "address": "寿光路78弄",
        "name": "江南山水",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.458187,
            31.296349
        ],
        "address": "寿阳路99弄27号",
        "name": "上勤大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.375334,
            31.122475
        ],
        "address": "疏影路1098弄",
        "name": "林水美地苑商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.259186,
            31.409478
        ],
        "address": "树屏路588弄",
        "name": "财智金岸",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450353,
            31.093659
        ],
        "address": "双柏路518号",
        "name": "双柏工业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.262346,
            31.330755
        ],
        "address": "双单路889弄",
        "name": "臻品嘉园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.485255,
            31.389031
        ],
        "address": "双城路803弄",
        "name": "宝莲城",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.27375,
            31.1925
        ],
        "address": "双联路88号",
        "name": "三银基金产业园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.380898,
            31.215118
        ],
        "address": "双流路188弄",
        "name": "宝地新品居",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.197834,
            31.292868
        ],
        "address": "双浦路70弄",
        "name": "花香澜庭",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.525575,
            31.294401
        ],
        "address": "双阳北路288号",
        "name": "黄兴花园",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.526055,
            31.297524
        ],
        "address": "双阳北路395号",
        "name": "香阁丽苑",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.269892,
            31.405532
        ],
        "address": "双坪路185弄",
        "name": "旭辉锦庭",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.535624,
            31.273522
        ],
        "address": "双阳路300弄",
        "name": "幸福苑(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.534019,
            31.279062
        ],
        "address": "双阳路365号",
        "name": "海林大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.530476,
            31.283574
        ],
        "address": "双阳路490弄",
        "name": "万昌大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.535667,
            31.2726
        ],
        "address": "双阳路50弄",
        "name": "双阳路50弄",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.446938,
            31.367987
        ],
        "address": "水产路2289号",
        "name": "壹间宝山花园城",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.440994,
            31.360209
        ],
        "address": "水产路2700弄",
        "name": "康桥水都第三街区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.44513,
            31.367086
        ],
        "address": "水产路2399号",
        "name": "泰富商业广场（上海）",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.409803,
            31.354575
        ],
        "address": "水产西路999弄1-57号",
        "name": "自然居家园",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.418423,
            31.356392
        ],
        "address": "水产西路680弄",
        "name": "绿地宝里",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.39088,
            31.211929
        ],
        "address": "水城路675号",
        "name": "怡乐公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.391478,
            31.20978
        ],
        "address": "水城路468弄",
        "name": "五洲大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.393628,
            31.193956
        ],
        "address": "水城南路17号",
        "name": "万科广场17号",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.396334,
            31.192776
        ],
        "address": "水城南路16弄",
        "name": "四季晶园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.393015,
            31.197871
        ],
        "address": "水城南路348弄",
        "name": "金麟公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.393422,
            31.194658
        ],
        "address": "水城南路37号",
        "name": "万科广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.3929,
            31.196564
        ],
        "address": "水城南路55号",
        "name": "六月汇",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.392924,
            31.196604
        ],
        "address": "水城南路59号",
        "name": "明珠大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.476075,
            31.296563
        ],
        "address": "水电路1412号",
        "name": "凉城地区中心办公楼(虹口图书馆)",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.475249,
            31.283082
        ],
        "address": "水电路682号",
        "name": "天虹商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.475589,
            31.276788
        ],
        "address": "水电路393弄1.2号",
        "name": "吉联大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.476034,
            31.283727
        ],
        "address": "水电路688号",
        "name": "天虹国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.381301,
            31.117135
        ],
        "address": "水清路378弄25支弄",
        "name": "水清二村",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.542627,
            31.279821
        ],
        "address": "水丰路15弄",
        "name": "帆升公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.375115,
            31.12672
        ],
        "address": "水清路999弄",
        "name": "香树丽舍(上海)",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.403139,
            31.267657
        ],
        "address": "水泉路88弄",
        "name": "达安春之声一期",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.402182,
            31.267469
        ],
        "address": "水泉路99弄",
        "name": "达安春之声花园二期",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.476624,
            31.221347
        ],
        "address": "顺昌路10号",
        "name": "经纬公寓（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.459997,
            31.238145
        ],
        "address": "顺德路92号",
        "name": "顺德苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.326275,
            31.321367
        ],
        "address": "顺达路938号",
        "name": "上海南翔游戏产业园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.278418,
            31.408189
        ],
        "address": "顺宁路501弄、启宁路421弄、胜竹东路3850弄、胜竹东路3870弄",
        "name": "佳兆业城市广场(上海)",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.329049,
            31.327848
        ],
        "address": "顺丰路508号",
        "name": "精品人才公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.417634,
            31.230658
        ],
        "address": "顺义路188号",
        "name": "顺达公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.48471,
            31.25146
        ],
        "address": "四川北路1318号",
        "name": "上海盛邦国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.48471,
            31.25293
        ],
        "address": "四川北路1350号",
        "name": "利通广场",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.483697,
            31.252558
        ],
        "address": "四川北路1363号及1361号",
        "name": "壹丰广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.483762,
            31.255065
        ],
        "address": "四川北路1500号",
        "name": "叶大昌商厦(上海投资组合中心大厦)",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.482557,
            31.257354
        ],
        "address": "四川北路1611号",
        "name": "凯润金城商务楼",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.482114,
            31.257374
        ],
        "address": "四川北路1661号",
        "name": "凯润金城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.483303,
            31.25821
        ],
        "address": "四川北路1688号",
        "name": "福德商务中心",
        "count": 70,
        "style": 0
    },
    {
        "lnglat": [
            121.482567,
            31.25871
        ],
        "address": "四川北路1717号",
        "name": "嘉杰国际广场(办公楼)",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.482326,
            31.258453
        ],
        "address": "四川北路1727弄",
        "name": "嘉杰国际(住宅楼)",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.483512,
            31.2619
        ],
        "address": "四川北路1885号",
        "name": "明猷商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.483444,
            31.261413
        ],
        "address": "四川北路1851号",
        "name": "荣欣大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.483563,
            31.262222
        ],
        "address": "四川北路1915号",
        "name": "上海时装商厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.483753,
            31.262544
        ],
        "address": "四川北路1941号",
        "name": "金海岸商厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.481475,
            31.265043
        ],
        "address": "四川北路2115号",
        "name": "方舟大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.481487,
            31.268544
        ],
        "address": "四川北路2261-2263号",
        "name": "嘉兰大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.485007,
            31.246761
        ],
        "address": "四川北路525号",
        "name": "宇航大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.484166,
            31.24839
        ],
        "address": "四川北路859号",
        "name": "上海中信广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.485239,
            31.249561
        ],
        "address": "四川北路888号",
        "name": "海泰国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.488095,
            31.236126
        ],
        "address": "四川中路213号",
        "name": "久事商务大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.488406,
            31.237622
        ],
        "address": "四川中路320号",
        "name": "安利大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.487854,
            31.237718
        ],
        "address": "四川中路321号",
        "name": "中央大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.491407,
            31.267561
        ],
        "address": "四达路58弄",
        "name": "世博花园",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.504053,
            31.278319
        ],
        "address": "四平路1147弄1、8、9号",
        "name": "伊顿公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.504516,
            31.277951
        ],
        "address": "四平路1188号",
        "name": "远洋广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.506032,
            31.280045
        ],
        "address": "四平路1230弄甲",
        "name": "通华小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.507312,
            31.281404
        ],
        "address": "四平路1388号",
        "name": "同济联合广场",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.490634,
            31.262315
        ],
        "address": "四平路188号",
        "name": "上海商贸大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.491239,
            31.262828
        ],
        "address": "四平路200号",
        "name": "盛泰国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.490865,
            31.263569
        ],
        "address": "四平路210号",
        "name": "家纺大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.491335,
            31.264406
        ],
        "address": "四平路228号",
        "name": "大世界商务大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.51371,
            31.29469
        ],
        "address": "四平路2158号",
        "name": "富庆国定大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.514556,
            31.298281
        ],
        "address": "四平路2500弄",
        "name": "金岛大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.51581,
            31.298613
        ],
        "address": "四平路2500号",
        "name": "悠迈生活广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.489001,
            31.261741
        ],
        "address": "四平路257号",
        "name": "永融企业中心",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.489493,
            31.262511
        ],
        "address": "四平路277号",
        "name": "福龙大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.492446,
            31.267574
        ],
        "address": "四平路415号（四达路58弄靠近世博花园）",
        "name": "馥敦坊",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.490888,
            31.265184
        ],
        "address": "四平路311号",
        "name": "恒城花苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.493296,
            31.266706
        ],
        "address": "四平路460弄",
        "name": "新陆花苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.498866,
            31.271043
        ],
        "address": "四平路758弄",
        "name": "金轩大邸",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.496247,
            31.270586
        ],
        "address": "四平路623号",
        "name": "新宏大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.498735,
            31.272763
        ],
        "address": "四平路775弄",
        "name": "天宝华庭",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.499189,
            31.27226
        ],
        "address": "四平路778号",
        "name": "盛业大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.48927,
            31.2588
        ],
        "address": "四平路96号",
        "name": "金融街海伦中心",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.254467,
            31.113856
        ],
        "address": "泗凤公路508弄",
        "name": "金地自在城三期",
        "count": 118,
        "style": 0
    },
    {
        "lnglat": [
            121.232482,
            31.109778
        ],
        "address": "泗凤公路1718弄1-22号",
        "name": "新凯城丹桂苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.234239,
            31.112694
        ],
        "address": "泗凯路291弄1-18号",
        "name": "新凯城锦昌苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.237459,
            31.10994
        ],
        "address": "泗凤公路1500弄",
        "name": "新凯城玉兰苑",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.237127,
            31.112593
        ],
        "address": "泗凯路415弄",
        "name": "新凯城钟秀苑",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.2561,
            31.117228
        ],
        "address": "泗通路246号",
        "name": "嘉南红塔大厦",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.255992,
            31.125963
        ],
        "address": "泗通路688弄",
        "name": "万业名苑",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.250525,
            31.118872
        ],
        "address": "泗祥路518弄",
        "name": "金地自在城二期",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.284149,
            31.102093
        ],
        "address": "泗砖路269弄",
        "name": "唯富科技产业园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.283451,
            31.100101
        ],
        "address": "泗砖路600号",
        "name": "松江钢材城南区园区",
        "count": 61,
        "style": 0
    },
    {
        "lnglat": [
            121.539193,
            31.294839
        ],
        "address": "松花江路205弄",
        "name": "松花江路205弄小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.499286,
            31.290526
        ],
        "address": "松花江路2539号",
        "name": "复旦科技园创业大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.540373,
            31.29121
        ],
        "address": "松花江路251弄",
        "name": "白玉兰广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.53832,
            31.294085
        ],
        "address": "松花江路215弄",
        "name": "延吉大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.498949,
            31.29258
        ],
        "address": "松花江路2628号",
        "name": "冠寓_复旦大学店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.534507,
            31.291724
        ],
        "address": "松花江路287号",
        "name": "伊格尔公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.533439,
            31.291362
        ],
        "address": "松花江路311-319号",
        "name": "松益公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.229779,
            31.004551
        ],
        "address": "松汇中路758弄",
        "name": "醉白景苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.530854,
            31.232437
        ],
        "address": "松林路111号",
        "name": "海怡花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.318208,
            31.110158
        ],
        "address": "松江区同利路2-4号",
        "name": "福贵诚工业园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.533983,
            31.227255
        ],
        "address": "松林路283-287号",
        "name": "新港大厦(松林路)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.53131,
            31.233583
        ],
        "address": "松林路97弄",
        "name": "海怡别墅",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.27659,
            31.023094
        ],
        "address": "松胜路758号",
        "name": "松胜路758号商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.25993,
            31.028857
        ],
        "address": "松卫北路280号",
        "name": "凯富家园广场5号楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.261823,
            31.02315
        ],
        "address": "松卫北路665号",
        "name": "企福天地",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.26116,
            31.03013
        ],
        "address": "松卫北路295号",
        "name": "上海陆国时代商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.494378,
            31.371445
        ],
        "address": "凇桥东路111号",
        "name": "021联和滨江大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.16609,
            31.183126
        ],
        "address": "崧复路1999号",
        "name": "奥帛科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.193239,
            31.196699
        ],
        "address": "崧建路339弄",
        "name": "佳兆业君汇上品（上海）",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.160143,
            31.139232
        ],
        "address": "崧涟二路66弄",
        "name": "昱翠雅苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.158765,
            31.14446
        ],
        "address": "崧润路49弄",
        "name": "德康雅苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.1601,
            31.158461
        ],
        "address": "崧润路800弄",
        "name": "逸泰雅苑二期",
        "count": 96,
        "style": 0
    },
    {
        "lnglat": [
            121.302144,
            31.189984
        ],
        "address": "崧泽大道333号",
        "name": "国家会展中心(上海)",
        "count": 118,
        "style": 0
    },
    {
        "lnglat": [
            121.176406,
            31.174568
        ],
        "address": "崧泽大道6555号",
        "name": "奥帛置业大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.173377,
            31.174377
        ],
        "address": "崧泽大道6699号",
        "name": "百丽商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.085304,
            31.143106
        ],
        "address": "崧子浦路55弄",
        "name": "顾会庭",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.500926,
            31.380459
        ],
        "address": "淞宝路155弄",
        "name": "星月国际商务广场",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.498407,
            31.344056
        ],
        "address": "淞发路25弄",
        "name": "鎏园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.084075,
            31.145467
        ],
        "address": "崧子浦路289弄",
        "name": "崧子苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.490386,
            31.341801
        ],
        "address": "淞发路500弄",
        "name": "万临家园",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.487245,
            31.342729
        ],
        "address": "淞发路901弄",
        "name": "祥腾生活广场之公寓楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.361951,
            31.221762
        ],
        "address": "淞虹路128弄",
        "name": "金淞家园",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.513262,
            31.303334
        ],
        "address": "淞沪路161号",
        "name": "中环国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.514543,
            31.300769
        ],
        "address": "淞沪路1号",
        "name": "巴黎春天(五角场店)",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.362397,
            31.205702
        ],
        "address": "淞虹路855弄",
        "name": "郁庭峰",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.512897,
            31.307515
        ],
        "address": "淞沪路388号",
        "name": "创智天地",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.514851,
            31.302908
        ],
        "address": "淞沪路98号",
        "name": "平盛大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.482313,
            31.34296
        ],
        "address": "淞肇路333弄",
        "name": "新城尚景苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.413986,
            31.191494
        ],
        "address": "宋园路62号",
        "name": "开城大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.412865,
            31.191582
        ],
        "address": "宋园路69号",
        "name": "圣美邸",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.414251,
            31.191596
        ],
        "address": "宋园路62弄",
        "name": "开城公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.49319,
            31.33951
        ],
        "address": "淞良路99弄",
        "name": "盛世宝邸二期",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.391879,
            31.359847
        ],
        "address": "苏家浜路435弄",
        "name": "宝顾佳苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.368909,
            31.268863
        ],
        "address": "绥德路470弄128号",
        "name": "海天下集团",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.36121,
            31.266057
        ],
        "address": "绥德路889弄",
        "name": "3点3万小区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.239114,
            31.373482
        ],
        "address": "塔城路718弄",
        "name": "金地格林春岸",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.272224,
            31.391747
        ],
        "address": "塔城东路288弄",
        "name": "嘉贤庄",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.596136,
            31.254737
        ],
        "address": "台儿庄路666弄",
        "name": "金桥名都",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.606509,
            31.315874
        ],
        "address": "台中南路2号",
        "name": "新贸楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.608425,
            31.315426
        ],
        "address": "台中南路68号",
        "name": "远洋洲海大厦",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.473636,
            31.220713
        ],
        "address": "太仓路233号",
        "name": "新茂大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.460743,
            31.249194
        ],
        "address": "太阳山路188弄",
        "name": "中海万锦城二_三期",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.457036,
            31.203839
        ],
        "address": "太原路289弄",
        "name": "太原邸",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.603441,
            31.335345
        ],
        "address": "泰谷路168号",
        "name": "烨博智慧园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.600727,
            31.333559
        ],
        "address": "泰谷路85号",
        "name": "永富大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.607023,
            31.336902
        ],
        "address": "泰谷路239号",
        "name": "天啸大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.469026,
            31.208484
        ],
        "address": "泰康路210弄",
        "name": "田子坊5号楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.43861,
            31.35558
        ],
        "address": "泰和路2038号",
        "name": "北外环信息产业园(北上海创意港）",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.603487,
            31.33466
        ],
        "address": "泰谷路169号",
        "name": "华源国际大厦(上海)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.56734,
            30.984166
        ],
        "address": "泰青公路119弄128支弄1-16号",
        "name": "申亚翠庭",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.25233,
            31.312045
        ],
        "address": "泰涛路55号",
        "name": "晨日产业园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.456377,
            31.236129
        ],
        "address": "泰兴路555号",
        "name": "武泰公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.422065,
            31.234387
        ],
        "address": "谈家渡路28号",
        "name": "盛泉大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.51196,
            31.261349
        ],
        "address": "唐山路1018号",
        "name": "宝地广场",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.508401,
            31.259527
        ],
        "address": "唐山路835弄",
        "name": "家化公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.455942,
            31.236709
        ],
        "address": "泰兴路625弄",
        "name": "泰府名邸",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.509084,
            31.259901
        ],
        "address": "唐山路921号",
        "name": "木材大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.486169,
            31.248082
        ],
        "address": "塘沽路463号",
        "name": "虹口科技金融大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.24595,
            31.090508
        ],
        "address": "塘浚路51弄",
        "name": "塘和家园齐康苑",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.479424,
            31.246049
        ],
        "address": "塘沽路835号",
        "name": "万豪公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.390062,
            31.329991
        ],
        "address": "塘祁路677-679弄",
        "name": "保利叶之林三期",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.376092,
            31.325783
        ],
        "address": "塘祁路577弄",
        "name": "保利叶之林二期",
        "count": 53,
        "style": 0
    },
    {
        "lnglat": [
            121.51819,
            31.210916
        ],
        "address": "塘桥路400弄",
        "name": "新塘桥生活广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.515846,
            31.211279
        ],
        "address": "塘桥新路201弄",
        "name": "东方天伦大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.533617,
            31.243525
        ],
        "address": "桃林路18号",
        "name": "环球广场",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.53882,
            31.23366
        ],
        "address": "桃林路777号",
        "name": "鄂尔多斯艾力（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.399982,
            31.26046
        ],
        "address": "桃浦路165弄",
        "name": "嘉发公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.542775,
            31.226639
        ],
        "address": "桃林路1141弄",
        "name": "新天家园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.396743,
            31.260457
        ],
        "address": "桃浦路226号",
        "name": "泊寓上海西站店",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.395482,
            31.260553
        ],
        "address": "桃浦路296号",
        "name": "星河世纪广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.478971,
            31.223886
        ],
        "address": "桃源路111弄",
        "name": "淮海晶华苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.49918,
            31.268289
        ],
        "address": "天宝路558号",
        "name": "中信和平家园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.500643,
            31.272531
        ],
        "address": "天宝路900号",
        "name": "天宝创业空间",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.497336,
            31.262398
        ],
        "address": "天宝路181弄",
        "name": "瑞虹新城 铭庭",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.429444,
            31.133212
        ],
        "address": "天等路128弄",
        "name": "明秀公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.427605,
            31.137238
        ],
        "address": "天等路400号(近丹棱路)",
        "name": "品域凌云里",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.482699,
            31.238336
        ],
        "address": "天津路180号",
        "name": "应氏大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.457642,
            31.246407
        ],
        "address": "天目西路111号",
        "name": "慧空间(长三角乡村振兴联合服务平台)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.456919,
            31.245138
        ],
        "address": "天目西路218号",
        "name": "嘉里不夜城一期",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.455528,
            31.245629
        ],
        "address": "天目西路290号",
        "name": "康吉大厦（市政楼）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.451479,
            31.246208
        ],
        "address": "天目西路511号",
        "name": "外贸锦程大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.468441,
            31.24547
        ],
        "address": "天目中路353号",
        "name": "万佳商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.467995,
            31.245217
        ],
        "address": "天目中路363号",
        "name": "万佳商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.467167,
            31.243829
        ],
        "address": "天目中路428号",
        "name": "凯旋门大厦（上海）",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.468034,
            31.244593
        ],
        "address": "天目中路380号",
        "name": "北方大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.464557,
            31.242949
        ],
        "address": "天目中路538弄1号",
        "name": "北苑大厦(538弄1号)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.465258,
            31.243994
        ],
        "address": "天目中路520号",
        "name": "北苑大厦(520号)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.464084,
            31.245141
        ],
        "address": "天目中路585号",
        "name": "新梅大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.462027,
            31.247275
        ],
        "address": "天目中路749弄71号",
        "name": "海鸥康恒大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.366355,
            31.000523
        ],
        "address": "天宁路51号",
        "name": "福缘集团园区",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.382346,
            31.214436
        ],
        "address": "天山路177弄",
        "name": "南洋新都",
        "count": 75,
        "style": 0
    },
    {
        "lnglat": [
            121.406849,
            31.210223
        ],
        "address": "天山路1111号",
        "name": "鼎天商务公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.411457,
            31.209342
        ],
        "address": "天山路1855号",
        "name": "联业大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.408762,
            31.210843
        ],
        "address": "天山路1718号",
        "name": "上海时尚园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.383501,
            31.215107
        ],
        "address": "天山路209弄",
        "name": "天山中华园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.413417,
            31.209057
        ],
        "address": "天山路1890弄",
        "name": "老干部新苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.383711,
            31.215768
        ],
        "address": "天山路288弄",
        "name": "海逸公寓",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.379106,
            31.216254
        ],
        "address": "天山路30号",
        "name": "天山大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.38715,
            31.215222
        ],
        "address": "天山路338号",
        "name": "衡辰酒店式公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.388437,
            31.214069
        ],
        "address": "天山路345号",
        "name": "缤谷文化休闲广场东座",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.386859,
            31.21436
        ],
        "address": "天山路341号",
        "name": "缤谷文化休闲广场西座",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.396493,
            31.213305
        ],
        "address": "天山路600弄1号",
        "name": "同达创业大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.396493,
            31.213305
        ],
        "address": "天山路600弄",
        "name": "思创大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.397219,
            31.213349
        ],
        "address": "天山路600弄2号",
        "name": "新虹桥捷运大厦",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.394835,
            31.212569
        ],
        "address": "天山路641号",
        "name": "慧谷白猫科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.38029,
            31.21594
        ],
        "address": "天山路88号",
        "name": "元丰天山花园",
        "count": 142,
        "style": 0
    },
    {
        "lnglat": [
            121.405071,
            31.211507
        ],
        "address": "天山路900号",
        "name": "汇金百货虹桥店",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.360831,
            31.21788
        ],
        "address": "天山西路541号",
        "name": "光大安石虹桥中心",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.356699,
            31.21787
        ],
        "address": "天山西路567号",
        "name": "神州智慧天地",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.360414,
            31.219006
        ],
        "address": "天山西路568号",
        "name": "统一梦时代大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.37496,
            31.216119
        ],
        "address": "天山西路125号",
        "name": "宜嘉坊",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.355286,
            31.218004
        ],
        "address": "天山西路789号",
        "name": "中山国际广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.397146,
            31.215408
        ],
        "address": "天山支路138弄",
        "name": "嘉平商务楼",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.396306,
            31.215204
        ],
        "address": "天山支路168弄",
        "name": "虹桥电子时代广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.396065,
            31.213609
        ],
        "address": "天山支路201号",
        "name": "长宁科技大楼",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.490349,
            31.245651
        ],
        "address": "天潼路133号",
        "name": "上海家化金融大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.613475,
            31.104512
        ],
        "address": "天雄路588弄",
        "name": "医谷现代商务园一期",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.442024,
            31.192405
        ],
        "address": "天钥桥路123号",
        "name": "城开YOYO联合办公",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.440986,
            31.190998
        ],
        "address": "天钥桥路180弄8号",
        "name": "南馨公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.441308,
            31.19127
        ],
        "address": "天钥桥路180弄",
        "name": "徐家汇馆(华狮国际公寓)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.440325,
            31.193783
        ],
        "address": "天钥桥路20号",
        "name": "T20(百胜集团大楼)",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.442605,
            31.191128
        ],
        "address": "天钥桥路191弄",
        "name": "南天大楼",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.442068,
            31.190688
        ],
        "address": "天钥桥路218号",
        "name": "华狮国际公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.440596,
            31.193039
        ],
        "address": "天钥桥路30号",
        "name": "美罗大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.442619,
            31.189382
        ],
        "address": "天钥桥路321号",
        "name": "天和苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.442464,
            31.188053
        ],
        "address": "天钥桥路333号",
        "name": "上海腾飞大厦",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.438791,
            31.187274
        ],
        "address": "天钥桥路380弄20-28号",
        "name": "天钥花苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.443039,
            31.188897
        ],
        "address": "天钥桥路325号",
        "name": "嘉汇国际广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.439064,
            31.187696
        ],
        "address": "天钥桥路380弄36号37号",
        "name": "南溪公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.441939,
            31.187218
        ],
        "address": "天钥桥路438号，458号",
        "name": "申峰大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.442099,
            31.186087
        ],
        "address": "天钥桥路500弄",
        "name": "新贵都万体景苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.441903,
            31.193697
        ],
        "address": "天钥桥路69弄",
        "name": "凯歌公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441903,
            31.193697
        ],
        "address": "天钥桥路69弄",
        "name": "凯歌公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.443798,
            31.184101
        ],
        "address": "天钥桥路811号",
        "name": "鹏欣公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.443774,
            31.183784
        ],
        "address": "天钥桥路859号",
        "name": "北海大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.445282,
            31.17909
        ],
        "address": "天钥桥路907号",
        "name": "天龙公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.445801,
            31.178679
        ],
        "address": "天钥桥路909-915号",
        "name": "D1国际创意空间",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.444314,
            31.182594
        ],
        "address": "天钥桥路869号",
        "name": "美晶佳园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.455219,
            31.156443
        ],
        "address": "天钥桥南路1111号",
        "name": "誉仁家园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.108492,
            31.196722
        ],
        "address": "天一路568号",
        "name": "8090青年创业基地青浦新城园",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.441681,
            31.193105
        ],
        "address": "天钥桥路93号",
        "name": "中福实业大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.26342,
            31.347528
        ],
        "address": "天祝路377弄",
        "name": "华都商务广场",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.255166,
            31.343995
        ],
        "address": "天祝路789弄",
        "name": "金嘉商务广场",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.258502,
            31.344514
        ],
        "address": "天祝路555弄",
        "name": "合景峰汇嘉苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.256875,
            31.346745
        ],
        "address": "天祝路818号",
        "name": "嘉鼎国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.435834,
            31.174108
        ],
        "address": "田东路377弄3号",
        "name": "金衡公寓",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.440792,
            31.172094
        ],
        "address": "田东路70弄",
        "name": "华南公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.432378,
            31.176379
        ],
        "address": "田林东路100弄",
        "name": "爱建园",
        "count": 95,
        "style": 0
    },
    {
        "lnglat": [
            121.425932,
            31.172796
        ],
        "address": "田林东路556弄",
        "name": "田林亲家",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.43326,
            31.174268
        ],
        "address": "田林东路55号",
        "name": "汇阳广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42565,
            31.172506
        ],
        "address": "田林东路568号对面",
        "name": "田林十一村",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.387916,
            31.164901
        ],
        "address": "田林路1016号",
        "name": "科技绿洲三期",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.414571,
            31.171551
        ],
        "address": "田林路130号",
        "name": "越界田林坊",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.402467,
            31.167736
        ],
        "address": "田林路300号",
        "name": "田林大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.398206,
            31.167291
        ],
        "address": "田林路388号",
        "name": "新业B楼(宏业大厦)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.396198,
            31.166473
        ],
        "address": "田林路418号",
        "name": "徐汇乐业天地",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.396353,
            31.162856
        ],
        "address": "田州路99号",
        "name": "新安大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.514534,
            31.278026
        ],
        "address": "铁岭路32号",
        "name": "同叶大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.513438,
            31.279076
        ],
        "address": "铁岭路50弄23号",
        "name": "铁岭大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.451933,
            31.39198
        ],
        "address": "铁山路1050号",
        "name": "巨丰商务楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.754942,
            31.071297
        ],
        "address": "听达路185弄",
        "name": "丽水雅苑北苑",
        "count": 88,
        "style": 0
    },
    {
        "lnglat": [
            121.755515,
            31.067697
        ],
        "address": "听达路325弄",
        "name": "丽水雅苑南苑",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.744843,
            31.067232
        ],
        "address": "听健路151弄",
        "name": "秀园西园",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.748435,
            31.067424
        ],
        "address": "听康路181弄",
        "name": "文竹苑南苑",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.746501,
            31.06772
        ],
        "address": "听康路190弄",
        "name": "秀园东园",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.7376,
            31.06946
        ],
        "address": "听康路79弄",
        "name": "文竹苑北苑",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.751601,
            31.053467
        ],
        "address": "听谐路73弄",
        "name": "民乐城康苑",
        "count": 101,
        "style": 0
    },
    {
        "lnglat": [
            121.517828,
            31.261017
        ],
        "address": "通北路589号",
        "name": "燕舞东方保利广场L楼",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.236839,
            31.04049
        ],
        "address": "通波路725弄",
        "name": "安琪花苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.44619,
            31.334225
        ],
        "address": "通河路438弄",
        "name": "住嘉新苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.450763,
            31.336277
        ],
        "address": "通河一村1号-4号",
        "name": "通河一村",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.373224,
            31.717449
        ],
        "address": "通济路1279弄",
        "name": "秀园北苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.745888,
            31.057059
        ],
        "address": "通济路616弄",
        "name": "民乐城朗苑",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.475031,
            31.341452
        ],
        "address": "通南路91弄99支弄",
        "name": "上海骏景雅苑",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.353782,
            31.227125
        ],
        "address": "通协路288弄",
        "name": "旭辉虹桥国际广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.498867,
            31.254911
        ],
        "address": "通州路88弄",
        "name": "海泰苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.481214,
            31.39574
        ],
        "address": "同济路669弄7号楼",
        "name": "火炬城市峰汇",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.491032,
            31.378494
        ],
        "address": "同济支路157号",
        "name": "智慧柒立方",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.468185,
            31.273473
        ],
        "address": "同丰路667号",
        "name": "紫金公馆",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.491406,
            31.378795
        ],
        "address": "同济支路199号",
        "name": "智慧柒立方二期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.26798,
            31.093091
        ],
        "address": "同乐路566弄",
        "name": "斌娇智能科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.370339,
            31.232702
        ],
        "address": "同普路1220号",
        "name": "同普大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.366909,
            31.234528
        ],
        "address": "同普路1412号",
        "name": "长征工业设计中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.36168,
            31.23281
        ],
        "address": "同普路1501弄",
        "name": "牡丹苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.360679,
            31.234786
        ],
        "address": "同普路1680弄",
        "name": "玫瑰苑（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.420113,
            31.236925
        ],
        "address": "同普路299弄",
        "name": "浙铁绿城长风中心",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.467915,
            31.276153
        ],
        "address": "同心路1115弄",
        "name": "春满园B区",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.477446,
            31.26622
        ],
        "address": "同心路116弄",
        "name": "同心路116弄",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.477588,
            31.266666
        ],
        "address": "同心路116弄1号",
        "name": "同心苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.478421,
            31.26572
        ],
        "address": "同心路28弄",
        "name": "嘉宏紫薇园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.479589,
            31.265907
        ],
        "address": "同心路3号",
        "name": "同和苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.16321,
            31.319388
        ],
        "address": "彤闻路199弄",
        "name": "古北萃庭二期",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.163322,
            31.318999
        ],
        "address": "彤闻路77弄",
        "name": "古北萃庭一期",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.393855,
            31.252183
        ],
        "address": "铜川路1422弄",
        "name": "绿洲公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.390096,
            31.251033
        ],
        "address": "铜川路1615弄",
        "name": "佳祥公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.365766,
            31.255178
        ],
        "address": "铜川路2655弄",
        "name": "鼎秀园",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.450183,
            31.226581
        ],
        "address": "铜仁路258号",
        "name": "九安广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.54917,
            31.289092
        ],
        "address": "图门路6号",
        "name": "沧达大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.570162,
            31.263557
        ],
        "address": "团林路38号",
        "name": "猫之家团林路店(精品公寓)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.508899,
            30.955829
        ],
        "address": "团汇公路258弄",
        "name": "逸贤雅苑",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.587682,
            31.349648
        ],
        "address": "外高桥保税区基隆路1号",
        "name": "汤臣国际贸易大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.594842,
            31.337065
        ],
        "address": "外高桥富特西一路381号",
        "name": "汤臣工业园区",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.590154,
            31.344302
        ],
        "address": "外高桥保税区奥纳路18号",
        "name": "奥吉大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.506849,
            31.212305
        ],
        "address": "外马路974号",
        "name": "三盛宏业大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.258346,
            31.115383
        ],
        "address": "外婆泾路299弄",
        "name": "建发玖珑湾",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.124938,
            31.14095
        ],
        "address": "外青松公路6666弄",
        "name": "帕缇欧香苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.44612,
            31.192352
        ],
        "address": "宛平南路300弄",
        "name": "宛平南苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.447865,
            31.191442
        ],
        "address": "宛平南路381号",
        "name": "沪港国际大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.44672,
            31.193175
        ],
        "address": "宛平南路255号",
        "name": "徐家汇花园",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.455203,
            31.180573
        ],
        "address": "宛平南路1415号",
        "name": "保利西岸明轩",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.447886,
            31.190932
        ],
        "address": "宛平南路401号",
        "name": "辉煌大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.447084,
            31.190861
        ],
        "address": "宛平南路388弄1-6号",
        "name": "海螺花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.447235,
            31.189864
        ],
        "address": "宛平南路420号1-2号",
        "name": "佳安公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.449419,
            31.189017
        ],
        "address": "宛平南路521号",
        "name": "恒昌花园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.448225,
            31.188855
        ],
        "address": "宛平南路590弄",
        "name": "爱建大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.445927,
            31.195578
        ],
        "address": "宛平南路75号",
        "name": "建科大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.44471,
            31.195352
        ],
        "address": "宛平南路88号",
        "name": "东方财富大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.45283,
            31.183622
        ],
        "address": "宛平南路921弄",
        "name": "临江豪园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.452175,
            31.182806
        ],
        "address": "宛平南路968号",
        "name": "腾王阁",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.399915,
            31.108588
        ],
        "address": "畹町路479号3-5层及1层120号",
        "name": "朗诗寓(莘庄店)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.446108,
            31.194744
        ],
        "address": "宛平南路99弄1号",
        "name": "宛平南路99弄1号",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.464663,
            31.302526
        ],
        "address": "万安路1323弄",
        "name": "良辰美景(南块)",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.555468,
            31.252556
        ],
        "address": "万德路11弄",
        "name": "上海东方广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.425308,
            31.229413
        ],
        "address": "万航渡后路77弄",
        "name": "蔚蓝水岸",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.43734,
            31.22908
        ],
        "address": "万春街162弄56支弄30号",
        "name": "鸿力鸿鹄公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.421126,
            31.22502
        ],
        "address": "万航渡路1455号",
        "name": "华阳公寓（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.405616,
            31.220481
        ],
        "address": "万航渡路2452号",
        "name": "苏州河DOHO",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.406334,
            31.220204
        ],
        "address": "万航渡路2453号",
        "name": "周家桥创意产业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.433541,
            31.226861
        ],
        "address": "万航渡路623弄85号",
        "name": "建华大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.4434,
            31.22462
        ],
        "address": "万航渡路83号",
        "name": "金航大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.430645,
            31.22762
        ],
        "address": "万航渡路736号",
        "name": "金融街静安中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.429959,
            31.22843
        ],
        "address": "万航渡路849号",
        "name": "海森国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.429181,
            31.22649
        ],
        "address": "万航渡路858弄",
        "name": "静安丽舍",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.429318,
            31.22713
        ],
        "address": "万航渡路858弄8号",
        "name": "蓝朝部落",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.428683,
            31.228237
        ],
        "address": "万航渡路888号",
        "name": "开开广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441463,
            31.29001
        ],
        "address": "万荣路1050号",
        "name": "万荣阳光苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.440507,
            31.29318
        ],
        "address": "万荣路1188号",
        "name": "龙软万荣基地",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.443858,
            31.272894
        ],
        "address": "万荣路388弄、大宁路883弄",
        "name": "歌林春天馨园",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.441948,
            31.281419
        ],
        "address": "万荣路700号",
        "name": "大宁中心广场A3",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.448948,
            31.269769
        ],
        "address": "万荣路30弄",
        "name": "宁和公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.442324,
            31.287995
        ],
        "address": "万荣路959号",
        "name": "悦舜959创意生活广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.443781,
            31.278495
        ],
        "address": "万荣路828弄",
        "name": "大宁858国际公寓",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.518943,
            30.957366
        ],
        "address": "万顺路1988号",
        "name": "百曲雅苑",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.51697,
            30.959157
        ],
        "address": "万顺路2089弄",
        "name": "百曲乐苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.85373,
            30.98018
        ],
        "address": "万松路88号",
        "name": "金盾产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.517348,
            30.935009
        ],
        "address": "万顺路709弄",
        "name": "金域华庭(万科金域华府)",
        "count": 71,
        "style": 0
    },
    {
        "lnglat": [
            121.812342,
            30.971989
        ],
        "address": "万祥镇祥凯路",
        "name": "同润金色橘苑",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.388019,
            31.169265
        ],
        "address": "万源路2158号",
        "name": "泓毅大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.388195,
            31.168376
        ],
        "address": "万源路2138号",
        "name": "泓茂中心",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.384211,
            31.168688
        ],
        "address": "万源路2161弄150号",
        "name": "冉东商务中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.38602,
            31.169186
        ],
        "address": "万源路2163号",
        "name": "新桥商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.444716,
            31.299748
        ],
        "address": "万荣一路90号",
        "name": "国际青年创业社区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.386674,
            31.171082
        ],
        "address": "万源路2289号",
        "name": "万源新城三期",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.396989,
            31.149144
        ],
        "address": "万源路986弄",
        "name": "万源城朗郡",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.374879,
            31.242981
        ],
        "address": "万镇路501弄",
        "name": "东旺家苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.395928,
            31.146308
        ],
        "address": "万源路788弄",
        "name": "万源城逸郡",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.374004,
            31.242058
        ],
        "address": "万镇路381号",
        "name": "运旺新村阳光世家",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.244731,
            31.091861
        ],
        "address": "王家厍路199弄",
        "name": "塘和家园顺康苑",
        "count": 100,
        "style": 0
    },
    {
        "lnglat": [
            121.296724,
            31.121468
        ],
        "address": "望东中路99弄",
        "name": "森祥投资晟维商务园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.473002,
            30.965693
        ],
        "address": "望园路1888号",
        "name": "复旦奥医高新科创园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.474864,
            30.96109
        ],
        "address": "望园路1698弄",
        "name": "聚惠领域_百村创业园B区",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.476551,
            31.224435
        ],
        "address": "望亭路135号",
        "name": "淮海金融大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.471341,
            30.967936
        ],
        "address": "望园路2066弄",
        "name": "百村创业园A区",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.466869,
            30.972852
        ],
        "address": "望园路2509弄",
        "name": "悦达南郊华都",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.468481,
            31.227989
        ],
        "address": "威海路128号",
        "name": "长发大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.468194,
            31.227744
        ],
        "address": "威海路168弄",
        "name": "杰仕豪庭",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.461694,
            31.226483
        ],
        "address": "威海路511号",
        "name": "上海国际集团大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.470277,
            31.228441
        ],
        "address": "威海路48号",
        "name": "民生银行大厦（上海）",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.457553,
            31.225353
        ],
        "address": "威海路755号",
        "name": "文新大厦(上海)",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.46098,
            31.226618
        ],
        "address": "威海路567号",
        "name": "晶采世纪大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.356297,
            31.462823
        ],
        "address": "威航路218弄",
        "name": "金地威新宝山智造园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.384871,
            31.211258
        ],
        "address": "威宁路258号",
        "name": "天申综合大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.386389,
            31.216362
        ],
        "address": "威宁路458弄",
        "name": "天山华庭",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.384477,
            31.214096
        ],
        "address": "威宁路369号",
        "name": "缤谷大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.515426,
            31.222978
        ],
        "address": "潍坊西路55号",
        "name": "上海世茂大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.385367,
            31.217739
        ],
        "address": "威宁路511弄",
        "name": "天山怡景苑",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.510619,
            31.305927
        ],
        "address": "伟成路62号",
        "name": "创智天地企业中心3号楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.51022,
            31.30582
        ],
        "address": "伟成路70号",
        "name": "弘源创新大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.39768,
            31.327576
        ],
        "address": "纬地路358弄",
        "name": "经纬城市绿洲观澜泓郡家园",
        "count": 174,
        "style": 0
    },
    {
        "lnglat": [
            121.396728,
            31.324751
        ],
        "address": "纬地路375弄",
        "name": "经纬城市绿洲泓汇地标家园",
        "count": 77,
        "style": 0
    },
    {
        "lnglat": [
            121.404861,
            31.324929
        ],
        "address": "纬地路99弄",
        "name": "经纬城市绿洲学士逸居家园",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.403772,
            31.328842
        ],
        "address": "纬地路88弄",
        "name": "经纬城市绿洲阳光水岸家园",
        "count": 204,
        "style": 0
    },
    {
        "lnglat": [
            121.433196,
            31.368965
        ],
        "address": "蕰川路1623号",
        "name": "柏丽华庭",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.43336,
            31.352991
        ],
        "address": "蕰川路516号",
        "name": "泰德科技园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.433615,
            31.352317
        ],
        "address": "蕰川路512号",
        "name": "红石科技大楼",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.218367,
            31.033233
        ],
        "address": "文诚路358号",
        "name": "嘉和休闲广场",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.433977,
            31.344173
        ],
        "address": "蕰川路6号",
        "name": "智慧湾",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.216248,
            31.032713
        ],
        "address": "文诚路500弄",
        "name": "安信生活广场",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.432008,
            31.186885
        ],
        "address": "文定路200号",
        "name": "盛源恒华大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.432856,
            31.18454
        ],
        "address": "文定路211号",
        "name": "泰德花苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.430219,
            31.184632
        ],
        "address": "文定路288弄",
        "name": "文定天下苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.26903,
            31.038745
        ],
        "address": "文翔东路58号",
        "name": "上海友喜国际高科技园区",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.186197,
            31.036791
        ],
        "address": "文涵路737弄1-37号",
        "name": "逸庭苑(上海)",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.235614,
            31.042894
        ],
        "address": "文翔路1000-1010号",
        "name": "西郊公馆(松云银座)",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.180713,
            31.041863
        ],
        "address": "文翔路3688弄",
        "name": "复地翠堤",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.765203,
            31.053975
        ],
        "address": "文益街5号",
        "name": "通盛商务广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.186555,
            31.046911
        ],
        "address": "文宇路88弄",
        "name": "上海绿地诺丁山",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.485369,
            31.29166
        ],
        "address": "汶水东路181弄",
        "name": "三九大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.482698,
            31.291128
        ],
        "address": "汶水东路351号",
        "name": "1876老站创意园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.457738,
            31.308229
        ],
        "address": "闻喜路555弄",
        "name": "爱建新家园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.434954,
            31.288533
        ],
        "address": "汶水路480号",
        "name": "汇智印针园区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.443114,
            31.221918
        ],
        "address": "乌鲁木齐北路211号",
        "name": "聚安大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.463639,
            31.292314
        ],
        "address": "汶水东路918号",
        "name": "信南都市型产业园区5号楼信南商务大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.44343,
            31.218002
        ],
        "address": "乌鲁木齐北路480号",
        "name": "万泰国际大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.237723,
            31.042723
        ],
        "address": "文翔路928号",
        "name": "松云水苑",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.442647,
            31.222578
        ],
        "address": "乌鲁木齐北路199号",
        "name": "世纪时空大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450643,
            31.200076
        ],
        "address": "乌鲁木齐南路299号",
        "name": "联业大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.449211,
            31.202394
        ],
        "address": "乌鲁木齐南路228号",
        "name": "金碧公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.444941,
            31.215297
        ],
        "address": "乌鲁木齐中路99弄",
        "name": "汇贤居",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.349153,
            31.156694
        ],
        "address": "吴宝路27弄50支弄",
        "name": "上海嘉丽苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.347216,
            31.163034
        ],
        "address": "吴宝路390-1号",
        "name": "蒂芬妮文创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.34904,
            31.159331
        ],
        "address": "吴宝路169弄",
        "name": "上海嘉景苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.463883,
            31.230694
        ],
        "address": "吴江路15号",
        "name": "五月花商务中心 ",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.48512,
            31.292581
        ],
        "address": "吴家湾路61弄24-34号",
        "name": "住安产业中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.490269,
            31.246471
        ],
        "address": "吴淞路130号",
        "name": "城投控股大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.463364,
            31.23033
        ],
        "address": "吴江路31号",
        "name": "东方有线大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.490914,
            31.248489
        ],
        "address": "吴淞路218号",
        "name": "宝矿国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.460135,
            31.230029
        ],
        "address": "吴江路188号",
        "name": "静安新时代大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.490064,
            31.249002
        ],
        "address": "吴淞路258号，308号",
        "name": "耀江国际广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.444186,
            30.961157
        ],
        "address": "吴塘路799弄",
        "name": "尚美苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.444186,
            30.961157
        ],
        "address": "吴塘路899弄",
        "name": "尚乐苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.444832,
            31.201553
        ],
        "address": "吴兴路219号",
        "name": "吴兴公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.488205,
            31.251122
        ],
        "address": "吴淞路469号",
        "name": "森林湾大厦",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.445777,
            31.198898
        ],
        "address": "吴兴路278号",
        "name": "宛平公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.486051,
            31.254354
        ],
        "address": "吴淞路669号",
        "name": "申贝大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.446008,
            31.198804
        ],
        "address": "吴兴路283号",
        "name": "申谊大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.424296,
            31.190112
        ],
        "address": "吴中东路491号",
        "name": "宏云广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.30674,
            31.269796
        ],
        "address": "吴杨东路333弄",
        "name": "金帝城市岸泊",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.4215,
            31.190011
        ],
        "address": "吴中东路588弄",
        "name": "上海华中大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.422787,
            31.19019
        ],
        "address": "吴中东路506弄",
        "name": "嘉欣公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.388087,
            31.177185
        ],
        "address": "吴中路1029号",
        "name": "灿虹世纪广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.387583,
            31.178567
        ],
        "address": "吴中路1050号",
        "name": "虹桥盛世莲花广场",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.388356,
            31.176761
        ],
        "address": "吴中路1059号",
        "name": "灿虹精英大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.387024,
            31.176949
        ],
        "address": "吴中路1081号",
        "name": "灿虹聚富大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.386088,
            31.177319
        ],
        "address": "吴中路1100号",
        "name": "炫润国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.386112,
            31.176434
        ],
        "address": "吴中路1099号",
        "name": "吴中商务大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.382814,
            31.175909
        ],
        "address": "吴中路1217号",
        "name": "长江商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.381018,
            31.176122
        ],
        "address": "吴中路1238号",
        "name": "新盛商务大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.383998,
            31.175912
        ],
        "address": "吴中路1189号",
        "name": "M8",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.382035,
            31.175475
        ],
        "address": "吴中路1235号",
        "name": "新宏商务大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.380095,
            31.175898
        ],
        "address": "吴中路1258号",
        "name": "新翔商务大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.37439,
            31.172123
        ],
        "address": "吴中路1369号",
        "name": "欧银中心",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.373214,
            31.172037
        ],
        "address": "吴中路1439号",
        "name": "莱茵虹景中心",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.419274,
            31.187643
        ],
        "address": "吴中路39号",
        "name": "新概念大厦",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.412524,
            31.187123
        ],
        "address": "吴中路380弄9号",
        "name": "海联花苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.412676,
            31.186156
        ],
        "address": "吴中路369号",
        "name": "美恒大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.368214,
            31.170008
        ],
        "address": "吴中路1799号",
        "name": "万象城(一期)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.404813,
            31.185422
        ],
        "address": "吴中路500号",
        "name": "涵博大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.396658,
            31.182748
        ],
        "address": "吴中路686弄2号",
        "name": "金虹桥广场E座",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.402799,
            31.183875
        ],
        "address": "吴中路511弄",
        "name": "古北新城",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.396561,
            31.182746
        ],
        "address": "吴中路686弄D座",
        "name": "东航金融中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.391816,
            31.179161
        ],
        "address": "吴中路889号",
        "name": "君怡公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.493903,
            31.254794
        ],
        "address": "梧州路218弄",
        "name": "中皇广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.492473,
            31.256036
        ],
        "address": "梧州路299弄",
        "name": "凯虹家园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.10968,
            31.145174
        ],
        "address": "五厍浜路168弄",
        "name": "汇丰豪轩",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.596432,
            31.272184
        ],
        "address": "五莲路1168号",
        "name": "新馨白领公寓五莲路店",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.431331,
            31.146905
        ],
        "address": "五星路706弄26号楼",
        "name": "御河企业公馆D2E3",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.574767,
            31.177958
        ],
        "address": "五星路707弄",
        "name": "御河企业公馆",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.566158,
            31.174825
        ],
        "address": "五星路410弄72号",
        "name": "湾流国际青年社区北蔡店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441303,
            31.229722
        ],
        "address": "武定路1102号",
        "name": "怡甸公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.438819,
            31.229165
        ],
        "address": "武定路1128弄",
        "name": "瀚林府邸",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.43808,
            31.227766
        ],
        "address": "武定路1145弄",
        "name": "沪中新苑",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.451486,
            31.234387
        ],
        "address": "武定路458号",
        "name": "洪安大厦(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.454318,
            31.234196
        ],
        "address": "武定路333号",
        "name": "申银发展大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.444743,
            31.230308
        ],
        "address": "武定路881号",
        "name": "881创意园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.443805,
            31.23022
        ],
        "address": "武定路969号",
        "name": "华祺大厦",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.435871,
            31.227097
        ],
        "address": "武定西路1158弄",
        "name": "瑞丽公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.429593,
            31.224724
        ],
        "address": "武定西路1398弄",
        "name": "静安城",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.430649,
            31.224549
        ],
        "address": "武定西路1438号",
        "name": "雅筑公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.485414,
            31.251757
        ],
        "address": "武进路289号",
        "name": "海泰时代大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.499609,
            31.30208
        ],
        "address": "武东路28弄",
        "name": "同和国际",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.48398,
            31.251491
        ],
        "address": "武进路41号",
        "name": "吉汇大厦(虹口SOHO)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.480149,
            31.24982
        ],
        "address": "武进路579号",
        "name": "武进大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.44079,
            31.211168
        ],
        "address": "武康路112号",
        "name": "康兴公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.438556,
            31.207378
        ],
        "address": "武康路280弄",
        "name": "汇成武康公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.421874,
            31.241466
        ],
        "address": "武宁路300弄",
        "name": "武宁小城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.42325,
            31.237897
        ],
        "address": "武宁路101号",
        "name": "我格广场（商场）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.383074,
            31.254642
        ],
        "address": "武宁路2101号",
        "name": "嘉安大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.416189,
            31.243069
        ],
        "address": "武宁路423号",
        "name": "五零智慧产业科技园",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.415723,
            31.2438
        ],
        "address": "武宁路501号",
        "name": "鸿运大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.413959,
            31.24451
        ],
        "address": "武宁路509号",
        "name": "电科大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.42935,
            31.23452
        ],
        "address": "武宁路8弄1号",
        "name": "大众河滨大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.423363,
            31.23782
        ],
        "address": "武宁路99号",
        "name": "我格广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.433685,
            31.231316
        ],
        "address": "武宁南路310-322号",
        "name": "宏安家园一期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.432464,
            31.231963
        ],
        "address": "武宁南路418弄",
        "name": "怡乐花园(上海)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.430943,
            31.23361
        ],
        "address": "武宁南路488号",
        "name": "智慧广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.399879,
            31.275338
        ],
        "address": "武威东路478弄",
        "name": "雅诗蓝郡",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.353096,
            31.281236
        ],
        "address": "武威路2600弄",
        "name": "新华悦都",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.264364,
            31.405247
        ],
        "address": "武乡南路259弄",
        "name": "大成名庭",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.323761,
            31.280392
        ],
        "address": "武威路2909弄",
        "name": "连飞虹湖天地国际公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.423519,
            31.213792
        ],
        "address": "武夷路351号",
        "name": "武夷商务中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.422269,
            31.212248
        ],
        "address": "武夷路416弄",
        "name": "天诚花苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.421481,
            31.212623
        ],
        "address": "武夷路438号",
        "name": "星辰公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.421933,
            31.212581
        ],
        "address": "武夷路418弄1号",
        "name": "武定大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.496174,
            31.259718
        ],
        "address": "物华路58号",
        "name": "物华大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.415599,
            31.212632
        ],
        "address": "武夷路718弄",
        "name": "武夷花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.496489,
            31.259874
        ],
        "address": "物华路73号",
        "name": "侨园渡边物华园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.472138,
            31.243665
        ],
        "address": "西藏北路166号",
        "name": "上海静安大悦城购物中心",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.471949,
            31.241073
        ],
        "address": "西藏北路18号",
        "name": "四行天地",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.470875,
            31.243781
        ],
        "address": "西藏北路199号",
        "name": "农房总部大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.469891,
            31.250045
        ],
        "address": "西藏北路528弄",
        "name": "博园大楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.470038,
            31.250575
        ],
        "address": "西藏北路568号",
        "name": "上海铭德国际广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.468466,
            31.252615
        ],
        "address": "西藏北路605号",
        "name": "兴中心创意园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.485766,
            31.211417
        ],
        "address": "西藏南路1090弄",
        "name": "银南大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.48533,
            31.210786
        ],
        "address": "西藏南路1108弄",
        "name": "黄浦新苑办公楼",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.487476,
            31.210774
        ],
        "address": "西藏南路1129弄",
        "name": "丽园公寓（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.486785,
            31.211087
        ],
        "address": "西藏南路1109号",
        "name": "永明大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.486033,
            31.208471
        ],
        "address": "西藏南路1200弄",
        "name": "黄浦丽园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.481812,
            31.221244
        ],
        "address": "西藏南路1208弄",
        "name": "东吴证券大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.487176,
            31.209319
        ],
        "address": "西藏南路1225号",
        "name": "城信大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.487177,
            31.207291
        ],
        "address": "西藏南路1332号",
        "name": "协作大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.489622,
            31.204295
        ],
        "address": "西藏南路1433弄",
        "name": "新中苑生活大师",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.489863,
            31.203065
        ],
        "address": "西藏南路1501弄",
        "name": "弘辉名苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.48497,
            31.202915
        ],
        "address": "西藏南路1558弄",
        "name": "上海人家",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.492637,
            31.201536
        ],
        "address": "西藏南路1639号",
        "name": "精文苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.491329,
            31.199765
        ],
        "address": "西藏南路1717弄",
        "name": "白玉兰家园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.492544,
            31.19944
        ],
        "address": "西藏南路1739弄",
        "name": "耀江花园二期",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.484136,
            31.216142
        ],
        "address": "西藏南路748号",
        "name": "惠达大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.480628,
            31.224381
        ],
        "address": "西藏南路218号",
        "name": "永银大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.482668,
            31.220071
        ],
        "address": "西藏南路555号",
        "name": "黄浦众鑫城",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.484533,
            31.215405
        ],
        "address": "西藏南路758号",
        "name": "桥苑公寓(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.484769,
            31.214696
        ],
        "address": "西藏南路760号",
        "name": "安基大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.485736,
            31.214329
        ],
        "address": "西藏南路831弄",
        "name": "交通大厦（即南吉公寓）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.481812,
            31.221244
        ],
        "address": "西藏南路879-899号",
        "name": "幸运福邸（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.478579,
            31.229345
        ],
        "address": "西藏中路18号",
        "name": "港陆广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.476915,
            31.232011
        ],
        "address": "西藏中路268号",
        "name": "来福士广场",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.473548,
            31.238687
        ],
        "address": "西藏中路656号",
        "name": "美华大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.484719,
            31.213522
        ],
        "address": "西藏南路900弄",
        "name": "开元坊",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.472044,
            31.239634
        ],
        "address": "西藏中路725号",
        "name": "家化中房苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.365134,
            31.110269
        ],
        "address": "西环路629号",
        "name": "同久文创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.477215,
            31.271142
        ],
        "address": "西江湾路388号",
        "name": "凯德龙之梦虹口广场(办公楼)",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.442233,
            31.240344
        ],
        "address": "西康路1000号",
        "name": "冠龙大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.442004,
            31.240771
        ],
        "address": "西康路1018号",
        "name": "元茂金豪大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.438339,
            31.242176
        ],
        "address": "西康路1249弄",
        "name": "泰极大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.437183,
            31.24295
        ],
        "address": "西康路1277弄",
        "name": "云都苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.437995,
            31.24264
        ],
        "address": "西康路1255号",
        "name": "普陀科技大厦",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.477698,
            31.265587
        ],
        "address": "西江湾路5号",
        "name": "冠都公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437381,
            31.243212
        ],
        "address": "西康路1297号",
        "name": "云都商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.43662,
            31.246228
        ],
        "address": "西康路1288弄",
        "name": "光明城市花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.435596,
            31.244231
        ],
        "address": "西康路1407号",
        "name": "荣联公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.450439,
            31.231135
        ],
        "address": "西康路300号",
        "name": "本本大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.448905,
            31.231817
        ],
        "address": "西康路339弄",
        "name": "曼克顿豪庭怡景苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.44832,
            31.233125
        ],
        "address": "西康路446号",
        "name": "伯龙公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.448087,
            31.233236
        ],
        "address": "西康路464号",
        "name": "康定大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.447385,
            31.23413
        ],
        "address": "西康路520号",
        "name": "华通公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.44698,
            31.234563
        ],
        "address": "西康路556号",
        "name": "联谊西康大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.446454,
            31.235123
        ],
        "address": "西康路600弄",
        "name": "华通大厦(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.445254,
            31.236614
        ],
        "address": "西康路658弄7-9号",
        "name": "静安东海园三期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.444515,
            31.235683
        ],
        "address": "西康路699弄",
        "name": "静安鼎鑫佳苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.443342,
            31.23945
        ],
        "address": "西康路928号",
        "name": "静安创展中心",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.48603,
            31.205124
        ],
        "address": "西凌家宅路111弄4号",
        "name": "科凌公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.53147,
            31.15233
        ],
        "address": "西泰林路158弄",
        "name": "环球翡翠湾花园",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.447888,
            31.24525
        ],
        "address": "西苏州路82弄",
        "name": "静安河滨花园 ",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.444258,
            31.236689
        ],
        "address": "西康路757号",
        "name": "侨侨大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.444151,
            31.237939
        ],
        "address": "西康路838号",
        "name": "康海大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.364366,
            31.222599
        ],
        "address": "西陶浜路28弄",
        "name": "北平家园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.485388,
            31.158169
        ],
        "address": "西营南路67弄",
        "name": "恒大华城_天地苑三期",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.483345,
            31.170429
        ],
        "address": "西营路58、62号",
        "name": "明珠花苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.160325,
            31.157738
        ],
        "address": "西油墩港路177弄",
        "name": "逸泰雅苑一期",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.248194,
            31.331041
        ],
        "address": "希望路1333号",
        "name": "常发豪庭",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.270383,
            31.344198
        ],
        "address": "希望路260弄",
        "name": "海上名苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.265936,
            31.340099
        ],
        "address": "希望路689弄",
        "name": "嘉定宝龙中心二期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.156547,
            31.371182
        ],
        "address": "喜泉路118弄",
        "name": "外冈景苑",
        "count": 160,
        "style": 0
    },
    {
        "lnglat": [
            121.25698,
            31.337235
        ],
        "address": "希望路978弄",
        "name": "领峰华庭二期",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.451817,
            31.143499
        ],
        "address": "喜泰路255号",
        "name": "海桐商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.80364,
            30.901244
        ],
        "address": "霞光路368弄",
        "name": "东港铭筑",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.810582,
            30.900749
        ],
        "address": "霞光路78弄",
        "name": "蓝色城邦",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.373922,
            31.208574
        ],
        "address": "仙霞路1281号",
        "name": "帝豪苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.404063,
            31.206196
        ],
        "address": "仙霞路137号",
        "name": "盛高国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.400636,
            31.206462
        ],
        "address": "仙霞路319号",
        "name": "远东国际广场",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.399063,
            31.205479
        ],
        "address": "仙霞路322号",
        "name": "鑫达大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.397932,
            31.206163
        ],
        "address": "仙霞路345号",
        "name": "东方世纪大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.398761,
            31.206355
        ],
        "address": "仙霞路333号",
        "name": "东方维京大厦",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.372814,
            31.207007
        ],
        "address": "仙霞路1388弄",
        "name": "虹康景博苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.397366,
            31.206628
        ],
        "address": "仙霞路357号",
        "name": "制版楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.396648,
            31.206382
        ],
        "address": "仙霞路369号",
        "name": "KB现代广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.403806,
            31.205269
        ],
        "address": "仙霞路88号",
        "name": "太阳广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.406497,
            31.204904
        ],
        "address": "仙霞路80号",
        "name": "天虹大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.36682,
            31.20993
        ],
        "address": "仙霞西路300弄",
        "name": "虹康花苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.589595,
            31.338982
        ],
        "address": "夏碧路79弄",
        "name": "瑞禾明苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.376338,
            31.176416
        ],
        "address": "先锋街25号",
        "name": "宝纳大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.293981,
            31.001429
        ],
        "address": "香车路388号",
        "name": "宝奇电子商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.458435,
            31.204464
        ],
        "address": "襄阳南路489号",
        "name": "金环大厦",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.45741,
            31.213313
        ],
        "address": "襄阳南路175-号",
        "name": "环中商厦（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.465463,
            31.215179
        ],
        "address": "香山路33号",
        "name": "香山丽舍",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.458154,
            31.203696
        ],
        "address": "襄阳南路550弄",
        "name": "天元襄阳公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.457815,
            31.205695
        ],
        "address": "襄阳南路500号",
        "name": "巴黎时韵",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.807597,
            30.955046
        ],
        "address": "祥凯路2013弄",
        "name": "天健翠园",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.517047,
            31.300956
        ],
        "address": "翔殷路1128号",
        "name": "沪东金融大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.542407,
            31.309895
        ],
        "address": "翔殷路258弄",
        "name": "星云苑",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.551175,
            31.308779
        ],
        "address": "翔殷路128号",
        "name": "上海理工科技园",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.291898,
            31.296938
        ],
        "address": "翔江公路518号",
        "name": "寅尚工业产业园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.535633,
            31.30586
        ],
        "address": "翔殷路505弄",
        "name": "翔殷路505弄小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.524559,
            31.302372
        ],
        "address": "翔殷路873弄",
        "name": "梅花村",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.530365,
            31.2235
        ],
        "address": "向成路58号",
        "name": "东方国际科技大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.52898,
            31.224043
        ],
        "address": "向城路15号",
        "name": "锦城大厦（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.533307,
            31.226372
        ],
        "address": "向城路288号",
        "name": "国华人寿金融大厦",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.331722,
            31.455997
        ],
        "address": "萧云路1318弄",
        "name": "霄云湾公寓",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.529795,
            31.224113
        ],
        "address": "向城路19号",
        "name": "众城公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.457654,
            31.198588
        ],
        "address": "小木桥路219号",
        "name": "悦樘公寓(小木桥店)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.457345,
            31.198248
        ],
        "address": "小木桥路224号",
        "name": "儿科大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.458331,
            31.197641
        ],
        "address": "小木桥路251号",
        "name": "上海天亿大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.460427,
            31.193639
        ],
        "address": "小木桥路456号",
        "name": "X2创意空间二期",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.457887,
            31.196979
        ],
        "address": "小木桥路268弄",
        "name": "泰康大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.463628,
            31.188496
        ],
        "address": "小木桥路800号",
        "name": "UTOP联创空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.35371,
            31.222914
        ],
        "address": "协和路1033号",
        "name": "文洋大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.486292,
            31.207815
        ],
        "address": "斜土东路265弄",
        "name": "锦绣家园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.467064,
            31.2013
        ],
        "address": "斜土路1077号",
        "name": "鼎园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.48515,
            31.207389
        ],
        "address": "斜土东路333弄",
        "name": "华浩苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.465117,
            31.199803
        ],
        "address": "斜土路1175号",
        "name": "景泰大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.465688,
            31.201069
        ],
        "address": "斜土路1111弄",
        "name": "福华花苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.464415,
            31.199882
        ],
        "address": "斜土路1221号",
        "name": "之俊大厦（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.482267,
            31.205703
        ],
        "address": "斜土路118弄1号",
        "name": "大众汽车公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450621,
            31.194674
        ],
        "address": "斜土路1975弄、2099弄",
        "name": "阳光名苑二期(阳光巴黎二期)",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.458003,
            31.196249
        ],
        "address": "斜土路1620号",
        "name": "三航大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.450562,
            31.193298
        ],
        "address": "斜土路2088号",
        "name": "徐汇创客中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.451632,
            31.191123
        ],
        "address": "斜土路2096弄",
        "name": "锦蝶苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450958,
            31.194583
        ],
        "address": "斜土路2099弄",
        "name": "阳光名苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.450248,
            31.191242
        ],
        "address": "斜土路2200弄",
        "name": "荣承公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.445707,
            31.190293
        ],
        "address": "斜土路2455号",
        "name": "同济杰作（同汇苑）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.449657,
            31.191547
        ],
        "address": "斜土路2200弄47,48号",
        "name": "红旗教师公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.446246,
            31.189276
        ],
        "address": "斜土路2526号",
        "name": "新亚徐汇公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.443156,
            31.187549
        ],
        "address": "斜土路2601号",
        "name": "嘉汇广场",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.443297,
            31.186475
        ],
        "address": "斜土路2600号",
        "name": "海高大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441411,
            31.186377
        ],
        "address": "斜土路2897号",
        "name": "海文商务楼（斜土路）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441297,
            31.185386
        ],
        "address": "斜土路2899号",
        "name": "上影公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.441448,
            31.1854
        ],
        "address": "斜土路2899甲号",
        "name": "光启文化广场",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.480442,
            31.204522
        ],
        "address": "斜土路298弄",
        "name": "永业仁德坊",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.477534,
            31.203357
        ],
        "address": "斜土路468号",
        "name": "白云公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.478251,
            31.203837
        ],
        "address": "斜土路448号",
        "name": "蒙自大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.477035,
            31.203232
        ],
        "address": "斜土路500号",
        "name": "人才大厦（斜土路）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.477234,
            31.20393
        ],
        "address": "斜土路501弄1-5号",
        "name": "兴城苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.471985,
            31.201565
        ],
        "address": "斜土路766弄1号",
        "name": "莱兴公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.470753,
            31.201522
        ],
        "address": "斜土路780号",
        "name": "经宇商务楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.471437,
            31.201703
        ],
        "address": "斜土路768号",
        "name": "致远大厦",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.470251,
            31.201673
        ],
        "address": "斜土路788号",
        "name": "飞纶商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.471458,
            31.202322
        ],
        "address": "斜土路791号",
        "name": "三毛集团办公楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.469953,
            31.200774
        ],
        "address": "斜土路810弄",
        "name": "郁金香花苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.444925,
            31.193096
        ],
        "address": "辛耕路81弄",
        "name": "永新世纪苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.466753,
            31.23821
        ],
        "address": "新昌路477弄",
        "name": "上海滩新昌城",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.636297,
            31.058334
        ],
        "address": "新场镇康新公路1588号",
        "name": "千禾创业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.565959,
            31.180729
        ],
        "address": "新陈路303弄",
        "name": "莲泰苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.267687,
            31.381467
        ],
        "address": "新成路261弄之1-18号",
        "name": "迎园东一坊",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.405577,
            31.269503
        ],
        "address": "新村路1759弄",
        "name": "凯旋花园",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.413857,
            31.266647
        ],
        "address": "新村路1321号",
        "name": "新村路1321号",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.397728,
            31.268507
        ],
        "address": "新村路2080弄",
        "name": "万里晶品苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.428482,
            31.266232
        ],
        "address": "新村路423弄",
        "name": "绿地普陀商务广场",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.414535,
            31.26667
        ],
        "address": "新村路877号",
        "name": "大华齐成晟商务园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.424719,
            31.264365
        ],
        "address": "新村路550弄",
        "name": "西部名邸",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.478226,
            31.330268
        ],
        "address": "新二路999弄",
        "name": "四季绿城",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.318194,
            31.03944
        ],
        "address": "新飞路1500号",
        "name": "上海市松江科技创业中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.318687,
            31.04567
        ],
        "address": "新飞路1756号",
        "name": "翔展创客园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.475269,
            31.326388
        ],
        "address": "新二路183弄",
        "name": "馨良苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.234247,
            31.228741
        ],
        "address": "新府中路1536弄",
        "name": "华新宝龙城市广场",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.340902,
            31.242713
        ],
        "address": "新福路9号",
        "name": "连成大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.227124,
            31.230466
        ],
        "address": "新府中路1600号，华志路333弄",
        "name": "虹桥宝龙城",
        "count": 49,
        "style": 0
    },
    {
        "lnglat": [
            121.280302,
            31.055121
        ],
        "address": "新格路599号",
        "name": "新格路599号商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.419828,
            31.276215
        ],
        "address": "新沪路1083弄",
        "name": "上寓酒店公寓（唐鋆酒店公寓）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.420185,
            31.269082
        ],
        "address": "新沪路198弄",
        "name": "久华佳苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.418809,
            31.267991
        ],
        "address": "新沪路55弄",
        "name": "久华佳苑二期",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.432563,
            31.201756
        ],
        "address": "新华路2号",
        "name": "鸿发苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.420214,
            31.270458
        ],
        "address": "新沪路250号",
        "name": "久华商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42607,
            31.20075
        ],
        "address": "新华路329弄47-71号",
        "name": "新华名门",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.427717,
            31.203669
        ],
        "address": "新华路272弄",
        "name": "畅翠苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.422914,
            31.20378
        ],
        "address": "新华路519号",
        "name": "新华御庭",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.422312,
            31.204095
        ],
        "address": "新华路543号",
        "name": "上海新华大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.420514,
            31.203116
        ],
        "address": "新华路569弄77号",
        "name": "鉴赏新华小区",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.419765,
            31.202832
        ],
        "address": "新华路569弄99号",
        "name": "当代新华",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.42201,
            31.205594
        ],
        "address": "新华路590弄6-16号",
        "name": "博园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.286636,
            30.80348
        ],
        "address": "新华路64弄",
        "name": "申新花苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.420885,
            31.205137
        ],
        "address": "新华路664号",
        "name": "万宝国际商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.420141,
            31.205675
        ],
        "address": "新华路666弄1-5号",
        "name": "申亚新华府",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.41988,
            31.20539
        ],
        "address": "新华路668号",
        "name": "申畅国际商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.419322,
            31.205036
        ],
        "address": "新华路699弄1-3号",
        "name": "新华嘉利公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.418353,
            31.20579
        ],
        "address": "新华路720号",
        "name": "交通公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.418653,
            31.20652
        ],
        "address": "新华路726号",
        "name": "新华世纪园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.417808,
            31.206332
        ],
        "address": "新华路728号",
        "name": "华联发展大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.4668,
            31.242435
        ],
        "address": "新疆路500号",
        "name": "绿地海悦酒店公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.418174,
            31.205248
        ],
        "address": "新华路755号",
        "name": "凯新苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.621738,
            31.25999
        ],
        "address": "新金桥路1122号",
        "name": "方正大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.62054,
            31.256779
        ],
        "address": "新金桥路1599弄",
        "name": "东方万国企业中心",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.488684,
            31.256236
        ],
        "address": "新嘉路1弄",
        "name": "瑞嘉苑小区",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.62054,
            31.256779
        ],
        "address": "新金桥路1599弄B2栋",
        "name": "东方万国企业中心B2栋",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.622818,
            31.260115
        ],
        "address": "新金桥路1888号36号楼",
        "name": "凯龙金领大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.598597,
            31.248068
        ],
        "address": "新金桥路201号",
        "name": "现代通信大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.599397,
            31.248751
        ],
        "address": "新金桥路255号",
        "name": "金桥商务公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.621982,
            31.260119
        ],
        "address": "新金桥路1888号7号楼",
        "name": "金领之都",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.591514,
            31.245728
        ],
        "address": "新金桥路28号",
        "name": "新金桥大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.593296,
            31.246602
        ],
        "address": "新金桥路58号",
        "name": "银东大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.523268,
            31.08942
        ],
        "address": "新骏环路115号",
        "name": "寰启商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.454002,
            31.217299
        ],
        "address": "新乐路158号",
        "name": "东湖公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.589629,
            31.351496
        ],
        "address": "新兰路9号",
        "name": "晓富金融大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.340774,
            31.151837
        ],
        "address": "新龙路1111弄",
        "name": "万科朗润园",
        "count": 62,
        "style": 0
    },
    {
        "lnglat": [
            121.336385,
            31.150999
        ],
        "address": "新龙路1333弄",
        "name": "七宝万新国际中心",
        "count": 126,
        "style": 0
    },
    {
        "lnglat": [
            121.35603,
            31.159416
        ],
        "address": "新龙路311弄6号",
        "name": "七宝宝龙城T6",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.353573,
            31.158938
        ],
        "address": "新龙路399弄56号",
        "name": "七宝宝龙城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.284915,
            31.053472
        ],
        "address": "新庙三路669号",
        "name": "669科创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.317185,
            31.061026
        ],
        "address": "新南街299弄",
        "name": "亚龙华泽新苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.316269,
            31.061545
        ],
        "address": "新南街301弄",
        "name": "万宇阳光苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.315631,
            31.062451
        ],
        "address": "新南街350弄",
        "name": "新桥首府",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.292585,
            31.091645
        ],
        "address": "新农河路508弄",
        "name": "上坤旭辉墅",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.344602,
            31.064454
        ],
        "address": "新桥镇金都西路1000号",
        "name": "松港闵新创意园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.34335,
            31.078309
        ],
        "address": "新桥镇明中路881弄，1010弄",
        "name": "万科白马花园",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.417914,
            31.261611
        ],
        "address": "新泉路66弄",
        "name": "万里欣苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.481651,
            31.287266
        ],
        "address": "新市路251弄",
        "name": "曲阳名邸",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.481094,
            31.282039
        ],
        "address": "新市路86号",
        "name": "灵峰公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.479715,
            31.295916
        ],
        "address": "新市南路780弄",
        "name": "望隆苑（望华苑）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.216838,
            31.039202
        ],
        "address": "新松江路1060号",
        "name": "恒杰商务大楼B座",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.212657,
            31.039241
        ],
        "address": "新松江路1234号",
        "name": "恒杰商务大楼A座",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.210576,
            31.037877
        ],
        "address": "新松江路1277号",
        "name": "东鼎商务大厦",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.20773,
            31.038553
        ],
        "address": "新松江路1455号",
        "name": "东鼎名人府",
        "count": 71,
        "style": 0
    },
    {
        "lnglat": [
            121.220102,
            31.038479
        ],
        "address": "新松江路887弄",
        "name": "单身公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.688368,
            31.238386
        ],
        "address": "新雅东路125弄",
        "name": "唐镇同福苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.383436,
            31.213423
        ],
        "address": "新渔东路456弄",
        "name": "知雅园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.378301,
            31.214257
        ],
        "address": "新渔东路800号",
        "name": "莲森集团商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.393194,
            31.211843
        ],
        "address": "新渔东路60号",
        "name": "安龙大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.361852,
            31.252265
        ],
        "address": "新郁路807号",
        "name": "兆地生活广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.363603,
            31.25207
        ],
        "address": "新郁路846弄56号",
        "name": "兆地商务金座_B座",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.397872,
            31.049042
        ],
        "address": "新源路1356号",
        "name": "上海正珏科技电子商务产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.396857,
            31.049712
        ],
        "address": "新源路1399弄",
        "name": "上海航天人才公寓",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.470392,
            31.23865
        ],
        "address": "新闸路166号",
        "name": "水景苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.457033,
            31.233181
        ],
        "address": "新闸路1001号",
        "name": "亚成公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.442899,
            31.227102
        ],
        "address": "新闸路1851号",
        "name": "新闸大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.356702,
            31.642738
        ],
        "address": "新闸路218号",
        "name": "中泰公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.466972,
            31.239669
        ],
        "address": "新闸路356号",
        "name": "悦达黄浦河滨大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.315412,
            31.066628
        ],
        "address": "新镇街1058弄",
        "name": "东渡海派青城",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.455578,
            31.232501
        ],
        "address": "新闸路831弄",
        "name": "丽都新贵",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.364756,
            31.145377
        ],
        "address": "新镇路603弄",
        "name": "东方花园二期",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.305348,
            31.053178
        ],
        "address": "新镇街99弄",
        "name": "九城家天下商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.311817,
            31.063425
        ],
        "address": "新中街119弄1-22号",
        "name": "新乐雅苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.363087,
            31.149299
        ],
        "address": "新镇路888号",
        "name": "水景书香园",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.310036,
            31.063368
        ],
        "address": "新中街199号",
        "name": "新乐名苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.392301,
            31.056877
        ],
        "address": "鑫都路2688号",
        "name": "天恒名城",
        "count": 62,
        "style": 0
    },
    {
        "lnglat": [
            121.219561,
            31.037996
        ],
        "address": "新松江路925号",
        "name": "丰源大厦(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.485327,
            31.258122
        ],
        "address": "邢家桥北路269号",
        "name": "天伦家园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.582379,
            31.327875
        ],
        "address": "行南路1150弄",
        "name": "南新西园",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.436117,
            31.207993
        ],
        "address": "兴国路228号",
        "name": "嘉豪苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.415115,
            31.281494
        ],
        "address": "行知路381弄",
        "name": "远景佳苑二期",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.311587,
            31.201943
        ],
        "address": "兴虹路299弄",
        "name": "万科时一区二期（虹桥万科润园）",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.31057,
            31.203546
        ],
        "address": "兴虹路368弄",
        "name": "万科润园时一区三期",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.310515,
            31.202148
        ],
        "address": "兴虹路399弄",
        "name": "万科润园时一区四期",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.415648,
            31.28571
        ],
        "address": "行知路380弄",
        "name": "远景佳苑一期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.41301,
            31.106354
        ],
        "address": "兴梅路1199弄",
        "name": "春申景城二期",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.427621,
            31.109627
        ],
        "address": "兴梅路485号",
        "name": "中环科技园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.403712,
            31.204499
        ],
        "address": "兴义路48号",
        "name": "新世纪广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.405138,
            31.204739
        ],
        "address": "兴义路8号",
        "name": "万都中心大厦",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.404675,
            31.237873
        ],
        "address": "杏山路500弄",
        "name": "曹杨华庭",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.410337,
            31.232153
        ],
        "address": "杏山路8号",
        "name": "银都名庭",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.431155,
            31.205353
        ],
        "address": "幸福路111弄1-6号（新华路）",
        "name": "恒力苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.431402,
            31.204788
        ],
        "address": "幸福路88号",
        "name": "浙海公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.43119,
            31.203956
        ],
        "address": "幸福路42号",
        "name": "福苑大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.154906,
            31.140972
        ],
        "address": "秀涓路338弄",
        "name": "崧泽华城华中苑3区",
        "count": 108,
        "style": 0
    },
    {
        "lnglat": [
            121.160965,
            31.141714
        ],
        "address": "秀涓路46弄",
        "name": "观景雅苑",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.570764,
            31.142136
        ],
        "address": "秀康路958弄",
        "name": "周康新苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.60682,
            31.132409
        ],
        "address": "秀浦路2555号",
        "name": "漕河泾康桥商务绿洲（临港康桥商务绿洲）",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.159284,
            31.139062
        ],
        "address": "秀沁路132弄",
        "name": "和瑞东苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.605319,
            31.128415
        ],
        "address": "秀浦路2388号",
        "name": "上海康桥先进制造技术创业园",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.15422,
            31.138666
        ],
        "address": "秀沁路238弄",
        "name": "和瑞西苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.230332,
            31.007569
        ],
        "address": "秀水新路145弄",
        "name": "龙潭南苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.363556,
            31.123435
        ],
        "address": "秀文路898号",
        "name": "西子国际中心",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.579706,
            31.130553
        ],
        "address": "秀沿路1028弄",
        "name": "康桥城中花园（康桥半岛秀溪公寓）",
        "count": 135,
        "style": 0
    },
    {
        "lnglat": [
            121.363139,
            31.12243
        ],
        "address": "秀文路908号(莘庄商务区内)",
        "name": "中铁诺德国际中心",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.593029,
            31.135656
        ],
        "address": "秀沿路1668号",
        "name": "八元桥创新创业园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.52979,
            31.129512
        ],
        "address": "秀沿西路258弄",
        "name": "中海御景熙岸",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.537304,
            31.131437
        ],
        "address": "秀沿西路68弄",
        "name": "保利林语溪",
        "count": 75,
        "style": 0
    },
    {
        "lnglat": [
            121.520597,
            30.934345
        ],
        "address": "秀韵路105弄",
        "name": "灏景湾",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.427638,
            31.188991
        ],
        "address": "徐虹北路18弄",
        "name": "徐家汇景园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.425357,
            31.190065
        ],
        "address": "徐虹北路5弄",
        "name": "徐虹华庭（哈佛印象）",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.42458,
            31.188171
        ],
        "address": "徐虹中路20号",
        "name": "西岸创意园一期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.421519,
            31.176847
        ],
        "address": "徐汇区柳州路585弄",
        "name": "申德公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.475985,
            31.208369
        ],
        "address": "徐家汇路515号",
        "name": "汇龙新城",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.474165,
            31.209061
        ],
        "address": "徐家汇路388号",
        "name": "瑞金新苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.471266,
            31.207382
        ],
        "address": "徐家汇路518号",
        "name": "天天花园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.481948,
            31.210279
        ],
        "address": "徐家汇路1弄",
        "name": "新家坡园景苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.476646,
            31.206836
        ],
        "address": "徐家汇路550号",
        "name": "宝鼎大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.470162,
            31.206833
        ],
        "address": "徐家汇路552弄1号",
        "name": "富源公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.292542,
            31.198458
        ],
        "address": "徐灵路300弄",
        "name": "二联馨苑",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.262562,
            31.194635
        ],
        "address": "徐祥路368号",
        "name": "8090青年创业基地数字经济总部园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.472314,
            31.207028
        ],
        "address": "徐家汇路569号",
        "name": "帝庭爱仕大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.469597,
            31.207021
        ],
        "address": "徐家汇路558弄1号",
        "name": "双钱公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.269825,
            31.198615
        ],
        "address": "徐祥路38号",
        "name": "西虹桥同联创新产业园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.259306,
            31.170799
        ],
        "address": "徐盈路588弄",
        "name": "锦绣逸庭",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.524069,
            31.259029
        ],
        "address": "许昌路630弄",
        "name": "全家福家园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.513467,
            31.272375
        ],
        "address": "许昌路1560弄",
        "name": "伊东苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.430715,
            31.218127
        ],
        "address": "宣化路28号",
        "name": "企业发展大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.43045,
            31.217673
        ],
        "address": "宣化路229弄",
        "name": "富都花园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.713144,
            31.089778
        ],
        "address": "宣秋路129号",
        "name": "上海尧煊实业有限公司(园区)",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.422432,
            31.217427
        ],
        "address": "宣化路300号",
        "name": "华宁国际大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.582903,
            31.34987
        ],
        "address": "学后街28号",
        "name": "银桥商务大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.489856,
            31.216302
        ],
        "address": "学前街111弄",
        "name": "沧海苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.491075,
            31.300334
        ],
        "address": "学府街88弄",
        "name": "三湘世纪花城三期",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.726959,
            31.089102
        ],
        "address": "宣秋路858号",
        "name": "盛镛智慧科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.49648,
            31.223162
        ],
        "address": "学院路32弄",
        "name": "圣莲大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.472765,
            31.226194
        ],
        "address": "延安东路1200号",
        "name": "电信世界",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.353071,
            31.285505
        ],
        "address": "雪松路392号",
        "name": "锦翔大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.487495,
            31.23257
        ],
        "address": "延安东路222号",
        "name": "外滩中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.9244,
            30.914727
        ],
        "address": "雪绒花路369弄",
        "name": "金域澜湾",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.48477,
            31.230654
        ],
        "address": "延安东路175号",
        "name": "旺角广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.480527,
            31.230118
        ],
        "address": "延安东路618号",
        "name": "远洋商业大厦(二期)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.481514,
            31.230912
        ],
        "address": "延安东路550号",
        "name": "海洋大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.47939,
            31.229872
        ],
        "address": "延安东路700号",
        "name": "港泰广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.480068,
            31.230241
        ],
        "address": "延安东路600-618号",
        "name": "远洋商业大厦(一期)",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.431682,
            31.212216
        ],
        "address": "延安西路1030弄",
        "name": "佳信都市花园",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.429688,
            31.212598
        ],
        "address": "延安西路1033号",
        "name": "大众金融大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.48911,
            31.231291
        ],
        "address": "延安东路45号",
        "name": "工商联大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.430331,
            31.210834
        ],
        "address": "延安西路1118号",
        "name": "龙之梦大厦(延安路)",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.430956,
            31.211582
        ],
        "address": "延安西路1088号",
        "name": "长峰中心",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.430703,
            31.210304
        ],
        "address": "延安西路1146号",
        "name": "新先锋商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42786,
            31.210864
        ],
        "address": "延安西路1221号",
        "name": "泛太大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.427844,
            31.209853
        ],
        "address": "延安西路1228弄2号",
        "name": "上海嘉利大厦",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.428236,
            31.209527
        ],
        "address": "延安西路1228弄4号",
        "name": "嘉阳公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.428453,
            31.209197
        ],
        "address": "延安西路1228弄8号",
        "name": "嘉苑公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.427393,
            31.211105
        ],
        "address": "延安西路1235弄",
        "name": "佳达新苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.427344,
            31.20901
        ],
        "address": "延安西路1262号",
        "name": "上生新所",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.427125,
            31.210005
        ],
        "address": "延安西路1260号",
        "name": "延安公寓(延安西路)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426041,
            31.210552
        ],
        "address": "延安西路1303号",
        "name": "上汽万众大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.425759,
            31.209621
        ],
        "address": "延安西路1326号",
        "name": "生物大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.443785,
            31.219733
        ],
        "address": "延安西路129号",
        "name": "华侨大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.424417,
            31.210415
        ],
        "address": "延安西路1355弄1、2号（定西路）",
        "name": "银都公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.426701,
            31.210546
        ],
        "address": "延安西路1399号",
        "name": "汇享1399",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.425515,
            31.209255
        ],
        "address": "延安西路1328弄",
        "name": "今日丽园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.422894,
            31.208866
        ],
        "address": "延安西路1448弄",
        "name": "华融国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.408175,
            31.203963
        ],
        "address": "延安西路2067号",
        "name": "仲盛金融中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.419831,
            31.207954
        ],
        "address": "延安西路1600号",
        "name": "禾森商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.407486,
            31.203493
        ],
        "address": "延安西路2077号",
        "name": "金桥大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.419882,
            31.208427
        ],
        "address": "延安西路1590号",
        "name": "增泽世贸大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.404001,
            31.202427
        ],
        "address": "延安西路2201号",
        "name": "上海国际贸易中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.420731,
            31.208497
        ],
        "address": "延安西路1566号",
        "name": "龙峰大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.400619,
            31.201763
        ],
        "address": "延安西路2299号",
        "name": "上海世贸商城",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.392469,
            31.197488
        ],
        "address": "延安西路2633号",
        "name": "美丽华商务中心(美丽华商务大厦)",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.380278,
            31.189807
        ],
        "address": "延安西路3062弄18号",
        "name": "华菱大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.439477,
            31.219202
        ],
        "address": "延安西路300号",
        "name": "静安大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.360579,
            31.183694
        ],
        "address": "延安西路3500号",
        "name": "南洋绿都",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.439086,
            31.218843
        ],
        "address": "延安西路358号",
        "name": "美丽园大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.437834,
            31.218915
        ],
        "address": "延安西路376弄22号",
        "name": "永兴商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.437813,
            31.218417
        ],
        "address": "延安西路396号",
        "name": "美丽园大酒店",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.435894,
            31.217106
        ],
        "address": "延安西路548弄3-11号",
        "name": "申亚瑞庭",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.436321,
            31.217144
        ],
        "address": "延安西路500号",
        "name": "嘉宁国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437515,
            31.216603
        ],
        "address": "延安西路487/501号",
        "name": "政宁小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.433924,
            31.216251
        ],
        "address": "延安西路688弄",
        "name": "华敏世纪广场_上海",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.434646,
            31.214075
        ],
        "address": "延安西路777号",
        "name": "裕丰国际广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.43426,
            31.214368
        ],
        "address": "延安西路719号",
        "name": "佳都大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432241,
            31.214631
        ],
        "address": "延安西路895号",
        "name": "申亚金融广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.431415,
            31.213703
        ],
        "address": "延安西路973、983号",
        "name": "五环大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.461679,
            31.224356
        ],
        "address": "延安中路658号",
        "name": "陕西大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.454815,
            31.222546
        ],
        "address": "延安中路839号",
        "name": "新民大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.544825,
            31.289211
        ],
        "address": "延吉东路140弄",
        "name": "长华绿苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.454393,
            31.223126
        ],
        "address": "延安中路841号",
        "name": "东方海外大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.369109,
            31.246168
        ],
        "address": "延川路299弄",
        "name": "广德苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.534271,
            31.284735
        ],
        "address": "延吉中路25弄",
        "name": "泰鸿新苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.441008,
            31.228474
        ],
        "address": "延平路121号",
        "name": "三和大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.440625,
            31.228282
        ],
        "address": "延平路123弄",
        "name": "三和花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.441111,
            31.229073
        ],
        "address": "延平路128号",
        "name": "盛达园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436866,
            31.235555
        ],
        "address": "延平路518弄",
        "name": "静安锦都公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.441618,
            31.227821
        ],
        "address": "延平路69号",
        "name": "延平大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441287,
            31.228063
        ],
        "address": "延平路81号",
        "name": "金叶大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.441801,
            31.228477
        ],
        "address": "延平路98号",
        "name": "98创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.458055,
            31.272236
        ],
        "address": "延长路162弄",
        "name": "爱甸苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.462317,
            31.27449
        ],
        "address": "延长路99弄",
        "name": "峥宸苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.428227,
            31.259956
        ],
        "address": "延长西路633弄3号",
        "name": "志丹苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432323,
            31.259602
        ],
        "address": "延长西路555弄4、6、7号（广新路）",
        "name": "银都佳园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.427214,
            31.259315
        ],
        "address": "延长西路677弄",
        "name": "华延公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.450277,
            31.269014
        ],
        "address": "延长中路576号",
        "name": "新世纪公寓（延长中路）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.438034,
            31.263326
        ],
        "address": "延长西路220弄5号",
        "name": "浦安公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.448855,
            31.268683
        ],
        "address": "延长中路619号",
        "name": "延中大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.448464,
            31.268924
        ],
        "address": "延长中路625号",
        "name": "延长工业园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.447795,
            31.26901
        ],
        "address": "延长中路629弄",
        "name": "延铁家园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.444818,
            31.266887
        ],
        "address": "延长中路801号",
        "name": "新华文化科技园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.529431,
            31.196454
        ],
        "address": "严家桥路1号",
        "name": "宏慧音悦湾",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.526389,
            31.189241
        ],
        "address": "严桥路58弄",
        "name": "由由新邸",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.511371,
            31.035695
        ],
        "address": "盐铁塘路176弄",
        "name": "永康城蒲芳苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.470143,
            31.220842
        ],
        "address": "雁荡路5号",
        "name": "金雁坊",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.425925,
            31.284558
        ],
        "address": "阳城路280弄",
        "name": "阳城贵都",
        "count": 63,
        "style": 0
    },
    {
        "lnglat": [
            121.42304,
            31.28493
        ],
        "address": "阳城路388弄",
        "name": "浦联佳苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.426177,
            31.284049
        ],
        "address": "阳城路283弄",
        "name": "大华阳城花园",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.591942,
            31.336554
        ],
        "address": "杨高北路1188号",
        "name": "阳明花园广场",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.508727,
            31.036185
        ],
        "address": "盐铁塘路272弄1-21号",
        "name": "永康城丽华园",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.605505,
            31.264735
        ],
        "address": "杨高北路5291弄",
        "name": "金桥新城（金石苑）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.587391,
            31.345736
        ],
        "address": "杨高北路528号",
        "name": "招商中心大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.587501,
            31.345434
        ],
        "address": "杨高北路536号",
        "name": "乐非天地",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.588265,
            31.34438
        ],
        "address": "杨高北路610号",
        "name": "三铭公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.52928,
            31.203183
        ],
        "address": "杨高南路1288号",
        "name": "中远龙阳公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.531945,
            31.150147
        ],
        "address": "杨高南路5055号",
        "name": "明丰花园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.534172,
            31.217295
        ],
        "address": "杨高南路428号",
        "name": "由由世纪广场",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.53406,
            31.148877
        ],
        "address": "杨高南路5135弄",
        "name": "日月豪庭",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.53484,
            31.213464
        ],
        "address": "杨高南路729号",
        "name": "陆家嘴世纪金融广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.519956,
            31.176507
        ],
        "address": "杨高南路2875号",
        "name": "康琳创意园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.556074,
            31.23173
        ],
        "address": "杨高中路2112号",
        "name": "界龙总部园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.555761,
            31.228904
        ],
        "address": "杨高中路2797号",
        "name": "联洋社区市民中心大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.404324,
            31.234324
        ],
        "address": "杨柳青路118弄",
        "name": "万都花园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.662714,
            31.032682
        ],
        "address": "杨辉路966弄",
        "name": "中粮禧瑞祥云",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.500755,
            31.153099
        ],
        "address": "杨南路689弄",
        "name": "上海叠翠苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.541543,
            31.258914
        ],
        "address": "杨树浦路1736弄",
        "name": "丰泰世纪公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.515675,
            31.25076
        ],
        "address": "杨树浦路248号",
        "name": "瑞丰国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.557522,
            31.272492
        ],
        "address": "杨树浦路2866号",
        "name": "上海国际时尚中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.548445,
            31.265043
        ],
        "address": "杨树浦路2300号",
        "name": "知兴大厦",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.532683,
            31.271111
        ],
        "address": "杨浦区黄兴路122号",
        "name": "光大信成大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.5575,
            31.272188
        ],
        "address": "杨树浦路2893号",
        "name": "海尚大厦",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.50581,
            31.1649
        ],
        "address": "杨思路1121弄",
        "name": "东方悦居苑",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.429827,
            31.393432
        ],
        "address": "杨泰路2158弄",
        "name": "远洋悦庭二期",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.429828,
            31.395118
        ],
        "address": "杨泰路2158弄50-68号",
        "name": "远洋悦庭三期",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.430592,
            31.39373
        ],
        "address": "杨泰路2158弄5-32号",
        "name": "远洋悦庭一期",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.503469,
            31.166025
        ],
        "address": "杨新东路160号",
        "name": "世博树源",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.417132,
            31.202803
        ],
        "address": "杨宅路255号",
        "name": "新发现才富园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.492263,
            31.164118
        ],
        "address": "杨新路88号",
        "name": "尚馥骊湾88文化创意园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.450547,
            31.372075
        ],
        "address": "杨鑫路98弄",
        "name": "禄德华苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.407854,
            31.190664
        ],
        "address": "姚虹路299号",
        "name": "恒盛苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.482652,
            31.172335
        ],
        "address": "耀华路488号",
        "name": "信建大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.47227,
            31.169815
        ],
        "address": "耀元路58号",
        "name": "上海环球都会广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.481458,
            31.17104
        ],
        "address": "耀华路550弄",
        "name": "耀华大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.24506,
            31.363018
        ],
        "address": "叶城路1118号",
        "name": "淮海国际广场(嘉定)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.244541,
            31.362736
        ],
        "address": "叶城路1128号",
        "name": "中青旅东方国际酒店",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.251748,
            31.365695
        ],
        "address": "叶城路818号",
        "name": "嘉禾大厦_上海",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.447033,
            31.325401
        ],
        "address": "一二八纪念路933弄",
        "name": "好天缘家苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.478673,
            31.328222
        ],
        "address": "一二八纪念东路518弄",
        "name": "象屿郦庭",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.269615,
            31.16012
        ],
        "address": "叶联路699弄",
        "name": "南山雨果",
        "count": 67,
        "style": 0
    },
    {
        "lnglat": [
            121.447172,
            31.323696
        ],
        "address": "一二八纪念路968号",
        "name": "宝山万达写字楼",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.404668,
            31.402621
        ],
        "address": "杨南路399弄",
        "name": "翡翠上南苑上南翡翠",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.404998,
            31.191546
        ],
        "address": "伊犁南路34弄",
        "name": "虹桥明珠公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.403603,
            31.191187
        ],
        "address": "伊犁南路111号",
        "name": "钱江商务广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.407019,
            31.195795
        ],
        "address": "伊犁南路500弄",
        "name": "古北中央花园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.459682,
            31.200631
        ],
        "address": "医学院路15号",
        "name": "嘉馨公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.248097,
            31.35432
        ],
        "address": "依玛路389弄",
        "name": "新城香溢璟庭",
        "count": 81,
        "style": 0
    },
    {
        "lnglat": [
            121.431096,
            31.243435
        ],
        "address": "宜昌路588弄",
        "name": "大上海城市花园",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.439159,
            31.264627
        ],
        "address": "宜川路351弄62-66号",
        "name": "展宏公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.437994,
            31.262464
        ],
        "address": "宜川路299号",
        "name": "宜乐荟",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.438105,
            31.269951
        ],
        "address": "宜川路733弄",
        "name": "望景苑",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.43868,
            31.270771
        ],
        "address": "宜川路778弄",
        "name": "宁泰馨苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.396722,
            31.169186
        ],
        "address": "宜山路1289号",
        "name": "克隆科技园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.40097,
            31.170655
        ],
        "address": "宜山路1009号",
        "name": "创新大厦",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.389147,
            31.168316
        ],
        "address": "宜山路1768号",
        "name": "福维克大厦(耀光虹桥中心)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.430511,
            31.189807
        ],
        "address": "宜山路187号",
        "name": "南山大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.395284,
            31.170601
        ],
        "address": "宜山路1398号",
        "name": "皓顺大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.382517,
            31.165564
        ],
        "address": "宜山路2301弄",
        "name": "九歌商务中心",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.384921,
            31.16709
        ],
        "address": "宜山路2016号",
        "name": "合川大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.430416,
            31.187458
        ],
        "address": "宜山路333号",
        "name": "汇鑫国际大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.427585,
            31.183951
        ],
        "address": "宜山路439号",
        "name": "七建大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42838,
            31.183831
        ],
        "address": "宜山路425号",
        "name": "光启城",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.425734,
            31.18196
        ],
        "address": "宜山路508号",
        "name": "景鸿大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.42553,
            31.181426
        ],
        "address": "宜山路520号",
        "name": "中华门大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.421298,
            31.176551
        ],
        "address": "宜山路515弄",
        "name": "环线广场",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.425654,
            31.176266
        ],
        "address": "宜山路655弄6号",
        "name": "高知楼_高级知识分子楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.415723,
            31.173968
        ],
        "address": "宜山路705号",
        "name": "科技大厦（上海）",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.402898,
            31.172264
        ],
        "address": "宜山路888号",
        "name": "新银大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.406887,
            31.172878
        ],
        "address": "宜山路810号",
        "name": "上海贝岭大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.401292,
            31.172037
        ],
        "address": "宜山路900号",
        "name": "科产楼C楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.417865,
            31.176881
        ],
        "address": "宜山路700号",
        "name": "普天科创产业园",
        "count": 67,
        "style": 0
    },
    {
        "lnglat": [
            121.404415,
            31.171015
        ],
        "address": "宜山路889号",
        "name": "齐来大厦及齐来工业城",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.40862,
            31.170101
        ],
        "address": "宜州路180号",
        "name": "华鑫天地",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.398301,
            31.171605
        ],
        "address": "宜山路926号",
        "name": "新思大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.410947,
            31.136963
        ],
        "address": "益文路101弄",
        "name": "锦鸿公寓",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.485809,
            31.313998
        ],
        "address": "逸仙路1277号",
        "name": "财景科技园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.484679,
            31.316107
        ],
        "address": "逸仙路1300号",
        "name": "悦樘公寓(殷高西路店)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.487748,
            31.314275
        ],
        "address": "逸仙路1321弄5支弄7支弄",
        "name": "幸之苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.483836,
            31.318393
        ],
        "address": "逸仙路1328号",
        "name": "新业坊源创全球科创示范区（新业坊源创园区）",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.488038,
            31.295722
        ],
        "address": "逸仙路158号",
        "name": "宝隆一方大厦",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.490282,
            31.294599
        ],
        "address": "逸仙路25号",
        "name": "同济逸仙大厦（同济晶度）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.493785,
            31.336574
        ],
        "address": "逸仙路2816号",
        "name": "华滋奔腾大厦",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.497026,
            31.340224
        ],
        "address": "逸仙路3000号",
        "name": "上海国际工业设计中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.486903,
            31.299034
        ],
        "address": "逸仙路300号",
        "name": "元和投资大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.50279,
            31.353445
        ],
        "address": "逸仙路3901号",
        "name": "东海航运大楼",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.486233,
            31.301171
        ],
        "address": "逸仙路432弄",
        "name": "久久公寓",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.487065,
            31.301982
        ],
        "address": "逸仙路661号",
        "name": "新海商务大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.484276,
            31.320013
        ],
        "address": "殷高西路10弄",
        "name": "景瑞站前大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.472285,
            31.320155
        ],
        "address": "殷高西路518号",
        "name": "尚景天地",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.469058,
            31.319989
        ],
        "address": "殷高西路711号",
        "name": "高境文化广场",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.508359,
            31.329903
        ],
        "address": "殷行路1286号",
        "name": "上海嘉誉国际广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.50557,
            31.233532
        ],
        "address": "银城中路501号",
        "name": "上海中心大厦(商场)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.503329,
            31.238484
        ],
        "address": "银城中路200号",
        "name": "中银大厦(上海)",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.510118,
            31.241313
        ],
        "address": "银城路66号",
        "name": "尚悦湾广场",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.50352,
            31.231466
        ],
        "address": "银城中路600弄",
        "name": "中粮海景壹号",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.507322,
            31.241745
        ],
        "address": "余姚路19号余姚路27号",
        "name": "永昌大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.393778,
            31.024757
        ],
        "address": "银春路1799弄",
        "name": "夏朵园上海",
        "count": 78,
        "style": 0
    },
    {
        "lnglat": [
            121.386817,
            31.025653
        ],
        "address": "银春路2200弄",
        "name": "万科马桥景城乐康苑",
        "count": 70,
        "style": 0
    },
    {
        "lnglat": [
            121.410335,
            31.096888
        ],
        "address": "银都路2755号",
        "name": "福克斯连锁商务大厦（银都园区）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.415427,
            31.099528
        ],
        "address": "银都路2188弄",
        "name": "中海寰宇名邸",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.448807,
            31.106835
        ],
        "address": "银都路398号",
        "name": "博济银都汇谷",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.453469,
            31.1064
        ],
        "address": "银都路4277号",
        "name": "金地威新闵行科创园(银都路园)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.44745,
            31.106358
        ],
        "address": "银都路466号",
        "name": "上海聚科生物园区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.445182,
            31.106504
        ],
        "address": "银都路466弄23号",
        "name": "九润商务大厦(龙吴)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.365917,
            31.081673
        ],
        "address": "银都西路215号",
        "name": "歆翱创意园(东区)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.379533,
            31.021027
        ],
        "address": "银康路735弄",
        "name": "马桥景城元景富文苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.374471,
            31.019997
        ],
        "address": "银康路750号",
        "name": "马桥景城和苑",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.388266,
            31.024021
        ],
        "address": "银康路76弄",
        "name": "银春苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.371719,
            31.017652
        ],
        "address": "银林路1002弄1~30号",
        "name": "#N/A",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.368718,
            31.021368
        ],
        "address": "银秋路1351弄",
        "name": "保利雅苑闵行",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.321977,
            31.289577
        ],
        "address": "银翔路655号",
        "name": "蓝天创业广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.388565,
            31.021039
        ],
        "address": "银林路100弄",
        "name": "银康苑",
        "count": 82,
        "style": 0
    },
    {
        "lnglat": [
            121.320146,
            31.288476
        ],
        "address": "银翔路799号",
        "name": "昌辉大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.31935,
            31.287901
        ],
        "address": "银翔路819弄1号",
        "name": "中暨大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.559255,
            31.212756
        ],
        "address": "银霄路39弄",
        "name": "浦东世纪花园二期",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.647853,
            31.212731
        ],
        "address": "银樽路58弄",
        "name": "张江国际豪庭",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.61683,
            31.311601
        ],
        "address": "英伦路396号",
        "name": "富立康大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.491391,
            31.262141
        ],
        "address": "银欣路38号",
        "name": "麒麟大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.559809,
            31.209157
        ],
        "address": "樱花路801弄",
        "name": "大唐盛世花园二期",
        "count": 84,
        "style": 0
    },
    {
        "lnglat": [
            121.558883,
            31.206094
        ],
        "address": "樱花路802弄",
        "name": "大唐国际公寓",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.562925,
            31.229038
        ],
        "address": "迎春路1355弄",
        "name": "浦东虹桥公寓",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.552908,
            31.222856
        ],
        "address": "迎春路736弄",
        "name": "联洋新苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.489654,
            31.216862
        ],
        "address": "迎勋北路8弄",
        "name": "唐城公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.180987,
            31.160341
        ],
        "address": "盈港东路6433号",
        "name": "8090青年创业基地赵巷园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.153412,
            31.161974
        ],
        "address": "盈港东路7802号",
        "name": "宝龙中心（青浦）",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.140071,
            31.162006
        ],
        "address": "盈港东路8300弄",
        "name": "佳乐苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.115811,
            31.159029
        ],
        "address": "盈港路453号",
        "name": "港隆国际大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.535218,
            31.296824
        ],
        "address": "营口路600弄",
        "name": "佳龙花园",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.310455,
            31.007064
        ],
        "address": "影佳路333号",
        "name": "雅居乐星徽",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.533014,
            31.292851
        ],
        "address": "营口路625弄",
        "name": "营口大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.533855,
            31.294633
        ],
        "address": "营口路488号",
        "name": "海尚杰座",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.439273,
            31.154501
        ],
        "address": "永川路187号",
        "name": "经纬梦园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.310207,
            31.004635
        ],
        "address": "影振路299弄",
        "name": "安贝尔花园",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.214888,
            31.011697
        ],
        "address": "永丰路270弄",
        "name": "玉龙苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.444466,
            31.288836
        ],
        "address": "永和路318弄18号",
        "name": "东方环球企业中心18号",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.444636,
            31.287864
        ],
        "address": "永和路201号",
        "name": "久合201",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.44063,
            31.287111
        ],
        "address": "永和路455号",
        "name": "创景空间",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.446276,
            31.289491
        ],
        "address": "永和路118弄",
        "name": "东方环球企业中心43号",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.531603,
            31.288171
        ],
        "address": "永吉路9号",
        "name": "永吉广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.45918,
            31.209538
        ],
        "address": "永嘉路158号",
        "name": "嘉嘉大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.451083,
            31.205864
        ],
        "address": "永嘉路570号",
        "name": "永嘉庭",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.433792,
            31.012905
        ],
        "address": "永平南路198弄",
        "name": "东苑佳和园",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.44937,
            31.204639
        ],
        "address": "永嘉路589号",
        "name": "永嘉大楼（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.257936,
            31.401496
        ],
        "address": "永靖路501弄",
        "name": "嘉华居",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.463696,
            31.210784
        ],
        "address": "永嘉路31号,35号",
        "name": "茂名大厦（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.255666,
            31.346958
        ],
        "address": "永盛路1218号",
        "name": "金元大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.544662,
            31.145454
        ],
        "address": "永泰路2080弄",
        "name": "浦发绿城（南区）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.517031,
            31.141481
        ],
        "address": "永泰路595弄1-41号",
        "name": "金谊河畔一期",
        "count": 132,
        "style": 0
    },
    {
        "lnglat": [
            121.525125,
            31.147471
        ],
        "address": "永泰路1058弄1-26号",
        "name": "新达汇三林",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.514721,
            31.140737
        ],
        "address": "永泰路595弄42-68号",
        "name": "金谊河畔二期",
        "count": 84,
        "style": 0
    },
    {
        "lnglat": [
            121.534945,
            31.144782
        ],
        "address": "永泰路1650弄",
        "name": "名嘉新苑",
        "count": 73,
        "style": 0
    },
    {
        "lnglat": [
            121.473053,
            31.253072
        ],
        "address": "永兴路258弄1号楼",
        "name": "兴亚广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.47578,
            31.255425
        ],
        "address": "永兴路39弄",
        "name": "蒙特利城一期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.460509,
            31.251342
        ],
        "address": "永兴路888弄",
        "name": "万锦城",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.511183,
            31.034282
        ],
        "address": "永跃路782弄",
        "name": "永康城佳兴苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.353908,
            31.126203
        ],
        "address": "友东路358号",
        "name": "闵欣大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.355958,
            31.121683
        ],
        "address": "友东路85号",
        "name": "友东路85号商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.389808,
            31.108774
        ],
        "address": "友情路50弄",
        "name": "名都新城四期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.355658,
            31.122351
        ],
        "address": "友东路81号",
        "name": "友东路81号商务楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.509801,
            31.031093
        ],
        "address": "永跃路555弄",
        "name": "永康城馨宁佳苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.464575,
            31.39749
        ],
        "address": "友谊路1060号",
        "name": "璨阳文化科创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.456019,
            31.393023
        ],
        "address": "友谊路1508号",
        "name": "晶钢商务馆",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.457208,
            31.393627
        ],
        "address": "友谊路1518弄",
        "name": "永景国际大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.454278,
            31.393357
        ],
        "address": "友谊路1588弄",
        "name": "钢领",
        "count": 70,
        "style": 0
    },
    {
        "lnglat": [
            121.436477,
            31.38689
        ],
        "address": "友谊路2699号",
        "name": "海创杨泰高新科技园B座",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.426291,
            31.382063
        ],
        "address": "友谊西路101号",
        "name": "上海建筑科技产业园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.193389,
            31.289697
        ],
        "address": "于塘南路82弄",
        "name": "盛世景庭",
        "count": 49,
        "style": 0
    },
    {
        "lnglat": [
            121.193238,
            31.292906
        ],
        "address": "于塘南路280弄",
        "name": "恒大名都(上海)",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.18158,
            31.280245
        ],
        "address": "于田南路36号",
        "name": "智能网联新能源汽车创新孵化中心",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.43863,
            31.236073
        ],
        "address": "余姚路288弄",
        "name": "鸿新商务楼(汇智创意园)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.437327,
            31.235118
        ],
        "address": "余姚路339号",
        "name": "百乐门商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.435701,
            31.234487
        ],
        "address": "余姚路420号",
        "name": "荣瑞商务中心(汇智金昌园区)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.434869,
            31.233982
        ],
        "address": "余姚路456号",
        "name": "新都城公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.433312,
            31.233442
        ],
        "address": "余姚路566弄",
        "name": "均泰丽轩",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.434312,
            31.233414
        ],
        "address": "余姚路500弄",
        "name": "家化绿苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.433845,
            31.232392
        ],
        "address": "余姚路569号",
        "name": "美联大厦(上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.464451,
            31.266444
        ],
        "address": "俞泾港路15弄18，19号",
        "name": "乐业公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.528636,
            31.259876
        ],
        "address": "榆林路858弄",
        "name": "滨江晶典",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.851313,
            30.866298
        ],
        "address": "渔港路399弄",
        "name": "朗诗里程",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.427544,
            31.218258
        ],
        "address": "愚园路1155弄",
        "name": "愚园公馆",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.426895,
            31.2178
        ],
        "address": "愚园路1203弄",
        "name": "仲信苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.425928,
            31.219444
        ],
        "address": "愚园路1258号",
        "name": "绿地商务大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.426202,
            31.218635
        ],
        "address": "愚园路1221弄1号",
        "name": "御华名苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.444439,
            31.224177
        ],
        "address": "愚园路168号",
        "name": "环球世界大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.444364,
            31.224166
        ],
        "address": "愚园路172号",
        "name": "环球世界大厦B座",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.442673,
            31.223121
        ],
        "address": "愚园路309号",
        "name": "紫安大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.431722,
            31.220482
        ],
        "address": "愚园路888号",
        "name": "畅园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.432069,
            31.219634
        ],
        "address": "愚园路905-907号",
        "name": "新利商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.547086,
            31.232949
        ],
        "address": "羽山路600弄",
        "name": "东方中华园(第五大道)",
        "count": 74,
        "style": 0
    },
    {
        "lnglat": [
            121.553129,
            31.236578
        ],
        "address": "羽山路851弄",
        "name": "新城名庭",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.555041,
            31.237298
        ],
        "address": "羽山路967弄",
        "name": "森林湾家园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.556631,
            31.237118
        ],
        "address": "羽山路998弄",
        "name": "景宏嘉园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.549746,
            31.203142
        ],
        "address": "玉兰路8号",
        "name": "盛第大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.412215,
            31.212322
        ],
        "address": "玉屏南路1号",
        "name": "玉屏大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.410172,
            31.212048
        ],
        "address": "玉屏南路113弄17号",
        "name": "锦屏公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.404109,
            31.214649
        ],
        "address": "玉屏南路498弄1-3号",
        "name": "安基大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.411588,
            31.212288
        ],
        "address": "玉屏南路9号",
        "name": "新联大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.269664,
            31.167418
        ],
        "address": "育才路555弄",
        "name": "西郊美德苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.58188,
            31.154037
        ],
        "address": "御衡路68弄",
        "name": "锦绣华都",
        "count": 73,
        "style": 0
    },
    {
        "lnglat": [
            121.283004,
            31.318789
        ],
        "address": "育英南街55弄",
        "name": "恒大御景湾(上海)",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.573069,
            31.158186
        ],
        "address": "御桥路1978弄3号",
        "name": "地杰国际城F街坊",
        "count": 81,
        "style": 0
    },
    {
        "lnglat": [
            121.575306,
            31.158076
        ],
        "address": "御桥路2066弄",
        "name": "地杰国际城E街坊",
        "count": 79,
        "style": 0
    },
    {
        "lnglat": [
            121.539048,
            31.145942
        ],
        "address": "御桥路288弄",
        "name": "未来域",
        "count": 72,
        "style": 0
    },
    {
        "lnglat": [
            121.572289,
            31.161036
        ],
        "address": "御水路150弄",
        "name": "万科金色城市2期悦庭(地杰国际C街坊)",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.57473,
            31.160047
        ],
        "address": "御水路199弄",
        "name": "地杰国际城D街坊",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.567502,
            31.158238
        ],
        "address": "御桥路1679弄",
        "name": "御桥河滨苑（万科海上传奇）",
        "count": 49,
        "style": 0
    },
    {
        "lnglat": [
            121.432559,
            31.185407
        ],
        "address": "裕德路168号",
        "name": "徐汇商务大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.238234,
            31.367449
        ],
        "address": "裕民路1000弄",
        "name": "清水颐园",
        "count": 105,
        "style": 0
    },
    {
        "lnglat": [
            121.399415,
            31.047033
        ],
        "address": "元江路3599号",
        "name": "福克斯创新园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.634392,
            31.317354
        ],
        "address": "园二路299弄",
        "name": "广盛佳苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.344011,
            31.303742
        ],
        "address": "园丰路69号",
        "name": "联东U谷宝山科创中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.431896,
            31.042551
        ],
        "address": "园区北路19号",
        "name": "上海雍臻公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.40279,
            31.048404
        ],
        "address": "元江路3399号",
        "name": "中臻科创园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.728847,
            31.018465
        ],
        "address": "园通路128号",
        "name": "东方智谷",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.431103,
            31.297891
        ],
        "address": "原平路1028弄-1029弄",
        "name": "成亿花园",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.53601,
            31.22696
        ],
        "address": "源深路836号",
        "name": "香榭丽花园",
        "count": 67,
        "style": 0
    },
    {
        "lnglat": [
            121.430855,
            31.285639
        ],
        "address": "原平路383弄",
        "name": "永和丽园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.53192,
            31.235718
        ],
        "address": "源深路92号",
        "name": "航科大厦",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.412285,
            31.42952
        ],
        "address": "月富路55弄",
        "name": "新城昱翠湾",
        "count": 134,
        "style": 0
    },
    {
        "lnglat": [
            121.352339,
            31.411975
        ],
        "address": "月罗公路2333号",
        "name": "兰湖美域",
        "count": 95,
        "style": 0
    },
    {
        "lnglat": [
            121.355274,
            31.412574
        ],
        "address": "月罗路2255号",
        "name": "博济上海美兰湖园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.501702,
            31.260373
        ],
        "address": "岳州路319弄",
        "name": "虹领公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.453028,
            31.204328
        ],
        "address": "岳阳路217号",
        "name": "岳阳公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.502509,
            31.260869
        ],
        "address": "岳州路399弄",
        "name": "紫虹嘉苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.817301,
            30.89107
        ],
        "address": "云端路1389弄",
        "name": "海云苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.498297,
            31.256938
        ],
        "address": "岳州路58号",
        "name": "岳洋大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.817408,
            30.887509
        ],
        "address": "云端路1388弄",
        "name": "凌波苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.820197,
            30.889059
        ],
        "address": "云端路1566弄",
        "name": "春晓苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.804124,
            30.911545
        ],
        "address": "云汉路1096弄",
        "name": "荷风华庭",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.821907,
            30.890057
        ],
        "address": "云端路1565弄",
        "name": "雨浥苑",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.256566,
            31.328163
        ],
        "address": "云谷路279弄",
        "name": "绿地嘉域生活中心",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.80683,
            30.91027
        ],
        "address": "云汉路977弄",
        "name": "荷风翠庭",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.807586,
            30.910747
        ],
        "address": "云汉路978弄",
        "name": "荷风景庭",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.388023,
            31.222202
        ],
        "address": "云岭东路391",
        "name": "长风嘉庭国际",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.457558,
            31.164999
        ],
        "address": "云锦路500号",
        "name": "绿地汇中心",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.457765,
            31.163851
        ],
        "address": "云锦路600号",
        "name": "航汇大厦",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.382542,
            31.22186
        ],
        "address": "云岭东路599弄",
        "name": "汇银金融商务楼",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.382167,
            31.223578
        ],
        "address": "云岭东路651号",
        "name": "合星大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.367601,
            31.231021
        ],
        "address": "云岭西路600弄",
        "name": "金环商务花园二期",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.474831,
            31.237285
        ],
        "address": "云南北路59号",
        "name": "六合大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.36116,
            31.231235
        ],
        "address": "云岭西路899弄",
        "name": "河滨香景园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.246372,
            31.339612
        ],
        "address": "云屏路1199弄",
        "name": "盘古天地一期（上海）",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.57326,
            31.248818
        ],
        "address": "云山路1039弄",
        "name": "陆家嘴新景园(1039弄)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.247177,
            31.339738
        ],
        "address": "云屏路1188弄",
        "name": "盘古天地二期（上海）",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.481359,
            31.226566
        ],
        "address": "云南南路180号",
        "name": "淮云大厦",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.572749,
            31.251187
        ],
        "address": "云山路999弄",
        "name": "云山星座苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.572141,
            31.24893
        ],
        "address": "云山路1050弄",
        "name": "陆家嘴新景园(1050弄)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.50452,
            31.179508
        ],
        "address": "云台路183弄",
        "name": "昌里花园",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.506871,
            31.171985
        ],
        "address": "云台路453号",
        "name": "金色国际公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.507351,
            31.168699
        ],
        "address": "云台路529弄",
        "name": "恒大广场国际公寓_爵仕悦",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.473127,
            31.31871
        ],
        "address": "云西路219弄",
        "name": "三花现代城二期（香梅苑）",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.466135,
            30.925654
        ],
        "address": "运河北路258号",
        "name": "绿地方舟",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.433521,
            31.352844
        ],
        "address": "蕴川路516号",
        "name": "泰德科技园（二期）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.572287,
            31.253261
        ],
        "address": "云山路835弄，839弄",
        "name": "黄山新城上海未来",
        "count": 62,
        "style": 0
    },
    {
        "lnglat": [
            121.43354,
            31.352978
        ],
        "address": "薀川路516号",
        "name": "泰德商务大厦(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.401213,
            31.23471
        ],
        "address": "枣阳路251弄80号2号楼",
        "name": "湾流国际青年社区华师大店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.402468,
            31.22727
        ],
        "address": "枣阳路530弄",
        "name": "枣阳路530弄公寓楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.401467,
            31.234012
        ],
        "address": "枣阳路297弄",
        "name": "金阳怡景苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.401838,
            31.223037
        ],
        "address": "枣阳路891弄",
        "name": "冠龙家园（风华水岸）",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.583801,
            31.248736
        ],
        "address": "枣庄路959号",
        "name": "锋巢宫寓(百舸商务酒店)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.246025,
            31.101595
        ],
        "address": "泽悦路211弄",
        "name": "兰花清苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.248415,
            31.101672
        ],
        "address": "泽悦路212弄",
        "name": "水仙雅苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.24566,
            31.103818
        ],
        "address": "泽悦路325弄1-30号",
        "name": "茉莉雅苑",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.585704,
            31.185486
        ],
        "address": "张衡路198弄10号",
        "name": "金鹤信息科技园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.517001,
            31.215892
        ],
        "address": "张家浜路37弄3号",
        "name": "京城大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.70524,
            31.240865
        ],
        "address": "张江高科技园区东区瑞庆路590号",
        "name": "7号地块张江东区现代医疗器械产业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.248342,
            31.099506
        ],
        "address": "泽悦路88弄",
        "name": "桂花锦苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.590526,
            31.186201
        ],
        "address": "张江高科技园区张衡路500弄",
        "name": "人才城",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.622298,
            31.196956
        ],
        "address": "张江路1206号",
        "name": "张江科创园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.611823,
            31.212343
        ],
        "address": "张江路69号",
        "name": "戏剧谷",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.616476,
            31.204668
        ],
        "address": "张江路665号",
        "name": "德宏大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.617433,
            31.203508
        ],
        "address": "张江路725号",
        "name": "德宏商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.611966,
            31.211605
        ],
        "address": "张江路75号10幢",
        "name": "海德堡中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.595247,
            31.210887
        ],
        "address": "张江镇郭守敬路351号",
        "name": "一标厂房（创e空间）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.603031,
            31.180307
        ],
        "address": "张江镇海趣路58号",
        "name": "海趣园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.520255,
            31.229163
        ],
        "address": "张扬路707号",
        "name": "生命人寿大厦",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.437962,
            30.933002
        ],
        "address": "张翁庙路525号",
        "name": "晨日科技创意园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.588029,
            31.308144
        ],
        "address": "张杨北路2899弄",
        "name": "金地未未来",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.530943,
            31.229693
        ],
        "address": "张杨路1050弄5号",
        "name": "梅竹大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.587183,
            31.267079
        ],
        "address": "张杨北路555弄",
        "name": "同方锦城",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.532415,
            31.231857
        ],
        "address": "张杨路1328号",
        "name": "明竹公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.533446,
            31.232224
        ],
        "address": "张杨路1348号",
        "name": "春竹大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.539334,
            31.233743
        ],
        "address": "张杨路1500弄",
        "name": "证大宽域公寓",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.535722,
            31.23549
        ],
        "address": "张杨路1515弄",
        "name": "陆家嘴国际华城",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.539968,
            31.234243
        ],
        "address": "张杨路1518弄",
        "name": "金博尚品苑办公楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.538495,
            31.235243
        ],
        "address": "张杨路1589、1591号",
        "name": "八方大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.539597,
            31.235266
        ],
        "address": "张杨路1619弄",
        "name": "东珂花苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.541873,
            31.236057
        ],
        "address": "张杨路1667弄",
        "name": "金露苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.542981,
            31.236932
        ],
        "address": "张杨路1673弄",
        "name": "生安花苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.511759,
            31.225038
        ],
        "address": "张杨路188号",
        "name": "汤臣中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.548216,
            31.239619
        ],
        "address": "张杨路1811弄",
        "name": "海上景庭",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.554673,
            31.239726
        ],
        "address": "张杨路2100弄",
        "name": "华阳苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.557849,
            31.240921
        ],
        "address": "张杨路2242弄",
        "name": "翡翠湾公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.554713,
            31.240748
        ],
        "address": "张杨路2389弄",
        "name": "置汇旭辉广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.556926,
            31.240483
        ],
        "address": "张杨路2228弄",
        "name": "张杨花苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.560028,
            31.242116
        ],
        "address": "张杨路2600弄",
        "name": "广洋华景苑",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.561975,
            31.245473
        ],
        "address": "张杨路2771",
        "name": "信罗大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.570201,
            31.248565
        ],
        "address": "张杨路3080弄",
        "name": "名典苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.569736,
            31.24954
        ],
        "address": "张杨路3083弄",
        "name": "广洋苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.518828,
            31.227504
        ],
        "address": "张杨路560、620号",
        "name": "恒瑞国际大厦",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.518373,
            31.228384
        ],
        "address": "张杨路579号",
        "name": "三鑫世界商厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.520547,
            31.228144
        ],
        "address": "张杨路628弄",
        "name": "东明广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.521919,
            31.228571
        ],
        "address": "张杨路800号",
        "name": "长航大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.519438,
            31.228759
        ],
        "address": "张杨路655号",
        "name": "福兴大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.523271,
            31.228757
        ],
        "address": "张杨路828-838号",
        "name": "华都大厦(上海)",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.452202,
            31.245047
        ],
        "address": "长安路1001号",
        "name": "长安大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.051498,
            31.001588
        ],
        "address": "章练塘路880弄",
        "name": "旭辉朗悦庭",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.451776,
            31.247049
        ],
        "address": "长安路1138号",
        "name": "中房华东大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.456685,
            31.239289
        ],
        "address": "长安路550弄12号",
        "name": "安丰小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.590004,
            31.259874
        ],
        "address": "长岛路1066弄",
        "name": "碧云新天地家园三期",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.600996,
            31.264129
        ],
        "address": "长岛路1560弄",
        "name": "长岛花苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.585196,
            31.262367
        ],
        "address": "长岛路625弄",
        "name": "同方锦城B区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.579132,
            31.259937
        ],
        "address": "长岛路638弄",
        "name": "龙腾苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.326686,
            31.476774
        ],
        "address": "长虹路779弄",
        "name": "海上御景苑一期",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.494087,
            31.350381
        ],
        "address": "长江路392号",
        "name": "KEY设计园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.484939,
            31.333211
        ],
        "address": "长江南路180号",
        "name": "长江软件园",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.478175,
            31.346262
        ],
        "address": "长江西路101号",
        "name": "上海节能环保园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.497368,
            31.353344
        ],
        "address": "长江路43号",
        "name": "闿和长江源",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.459464,
            31.33833
        ],
        "address": "长江西路1160弄",
        "name": "泗塘四村",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.458807,
            31.338149
        ],
        "address": "长江西路1180号",
        "name": "泗塘大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.450319,
            31.333449
        ],
        "address": "长江西路1568号",
        "name": "通河二村",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.443827,
            31.33148
        ],
        "address": "长江西路1952弄2号（通河四村69号）",
        "name": "骏利财智园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.442417,
            31.331189
        ],
        "address": "长江西路2036弄1、2号",
        "name": "汇秀公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.477886,
            31.346839
        ],
        "address": "长江西路255号",
        "name": "上海国际节能环保园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.471481,
            31.343358
        ],
        "address": "长江西路755号",
        "name": "碧家国际社区(长江西路店)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.447843,
            31.215518
        ],
        "address": "长乐路801号",
        "name": "华尔登广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.44705,
            31.21535
        ],
        "address": "长乐路989号",
        "name": "THE_CENTER世纪商贸广场",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.478881,
            31.344861
        ],
        "address": "长江西路162、200号",
        "name": "湘源大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.43197,
            31.33072
        ],
        "address": "长临路1318弄",
        "name": "九英里城",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.55216,
            31.224688
        ],
        "address": "长柳路58号",
        "name": "证大立方大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.416611,
            31.219131
        ],
        "address": "长宁路1018号",
        "name": "龙之梦购物中心大厦",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.418312,
            31.217828
        ],
        "address": "长宁路1027号",
        "name": "兆丰广场",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.417104,
            31.217695
        ],
        "address": "长宁路1033号",
        "name": "联通大厦（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.416665,
            31.21774
        ],
        "address": "长宁路1055号",
        "name": "汇都大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.414394,
            31.216358
        ],
        "address": "长宁路1189号",
        "name": "长宁来福士广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.414205,
            31.217964
        ],
        "address": "长宁路1200号",
        "name": "贝多芬广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.41254,
            31.216923
        ],
        "address": "长宁路1277弄",
        "name": "中山公寓",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.412451,
            31.218598
        ],
        "address": "长宁路1318弄",
        "name": "城宁花苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.410612,
            31.216917
        ],
        "address": "长宁路1387号",
        "name": "新发现梦园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.409767,
            31.216815
        ],
        "address": "长宁路1447号",
        "name": "遵义东大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.407668,
            31.218256
        ],
        "address": "长宁路1600弄",
        "name": "沈南小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.408397,
            31.216764
        ],
        "address": "长宁路1515号",
        "name": "星火大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.428221,
            31.226024
        ],
        "address": "长宁路165号",
        "name": "华电商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.402612,
            31.21859
        ],
        "address": "长宁路1898弄",
        "name": "虹桥河滨花园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.427594,
            31.22288
        ],
        "address": "长宁路405弄2号",
        "name": "花园村雅苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426899,
            31.224194
        ],
        "address": "长宁路378号",
        "name": "长宁大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.428168,
            31.224748
        ],
        "address": "长宁路269弄",
        "name": "静安风华苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.406762,
            31.217582
        ],
        "address": "长宁路1666弄",
        "name": "虹桥馨苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.425895,
            31.221788
        ],
        "address": "长宁路515号",
        "name": "兴联大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.424663,
            31.221757
        ],
        "address": "长宁路546号",
        "name": "尚街Loft长宁会馆",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.420236,
            31.218542
        ],
        "address": "长宁路855号",
        "name": "亨通国际大厦",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.424624,
            31.220374
        ],
        "address": "长宁路599号",
        "name": "长宁区机关大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.419517,
            31.219515
        ],
        "address": "长宁路888号",
        "name": "兆丰嘉园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.419321,
            31.21758
        ],
        "address": "长宁路969号",
        "name": "兆丰花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.426511,
            31.227026
        ],
        "address": "长宁支路125弄",
        "name": "长宁88金廷",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.424867,
            31.22597
        ],
        "address": "长宁支路237弄1号",
        "name": "长芝大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.484053,
            31.185135
        ],
        "address": "长清北路1号",
        "name": "国新控股大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.492084,
            31.149521
        ],
        "address": "长清路1200弄",
        "name": "森宏购物广场商务楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.487533,
            31.174586
        ],
        "address": "长清路12号",
        "name": "长清教师公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.426694,
            31.231937
        ],
        "address": "长寿路1112弄",
        "name": "水岸茗苑",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.42717,
            31.23071
        ],
        "address": "长寿路1118号",
        "name": "悦达国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.442329,
            31.243038
        ],
        "address": "长寿路137号",
        "name": "财富时代广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.428108,
            31.232021
        ],
        "address": "长寿路1076号",
        "name": "飞雕商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.439902,
            31.241569
        ],
        "address": "长寿路237号",
        "name": "工商银行大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.439232,
            31.240733
        ],
        "address": "长寿路285号",
        "name": "恒达大厦A幢",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.445011,
            31.245387
        ],
        "address": "长寿路28弄",
        "name": "秋水云庐",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.445842,
            31.244777
        ],
        "address": "长寿路30",
        "name": "荣年商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.438851,
            31.24194
        ],
        "address": "长寿路360号",
        "name": "源达大厦",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.437501,
            31.239613
        ],
        "address": "长寿路393号",
        "name": "昆仑商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.439,
            31.24206
        ],
        "address": "长寿路457弄",
        "name": "锦海大厦(上海)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.439436,
            31.2406
        ],
        "address": "长寿路295弄8号",
        "name": "恒达公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436779,
            31.240097
        ],
        "address": "长寿路468号",
        "name": "中环商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.435766,
            31.240432
        ],
        "address": "长寿路518弄",
        "name": "纺鑫苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.432072,
            31.238554
        ],
        "address": "长寿路652号",
        "name": "景源时尚产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.433611,
            31.236872
        ],
        "address": "长寿路633弄3号",
        "name": "长寿大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.431566,
            31.237205
        ],
        "address": "长寿路748弄1号",
        "name": "湖南大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.431099,
            31.237411
        ],
        "address": "长寿路748弄2号",
        "name": "莘远大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.429719,
            31.23709
        ],
        "address": "长寿路800弄",
        "name": "苏堤春晓名苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.433044,
            31.237008
        ],
        "address": "长寿路699号",
        "name": "国鑫大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.429699,
            31.235417
        ],
        "address": "长寿路822弄45支弄",
        "name": "汇丽花园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.4301,
            31.234638
        ],
        "address": "长寿路888号",
        "name": "大众河滨酒店公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.443024,
            31.243243
        ],
        "address": "长寿路97号",
        "name": "世纪商务大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.2548,
            31.059028
        ],
        "address": "长水街277弄",
        "name": "信达蓝尊",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.418582,
            31.198018
        ],
        "address": "长顺路36号",
        "name": "紫勋雅苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.524747,
            31.263873
        ],
        "address": "长阳路1080号",
        "name": "上海国际设计交流中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.531053,
            31.268562
        ],
        "address": "长阳路1529弄",
        "name": "旺增公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.534143,
            31.26909
        ],
        "address": "长阳路1616号",
        "name": "互联网教育大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.533738,
            31.271681
        ],
        "address": "长阳路1687号",
        "name": "长阳谷创意园区",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.541646,
            31.272624
        ],
        "address": "长阳路2080号",
        "name": "宁武小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.511023,
            31.256606
        ],
        "address": "长阳路235号",
        "name": "鼎立大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.544452,
            31.27605
        ],
        "address": "长阳路2467号",
        "name": "铭大创意广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.512199,
            31.256905
        ],
        "address": "长阳路288号",
        "name": "兰侨大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.516878,
            31.260892
        ],
        "address": "长阳路666号",
        "name": "燕舞东方保利广场M楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.509197,
            31.261567
        ],
        "address": "长阳路8号",
        "name": "建爱大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.494531,
            31.338178
        ],
        "address": "长逸路180号",
        "name": "逸隆广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.494055,
            31.339523
        ],
        "address": "长逸路15号",
        "name": "复旦软件园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.49099,
            31.33822
        ],
        "address": "长逸路301弄",
        "name": "新梅淞南苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.493903,
            31.338304
        ],
        "address": "长逸路188号",
        "name": "复旦软件园二期",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.49039,
            31.337026
        ],
        "address": "长逸路388弄",
        "name": "鹏程花苑（上海）",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.235476,
            31.355167
        ],
        "address": "招贤路1181号",
        "name": "意安乐创中心",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.426213,
            31.211842
        ],
        "address": "昭化路110号",
        "name": "增沁商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.4258,
            31.211816
        ],
        "address": "昭化路118号",
        "name": "臻悦商苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.422835,
            31.21126
        ],
        "address": "昭化路488号",
        "name": "金森大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.427788,
            31.212297
        ],
        "address": "昭化路68弄",
        "name": "晨飞公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.45602,
            31.19267
        ],
        "address": "肇家浜路407号",
        "name": "中科苑公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.458835,
            31.201618
        ],
        "address": "肇家浜路393号",
        "name": "兴南花园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.084344,
            31.146678
        ],
        "address": "赵屯浦路380弄",
        "name": "新塘苑",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.441939,
            31.194865
        ],
        "address": "肇嘉浜路1033号",
        "name": "徐家汇国际大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.441315,
            31.19443
        ],
        "address": "肇嘉浜路1065号",
        "name": "飞雕国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.439649,
            31.192944
        ],
        "address": "肇嘉浜路1111号",
        "name": "美罗城",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.464587,
            31.203103
        ],
        "address": "肇嘉浜路159号",
        "name": "友谊时代大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.463055,
            31.204099
        ],
        "address": "肇嘉浜路188弄",
        "name": "德玛公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.464009,
            31.203112
        ],
        "address": "肇嘉浜路201号",
        "name": "上海生产资料交易市场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.463881,
            31.201947
        ],
        "address": "肇嘉浜路201弄",
        "name": "衡园",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.461167,
            31.203536
        ],
        "address": "肇嘉浜路258-268号",
        "name": "紫苑大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.462244,
            31.202674
        ],
        "address": "肇嘉浜路269弄",
        "name": "云福大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.46127,
            31.202529
        ],
        "address": "肇嘉浜路301号",
        "name": "工商大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.460063,
            31.202752
        ],
        "address": "肇嘉浜路288弄2号",
        "name": "中福商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.460445,
            31.202216
        ],
        "address": "肇嘉浜路333号",
        "name": "亚太企业大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.459944,
            31.202203
        ],
        "address": "肇嘉浜路359号",
        "name": "航天科工集团大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.458078,
            31.202667
        ],
        "address": "肇嘉浜路366号",
        "name": "裕华大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.457529,
            31.202565
        ],
        "address": "肇嘉浜路376号",
        "name": "轻工大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.45931,
            31.201962
        ],
        "address": "肇嘉浜路383号",
        "name": "嘉乐公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.454935,
            31.202169
        ],
        "address": "肇嘉浜路446号",
        "name": "伊泰利大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.456701,
            31.201321
        ],
        "address": "肇嘉浜路539号",
        "name": "平华大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.449459,
            31.199542
        ],
        "address": "肇嘉浜路680号",
        "name": "上海金钟大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.448139,
            31.199239
        ],
        "address": "肇嘉浜路688弄",
        "name": "徐家汇景福苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.446208,
            31.198802
        ],
        "address": "肇嘉浜路768号",
        "name": "欧江大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.447929,
            31.197974
        ],
        "address": "肇嘉浜路807号（东安路）",
        "name": "五洲国际大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.448603,
            31.198065
        ],
        "address": "肇嘉浜路789号",
        "name": "均瑶国际广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.464606,
            31.203048
        ],
        "address": "肇嘉浜路96弄7号",
        "name": "沪筑汇",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.442493,
            31.195156
        ],
        "address": "肇嘉浜路999弄",
        "name": "上海帝景苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.479658,
            31.233124
        ],
        "address": "浙江中路188弄",
        "name": "中福城",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.478328,
            31.236296
        ],
        "address": "浙江中路400号",
        "name": "春申江大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.600834,
            31.252594
        ],
        "address": "浙桥路277号",
        "name": "碧海现代苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.601813,
            31.252818
        ],
        "address": "浙桥路289弄2号",
        "name": "碧云公馆",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.482104,
            31.228504
        ],
        "address": "浙江南路78号",
        "name": "东新商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.392131,
            31.253454
        ],
        "address": "真北路2150号",
        "name": "光学科技园区(宝岛眼镜)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.393855,
            31.260492
        ],
        "address": "真北路2500号",
        "name": "星河世纪广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.391103,
            31.253564
        ],
        "address": "真北路2167号",
        "name": "鸿海大厦（上海）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.384091,
            31.233201
        ],
        "address": "真北路958号",
        "name": "天地科技广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.40179,
            31.28496
        ],
        "address": "真北路3725弄11号",
        "name": "V领地青年社区真北路社区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.346223,
            31.300663
        ],
        "address": "真陈路788号",
        "name": "陕外物流商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.401689,
            31.292029
        ],
        "address": "真大路399弄1-20号",
        "name": "晶悦都汇(中环一号三期)",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.407878,
            31.296639
        ],
        "address": "真大路520号",
        "name": "昇park文创园区",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.410688,
            31.296854
        ],
        "address": "真大路551号",
        "name": "华生创谷文化创意产业园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.40979,
            31.298494
        ],
        "address": "真大路560号",
        "name": "永久1940iHUB创意产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.402634,
            31.289182
        ],
        "address": "真大路333弄",
        "name": "琉樽尚品",
        "count": 78,
        "style": 0
    },
    {
        "lnglat": [
            121.381962,
            31.247041
        ],
        "address": "真光路1473弄3号",
        "name": "胜益商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.38067,
            31.243411
        ],
        "address": "真光路1219号",
        "name": "新长征中环大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.409662,
            31.26542
        ],
        "address": "真华路157弄",
        "name": "万里一期157弄",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.412207,
            31.286889
        ],
        "address": "真华路1600弄",
        "name": "玉华东苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.410562,
            31.289533
        ],
        "address": "真华路1801弄",
        "name": "梧桐城邦二期",
        "count": 92,
        "style": 0
    },
    {
        "lnglat": [
            121.411855,
            31.291539
        ],
        "address": "真华路1988弄、真华路1958弄",
        "name": "梧桐城邦三期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.411705,
            31.271499
        ],
        "address": "真华路928号",
        "name": "大华虎城第三空间",
        "count": 87,
        "style": 0
    },
    {
        "lnglat": [
            121.409859,
            31.29235
        ],
        "address": "真华路1989弄",
        "name": "梧桐城邦四期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.40555,
            31.267821
        ],
        "address": "真金路250弄",
        "name": "真金苑",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.404576,
            31.268269
        ],
        "address": "真金路251弄",
        "name": "万里一期251弄",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.408977,
            31.27583
        ],
        "address": "真华路999弄",
        "name": "水岸蓝桥",
        "count": 91,
        "style": 0
    },
    {
        "lnglat": [
            121.404479,
            31.272359
        ],
        "address": "真金路457弄",
        "name": "凯旋华庭",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.398039,
            31.27484
        ],
        "address": "真金路577弄，武威东路477弄，武威东路479弄",
        "name": "颐和华城",
        "count": 94,
        "style": 0
    },
    {
        "lnglat": [
            121.343007,
            31.29126
        ],
        "address": "真南路3435弄",
        "name": "安达家园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.405383,
            31.275834
        ],
        "address": "真金路655弄",
        "name": "金华苑（上海）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.343272,
            31.290186
        ],
        "address": "真南路3489弄",
        "name": "阳光水岸苑",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.383608,
            31.273022
        ],
        "address": "真南路822弄129号",
        "name": "李子园同济科技园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.38653,
            31.269951
        ],
        "address": "真南路708号",
        "name": "申环商务大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.38145,
            31.269336
        ],
        "address": "真南路895弄22-38号",
        "name": "真南路895弄",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.49633,
            31.163011
        ],
        "address": "振兴东路15弄",
        "name": "成发苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.436553,
            31.218097
        ],
        "address": "镇宁路111号",
        "name": "万宝国际广场（王子晶品）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.437816,
            31.218495
        ],
        "address": "镇宁路168号",
        "name": "美丽园酒店公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.436387,
            31.218867
        ],
        "address": "镇宁路233号",
        "name": "荣轩大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.437371,
            31.219131
        ],
        "address": "镇宁路200号",
        "name": "欣安大厦",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.435138,
            31.224296
        ],
        "address": "镇宁路525号",
        "name": "新东纺国际商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.434721,
            31.223845
        ],
        "address": "镇宁路545弄15号",
        "name": "天星公寓（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.428511,
            31.25075
        ],
        "address": "镇坪路48号",
        "name": "嘉富利大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.434559,
            31.223902
        ],
        "address": "镇宁路545弄7号",
        "name": "兴星公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.438701,
            31.216219
        ],
        "address": "镇宁路90-98号",
        "name": "爱俪轩大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.430348,
            31.250354
        ],
        "address": "镇坪路176弄",
        "name": "秋月枫舍二期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.746103,
            30.875847
        ],
        "address": "正旭路599弄",
        "name": "凤凰城天境",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.445709,
            31.380112
        ],
        "address": "镇泰路111弄",
        "name": "上海四季花城二期",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.747399,
            30.883564
        ],
        "address": "正旭路733弄",
        "name": "凤凰城天悦",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.518231,
            31.3022
        ],
        "address": "政旦东路8弄",
        "name": "财富商业广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.518762,
            31.308773
        ],
        "address": "政德东路88号",
        "name": "椰泰公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.51801,
            31.309208
        ],
        "address": "政府路18号",
        "name": "波司登国际大厦",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.508251,
            31.309452
        ],
        "address": "政高路77号",
        "name": "同和国际大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.512653,
            31.327625
        ],
        "address": "政和路388弄",
        "name": "仁恒怡庭",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.516393,
            31.336475
        ],
        "address": "政和路999弄",
        "name": "合生江湾国际公寓",
        "count": 74,
        "style": 0
    },
    {
        "lnglat": [
            121.509533,
            31.308817
        ],
        "address": "政立路415号",
        "name": "天盛广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.497587,
            31.31665
        ],
        "address": "政青路399弄",
        "name": "文化名邸",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.517917,
            31.303805
        ],
        "address": "政通路95弄",
        "name": "文轩佳苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.518581,
            31.3032
        ],
        "address": "政益路8号",
        "name": "五角丰达商务广场(五角丰达大厦)",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.402499,
            31.258037
        ],
        "address": "芝川路100弄",
        "name": "芝川新苑（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.517284,
            31.302333
        ],
        "address": "政益路47号48号",
        "name": "五角丰达商务广场（二期）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.521565,
            31.32649
        ],
        "address": "政悦路88弄",
        "name": "涵碧景苑",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.452858,
            31.255377
        ],
        "address": "芷江西路788号",
        "name": "华舟大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.467187,
            31.263911
        ],
        "address": "止园路577号",
        "name": "和兰苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.431319,
            31.25893
        ],
        "address": "志丹路10弄8号",
        "name": "长富大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.430201,
            31.260435
        ],
        "address": "志丹路97弄",
        "name": "西部大楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.430256,
            31.268142
        ],
        "address": "志丹路155弄",
        "name": "西部名都花园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.482393,
            31.210601
        ],
        "address": "制造局路27号",
        "name": "紫宇大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.484685,
            31.207437
        ],
        "address": "制造局路287号",
        "name": "龙悦大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.485126,
            31.206115
        ],
        "address": "制造局路363弄",
        "name": "豫欣公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.484096,
            31.2045
        ],
        "address": "制造局路466号",
        "name": "裕和公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.486296,
            31.199484
        ],
        "address": "制造局路787号",
        "name": "黄浦区科技创业中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.485787,
            31.203943
        ],
        "address": "制造局路833号",
        "name": "惠祥公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.48616,
            31.199148
        ],
        "address": "制造局路833弄8号",
        "name": "嘉登公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.434846,
            31.183682
        ],
        "address": "中漕路20号",
        "name": "中漕小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.274897,
            31.047987
        ],
        "address": "中创路398号",
        "name": "佳钢科创园_中创路",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.39764,
            31.04425
        ],
        "address": "中春路1288号",
        "name": "金地威新闵行科创园(中春路)",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.375401,
            31.099998
        ],
        "address": "中春路4999号",
        "name": "莘庄商务大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.357137,
            31.125698
        ],
        "address": "中春路6111号",
        "name": "慧峰商务大厦",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.350485,
            31.135178
        ],
        "address": "中春路6818弄10号",
        "name": "海琪大厦",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.346338,
            31.137034
        ],
        "address": "中春路7001号",
        "name": "明谷科技园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.345139,
            31.139401
        ],
        "address": "中春路7089号",
        "name": 7089,
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.274189,
            31.042047
        ],
        "address": "中创路68号",
        "name": "上海启迪漕河泾(中山)科技园",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.346247,
            31.140792
        ],
        "address": "中春路7198号",
        "name": "凯斯国际商务中心",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.346999,
            31.140168
        ],
        "address": "中春路7178号",
        "name": "欧西玛创新园区",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.343386,
            31.145864
        ],
        "address": "中春路7628号",
        "name": "优房商务中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.345168,
            31.147759
        ],
        "address": "中春路7658号",
        "name": "水清年华臻景苑",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.33699,
            31.157265
        ],
        "address": "中春路8888弄",
        "name": "万科城市花园新区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.354812,
            30.859215
        ],
        "address": "中华路168弄",
        "name": "浦江公馆",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.335463,
            31.154937
        ],
        "address": "中春路8889弄",
        "name": "万科城花新园",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.497455,
            31.218072
        ],
        "address": "中华路429弄1-5号",
        "name": "绿地名人坊",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.486207,
            31.217451
        ],
        "address": "中华路1359号",
        "name": "康宁商厦（大厦）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.495055,
            31.214645
        ],
        "address": "中华路868弄",
        "name": "明日星城二期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.473953,
            31.258921
        ],
        "address": "中华新路288号",
        "name": "绿洲雅宾利花园",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.45607,
            31.254824
        ],
        "address": "中华新路939弄",
        "name": "紫兰苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.462713,
            31.25253
        ],
        "address": "中华新路588弄",
        "name": "中兴财富国际公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.390686,
            31.23426
        ],
        "address": "中江路879号",
        "name": "天地软件园",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.49326,
            31.21519
        ],
        "address": "中华路88号",
        "name": "滨江名人苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.392487,
            31.235112
        ],
        "address": "中江路888号",
        "name": "五芳斋大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.392526,
            31.23553
        ],
        "address": "中江路938号",
        "name": "中天新世纪商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.391451,
            31.235647
        ],
        "address": "中江路889号",
        "name": "曹杨商务大厦",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.50426,
            31.286789
        ],
        "address": "中山北二路1121号",
        "name": "同济科技大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.493546,
            31.285166
        ],
        "address": "中山北二路1631号",
        "name": "曲阳邮政大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.49419,
            31.286345
        ],
        "address": "中山北二路1800号",
        "name": "海鸥商务大厦",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.449743,
            31.258844
        ],
        "address": "中山北路1017号",
        "name": "沪太办公楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.471109,
            31.265458
        ],
        "address": "中山北路178号",
        "name": "钻石坊创意园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.433315,
            31.251146
        ],
        "address": "中山北路1799号",
        "name": "中一国际商务大厦",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.470622,
            31.264535
        ],
        "address": "中山北路198号",
        "name": "申航大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.433605,
            31.251362
        ],
        "address": "中山北路1777号",
        "name": "飞洲时代大厦",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.431013,
            31.247994
        ],
        "address": "中山北路2052号",
        "name": "振源大厦",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.431973,
            31.248802
        ],
        "address": "中山北路2000号",
        "name": "中期大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.430344,
            31.247272
        ],
        "address": "中山北路2130号",
        "name": "万千大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.426726,
            31.245235
        ],
        "address": "中山北路2318号-2342号",
        "name": "中岚大楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.424521,
            31.243916
        ],
        "address": "中山北路2438号",
        "name": "中瑞商务大厦（上海）",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.418824,
            31.240669
        ],
        "address": "中山北路2790号",
        "name": "上海杰地大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.423201,
            31.243133
        ],
        "address": "中山北路2550号",
        "name": "上海有色金属交易中心(物贸大厦)",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.41811,
            31.240259
        ],
        "address": "中山北路2900号",
        "name": "东方国际元中大厦",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.416738,
            31.240639
        ],
        "address": "中山北路2911号",
        "name": "中关村科技大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.414125,
            31.236047
        ],
        "address": "中山北路3064号",
        "name": "绿洲广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.41567,
            31.238177
        ],
        "address": "中山北路3000号",
        "name": "上海长城大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.411317,
            31.234011
        ],
        "address": "中山北路3323号",
        "name": "春之声大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.41107,
            31.23368
        ],
        "address": "中山北路3327弄",
        "name": "恒陇丽晶",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.413974,
            31.236079
        ],
        "address": "中山北路3618弄",
        "name": "银城大厦(上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.409883,
            31.224677
        ],
        "address": "中山北路3751弄3号",
        "name": "悦樘公寓(华师大店)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.411427,
            31.226825
        ],
        "address": "中山北路3856弄2号",
        "name": "中环大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.458184,
            31.259443
        ],
        "address": "中山北路814弄",
        "name": "协和大厦(上海)",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.457634,
            31.260377
        ],
        "address": "中山北路831弄1-5号",
        "name": "吉兴大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.457141,
            31.259395
        ],
        "address": "中山北路828号",
        "name": "科普大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.457517,
            31.259956
        ],
        "address": "中山北路835号",
        "name": "悦樘公寓(大宁店)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.456106,
            31.262346
        ],
        "address": "中山北路899弄",
        "name": "上海滩大宁城",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.486237,
            31.289033
        ],
        "address": "中山北一路1100弄",
        "name": "新华一村干休所",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.487794,
            31.29018
        ],
        "address": "中山北一路1200号",
        "name": "明道大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.487899,
            31.290217
        ],
        "address": "中山北一路1200号1号楼",
        "name": "魔方公寓大柏树店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.488646,
            31.290733
        ],
        "address": "中山北一路1230号",
        "name": "柏树大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.489644,
            31.291622
        ],
        "address": "中山北一路1250号",
        "name": "沪办大厦",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.47787,
            31.272837
        ],
        "address": "中山北一路160号",
        "name": "久乐大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.479659,
            31.277187
        ],
        "address": "中山北一路284号",
        "name": "上外中山大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.456281,
            31.259149
        ],
        "address": "中山北路864号",
        "name": "金甸大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.477915,
            31.27315
        ],
        "address": "中山北一路184号",
        "name": "上海怡景大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.483723,
            31.286802
        ],
        "address": "中山北一路805号",
        "name": "805公安大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.491836,
            31.232322
        ],
        "address": "中山东二路8号",
        "name": "外滩金延大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.483217,
            31.287612
        ],
        "address": "中山北一路865弄21号",
        "name": "阜和综合楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.446019,
            31.180987
        ],
        "address": "中山南二路1007号",
        "name": "中煌大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.444304,
            31.179398
        ],
        "address": "中山南二路1057弄2号",
        "name": "协昌小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.460703,
            31.189826
        ],
        "address": "中山南二路506号",
        "name": "泰莱商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.46253,
            31.18998
        ],
        "address": "中山南二路508号",
        "name": "泰莱大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.459769,
            31.18767
        ],
        "address": "中山南二路595号",
        "name": "中南都市型工业园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.44985,
            31.185079
        ],
        "address": "中山南二路900号",
        "name": "精文公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.448228,
            31.184059
        ],
        "address": "中山南二路932弄6号",
        "name": "龙山公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.446412,
            31.181371
        ],
        "address": "中山南二路999弄19号",
        "name": "中信中山大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.503662,
            31.211481
        ],
        "address": "中山南路1088号",
        "name": "南浦大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.501522,
            31.210561
        ],
        "address": "中山南路1228号",
        "name": "北方工业大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.499641,
            31.210531
        ],
        "address": "中山南路1358弄",
        "name": "中福花苑二期",
        "count": 67,
        "style": 0
    },
    {
        "lnglat": [
            121.495465,
            31.204877
        ],
        "address": "中山南路1669弄69号",
        "name": "中山大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.491711,
            31.20227
        ],
        "address": "中山南路1877号",
        "name": "金中苑商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.502008,
            31.222807
        ],
        "address": "中山南路200号",
        "name": "金外滩花园",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.502407,
            31.221454
        ],
        "address": "中山南路318号",
        "name": "东方国际金融广场",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.502963,
            31.221528
        ],
        "address": "中山南路268号",
        "name": "新源广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.502951,
            31.22044
        ],
        "address": "中山南路398弄",
        "name": "海琪园",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.505826,
            31.211792
        ],
        "address": "中山南路969号",
        "name": "谷泰滨江大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.507049,
            31.213108
        ],
        "address": "中山南路865号",
        "name": "临江花园大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.472209,
            31.19608
        ],
        "address": "中山南一路1065",
        "name": "天歌大地大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.482456,
            31.198441
        ],
        "address": "中山南一路528号",
        "name": "华西融创中心（上海滨江壹号院）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.480138,
            31.198526
        ],
        "address": "中山南一路721弄",
        "name": "江南造船新苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.476211,
            31.196608
        ],
        "address": "中山南一路892号",
        "name": "申龙大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.475787,
            31.196458
        ],
        "address": "中山南一路904号",
        "name": "中南公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.417556,
            31.195068
        ],
        "address": "中山西路1221号",
        "name": "锦绣花园（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.417698,
            31.194689
        ],
        "address": "中山西路1231号",
        "name": "锦城公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.419193,
            31.19355
        ],
        "address": "中山西路1251弄",
        "name": "九九园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.420567,
            31.192152
        ],
        "address": "中山西路1279弄6号",
        "name": "国峰科技大厦（上海）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.420163,
            31.191475
        ],
        "address": "中山西路1281号",
        "name": "海螺大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.42431,
            31.183973
        ],
        "address": "中山西路1790号",
        "name": "兆丰虹桥公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.411235,
            31.219881
        ],
        "address": "中山西路179号，189弄",
        "name": "虹桥世家花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.425209,
            31.18313
        ],
        "address": "中山西路1878号",
        "name": "凯托大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.425928,
            31.183751
        ],
        "address": "中山西路1919号",
        "name": "北科徐汇商都",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.424311,
            31.183359
        ],
        "address": "中山西路1800号",
        "name": "兆丰环球大厦",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.41039,
            31.215075
        ],
        "address": "中山西路1号",
        "name": "水云间(上海)",
        "count": 69,
        "style": 0
    },
    {
        "lnglat": [
            121.426915,
            31.181979
        ],
        "address": "中山西路2020号",
        "name": "华宜大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.425799,
            31.182631
        ],
        "address": "中山西路2006号",
        "name": "百第宜山大楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.427784,
            31.182661
        ],
        "address": "中山西路2025号",
        "name": "永升大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.430198,
            31.181188
        ],
        "address": "中山西路2240号",
        "name": "鼎力创意园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.432525,
            31.180126
        ],
        "address": "中山西路2366号",
        "name": "华鼎广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.410589,
            31.216033
        ],
        "address": "中山西路360号",
        "name": "宁定大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432219,
            31.180551
        ],
        "address": "中山西路2368号",
        "name": "华鼎大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.410423,
            31.216432
        ],
        "address": "中山西路340号",
        "name": "科宁公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.410699,
            31.215515
        ],
        "address": "中山西路380号",
        "name": "家电大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.412194,
            31.214503
        ],
        "address": "中山西路483号",
        "name": "碧云公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.412676,
            31.213891
        ],
        "address": "中山西路555号",
        "name": "绿洲大厦（上海）",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.411314,
            31.207834
        ],
        "address": "中山西路750号",
        "name": "虹桥商务写字楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.409797,
            31.20594
        ],
        "address": "中山西路800弄57号",
        "name": "紫虹大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.41348,
            31.210761
        ],
        "address": "中山西路699弄",
        "name": "上海虹桥绿郡",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.412626,
            31.200446
        ],
        "address": "中山西路930号",
        "name": "云都虹桥大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.410677,
            31.229399
        ],
        "address": "中山西路933号",
        "name": "虹桥银城",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.413934,
            31.19961
        ],
        "address": "中山西路999号",
        "name": "华闻国际大厦",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.443316,
            31.251016
        ],
        "address": "中潭路33/91/99/100弄，远景路97弄",
        "name": "中远两湾城",
        "count": 194,
        "style": 0
    },
    {
        "lnglat": [
            121.330584,
            31.09644
        ],
        "address": "中心路1450弄",
        "name": "华亭茗苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.465119,
            31.252638
        ],
        "address": "中兴路1101号",
        "name": "昆泰大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.475712,
            31.258561
        ],
        "address": "中兴路373号",
        "name": "兴园373号",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.347588,
            31.135899
        ],
        "address": "中谊路1215号",
        "name": "福克斯商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.358894,
            31.14097
        ],
        "address": "中谊路699号",
        "name": "华友大厦（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.353163,
            31.140608
        ],
        "address": "中谊路888弄86-136号",
        "name": "碧林湾",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.656346,
            31.029107
        ],
        "address": "众安路879弄",
        "name": "上海意得商城",
        "count": 140,
        "style": 0
    },
    {
        "lnglat": [
            121.325376,
            31.288884
        ],
        "address": "众仁路375号",
        "name": "勇立大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.181377,
            31.193532
        ],
        "address": "重固镇大街588号",
        "name": "新世纪商业广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.324572,
            31.289859
        ],
        "address": "众仁路399号",
        "name": "上海运通星财富广场",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.472016,
            31.209555
        ],
        "address": "重庆南路310号",
        "name": "新电大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.603098,
            31.116331
        ],
        "address": "周邓公路6600弄",
        "name": "海尚乐苑",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.510986,
            31.265237
        ],
        "address": "周家嘴路1299弄",
        "name": "上海大花园",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.583658,
            31.125172
        ],
        "address": "周东路782弄22支弄",
        "name": "日月星城（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.515731,
            31.267516
        ],
        "address": "周家嘴路2001弄",
        "name": "东银茗苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.516187,
            31.266389
        ],
        "address": "周家嘴路2000弄",
        "name": "锦丽斯公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.517512,
            31.267792
        ],
        "address": "周家嘴路2188弄",
        "name": "泰鸿苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.523721,
            31.272722
        ],
        "address": "周家嘴路2809号",
        "name": "凤城巷三期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.534047,
            31.276637
        ],
        "address": "周家嘴路3255号",
        "name": "上海船舶大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.496871,
            31.253701
        ],
        "address": "周家嘴路338弄",
        "name": "馨虹苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.572292,
            31.110278
        ],
        "address": "周康路129弄",
        "name": "南郊花园东区",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.533278,
            31.275915
        ],
        "address": "周家嘴路3158弄",
        "name": "双阳公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.580809,
            31.117662
        ],
        "address": "周市路416号",
        "name": "慧晶国际公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.581971,
            31.110367
        ],
        "address": "周市路39弄",
        "name": "粤亮湾景苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.490908,
            31.223135
        ],
        "address": "昼锦路180弄",
        "name": "复地雅园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.320706,
            31.10896
        ],
        "address": "朱金公路801号",
        "name": "百士威大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.086243,
            31.135477
        ],
        "address": "朱家角路158弄",
        "name": "大发融悦华庭",
        "count": 78,
        "style": 0
    },
    {
        "lnglat": [
            121.388251,
            31.102932
        ],
        "address": "珠城路118弄",
        "name": "新梅莘苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.465112,
            31.275092
        ],
        "address": "株洲路168弄",
        "name": "城城金岛苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.464951,
            31.279357
        ],
        "address": "株洲路388弄",
        "name": "建明花苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.466042,
            31.274279
        ],
        "address": "株洲路9弄",
        "name": "菁鸿锦庭",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.903998,
            30.902703
        ],
        "address": "竹柏路500弄",
        "name": "保利蔚蓝林语",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.388707,
            31.104144
        ],
        "address": "珠城路158号",
        "name": "解放日报大厦C座",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.465405,
            31.279276
        ],
        "address": "株洲路399弄",
        "name": "宝华城市花园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.226752,
            31.373941
        ],
        "address": "竹笛路388弄",
        "name": "宝菊清水园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.532338,
            31.224032
        ],
        "address": "竹林路101号",
        "name": "陆家嘴基金大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.348292,
            31.289472
        ],
        "address": "竹柳路50弄135号",
        "name": "安居锦竹苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.107837,
            31.168782
        ],
        "address": "竹盈路160号",
        "name": "浪潮科创园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.099561,
            31.169093
        ],
        "address": "竹盈路339弄",
        "name": "卓越E时代创业中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.514167,
            31.070599
        ],
        "address": "竹园路518号",
        "name": "德宏商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.406454,
            31.071131
        ],
        "address": "颛桥镇颛兴东路1559号万达广场(颛桥店)F1层",
        "name": "孩子王(上海颛桥万达店)",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.423073,
            31.077009
        ],
        "address": "颛兴东路1058号",
        "name": "红园企业总部园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.419274,
            31.075515
        ],
        "address": "颛兴东路1280弄1-4号",
        "name": "南滨江科创园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.416596,
            31.073274
        ],
        "address": "颛兴东路1331号",
        "name": "TMT大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.417487,
            31.073669
        ],
        "address": "颛兴东路1313号",
        "name": "云部落大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.408852,
            31.072255
        ],
        "address": "颛兴东路1550弄",
        "name": "剑桥馨苑",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.426441,
            31.076993
        ],
        "address": "颛兴东路745号",
        "name": "拉法叶园区B楼墨空间",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.423692,
            31.075352
        ],
        "address": "颛兴东路999弄",
        "name": "阳明创业园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.561418,
            31.12161
        ],
        "address": "梓康路580弄",
        "name": "双秀西园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.381812,
            31.181353
        ],
        "address": "紫乐路8号",
        "name": "魔方公寓虹中路店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.388969,
            31.064924
        ],
        "address": "颛兴路666弄",
        "name": "日月华城",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.36443,
            31.174761
        ],
        "address": "紫藤路266弄",
        "name": "龙柏易居",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.364512,
            31.171612
        ],
        "address": "紫藤路99弄",
        "name": "紫藤居",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.622753,
            31.209145
        ],
        "address": "紫薇路667弄",
        "name": "阳光花城",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.381836,
            31.179882
        ],
        "address": "紫秀路100号",
        "name": "虹桥总部1号",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.405471,
            31.20732
        ],
        "address": "紫云西路28弄",
        "name": "翠庭",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.409647,
            31.20606
        ],
        "address": "紫云路118号",
        "name": "虹桥豪苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.408462,
            31.206079
        ],
        "address": "紫云西路50弄",
        "name": "虹桥紫云苑二期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.403948,
            31.207063
        ],
        "address": "紫云西路89弄",
        "name": "虹桥紫云苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.37214,
            31.304864
        ],
        "address": "走马塘路1228弄",
        "name": "保利熙悦",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.611915,
            31.207638
        ],
        "address": "祖冲之路1559号",
        "name": "创意大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.406329,
            31.206893
        ],
        "address": "遵义路107号",
        "name": "安泰大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.582134,
            31.201634
        ],
        "address": "祖冲之路295号",
        "name": "夏新大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.408615,
            31.216034
        ],
        "address": "遵义路797号",
        "name": "虹桥国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.406209,
            31.204319
        ],
        "address": "遵义南路88号",
        "name": "协泰中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.40666,
            31.2038
        ],
        "address": "遵义南路8号",
        "name": "锦明大厦",
        "count": 29,
        "style": 1
    }
]