var addresses = [
    {
        "lnglat": [
            121.376116,
            31.325728
        ],
        "address": "塘祁路577弄",
        "name": "保利叶之林二期",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.388904,
            31.235683
        ],
        "address": "怒江北路427号",
        "name": "曹杨经贸大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.430104,
            31.238325
        ],
        "address": "长寿路800弄",
        "name": "苏堤春晓名苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.651206,
            31.265954
        ],
        "address": "金海路2449号",
        "name": "宝龙广场2期（曹路）",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.511865,
            31.261391
        ],
        "address": "唐山路1018号",
        "name": "宝地广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.433616,
            31.152807
        ],
        "address": "石龙路666号",
        "name": "上海长途客运南站",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.420851,
            31.208337
        ],
        "address": "延安西路1566号",
        "name": "龙峰大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.487413,
            31.214838
        ],
        "address": "黄家阙路65-69号",
        "name": "惠德大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.345155,
            31.266867
        ],
        "address": "海波路127弄",
        "name": "嘉城爱琴海",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.415111,
            31.180898
        ],
        "address": "钦州北路567号",
        "name": "长春新苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.442605,
            31.191128
        ],
        "address": "天钥桥路191弄",
        "name": "南天大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.522636,
            30.91885
        ],
        "address": "德泉路305弄",
        "name": "贤青雅苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.375192,
            31.316667
        ],
        "address": "锦秋路1588弄",
        "name": "丰宝苑",
        "count": 74,
        "style": 0
    },
    {
        "lnglat": [
            121.219492,
            31.037766
        ],
        "address": "北翠路1000弄",
        "name": "地中海小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.247505,
            31.021022
        ],
        "address": "方塔北路605号",
        "name": "企德天地",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.376338,
            31.176416
        ],
        "address": "先锋街25号",
        "name": "宝纳大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.433044,
            31.237008
        ],
        "address": "长江南路180号",
        "name": "长江软件园",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.305821,
            31.039665
        ],
        "address": "新车公路555号",
        "name": "逸南智能科技产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.463356,
            31.230316
        ],
        "address": "吴江路31号",
        "name": "东方有线大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.48951,
            31.265869
        ],
        "address": "欧阳路85号",
        "name": "金陵国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.380747,
            31.234937
        ],
        "address": "金沙江路1688弄",
        "name": "绿洲商业中心",
        "count": 133,
        "style": 0
    },
    {
        "lnglat": [
            121.366891,
            31.234547
        ],
        "address": "同普路1412号",
        "name": "长征工业设计中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.431415,
            31.213703
        ],
        "address": "延安西路973、983号",
        "name": "五环大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.276467,
            30.990098
        ],
        "address": "车墩镇车阳路177弄",
        "name": "松南城尚雅苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.468441,
            31.24547
        ],
        "address": "天目中路353号",
        "name": "万佳商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.447084,
            31.190861
        ],
        "address": "宛平南路388弄1-6号",
        "name": "海螺花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.518049,
            31.230226
        ],
        "address": "商城路618号",
        "name": "上海良友大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.36686,
            31.208721
        ],
        "address": "仙霞西路300弄",
        "name": "虹康花苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.588029,
            31.308144
        ],
        "address": "张杨北路2899弄",
        "name": "金地未未来",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.443831,
            31.18379
        ],
        "address": "天钥桥路859号",
        "name": "北海大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.513042,
            31.084614
        ],
        "address": "恒南路1325号",
        "name": "闿鑫商务园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.41697,
            31.290873
        ],
        "address": "沪太路1866号",
        "name": "诺诚M7创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.590902,
            31.081406
        ],
        "address": "鹤沙路699弄",
        "name": "昱丽家园",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.417786,
            31.197828
        ],
        "address": "虹桥路977号",
        "name": "中山广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.356285,
            31.136564
        ],
        "address": "华友路260弄",
        "name": "碧林湾南苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.477204,
            31.245982
        ],
        "address": "海宁路899号",
        "name": "长泰企业天地广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.437816,
            31.218495
        ],
        "address": "镇宁路168号",
        "name": "美丽园酒店公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.249834,
            31.038443
        ],
        "address": "茸兴路280弄",
        "name": "恒大帝景一期",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.259294,
            31.170794
        ],
        "address": "徐盈路588弄",
        "name": "锦绣逸庭",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.624373,
            31.173197
        ],
        "address": "勤政路88弄",
        "name": "华发四季",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.292315,
            31.306511
        ],
        "address": "嘉美路269弄",
        "name": "云湖漫城",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.212759,
            31.219055
        ],
        "address": "华隆路1777号",
        "name": "e通世界科技园(华新园）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.466042,
            31.274279
        ],
        "address": "株洲路9弄",
        "name": "菁鸿锦庭",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.742263,
            30.87319
        ],
        "address": "江山路6819弄    ",
        "name": "泷悦蓝湾城",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.48159,
            31.404136
        ],
        "address": "友谊路160号",
        "name": "宝地友谊商务中心（宝学汇）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.509393,
            31.23884
        ],
        "address": "浦东南路360号",
        "name": "新上海国际大厦",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.628515,
            31.083766
        ],
        "address": "康新公路2333号",
        "name": "天慈生物医药生产基地（天慈国际产业园）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.446162,
            31.237732
        ],
        "address": "海防路387号",
        "name": "大闻丽都苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.587434,
            31.184195
        ],
        "address": "毕升路299弄",
        "name": "富海商务苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.355036,
            31.280582
        ],
        "address": "武威路2600弄",
        "name": "新华悦都",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.545959,
            31.044094
        ],
        "address": "浦航路36弄",
        "name": "聚缘北庭",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.399507,
            31.204864
        ],
        "address": "古北路678号",
        "name": "同诠大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.363328,
            31.150133
        ],
        "address": "新镇路888号",
        "name": "水景书香园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.4301,
            31.340743
        ],
        "address": "呼兰西路129号",
        "name": "魔方公寓呼兰路地铁站店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.460184,
            31.230072
        ],
        "address": "吴江路188号",
        "name": "静安新时代大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.418741,
            31.236007
        ],
        "address": "曹杨路455弄",
        "name": "尚诚国际苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.507239,
            31.200873
        ],
        "address": "南码头路101号",
        "name": "海博大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.517878,
            31.220678
        ],
        "address": "浦东南路1550弄",
        "name": "天科苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.53906,
            31.238205
        ],
        "address": "商城路1986号",
        "name": "商城商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.381751,
            31.180251
        ],
        "address": "紫秀路100号",
        "name": "虹桥总部1号",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.244639,
            31.362754
        ],
        "address": "叶城路1128号",
        "name": "中青旅东方国际酒店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436727,
            31.231043
        ],
        "address": "康定路1038弄",
        "name": "静安艺阁",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.408,
            31.21647
        ],
        "address": "遵义路797号",
        "name": "虹桥国际大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.544773,
            31.205483
        ],
        "address": "牡丹路60号",
        "name": "东辰大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.417412,
            31.207719
        ],
        "address": "凯旋路1010号A栋",
        "name": "上汽凯旋坊",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.513755,
            31.204908
        ],
        "address": "浦东南路2250号",
        "name": "滨江2250",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.37214,
            31.304864
        ],
        "address": "走马塘路1228弄",
        "name": "保利熙悦",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.456711,
            31.229851
        ],
        "address": "南汇路69号",
        "name": "上海宁波联谊大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.318905,
            30.745233
        ],
        "address": "龙轩路1998弄15号",
        "name": "正荣御首府",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.593318,
            31.081866
        ],
        "address": "鹤沙路588弄",
        "name": "昱星家园东区",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.348417,
            31.26436
        ],
        "address": "田林东路568号对面",
        "name": "田林十一村",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.447944,
            31.215718
        ],
        "address": "长乐路801号",
        "name": "华尔登广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.531107,
            31.254322
        ],
        "address": "平凉路1398号",
        "name": "上海杨浦工贸大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.296724,
            31.121468
        ],
        "address": "望东中路99弄",
        "name": "森祥投资晟维商务园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.584462,
            31.207335
        ],
        "address": "碧波路177号",
        "name": "华虹科技园办公楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.158765,
            31.14446
        ],
        "address": "崧润路49弄",
        "name": "德康雅苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.542992,
            31.292563
        ],
        "address": "靖宇东路55弄",
        "name": "靖宇家园",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.427393,
            31.211105
        ],
        "address": "延安西路1235弄",
        "name": "佳达新苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.482699,
            31.238336
        ],
        "address": "天津路180号",
        "name": "应氏大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.477067,
            31.210363
        ],
        "address": "徐家汇路268号",
        "name": "凯德晶萃广场",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.445282,
            31.17909
        ],
        "address": "天钥桥路907号",
        "name": "天龙公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.366241,
            31.175212
        ],
        "address": "青杉路169弄、157弄",
        "name": "龙柏香榭苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.439203,
            30.941307
        ],
        "address": "南桥镇程普路377号",
        "name": "悠口创意园",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.563366,
            31.249208
        ],
        "address": "博山东路112弄",
        "name": "海德苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.423511,
            31.211777
        ],
        "address": "定西路1100号",
        "name": "辽油大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.549748,
            31.203143
        ],
        "address": "玉兰路8号",
        "name": "盛第大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.357505,
            31.412387
        ],
        "address": "月罗公路2120号",
        "name": "程居电商产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.364366,
            31.222599
        ],
        "address": "西陶浜路28弄 ",
        "name": "北平家园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.445788,
            31.257075
        ],
        "address": "中山北路1238号",
        "name": "格林德必易园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.434997,
            31.244444
        ],
        "address": "西康路1407号",
        "name": "荣联公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.466549,
            31.304155
        ],
        "address": "广粤路1601弄",
        "name": "广裕小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.392487,
            31.235112
        ],
        "address": "中江路888号",
        "name": "五芳斋大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.706482,
            31.062752
        ],
        "address": "南六公路399号",
        "name": "艺泰安邦花园",
        "count": 169,
        "style": 0
    },
    {
        "lnglat": [
            121.462177,
            31.265356
        ],
        "address": "和田路229弄",
        "name": "紫薇阁",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.093147,
            31.192795
        ],
        "address": "漕盈路3535号",
        "name": "大亨科技园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.413781,
            31.244281
        ],
        "address": "武宁路509号",
        "name": "电科大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.428279,
            31.209521
        ],
        "address": "延安西路1228弄4号",
        "name": "嘉阳公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.582943,
            31.237005
        ],
        "address": "碧云路580号",
        "name": "S8碧云花园",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.509197,
            31.261567
        ],
        "address": "长阳路8号",
        "name": "建爱大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.524661,
            31.228553
        ],
        "address": "东方路738号",
        "name": "裕安大厦",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.609123,
            31.279721
        ],
        "address": "巨峰路1058弄",
        "name": "新紫茂国际城",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.420614,
            31.205801
        ],
        "address": "新华路666弄1-5号",
        "name": "申亚新华府",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.605644,
            31.260298
        ],
        "address": "金高路2330号",
        "name": "金桥炜业",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.417867,
            31.194615
        ],
        "address": "中山西路1231号",
        "name": "锦城公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.54014,
            31.301278
        ],
        "address": "包头南路628弄",
        "name": "杨浦欣园二期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.402733,
            31.245228
        ],
        "address": "南石二路135弄",
        "name": "兰溪公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.41616,
            31.191036
        ],
        "address": "古羊路158号",
        "name": "虹三产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.599943,
            31.33609
        ],
        "address": "富特北路432号",
        "name": "万荣大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.612031,
            31.255299
        ],
        "address": "金港路299号",
        "name": "禹洲广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.45931,
            31.201962
        ],
        "address": "肇嘉浜路383号",
        "name": "嘉乐公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.478058,
            31.233902
        ],
        "address": "汉口路650号",
        "name": "亚洲大厦",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.443337,
            31.186528
        ],
        "address": "斜土路2600号",
        "name": "海高大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.402278,
            31.132612
        ],
        "address": "古方路18号",
        "name": "南方休闲广场商务大厦",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.501202,
            31.098199
        ],
        "address": "浦锦街道浦泉路251弄",
        "name": "浦江颐城尚院",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.427621,
            31.109627
        ],
        "address": "兴梅路485号",
        "name": "中环科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.386389,
            31.216362
        ],
        "address": "威宁路458弄",
        "name": "天山华庭",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.394362,
            31.072571
        ],
        "address": "光中路133弄118号",
        "name": "茸桥科创园_光中路133弄118号园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.251748,
            31.365695
        ],
        "address": "叶城路818号",
        "name": "嘉禾大厦_上海",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.593874,
            31.115433
        ],
        "address": "年家浜东路159弄",
        "name": "印象生活广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.35603,
            31.159416
        ],
        "address": "新龙路311弄6号",
        "name": "七宝宝龙城T6",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.46947,
            31.195788
        ],
        "address": "瑞金南路628弄",
        "name": "环龙新苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.46889,
            31.200538
        ],
        "address": "瑞金南路185弄",
        "name": "瑞南新苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.425759,
            31.209621
        ],
        "address": "延安西路1326号",
        "name": "生物大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.439147,
            31.343837
        ],
        "address": "呼青路158号",
        "name": "上海交运智慧湾科创园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.510944,
            31.256484
        ],
        "address": "长阳路235号",
        "name": "鼎立大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.773368,
            31.128137
        ],
        "address": "祝潘公路699号",
        "name": "嘉荣商务广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.430198,
            31.229218
        ],
        "address": "康定路1588弄(1590弄)",
        "name": "三鑫花苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.66969,
            31.235586
        ],
        "address": "卡园二路58号",
        "name": "银信创智园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.48781,
            31.393655
        ],
        "address": "牡丹江路1248号",
        "name": "安信财富中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.393855,
            31.260492
        ],
        "address": "真北路2500号",
        "name": "星河世纪广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.374883,
            31.170356
        ],
        "address": "虹泉路1000号",
        "name": "井亭大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.480642,
            31.234136
        ],
        "address": "汉口路515号",
        "name": "汇金大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.481357,
            31.233984
        ],
        "address": "福建中路205号",
        "name": "中怡公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.4718,
            30.967824
        ],
        "address": "望园路2066弄",
        "name": "百村创业园A区",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.446809,
            31.283427
        ],
        "address": "灵石路697-3号",
        "name": "巨丰国际商务广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.447929,
            31.197974
        ],
        "address": "肇嘉浜路807号（东安路）",
        "name": "五洲国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.461115,
            31.217353
        ],
        "address": "淮海中路887号",
        "name": "永新大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.36462,
            31.253917
        ],
        "address": "曹安公路1718号",
        "name": "威隆大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.763622,
            31.044575
        ],
        "address": "万航渡后路77弄",
        "name": "蔚蓝水岸",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.390915,
            31.295417
        ],
        "address": "鄂尔多斯路67弄",
        "name": "祁秀雅苑",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.488958,
            31.302009
        ],
        "address": "逸仙路655弄",
        "name": "文化花园二期(明珠苑)",
        "count": 53,
        "style": 0
    },
    {
        "lnglat": [
            121.425379,
            31.162937
        ],
        "address": "冠生园路393号",
        "name": "云景德必易园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.47493,
            31.244273
        ],
        "address": "七浦路535号",
        "name": "七浦商厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.25993,
            31.028857
        ],
        "address": "松卫北路280号",
        "name": "凯富家园广场5号楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.609393,
            31.036703
        ],
        "address": "航头路118号",
        "name": "宏澜商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441195,
            31.283354
        ],
        "address": "灵石路721号",
        "name": "乐平方园区8号楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.446205,
            31.198813
        ],
        "address": "肇嘉浜路768号",
        "name": "欧江大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.487859,
            31.237713
        ],
        "address": "四川中路321号",
        "name": "中央大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.283415,
            31.418121
        ],
        "address": "启源路1000弄",
        "name": "汇丰颐苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.432978,
            31.251204
        ],
        "address": "光新路88号",
        "name": "中一国际商务大厦",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.461978,
            31.250227
        ],
        "address": "太阳山路188弄、长兴路168弄",
        "name": "中海万锦城二_三期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.439046,
            30.937278
        ],
        "address": "环城西路2511号1栋",
        "name": "菱光大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.62859,
            31.214669
        ],
        "address": "盛夏路58号",
        "name": "张江集电港天之骄子创业公寓",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.446451,
            31.18143
        ],
        "address": "中山南二路999弄19号",
        "name": "中信中山大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.45853,
            31.246689
        ],
        "address": "天目西路99号",
        "name": "丽丰天际中心",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.451281,
            31.039278
        ],
        "address": "尚义路91号",
        "name": "吴泾宝龙中心（二期）",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.477886,
            31.346839
        ],
        "address": "长江西路255号",
        "name": "上海国际节能环保园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.163831,
            31.290814
        ],
        "address": "墨玉路28号",
        "name": "嘉正国际大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.432462,
            31.311462
        ],
        "address": "康宁路1211号",
        "name": "幸福商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.606941,
            31.193808
        ],
        "address": "蔡伦路780号",
        "name": "推广大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.568685,
            31.098162
        ],
        "address": "建韵路399号",
        "name": "澄天伟业",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.42412,
            31.201407
        ],
        "address": "淮海西路442弄124支弄86-88号",
        "name": "爱迪公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.441411,
            31.186377
        ],
        "address": "斜土路2897号",
        "name": "海文商务楼（斜土路）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.433194,
            31.230628
        ],
        "address": "武宁南路310-322号",
        "name": "宏安家园一期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.401292,
            31.172037
        ],
        "address": "宜山路900号",
        "name": "科技大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.539809,
            31.198395
        ],
        "address": "锦安东路567弄",
        "name": "锦绣一方名苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.423696,
            31.247948
        ],
        "address": "岚皋西路61弄10支弄",
        "name": "实地公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.218408,
            31.382598
        ],
        "address": "秋竹路801弄",
        "name": "金色榴乡园",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.515018,
            31.232394
        ],
        "address": "浦东南路855号",
        "name": "世界广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.436465,
            31.169193
        ],
        "address": "龙漕路51弄3号",
        "name": "澳龙公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.417914,
            31.261611
        ],
        "address": "新泉路66弄",
        "name": "万里欣苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.476448,
            31.270326
        ],
        "address": "花园路88号",
        "name": "华博科技大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.344602,
            31.064454
        ],
        "address": "金都西路1000号",
        "name": "松港闵新创意园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.244246,
            31.386729
        ],
        "address": "城中路200号",
        "name": "冠寓_嘉定城中路店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.62009,
            31.253819
        ],
        "address": "金桥经济技术开发区宁桥路825号",
        "name": "9号楼公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.519164,
            31.205217
        ],
        "address": "临沂北路210弄",
        "name": "盛族家园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.458923,
            31.205062
        ],
        "address": "建国西路285号",
        "name": "科投大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.447653,
            31.319201
        ],
        "address": "共和新路4727号",
        "name": "新陆国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.415321,
            31.077715
        ],
        "address": "都会路2626弄",
        "name": "众秀新家园",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.4834,
            31.200648
        ],
        "address": "局门路599弄",
        "name": "东怡花园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.588356,
            31.200492
        ],
        "address": "晨晖路377弄",
        "name": "张江汤臣豪园一期",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.155732,
            31.14104
        ],
        "address": "秀涓路46弄",
        "name": "观景雅苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.258604,
            31.347608
        ],
        "address": "德富路1198号",
        "name": "太湖世家国际大厦（世家双塔）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.491329,
            31.199765
        ],
        "address": "西藏南路1717弄",
        "name": "白玉兰家园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.441198,
            31.153081
        ],
        "address": "石龙路345弄28号",
        "name": "大树下创意空间",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.667209,
            31.224865
        ],
        "address": "诚礼路298号",
        "name": "紫金九号二期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.410172,
            31.212048
        ],
        "address": "玉屏南路113弄17号",
        "name": "锦屏公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.465401,
            31.274986
        ],
        "address": "株洲路168弄",
        "name": "城城金岛苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.33859,
            31.382569
        ],
        "address": "上海市宝山区天家路199弄",
        "name": "美罗家园宝欣苑六村",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.484769,
            31.230649
        ],
        "address": "延安东路175号",
        "name": "旺角广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.51935,
            31.286414
        ],
        "address": "国科路29弄",
        "name": "黄兴雅苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.535229,
            31.222676
        ],
        "address": "浦电路489号",
        "name": "由由燕乔大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.421388,
            31.215878
        ],
        "address": "定西路1279号",
        "name": "名光大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.379297,
            31.325796
        ],
        "address": "华秋路349弄",
        "name": "保利叶之林",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.506032,
            31.280045
        ],
        "address": "四平路1230弄甲",
        "name": "通华小区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.306814,
            31.260087
        ],
        "address": "金园五路208号",
        "name": "梁杭文化创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.445773,
            31.282805
        ],
        "address": "灵石路658号",
        "name": "大宁财智中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.481488,
            31.265085
        ],
        "address": "四川北路2115号",
        "name": "方舟大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.450277,
            31.269014
        ],
        "address": "延长中路576号",
        "name": "新世纪公寓（延长中路）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.402556,
            31.208916
        ],
        "address": "娄山关路523、533号",
        "name": "金虹桥国际中心",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.380898,
            31.215118
        ],
        "address": "双流路188弄",
        "name": "宝地新品居",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.340437,
            31.330625
        ],
        "address": "科福路368号",
        "name": "华强科技园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.36116,
            31.231235
        ],
        "address": "云岭西路899弄",
        "name": "河滨香景园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.443798,
            31.184101
        ],
        "address": "天钥桥路811号",
        "name": "鹏欣公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.456928,
            31.191323
        ],
        "address": "零陵路342号",
        "name": "汇成民聚商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.379566,
            31.10716
        ],
        "address": "莘浜路10弄2号",
        "name": "上海银星大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.489001,
            31.261741
        ],
        "address": "四平路257号",
        "name": "永融企业中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.57245,
            31.109956
        ],
        "address": "周康路129弄",
        "name": "南郊花园东区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.418582,
            31.198018
        ],
        "address": "长顺路36号",
        "name": "紫勋雅苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.520223,
            31.214081
        ],
        "address": "峨山路679弄",
        "name": "浦江映象",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.479736,
            31.266645
        ],
        "address": "东江湾路151号",
        "name": "绿地创客",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.463916,
            31.20321
        ],
        "address": "肇嘉浜路201号",
        "name": "上海生产资料交易市场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.471262,
            31.210299
        ],
        "address": "建国中路25号",
        "name": "8号桥建国园南区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.427784,
            31.182661
        ],
        "address": "中山西路2025号",
        "name": "永升大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.485461,
            31.284628
        ],
        "address": "赤峰路626弄",
        "name": "天峰公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.60121,
            31.336042
        ],
        "address": "富特北路353号",
        "name": "凯邦大楼",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.516132,
            31.206519
        ],
        "address": "浦东南路2179弄",
        "name": "宏润公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.393769,
            31.247788
        ],
        "address": "北石路500弄30号",
        "name": "舒庭苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.484658,
            31.294174
        ],
        "address": "广纪路838号",
        "name": "中图出版蓝桥创意产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.539134,
            31.039784
        ],
        "address": "江航南路801弄-1-15号",
        "name": "瑞和华苑（上海）",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.482567,
            31.25871
        ],
        "address": "四川北路1717号",
        "name": "嘉杰国际广场(办公楼)",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.475795,
            31.25936
        ],
        "address": "宝通路425弄",
        "name": "宝通公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.458513,
            31.264604
        ],
        "address": "共和新路1346号",
        "name": "通用大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.535669,
            31.054791
        ],
        "address": "江协路51弄",
        "name": "金硕河畔景园西区",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.437447,
            31.130156
        ],
        "address": "老沪闵路1068弄",
        "name": "绿洲庭苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.387866,
            31.124305
        ],
        "address": "虹莘路1200弄",
        "name": "新梅商住楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.401838,
            31.223037
        ],
        "address": "枣阳路891弄",
        "name": "冠龙家园（风华水岸）",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.600807,
            31.252279
        ],
        "address": "浙桥路277号",
        "name": "碧海现代苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.246372,
            31.339612
        ],
        "address": "云屏路1199弄",
        "name": "盘古天地一期（上海）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.272967,
            31.115654
        ],
        "address": "鼓浪路550号",
        "name": "晶尚坊",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.684986,
            31.196994
        ],
        "address": "青厦路200弄",
        "name": "华夏银桂苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.248256,
            31.353901
        ],
        "address": "依玛路389弄",
        "name": "新城香溢璟庭",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.44409,
            31.322059
        ],
        "address": "共和新路5000号",
        "name": "绿地新都会（风尚天地）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.262795,
            31.379302
        ],
        "address": "嘉罗公路336号",
        "name": "嘉定科创大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.400714,
            31.207104
        ],
        "address": "古北路585号",
        "name": "古北公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.529958,
            31.222815
        ],
        "address": "东方路971号",
        "name": "钱江大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.408066,
            31.193011
        ],
        "address": "黄金城道258号",
        "name": "古北嘉年华庭",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.419902,
            31.200103
        ],
        "address": "凯旋路1415号",
        "name": "凯旋商务大厦（中心）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.485281,
            31.232814
        ],
        "address": "北京东路668号",
        "name": "科技京城",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.421769,
            31.233671
        ],
        "address": "曹杨路272号",
        "name": "曹杨路272号商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.381848,
            31.055937
        ],
        "address": "华宁路3333号",
        "name": "海联智谷",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.46534,
            31.243952
        ],
        "address": "天目中路520号",
        "name": "北苑大厦(520号)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.427638,
            31.188991
        ],
        "address": "徐虹北路18弄",
        "name": "徐家汇景园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.503521,
            31.261521
        ],
        "address": "岳州路399弄",
        "name": "紫虹嘉苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.502403,
            31.221565
        ],
        "address": "中山南路318号",
        "name": "东方国际金融广场",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.2548,
            31.059028
        ],
        "address": "长水街277弄",
        "name": "信达蓝尊（信达仁泰苑）",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.217779,
            31.275807
        ],
        "address": "曹安公路4671号",
        "name": "北虹桥协通科技大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.551151,
            31.247615
        ],
        "address": "栖山路465弄16号",
        "name": "鼎隆大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.622945,
            31.167814
        ],
        "address": "科农路99弄",
        "name": "张江国际人才公寓一期（张江纳仕国际社区）",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.421973,
            31.009374
        ],
        "address": "兰坪路301弄22支弄",
        "name": "鹤庆高层小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.524906,
            31.266692
        ],
        "address": "齐齐哈尔路928号",
        "name": "印坊928",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.426173,
            31.193661
        ],
        "address": "虹桥路666弄",
        "name": "虹桥乐庭",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.517431,
            31.299654
        ],
        "address": "黄兴路2218号",
        "name": "合生国际中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.419765,
            31.202832
        ],
        "address": "新华路569弄99号",
        "name": "当代新华",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.706545,
            31.246095
        ],
        "address": "汇庆路366号",
        "name": "怡新生命科技园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.513208,
            31.308595
        ],
        "address": "国京路50弄",
        "name": "平安佳苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.537004,
            31.052185
        ],
        "address": "江航路378弄",
        "name": "浦江丽都二期",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.112151,
            31.181966
        ],
        "address": "久业路89号",
        "name": "松港智造工坊",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.480267,
            31.308173
        ],
        "address": "场中路201号",
        "name": "元博商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.470287,
            31.203103
        ],
        "address": "打浦路88号",
        "name": "海丽大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.436278,
            31.174917
        ],
        "address": "漕溪路167弄",
        "name": "铭源大楼（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.5575,
            31.272188
        ],
        "address": "杨树浦路2893号",
        "name": "海尚大厦",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.502951,
            31.22044
        ],
        "address": "中山南路398弄",
        "name": "海琪园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.192569,
            31.016686
        ],
        "address": "荣乐西路1058号",
        "name": "松江颐景园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.51371,
            31.29469
        ],
        "address": "四平路2158号",
        "name": "富庆国定大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.238275,
            31.382689
        ],
        "address": "环城路2222号",
        "name": "嘉乐园商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.482849,
            31.199766
        ],
        "address": "局门路620号",
        "name": "重矿大厦(局门路)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.489669,
            31.288476
        ],
        "address": "东体育会路1071弄",
        "name": "商建大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.43426,
            31.214368
        ],
        "address": "延安西路719号",
        "name": "佳都大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.426213,
            31.211842
        ],
        "address": "昭化路110号",
        "name": "增沁商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.523566,
            31.277918
        ],
        "address": "控江路1555号",
        "name": "上海信息技术大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.440538,
            31.193002
        ],
        "address": "天钥桥路30号",
        "name": "美罗大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.476086,
            31.194566
        ],
        "address": "龙华东路647号",
        "name": "电科滨江中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.426522,
            31.071498
        ],
        "address": "向阳路880号",
        "name": "歆翱智联大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.446276,
            31.289491
        ],
        "address": "永和路118弄",
        "name": "东方环球企业中心43号",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.340902,
            31.242713
        ],
        "address": "新福路9号",
        "name": "连成大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.449459,
            31.199542
        ],
        "address": "肇嘉浜路680号",
        "name": "上海金钟大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.587671,
            31.345725
        ],
        "address": "杨高北路536号",
        "name": "乐非天地",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.31315,
            31.210894
        ],
        "address": "申长路1588弄1号楼",
        "name": "虹桥平安财富中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.604484,
            31.338933
        ],
        "address": "美盛路255号",
        "name": "众原企业天地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46985,
            31.197207
        ],
        "address": "瑞金南路345号",
        "name": "裕兴大厦（商务楼）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.532478,
            31.176872
        ],
        "address": "成山路1850弄",
        "name": "大华锦绣华城17街区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.55317,
            31.232625
        ],
        "address": "灵山路898号",
        "name": "融汇898创意园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.556631,
            31.237118
        ],
        "address": "羽山路998弄",
        "name": "景宏嘉园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.372411,
            31.176764
        ],
        "address": "虹井路280弄1号",
        "name": "瑞都大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.456289,
            31.239575
        ],
        "address": "长安路550弄12号",
        "name": "安丰小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.519158,
            31.149194
        ],
        "address": "尚博路569弄",
        "name": "湾流域二期",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.502421,
            31.340536
        ],
        "address": "国权北路1688弄52号",
        "name": "湾谷科技园C6座（新湾财智中心）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.251445,
            31.032168
        ],
        "address": "五昆路88弄",
        "name": "云著深蓝",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.492101,
            31.335382
        ],
        "address": "淞良路99弄",
        "name": "盛世宝邸二期",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.42073,
            31.12538
        ],
        "address": "罗锦路55号",
        "name": "锦宏产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.473782,
            31.401244
        ],
        "address": "友谊路318号",
        "name": "灏唯滨江智创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.226752,
            31.373941
        ],
        "address": "竹笛路388弄",
        "name": "宝菊清水园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.505386,
            31.316293
        ],
        "address": "国霞路399弄",
        "name": "三湘未来海岸",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.425654,
            31.176266
        ],
        "address": "宜山路655弄6号",
        "name": "高知楼_高级知识分子楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.444652,
            31.191342
        ],
        "address": "南丹东路99弄",
        "name": "天际花园三期",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.424347,
            31.133657
        ],
        "address": "梅陇十村17～21号",
        "name": "徐汇锦梅苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.454394,
            31.244462
        ],
        "address": "恒丰路436-410号 ",
        "name": "环智国际大厦",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.431096,
            31.243435
        ],
        "address": "宜昌路588弄",
        "name": "大上海城市花园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.433541,
            31.226861
        ],
        "address": "万航渡路623弄85号",
        "name": "建华大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.440338,
            31.19386
        ],
        "address": "天钥桥路20号",
        "name": "T20(百胜集团大楼)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.653578,
            31.266663
        ],
        "address": "金海路2505号",
        "name": "曹路宝龙城市广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.34736,
            31.101189
        ],
        "address": "莘松路1288弄",
        "name": "绿洲长香岛花园",
        "count": 70,
        "style": 0
    },
    {
        "lnglat": [
            121.384484,
            31.241668
        ],
        "address": "梅川路1209号",
        "name": "加速器金融园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441939,
            31.187218
        ],
        "address": "天钥桥路438号，458号",
        "name": "申峰大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.333791,
            31.237787
        ],
        "address": "丰华路1200号",
        "name": "富锋科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450439,
            31.231135
        ],
        "address": "西康路300号",
        "name": "本本大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.231787,
            31.385362
        ],
        "address": "盘安路501号",
        "name": "菊园智慧中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.492226,
            31.198389
        ],
        "address": "西藏南路1739弄",
        "name": "耀江花园二期",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.424544,
            31.036426
        ],
        "address": "都市路388弄",
        "name": "复地北桥城三期",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.26903,
            31.038745
        ],
        "address": "文翔东路58号",
        "name": "上海友喜国际高科技园区二期",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.419111,
            31.204977
        ],
        "address": "新华路699弄1-3号",
        "name": "新华嘉利公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.480132,
            31.227123
        ],
        "address": "金陵东路500号",
        "name": "亚龙国际广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.506109,
            31.310695
        ],
        "address": "国安路55号",
        "name": "君庭广场",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.380545,
            31.164183
        ],
        "address": "龙茗路2822弄18-35号",
        "name": "九歌茗园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.43669,
            31.339262
        ],
        "address": "纪蕰路588号",
        "name": "智力产业园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.176406,
            31.174568
        ],
        "address": "崧泽大道6555号",
        "name": "奥帛置业大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.497263,
            31.166859
        ],
        "address": "上南路2779号",
        "name": "大桥海达楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.484658,
            31.294174
        ],
        "address": "广纪路838号",
        "name": "国家数字出版基地",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.480912,
            31.19591
        ],
        "address": "中山南一路788号博荟广场",
        "name": "博荟广场商场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.498084,
            31.24903
        ],
        "address": "东大名路501号",
        "name": "上海白玉兰广场",
        "count": 88,
        "style": 0
    },
    {
        "lnglat": [
            121.432023,
            31.219649
        ],
        "address": "愚园路905-907号",
        "name": "新利商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.346338,
            31.137034
        ],
        "address": "中春路7001号",
        "name": "明谷科技园一期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.421519,
            31.176847
        ],
        "address": "徐汇区柳州路585弄",
        "name": "申德公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.532807,
            31.183609
        ],
        "address": "北艾路1200弄",
        "name": "大华锦绣华城9街区",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.521098,
            31.298837
        ],
        "address": "胶州路1118弄1-19号",
        "name": "绿洲城市花园一期",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.517828,
            31.293762
        ],
        "address": "黄兴路2005弄2号",
        "name": "杨浦科技大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.324976,
            31.139569
        ],
        "address": "蒲汇路168-178号",
        "name": "旭辉丰禄纯真中心（九亭U天地）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.53131,
            31.233583
        ],
        "address": "松林路97弄",
        "name": "海怡别墅",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.307149,
            31.149953
        ],
        "address": "涞坊路1033弄1-145",
        "name": "馨亭家苑",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.430038,
            31.266086
        ],
        "address": "志丹路155弄",
        "name": "西部名都花园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.475128,
            31.210429
        ],
        "address": "马当路588弄",
        "name": "淡水湾花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.589222,
            31.351632
        ],
        "address": "新兰路9号",
        "name": "晓富金融大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.483303,
            31.25821
        ],
        "address": "四川北路1688号",
        "name": "福德商务中心",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.424146,
            31.194764
        ],
        "address": "虹桥路808号",
        "name": "加华广场(汇宜众创空间)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.384802,
            31.184459
        ],
        "address": "虹梅路3215弄201号",
        "name": "圣伦兰商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.382167,
            31.223578
        ],
        "address": "云岭东路651号",
        "name": "合星大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.599801,
            31.117007
        ],
        "address": "康浦路51弄",
        "name": "绿地浦汇广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.536939,
            31.266085
        ],
        "address": "锦州湾路27弄",
        "name": "和瑞雅苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.421874,
            31.241466
        ],
        "address": "武宁路300弄",
        "name": "武宁小城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.435859,
            31.112945
        ],
        "address": "老沪闵路1482号",
        "name": "瑞星商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.761691,
            30.873023
        ],
        "address": "新杨公路1666号",
        "name": "临港润材智能产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.440631,
            31.176378
        ],
        "address": "龙华西路591弄",
        "name": "宜仕怡家",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.39347,
            31.283551
        ],
        "address": "古浪路288弄",
        "name": "中环名品公馆",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.408977,
            31.27583
        ],
        "address": "真华路999弄",
        "name": "水岸蓝桥",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.442014,
            31.297354
        ],
        "address": "江场西路299弄1号楼",
        "name": "海棠大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.402655,
            31.243177
        ],
        "address": "兰溪路182号",
        "name": "安居兰庭商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.410947,
            31.136963
        ],
        "address": "益文路101弄",
        "name": "锦鸿公寓",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.746499,
            31.067523
        ],
        "address": "听康路190弄",
        "name": "秀园东园",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.5564,
            31.202848
        ],
        "address": "龙阳路1990号",
        "name": "龙阳商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.432241,
            31.214631
        ],
        "address": "延安西路895号",
        "name": "申亚金融广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.491221,
            31.25516
        ],
        "address": "辽宁路244号",
        "name": "1930鑫鑫创意园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.504164,
            31.240987
        ],
        "address": "陆家嘴环路1233号",
        "name": "汇亚大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.736569,
            31.069595
        ],
        "address": "拱海路79弄",
        "name": "民乐城惠康苑",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.589967,
            31.347311
        ],
        "address": "菲拉路45号",
        "name": "众上文化大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.335883,
            31.387947
        ],
        "address": "美平路1060弄1-15号",
        "name": "美罗家园宝欣苑三村",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.412366,
            31.216217
        ],
        "address": "长宁路1277弄",
        "name": "中山公寓",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.455536,
            31.245608
        ],
        "address": "天目西路290号",
        "name": "康吉大厦（市政楼）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.437816,
            31.192755
        ],
        "address": "漕溪北路18号",
        "name": "实业大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.358872,
            31.410117
        ],
        "address": "美丰路88号",
        "name": "香岛原墅",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.434643,
            31.240682
        ],
        "address": "澳门路872弄3号",
        "name": "绿洲尧舜公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.622198,
            31.196727
        ],
        "address": "张江路1206号",
        "name": "张江科创园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.448855,
            31.268683
        ],
        "address": "延长中路619号",
        "name": "延中大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.427263,
            31.222853
        ],
        "address": "长宁路405弄2号",
        "name": "花园村雅苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.452858,
            31.255377
        ],
        "address": "芷江西路788号",
        "name": "华舟大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.428979,
            31.233394
        ],
        "address": "上海市普陀区武宁路19号",
        "name": "丽晶阳光大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.534019,
            31.279062
        ],
        "address": "双阳路365号",
        "name": "海林大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.486913,
            31.181377
        ],
        "address": "国耀路211号、209号",
        "name": "国家电网世博写字楼CD座",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.425678,
            31.345343
        ],
        "address": "共富路476弄",
        "name": "富隆苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.436949,
            30.961531
        ],
        "address": "肖南路16号",
        "name": "乐活生活馆",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.230902,
            31.031127
        ],
        "address": "谷阳北路1500号",
        "name": "永翔大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.426291,
            31.382063
        ],
        "address": "友谊西路101号",
        "name": "上海建筑科技产业园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.491467,
            31.290152
        ],
        "address": "曲阳路910号",
        "name": "复城国际办公楼",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.428726,
            31.194134
        ],
        "address": "虹桥路591弄",
        "name": "虹桥丽园（上海）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.486033,
            31.208471
        ],
        "address": "西藏南路1200弄",
        "name": "黄浦丽园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.212657,
            31.039241
        ],
        "address": "新松江路1234号",
        "name": "恒杰商务大楼A座",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.463754,
            31.273626
        ],
        "address": "平型关路377弄",
        "name": "上海嘉利明珠城",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.417032,
            31.216922
        ],
        "address": "汇川路99弄",
        "name": "新时空国际商务广场",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.537647,
            31.268355
        ],
        "address": "临青路555号",
        "name": "银河经典苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.483006,
            31.223078
        ],
        "address": "人民路998号",
        "name": "金天地国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.404484,
            31.402765
        ],
        "address": "杨南路399弄",
        "name": "翡翠上南苑上南翡翠",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.516797,
            31.205984
        ],
        "address": "临沂北路150弄",
        "name": "东南华庭",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.450109,
            31.235136
        ],
        "address": "康定路358号",
        "name": "越界陕康里",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.533424,
            31.275758
        ],
        "address": "周家嘴路3158弄",
        "name": "双阳公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.26116,
            31.03013
        ],
        "address": "松卫北路295号",
        "name": "上海陆国时代商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.561181,
            31.22512
        ],
        "address": "芳甸路333号",
        "name": "水清木华国际公寓",
        "count": 63,
        "style": 0
    },
    {
        "lnglat": [
            121.3852,
            31.210813
        ],
        "address": "茅台路830弄（威宁路）",
        "name": "天申综合小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436154,
            31.153812
        ],
        "address": "石龙路569号",
        "name": "S569园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.457506,
            31.280636
        ],
        "address": "平型关路1088弄",
        "name": "慧芝湖花园三期(嘉悦天地)",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.446063,
            31.288084
        ],
        "address": "平陆路490弄",
        "name": "彭浦商务园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.254479,
            31.177923
        ],
        "address": "崧泽大道2229弄47-57号",
        "name": "天空之城虹之森",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.465821,
            31.312109
        ],
        "address": "临汾路80弄",
        "name": "临汾名城三期",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.377259,
            31.109258
        ],
        "address": "莘松路58号",
        "name": "东苑丽宝广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.46511,
            31.249364
        ],
        "address": "虬江路1488弄",
        "name": "精文城市花园",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.292542,
            31.198458
        ],
        "address": "徐灵路300弄",
        "name": "二联馨苑",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.346917,
            31.144063
        ],
        "address": "联明路389号",
        "name": "麦可将文创园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.514123,
            31.060691
        ],
        "address": "沈杜公路3872弄4号楼",
        "name": "上海节能环保科技孵化基地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.473581,
            31.223523
        ],
        "address": "淮海中路300号",
        "name": "香港新世界大厦(写字楼)",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.480119,
            31.225106
        ],
        "address": "淮海中路1号",
        "name": "柳林大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.488098,
            31.213219
        ],
        "address": "大林路10弄2号",
        "name": "兴林办公楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.412285,
            31.42952
        ],
        "address": "月富路55弄",
        "name": "新城昱翠湾",
        "count": 134,
        "style": 0
    },
    {
        "lnglat": [
            121.243277,
            31.058027
        ],
        "address": "广富林路658号",
        "name": "松江万达广场商务楼",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.484483,
            31.320177
        ],
        "address": "殷高西路10弄",
        "name": "景瑞站前大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.49648,
            31.223162
        ],
        "address": "学院路32弄",
        "name": "圣莲大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.462464,
            31.240836
        ],
        "address": "南苏州路1393弄1号",
        "name": "良友高层",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.460921,
            31.230432
        ],
        "address": "南京西路819号",
        "name": "中创大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.498069,
            31.272529
        ],
        "address": "虹口区四平路773号",
        "name": "金大地商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.096644,
            31.165876
        ],
        "address": "清河湾路699弄",
        "name": "旭辉玫瑰湾",
        "count": 70,
        "style": 0
    },
    {
        "lnglat": [
            121.52005,
            31.077019
        ],
        "address": "联航路1399弄",
        "name": "浦江智汇园",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.467957,
            31.24527
        ],
        "address": "天目中路363号",
        "name": "万佳商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.61346,
            31.310258
        ],
        "address": "巴圣路160号",
        "name": "自贸壹号",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.455942,
            31.236709
        ],
        "address": "泰兴路625弄",
        "name": "泰府名邸",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.454776,
            31.255304
        ],
        "address": "中华新路939弄",
        "name": "紫兰苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.36602,
            31.081527
        ],
        "address": "银都西路215号",
        "name": "歆翱创意园(东区)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.085306,
            31.13253
        ],
        "address": "黄泥娄路287号",
        "name": "禧悦佳苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.40222,
            31.358665
        ],
        "address": "潘泾路366弄56号",
        "name": "大华享寓锦绣四季宝荻路社区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.524542,
            31.243769
        ],
        "address": "滨江大道1588号",
        "name": "滨江道",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.219307,
            31.379112
        ],
        "address": "秋竹路655弄",
        "name": "叠翠峰苑二期",
        "count": 65,
        "style": 0
    },
    {
        "lnglat": [
            121.439155,
            31.171697
        ],
        "address": "漕溪四村70号",
        "name": "兆嘉园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.438851,
            31.24194
        ],
        "address": "长寿路360号",
        "name": "源达大厦",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.422954,
            31.014407
        ],
        "address": "东川路1779号",
        "name": "新闵创意园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.420113,
            31.236925
        ],
        "address": "同普路299弄",
        "name": "浙铁绿城长风中心",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.451464,
            31.234373
        ],
        "address": "武定路458号",
        "name": "洪安大厦(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.316231,
            31.209015
        ],
        "address": "申虹路988弄",
        "name": "虹桥富力悦都商办区域",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.495055,
            31.214645
        ],
        "address": "中华路868弄",
        "name": "明日星城二期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.433193,
            31.306381
        ],
        "address": "康宁路1021弄",
        "name": "幸福创智园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.534956,
            31.284538
        ],
        "address": "延吉中路25弄",
        "name": "泰鸿新苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.501053,
            31.222863
        ],
        "address": "中山南路200号",
        "name": "金外滩花园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.55318,
            31.211117
        ],
        "address": "花木路908号",
        "name": "雍景台（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.264364,
            31.405247
        ],
        "address": "武乡南路259弄",
        "name": "大成名庭",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.469966,
            31.19827
        ],
        "address": "瑞金南路333弄",
        "name": "名盛苑",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.427407,
            31.208476
        ],
        "address": "延安西路1262号",
        "name": "上生新所",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.487152,
            31.230541
        ],
        "address": "河南南路1号",
        "name": "星腾大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.379106,
            31.216254
        ],
        "address": "天山路30号",
        "name": "天山大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.469953,
            31.200774
        ],
        "address": "斜土路810弄",
        "name": "郁金香花苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.490906,
            31.277518
        ],
        "address": "曲阳路501号-551号",
        "name": "曲一花苑(曲一小区)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.336447,
            31.387068
        ],
        "address": "美平路999弄1-16号",
        "name": "美罗家园宝欣苑四村",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.396198,
            31.166473
        ],
        "address": "田林路418号",
        "name": "徐汇乐业天地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.257641,
            31.36838
        ],
        "address": "沪宜公路3099号",
        "name": "绿地嘉创国际商务广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.484071,
            31.237907
        ],
        "address": "南京东路300号",
        "name": "名人商业大厦",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.382072,
            31.232897
        ],
        "address": "金沙江路1518弄",
        "name": "近铁城市广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.509715,
            31.031028
        ],
        "address": "永跃路555弄",
        "name": "永康城馨宁佳苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.310455,
            31.007064
        ],
        "address": "影佳路333号",
        "name": "雅居乐星徽",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.320706,
            31.10896
        ],
        "address": "朱金公路801号",
        "name": "百士威大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.413321,
            31.270408
        ],
        "address": "大华一路210号",
        "name": "嘉年华大厦（宝山）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.479062,
            31.225699
        ],
        "address": "淮海中路98号",
        "name": "金钟广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432226,
            31.194953
        ],
        "address": "广元西路315号",
        "name": "联峰汇",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.415723,
            31.2438
        ],
        "address": "武宁路501号",
        "name": "鸿运大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.457687,
            31.19866
        ],
        "address": "小木桥路219号",
        "name": "悦樘公寓(小木桥店)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.439086,
            31.218843
        ],
        "address": "延安西路358号",
        "name": "美丽园大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.449743,
            31.258844
        ],
        "address": "中山北路1017号",
        "name": "沪太办公楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.61005,
            31.181468
        ],
        "address": "祥科路298号",
        "name": "佑越国际",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.185956,
            31.201545
        ],
        "address": "福定路289弄59号",
        "name": "万科尚景苑",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.400887,
            31.133262
        ],
        "address": "沪闵路6088号",
        "name": "凯德龙之梦莘庄店（闵行凯德商业中心）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.500771,
            31.211777
        ],
        "address": "陆家浜路305弄",
        "name": "上海阳光里",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.492806,
            31.215713
        ],
        "address": "河南南路747号",
        "name": "申升公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.488064,
            31.223921
        ],
        "address": "河南南路368弄",
        "name": "太阳都市花园二期",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.393522,
            31.173869
        ],
        "address": "虹梅路2159弄",
        "name": "荣信虹桥世嘉",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.696546,
            31.188887
        ],
        "address": "南桥路707弄",
        "name": "永达城市公寓",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.472354,
            31.284834
        ],
        "address": "广灵二路298弄",
        "name": "典雅公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.439497,
            31.27848
        ],
        "address": "广中西路777弄55号",
        "name": "启迪大厦",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.443485,
            31.284547
        ],
        "address": "灵石路709号60幢",
        "name": "万灵谷花园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.520775,
            31.287614
        ],
        "address": "黄兴路1599弄",
        "name": "新纪元国际广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.42041,
            31.26399
        ],
        "address": "交暨路207弄5号",
        "name": "齐成创业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.520866,
            31.085854
        ],
        "address": "江月路1059号",
        "name": "旭和环保产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.417132,
            31.202803
        ],
        "address": "杨宅路255号",
        "name": "新发现才富园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.275378,
            31.346172
        ],
        "address": "沪宜公路2641号",
        "name": "远香湖1号商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.356699,
            31.21787
        ],
        "address": "天山西路567号",
        "name": "神州智慧天地",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.391833,
            31.29349
        ],
        "address": "祁顺路1388弄",
        "name": "复地香栀花园",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.311817,
            31.063425
        ],
        "address": "新中街119弄1-22号",
        "name": "新乐雅苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.706617,
            31.158803
        ],
        "address": "川宏路365号",
        "name": "圣御工业总部园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.424018,
            31.187727
        ],
        "address": "古宜路181号",
        "name": "西岸才谷",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.473761,
            31.252113
        ],
        "address": "虬江路997弄",
        "name": "东新大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.475448,
            31.204609
        ],
        "address": "鲁班路277号",
        "name": "银杏家园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.438777,
            31.278901
        ],
        "address": "广中西路777弄99号",
        "name": "江裕大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.42376,
            31.206433
        ],
        "address": "定西路657号",
        "name": "大吉地世贸大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.312108,
            31.121456
        ],
        "address": "恒江路8号",
        "name": "elife生活社区",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.355658,
            31.122351
        ],
        "address": "友东路81号",
        "name": "友东路81号商务楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.490962,
            31.220704
        ],
        "address": "河南南路555弄",
        "name": "士林华苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.250332,
            31.10577
        ],
        "address": "古楼公路1198弄",
        "name": "同润山河小城",
        "count": 81,
        "style": 0
    },
    {
        "lnglat": [
            121.277251,
            31.039338
        ],
        "address": "锦昔路626号",
        "name": "佳才天地",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.486785,
            31.211087
        ],
        "address": "西藏南路1109号",
        "name": "永明大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.387855,
            31.232302
        ],
        "address": "金沙江路1340弄172支弄A区",
        "name": "上海新曹杨高新技术工业园区一街坊（A区）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.411427,
            31.226825
        ],
        "address": "中山北路3856弄2号",
        "name": "中环大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.348973,
            31.159401
        ],
        "address": "吴宝路169弄",
        "name": "上海嘉景苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.101514,
            31.170855
        ],
        "address": "清河湾路1121弄62号楼",
        "name": "卓越商务广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.635823,
            31.266299
        ],
        "address": "金穗路1501号",
        "name": "金穗园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.262756,
            31.201928
        ],
        "address": "华徐公路1199号",
        "name": "碧家国际社区(国家会展中心店)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.452506,
            31.246126
        ],
        "address": "恒丰路568号",
        "name": "恒汇国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.517189,
            31.230036
        ],
        "address": "商城路518号",
        "name": "内外联大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.490129,
            31.211869
        ],
        "address": "陆家浜路976号",
        "name": "富南大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.530893,
            31.259358
        ],
        "address": "平凉路1000弄",
        "name": "天科国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.487536,
            31.209997
        ],
        "address": "丽园路501弄",
        "name": "soho丽园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.497808,
            31.294476
        ],
        "address": "邯郸路159号",
        "name": "上豪大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.470277,
            31.228441
        ],
        "address": "威海路48号",
        "name": "民生银行大厦（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.525102,
            31.27438
        ],
        "address": "凤城路5号",
        "name": "凤城巷二期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.494385,
            31.251952
        ],
        "address": "东汉阳路309弄",
        "name": "名江七星城",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.680275,
            31.186276
        ],
        "address": "城丰路599弄",
        "name": "东方城市绿洲",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.422651,
            31.194722
        ],
        "address": "虹桥路888号",
        "name": "阳光名邸",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.444818,
            31.266887
        ],
        "address": "延长中路801号",
        "name": "新华文化科技园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.443508,
            31.13924
        ],
        "address": "上中路303号",
        "name": "万街303创意园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.461642,
            31.224403
        ],
        "address": "延安中路658号",
        "name": "陕西大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.414394,
            31.216358
        ],
        "address": "长宁路1189号",
        "name": "长宁来福士广场",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.422108,
            31.037315
        ],
        "address": "都市路431号",
        "name": "铂客公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.458687,
            31.214276
        ],
        "address": "南昌路555号",
        "name": "东方巴黎霞飞苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.502988,
            31.180265
        ],
        "address": "齐河路257弄21号",
        "name": "上南花苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.221031,
            31.735044
        ],
        "address": "环湖西路588号",
        "name": "广昊世纪大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.374161,
            31.357256
        ],
        "address": "菊泉街577弄",
        "name": "宝沁苑",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.371205,
            31.356429
        ],
        "address": "菊盛路468弄",
        "name": "宝翔苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.350467,
            31.066282
        ],
        "address": "金都西路688号",
        "name": "上海喜乐嘉工业园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.442337,
            31.233706
        ],
        "address": "常德路818弄",
        "name": "德安商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.455489,
            31.156465
        ],
        "address": "天钥桥南路1111号",
        "name": "誉仁家园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.35371,
            31.222914
        ],
        "address": "协和路1033号",
        "name": "文洋大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.491429,
            31.291293
        ],
        "address": "虹口区曲阳路930号",
        "name": "大柏树930科技创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.523879,
            31.202854
        ],
        "address": "北园路258弄",
        "name": "东方汇景苑",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.441584,
            31.233745
        ],
        "address": "昌平路777弄",
        "name": "静安凤凰苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.44612,
            31.192352
        ],
        "address": "宛平南路300弄",
        "name": "宛平南苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.274339,
            31.27171
        ],
        "address": "曹安公路3918号",
        "name": "协通大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.283392,
            31.303325
        ],
        "address": "嘉美路777号",
        "name": "瑞华文化科技创意园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.105212,
            31.183642
        ],
        "address": "胜利路1680号",
        "name": "联东U谷青浦国际企业港",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.484893,
            31.227221
        ],
        "address": "人民路777弄",
        "name": "东淮海公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.542612,
            31.244437
        ],
        "address": "巨野路22号",
        "name": "陆家嘴滨江公馆（申城公寓）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.48632,
            31.20531
        ],
        "address": "西凌家宅路111弄4号",
        "name": "科凌公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42351,
            31.045076
        ],
        "address": "放鹤路2323号",
        "name": "万顺苑小区",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.430943,
            31.23361
        ],
        "address": "武宁南路488号",
        "name": "智慧广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.428085,
            31.195698
        ],
        "address": "番禺路900号",
        "name": "番禺大楼（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.448225,
            31.188855
        ],
        "address": "宛平南路590弄",
        "name": "爱建大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.491335,
            31.264406
        ],
        "address": "四平路228号",
        "name": "大世界商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.484479,
            31.282246
        ],
        "address": "赤峰路525号",
        "name": "赤峰路525号小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.465797,
            31.195746
        ],
        "address": "零陵北路9弄",
        "name": "日晖新城",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.445744,
            31.198886
        ],
        "address": "吴兴路278号",
        "name": "宛平公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.410423,
            31.216432
        ],
        "address": "中山西路340号",
        "name": "科宁公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.441903,
            31.193697
        ],
        "address": "天钥桥路69弄 ",
        "name": "科汇公寓（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.469873,
            31.197221
        ],
        "address": "瑞金南路345弄",
        "name": "裕兴大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436503,
            31.187901
        ],
        "address": "漕溪北路398号",
        "name": "汇智大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.436274,
            31.239062
        ],
        "address": "长寿路457弄",
        "name": "锦海大厦(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.292129,
            31.207821
        ],
        "address": "纪翟路256号",
        "name": "华漕U天地",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.448675,
            31.251755
        ],
        "address": "中潭路33/91/99/100弄，远景路97弄",
        "name": "中远两湾城",
        "count": 190,
        "style": 0
    },
    {
        "lnglat": [
            121.52217,
            31.322672
        ],
        "address": "长岛路1066弄",
        "name": "碧云新天地家园三期",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.555146,
            31.242531
        ],
        "address": "张杨路2389弄",
        "name": "置汇旭辉广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.386379,
            31.351976
        ],
        "address": "顾北路689弄",
        "name": "东方帕提欧",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.49806,
            31.268504
        ],
        "address": "天宝路558号",
        "name": "中信和平家园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.865315,
            30.948029
        ],
        "address": "老芦公路1055号",
        "name": "科创田园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.023203,
            31.121049
        ],
        "address": "绿湖路888弄",
        "name": "海上湾华庭闻涧",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.494087,
            31.350381
        ],
        "address": "长江路392号",
        "name": "KEY设计园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.475548,
            31.325229
        ],
        "address": "新二路183弄",
        "name": "馨良苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.469103,
            31.299834
        ],
        "address": "奎照路790弄",
        "name": "奎照路790弄",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.431993,
            31.248789
        ],
        "address": "中山北路2000号",
        "name": "中期大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.153412,
            31.161974
        ],
        "address": "盈港东路7802号",
        "name": "宝龙中心（青浦）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.457532,
            31.164923
        ],
        "address": "云锦路500号",
        "name": "绿地汇中心",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.462931,
            31.204656
        ],
        "address": "陕西南路333弄5号",
        "name": "联兴大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.480442,
            31.204522
        ],
        "address": "斜土路298弄",
        "name": "永业仁德坊",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.198691,
            31.294648
        ],
        "address": "雅丹路789弄",
        "name": "昌吉名邸",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.442073,
            31.240755
        ],
        "address": "西康路1018号",
        "name": "元茂金豪大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.588321,
            31.250982
        ],
        "address": "金桥路1480号",
        "name": "馨住公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.54306,
            31.236579
        ],
        "address": "张杨路1673弄",
        "name": "生安花苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.09305,
            31.13979
        ],
        "address": "盈清路188号",
        "name": "北极星广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.483538,
            31.209896
        ],
        "address": "丽园路333弄",
        "name": "黄浦新苑（上海）",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.452331,
            31.265368
        ],
        "address": "洛川中路840号",
        "name": "E构空间",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.484146,
            31.118639
        ],
        "address": "江松路501弄",
        "name": "江锦南苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.424596,
            31.20809
        ],
        "address": "定西路768号",
        "name": "东方金门花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.515731,
            31.267516
        ],
        "address": "周家嘴路2001弄",
        "name": "东银茗苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.346247,
            31.140792
        ],
        "address": "中春路7198号",
        "name": "凯斯国际商务中心",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.505464,
            31.324288
        ],
        "address": "国泓路818弄",
        "name": "绿地海珀璞晖",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.517903,
            31.291893
        ],
        "address": "国顺路66弄",
        "name": "怡福苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.505386,
            31.316293
        ],
        "address": "国霞路399弄",
        "name": "三湘未来海岸商务楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.452753,
            31.21737
        ],
        "address": "富民路291号",
        "name": "悟锦世纪大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.432279,
            31.16804
        ],
        "address": "沪闵路9512弄",
        "name": "泰成花苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.596892,
            31.25055
        ],
        "address": "金藏路51号",
        "name": "森晟世洋国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.53457,
            31.361613
        ],
        "address": "康悦路133弄1-26号",
        "name": "祥美苑",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.584225,
            31.311701
        ],
        "address": "莱阳路2450弄",
        "name": "高海家苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.455261,
            31.240847
        ],
        "address": "汉中路333弄",
        "name": "河滨花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.476183,
            31.198844
        ],
        "address": "鲁班路558号",
        "name": "经纬国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.535532,
            31.265046
        ],
        "address": "宁国路313弄",
        "name": "龙泽大厦(上海)",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.52396,
            31.240314
        ],
        "address": "浦东大道688号",
        "name": "浦东大道688号基地",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.475959,
            31.194928
        ],
        "address": "打浦路603号",
        "name": "金地威新8号桥滨江园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.512906,
            31.254386
        ],
        "address": "临潼路188号",
        "name": "临潼188金融创新中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.462632,
            31.039588
        ],
        "address": "尚义路39弄2号",
        "name": "吴泾宝龙中心（一期）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.505803,
            31.317729
        ],
        "address": "国霞路458弄",
        "name": "星汇广场二期",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.391879,
            31.359847
        ],
        "address": "苏家浜路435弄",
        "name": "宝顾佳苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.432378,
            31.240276
        ],
        "address": "胶州路1155弄1-19号",
        "name": "绿洲城市花园2期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.604911,
            31.333265
        ],
        "address": "天目中路749弄71号",
        "name": "海鸥康恒大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.380938,
            31.22241
        ],
        "address": "丹巴路28弄",
        "name": "旭辉世纪广场",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.468738,
            31.303404
        ],
        "address": "广粤路1500弄",
        "name": "学府花苑（上海）",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.459416,
            31.231524
        ],
        "address": "北京西路819号",
        "name": "北泰电信大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.544845,
            31.244167
        ],
        "address": "巨野路61弄",
        "name": "旭辉雅苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.452348,
            31.240829
        ],
        "address": "西苏州路85弄",
        "name": "静安河滨花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.420695,
            31.000436
        ],
        "address": "华坪路100号",
        "name": "上海帝景园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.275509,
            31.405864
        ],
        "address": "顺宁路501弄、启宁路421弄、胜竹东路3850弄、胜竹东路3870弄",
        "name": "佳兆业城市广场(上海)",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.472314,
            31.207028
        ],
        "address": "徐家汇路569号",
        "name": "帝庭爱仕大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.615364,
            31.315535
        ],
        "address": "上海外高桥保税区港澳路239号",
        "name": "兴江国贸大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.434962,
            31.012271
        ],
        "address": "永平南路198弄",
        "name": "东苑佳和园",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.461107,
            31.200774
        ],
        "address": "大木桥路100号",
        "name": "祥和公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.256071,
            31.381227
        ],
        "address": "金沙路75、77号",
        "name": "泰宸汇金商务楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.38796,
            31.222409
        ],
        "address": "云岭东路391",
        "name": "长风嘉庭国际",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.426422,
            31.245638
        ],
        "address": "中山北路2318号-2342号",
        "name": "中岚大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.507049,
            31.213108
        ],
        "address": "中山南路865号",
        "name": "临江花园大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.529652,
            31.203739
        ],
        "address": "杨高南路1288号",
        "name": "中远龙阳公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.260246,
            31.367921
        ],
        "address": "沪宜公路3128号",
        "name": "嘉尚国际广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.382035,
            31.175475
        ],
        "address": "吴中路1235号",
        "name": "新宏商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.449167,
            31.191509
        ],
        "address": "斜土路2200弄",
        "name": "荣承公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.381583,
            31.192068
        ],
        "address": "虹桥路2222弄55号",
        "name": "爱都公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.866637,
            30.978963
        ],
        "address": "老芦公路868号",
        "name": "金港世纪广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.382438,
            31.247827
        ],
        "address": "曹安路295，323号",
        "name": "振光大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.551364,
            31.224185
        ],
        "address": "民生路1403号",
        "name": "上海信息大厦",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.457626,
            31.298031
        ],
        "address": "江场路1228弄33号",
        "name": "东贤大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.4033,
            31.127079
        ],
        "address": "罗秀路1955弄",
        "name": "嘉和花苑",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.628366,
            31.300499
        ],
        "address": "美约路166号",
        "name": "美约路166号园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.335838,
            31.269387
        ],
        "address": "嘉涌路99号",
        "name": "MAX未来广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.310176,
            31.103905
        ],
        "address": "盛富路490号",
        "name": "佳钢科创园_盛富路",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.396658,
            31.182748
        ],
        "address": "吴中路686弄2号",
        "name": "金虹桥广场E座",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.470383,
            31.229261
        ],
        "address": "黄陂北路227号",
        "name": "中区广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.422562,
            31.19691
        ],
        "address": "淮海西路666号",
        "name": "中山万博国际中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.52866,
            31.175248
        ],
        "address": "成山路1488弄",
        "name": "大华锦绣华城15街区二期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.473568,
            31.238763
        ],
        "address": "西藏中路656号",
        "name": "美华大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.329138,
            31.243615
        ],
        "address": "华江路720号",
        "name": "歆翱商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.319886,
            31.243661
        ],
        "address": "鹤望路679弄",
        "name": "亿达北虹桥创业城",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.504554,
            31.254834
        ],
        "address": "公平路168号",
        "name": "北外滩来福士办公楼西塔",
        "count": 128,
        "style": 0
    },
    {
        "lnglat": [
            121.588328,
            31.210512
        ],
        "address": "科苑路99号",
        "name": "魔方公寓张江店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.497245,
            30.901299
        ],
        "address": "金海公路3199号",
        "name": "上海杨王高新技术产业园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.537366,
            31.264865
        ],
        "address": "宁国路228号B座",
        "name": "郡江国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.491068,
            30.919005
        ],
        "address": "南奉公路7298号",
        "name": "浦南财富广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.534552,
            31.291808
        ],
        "address": "松花江路287号",
        "name": "伊格尔公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.623602,
            31.253874
        ],
        "address": "宁桥路999号",
        "name": "金桥开发区T15",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.474002,
            31.213842
        ],
        "address": "合肥路315号",
        "name": "海文商务楼(合肥路)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.264796,
            31.182894
        ],
        "address": "明珠路838号",
        "name": "恒润大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.443808,
            31.29853
        ],
        "address": "江场二路99号",
        "name": "莱赛现代生活港",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.412962,
            31.097106
        ],
        "address": "莲花南路1500弄",
        "name": "麦多生活广场",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.525911,
            31.298288
        ],
        "address": "双阳北路395号",
        "name": "香阁丽苑",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.539585,
            31.268912
        ],
        "address": "河间路555弄",
        "name": "明月坊",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.484142,
            31.204906
        ],
        "address": "制造局路466号",
        "name": "裕和公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.607843,
            31.293072
        ],
        "address": "东靖路1831号",
        "name": "先行国际综合商务楼（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426441,
            31.076993
        ],
        "address": " 颛兴东路745号",
        "name": "拉法叶园区B楼墨空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.198822,
            31.160342
        ],
        "address": "镇泽路18弄",
        "name": "万科锦源",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.433721,
            31.211507
        ],
        "address": "江苏路876号",
        "name": "贵冠商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.535281,
            30.850502
        ],
        "address": "民乐路328弄",
        "name": "派米雷星火产业园A区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.420356,
            31.23467
        ],
        "address": "宁夏路201号",
        "name": "绿地科创大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.291885,
            31.20993
        ],
        "address": "繁兴路399弄1号",
        "name": "华漕生活馆",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.511338,
            31.024502
        ],
        "address": "永跃路208弄1-38号",
        "name": "江山都会",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.590284,
            31.350331
        ],
        "address": "基隆路89号",
        "name": "振丰大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.599228,
            31.20516
        ],
        "address": "金科路2966号",
        "name": "创智空间_张江信息园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.524368,
            31.148196
        ],
        "address": "环林东路270弄",
        "name": "樱桃苑",
        "count": 128,
        "style": 0
    },
    {
        "lnglat": [
            121.385231,
            31.220981
        ],
        "address": "光复西路2899弄",
        "name": "赢华国际广场",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.450018,
            31.12717
        ],
        "address": "华发路258号",
        "name": "东阔生活广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.486169,
            31.248082
        ],
        "address": "塘沽路463号",
        "name": "虹口科技金融大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.370553,
            31.175014
        ],
        "address": "虹井路185号",
        "name": "虹淞大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.429918,
            31.200495
        ],
        "address": "番禺路617弄1号",
        "name": "淮新大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.447477,
            31.286814
        ],
        "address": "彭江路602号",
        "name": "大宁德必易园",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.502967,
            31.221527
        ],
        "address": "中山南路268号",
        "name": "新源广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.454751,
            31.053861
        ],
        "address": "曲吴路589号",
        "name": "中国梦谷南上海文化创意产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.423519,
            31.213792
        ],
        "address": "武夷路351号",
        "name": "武夷商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.54977,
            31.202643
        ],
        "address": "杜鹃路192号",
        "name": "晖霖广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.175768,
            31.147519
        ],
        "address": "沪青平公路3908号",
        "name": "松港智创天地",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.254842,
            31.335733
        ],
        "address": "合作路719弄",
        "name": "领峰华庭一期",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.434869,
            31.233982
        ],
        "address": "余姚路456号",
        "name": "新都城公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.458154,
            31.203696
        ],
        "address": "襄阳南路550弄",
        "name": "天元襄阳公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.165632,
            31.183096
        ],
        "address": "崧复路1999号",
        "name": "奥帛科创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.51712,
            31.085935
        ],
        "address": "江月路1188号 ",
        "name": "久升科技大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436498,
            31.233204
        ],
        "address": "昌平路990号",
        "name": "航创990",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.423223,
            31.216508
        ],
        "address": "定西路1310弄8号",
        "name": "长乐大厦(长宁)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.306997,
            31.101973
        ],
        "address": "盛富路669号",
        "name": "科溢科创中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.565143,
            31.173606
        ],
        "address": "莲溪路1099弄",
        "name": "鹏裕苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.53167,
            31.214192
        ],
        "address": "蓝村路55弄",
        "name": "仕嘉名苑（上海）",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.479242,
            31.233689
        ],
        "address": "浙江中路188弄",
        "name": "中福城",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.457325,
            31.260221
        ],
        "address": "中山北路835号",
        "name": "悦樘公寓(大宁店)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.519463,
            31.260367
        ],
        "address": "霍山路777号",
        "name": "上海海鸥科创大厦",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.390083,
            31.251029
        ],
        "address": "铜川路1615弄",
        "name": "佳祥公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.367601,
            31.231021
        ],
        "address": "云岭西路600弄",
        "name": "金环商务花园二期",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.230059,
            31.125441
        ],
        "address": "置旺路288弄",
        "name": "万科有山（博望苑）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.278668,
            31.159126
        ],
        "address": "联民路100弄",
        "name": "正荣府",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.436437,
            31.240773
        ],
        "address": "常德路1239号",
        "name": "常德大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.556452,
            31.231897
        ],
        "address": "南洋泾路578号",
        "name": "界龙总部园御龙湾",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.457345,
            31.198248
        ],
        "address": "小木桥路224号",
        "name": "儿科大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.424611,
            31.1898
        ],
        "address": "吴中东路491号",
        "name": "宏云广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.228782,
            31.004792
        ],
        "address": "人民南路49弄1-13号",
        "name": "汇民轩",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.359793,
            31.408243
        ],
        "address": "抚远路1288弄",
        "name": "美兰湖中华园",
        "count": 113,
        "style": 0
    },
    {
        "lnglat": [
            121.805,
            30.906916
        ],
        "address": "青鸟路599号",
        "name": "碧桂园浦东星作",
        "count": 49,
        "style": 0
    },
    {
        "lnglat": [
            121.423631,
            31.172665
        ],
        "address": "柳州路523号",
        "name": "和成阁公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.403762,
            31.188791
        ],
        "address": "金高路1925号",
        "name": "金高里创意街区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.479307,
            31.261419
        ],
        "address": "宝山路748号",
        "name": "鑫成大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436761,
            31.240095
        ],
        "address": "长寿路468号",
        "name": "中环商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.499025,
            31.211901
        ],
        "address": "陆家浜路413弄",
        "name": "金南新苑（群英荟）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.522256,
            31.21595
        ],
        "address": "北张家浜路88弄",
        "name": "左岸88",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.449232,
            31.274818
        ],
        "address": "大宁路535弄",
        "name": "绿色丽园",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.378331,
            31.189056
        ],
        "address": "虹中路786弄3-6号",
        "name": "奥森公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.611428,
            31.255671
        ],
        "address": "金湘路268号",
        "name": "中新传媒广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.590327,
            31.119795
        ],
        "address": "关岳路338弄1-49号",
        "name": "申雅苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.736829,
            31.068665
        ],
        "address": "拱海路78弄",
        "name": "民乐城惠康苑(西苑)",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.44266,
            31.342861
        ],
        "address": "呼兰路799号",
        "name": "智汇园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.458773,
            31.281544
        ],
        "address": "平型关路1083弄",
        "name": "慧芝湖花园一期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.326275,
            31.321367
        ],
        "address": "顺达路938号",
        "name": "上海南翔游戏产业园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.450882,
            31.247212
        ],
        "address": "恒丰路610号",
        "name": "金岸610",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.530206,
            31.027726
        ],
        "address": "东城二路1号",
        "name": "中国留学人才创新港",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.432257,
            31.230404
        ],
        "address": "康定路1268弄",
        "name": "静鼎安邦府邸",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.354636,
            31.401989
        ],
        "address": "罗芬路1288号",
        "name": "远洋美兰公寓",
        "count": 63,
        "style": 0
    },
    {
        "lnglat": [
            121.446933,
            31.298651
        ],
        "address": "江场西路160号",
        "name": "美邦大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.44295,
            31.067734
        ],
        "address": "虹梅南路4289号",
        "name": "绿亮科创园(虹梅南路)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.496832,
            31.276226
        ],
        "address": "大连西路100号",
        "name": "玉山大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.470679,
            31.201525
        ],
        "address": "斜土路780号",
        "name": "经宇商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.53956,
            31.046977
        ],
        "address": "江航路60弄",
        "name": "瑞和新苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.316418,
            31.14157
        ],
        "address": "沪亭北路199弄10号楼",
        "name": "宝龙公寓(九亭中心)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.186197,
            31.036791
        ],
        "address": "文涵路737弄1-37号",
        "name": "逸庭苑(上海)",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.535107,
            31.224889
        ],
        "address": "世纪大道1589号",
        "name": "长泰国际金融大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.440634,
            31.229221
        ],
        "address": "延平路135号",
        "name": "静安WE",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.525755,
            31.332901
        ],
        "address": "国伟路800号",
        "name": "新江湾城雍景苑",
        "count": 55,
        "style": 0
    },
    {
        "lnglat": [
            121.11238,
            31.14844
        ],
        "address": "公园路700号",
        "name": "东方商厦青浦店",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.407394,
            31.218075
        ],
        "address": "长宁路1600弄",
        "name": "沈南小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.411926,
            31.122055
        ],
        "address": "罗锦路",
        "name": "游悉谷",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.510709,
            31.226751
        ],
        "address": "浦明路233弄",
        "name": "江临天下",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.521924,
            31.082495
        ],
        "address": "三鲁公路3398号",
        "name": "上海国茸浦江科创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.579237,
            30.921179
        ],
        "address": "城乡路188号",
        "name": "亿星大厦(上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.410009,
            31.314624
        ],
        "address": "沪太路2899弄",
        "name": "绿地科技中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.332184,
            31.229106
        ],
        "address": "北华路18号",
        "name": "虹桥乐贤居二期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.43089,
            31.217603
        ],
        "address": "江苏路470号",
        "name": "香樟公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.405889,
            31.160577
        ],
        "address": "桂平路333号",
        "name": "桂林聚科商务园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.247212,
            31.397975
        ],
        "address": "柳湖路299弄",
        "name": "御江金都2期",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.403948,
            31.207063
        ],
        "address": "紫云西路89弄",
        "name": "虹桥紫云苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.533453,
            31.223753
        ],
        "address": "世纪大道1568号",
        "name": "中建大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.467629,
            31.204537
        ],
        "address": "瑞金南路1号",
        "name": "海兴广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.406321,
            31.206896
        ],
        "address": "遵义路107号",
        "name": "安泰大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.491407,
            31.267561
        ],
        "address": "四达路58弄",
        "name": "世博花园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.42935,
            31.23452
        ],
        "address": "武宁路8弄1号",
        "name": "大众河滨大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.225786,
            31.376306
        ],
        "address": "胜辛路3285号",
        "name": "运通大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.429959,
            31.22843
        ],
        "address": "万航渡路849号",
        "name": "海森国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436001,
            31.175786
        ],
        "address": "漕溪路135号",
        "name": "上海金浦大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.422377,
            31.204226
        ],
        "address": "新华路543号",
        "name": "上海新华大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.573784,
            31.236742
        ],
        "address": "碧云路199弄",
        "name": "金桥爱建园",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.411287,
            31.230679
        ],
        "address": "宁夏路777号",
        "name": "坤田社区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.523173,
            31.149547
        ],
        "address": "尚博路650弄",
        "name": "金橘新苑南区",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.43438,
            31.239375
        ],
        "address": "胶州路1077弄",
        "name": "宝华雅苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.610496,
            31.257298
        ],
        "address": "金港路199弄",
        "name": "禹洲蓝爵",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.498866,
            31.271043
        ],
        "address": "四平路758弄",
        "name": "金轩大邸",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.241955,
            31.363872
        ],
        "address": "福海路777号",
        "name": "嘉福汇商务广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.396065,
            31.213609
        ],
        "address": "天山支路201号",
        "name": "长宁科技大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.355286,
            31.218004
        ],
        "address": "天山西路789号",
        "name": "中山国际广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.441851,
            31.281416
        ],
        "address": "万荣路700号",
        "name": "大宁中心广场A3",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.422552,
            31.329999
        ],
        "address": "大康路891弄",
        "name": "共康雅苑",
        "count": 195,
        "style": 0
    },
    {
        "lnglat": [
            121.490991,
            31.149281
        ],
        "address": "长清路1200弄",
        "name": "森宏购物广场商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.292158,
            30.815492
        ],
        "address": "黄家撅路92号",
        "name": "海文商务楼黄家厥路",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.402541,
            31.332844
        ],
        "address": "涵青路100弄",
        "name": "经纬城市绿洲学府阳光家园",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.559399,
            31.259106
        ],
        "address": "浦东大道2511弄19号",
        "name": "柚米国际公寓(浦东大道店)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.408598,
            31.210835
        ],
        "address": "天山路1718号",
        "name": "上海时尚园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.418803,
            31.075398
        ],
        "address": "颛兴东路1280弄14号",
        "name": "南滨江科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.469035,
            31.204653
        ],
        "address": "打浦路38弄",
        "name": "海华花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.474054,
            31.209526
        ],
        "address": "徐家汇路388号",
        "name": "瑞金新苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.49978,
            31.182409
        ],
        "address": "云台路80、86、92、98号",
        "name": "云台小区",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.451706,
            31.247674
        ],
        "address": "恒丰路638号",
        "name": "苏河1号",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.433507,
            31.344333
        ],
        "address": "蕰川路6号",
        "name": "智慧湾创新公社",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.534209,
            31.363162
        ],
        "address": "凌创路62号",
        "name": "高盛家园",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.497525,
            31.165076
        ],
        "address": "上南路2985号",
        "name": "海宏大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.268242,
            31.195866
        ],
        "address": "华徐公路628号",
        "name": "虹桥奇点科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.478208,
            31.268774
        ],
        "address": "西江湾路230号",
        "name": "驰民大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.500178,
            30.919721
        ],
        "address": "南奉公路6899弄",
        "name": "金昊雅苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.571372,
            30.853602
        ],
        "address": "海兴路1881弄",
        "name": "绿地香溢",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.425702,
            31.211809
        ],
        "address": "昭化路118号",
        "name": "臻悦商苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.447109,
            31.234671
        ],
        "address": "西康路556号",
        "name": "联谊西康大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.595144,
            31.326049
        ],
        "address": "浦东新区庭安路825弄",
        "name": "高行绿洲五期",
        "count": 85,
        "style": 0
    },
    {
        "lnglat": [
            121.404991,
            31.162518
        ],
        "address": "漕宝路650号",
        "name": "知汇大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.549015,
            31.224674
        ],
        "address": "民生路1286号",
        "name": "上海汇商大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.271898,
            31.191755
        ],
        "address": "双联路88号",
        "name": "三银基金产业园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.348561,
            31.258963
        ],
        "address": "曹安公路2038号",
        "name": "华拓大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.28104,
            31.050706
        ],
        "address": "新格路388号",
        "name": "屺盛科研中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.487996,
            31.214931
        ],
        "address": "黄家阙路99号",
        "name": "惠德公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.469237,
            31.28608
        ],
        "address": "凉城路357弄",
        "name": "中虹花园(丽都苑)",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.417829,
            31.190104
        ],
        "address": "古井路165号",
        "name": "锦馨公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.487065,
            31.301982
        ],
        "address": "逸仙路661号",
        "name": "新海商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.416189,
            31.243069
        ],
        "address": "武宁路423号",
        "name": "五零智慧产业科技园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.56734,
            30.984166
        ],
        "address": "泰青公路119弄128支弄1-16号",
        "name": "申亚翠庭",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.361124,
            31.129959
        ],
        "address": "顾戴路2337号",
        "name": "维璟中心A座",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.482388,
            31.201105
        ],
        "address": "局门路550号",
        "name": "8号桥瞿溪园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.297387,
            31.196208
        ],
        "address": "龙联路59弄",
        "name": "城投玉兰清苑二期",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.307136,
            31.052435
        ],
        "address": "新镇街99弄",
        "name": "九城家天下商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.471719,
            31.310093
        ],
        "address": "凉城路2289号",
        "name": "泽元文化广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.282735,
            31.149858
        ],
        "address": "九泾路701号",
        "name": "新雅创业园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.623337,
            31.242366
        ],
        "address": "锦绣东路2777弄",
        "name": "锦绣申江（金桥华虹创新园）",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.447756,
            31.141162
        ],
        "address": "上中路479号",
        "name": "上中路483弄（479弄）商办楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.55902,
            31.156062
        ],
        "address": "康杉路108弄3号",
        "name": "沃众创业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.475535,
            31.196278
        ],
        "address": "中山南一路904号",
        "name": "中南公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.287278,
            31.333018
        ],
        "address": "宝安公路3136号",
        "name": "清水湾上海",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.499711,
            31.379464
        ],
        "address": "化成路366弄-8",
        "name": "三水国际广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.409567,
            31.353621
        ],
        "address": "水产西路999弄1-57号",
        "name": "自然居家园",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.415801,
            31.099402
        ],
        "address": "银都路2188弄",
        "name": "中海寰宇名邸",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.418803,
            31.075398
        ],
        "address": "颛兴东路1280弄14号",
        "name": "南滨江科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.543288,
            31.03959
        ],
        "address": "闵驰一路197弄",
        "name": "汇秀景苑三街坊",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.158439,
            31.080654
        ],
        "address": "龙泉山路198弄",
        "name": "秋乐苑",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.364536,
            31.176022
        ],
        "address": "青衫路341号",
        "name": "青衫商务园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.4195,
            31.267579
        ],
        "address": "新沪路58弄",
        "name": "水韵华庭西苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.745577,
            31.071301
        ],
        "address": "拱海路459",
        "name": "兰丽苑西苑",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.391183,
            31.107598
        ],
        "address": "名都路20弄",
        "name": "名都新城三期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.496329,
            31.250094
        ],
        "address": "东长治路399号",
        "name": "双狮汇",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.495029,
            31.284226
        ],
        "address": "赤峰路301-303号",
        "name": "峰茂大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.415115,
            31.281494
        ],
        "address": "行知路381弄",
        "name": "远景佳苑二期",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.216002,
            31.417078
        ],
        "address": "金兰路333号",
        "name": "全通上海金融谷",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.518581,
            31.3032
        ],
        "address": "政益路8号",
        "name": "五角丰达商务广场(五角丰达大厦)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.424988,
            31.183057
        ],
        "address": "中山西路1878号",
        "name": "凯托大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.411504,
            31.139805
        ],
        "address": "沪闵路8390弄",
        "name": "迎春园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.490634,
            31.262315
        ],
        "address": "四平路188号",
        "name": "上海商贸大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.510561,
            31.080125
        ],
        "address": "浦星公路1919弄",
        "name": "绿地峰尚汇",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.436264,
            31.237379
        ],
        "address": "胶州路959弄1号",
        "name": "长久大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.229646,
            31.186975
        ],
        "address": "凤强塘路1120弄",
        "name": "春江三月二期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.429459,
            31.147378
        ],
        "address": "石龙路999弄",
        "name": "汇京佳丽园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.40024,
            31.05514
        ],
        "address": "瓶安路1600号",
        "name": "鑫都城宝铭苑",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.459187,
            31.209556
        ],
        "address": "永嘉路158号",
        "name": "嘉嘉大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.471495,
            31.202463
        ],
        "address": "斜土路791号",
        "name": "三毛集团办公楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.532983,
            31.21625
        ],
        "address": "峨山路91弄48号",
        "name": "开伦鑫座",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.492163,
            30.902236
        ],
        "address": "上海市奉贤区望园南路1121号",
        "name": "上海泽天产业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.382368,
            31.181848
        ],
        "address": "虹中路335弄32号",
        "name": "虹桥集富大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.531972,
            31.224374
        ],
        "address": "福山路455号",
        "name": "全华信息大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.507322,
            31.241745
        ],
        "address": "银城中路8号",
        "name": "中融碧玉蓝天",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.425458,
            31.193736
        ],
        "address": "番愚路1099弄",
        "name": "东方时空公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.616102,
            31.252474
        ],
        "address": "宁桥路615号",
        "name": "由度工场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.484703,
            31.252772
        ],
        "address": "四川北路1350号",
        "name": "利通广场",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.40276,
            31.048312
        ],
        "address": "瓶安路1258号",
        "name": "中臻科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.552163,
            31.210854
        ],
        "address": "花木路838号",
        "name": "影城小筑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.418382,
            31.108625
        ],
        "address": "梅富路228号",
        "name": "春申创意园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.424197,
            31.205607
        ],
        "address": "法华镇路555号",
        "name": "法华门大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.293981,
            31.001429
        ],
        "address": "香车路388号",
        "name": "宝奇电子商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.364539,
            31.180123
        ],
        "address": "黄桦路247号",
        "name": "俊领国际_黄桦路247号",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.587459,
            31.125428
        ],
        "address": "川周公路4011弄",
        "name": "汇丽苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.436553,
            31.218097
        ],
        "address": "镇宁路111号",
        "name": "万宝国际广场（王子晶品）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.552681,
            31.244804
        ],
        "address": "博山路200弄",
        "name": "名门河滨花园",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.421507,
            31.333631
        ],
        "address": "大康路1079弄",
        "name": "中环国际公寓二期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.264796,
            31.182894
        ],
        "address": "明珠路838号",
        "name": "恒润大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.479656,
            31.225934
        ],
        "address": "淮海中路2--8号",
        "name": "兰生大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.502598,
            31.168886
        ],
        "address": "德州路60弄",
        "name": "中星云庭（上海）",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.426794,
            31.271533
        ],
        "address": "灵石路1188号",
        "name": "华仁商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.440507,
            31.29318
        ],
        "address": "万荣路1188号",
        "name": "龙软万荣基地",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.442356,
            31.241137
        ],
        "address": "陕西北路1283弄9号",
        "name": "玉城大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.476424,
            31.238142
        ],
        "address": "广西北路528号",
        "name": "地王中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.477915,
            31.27315
        ],
        "address": "中山北一路184号",
        "name": "上海怡景大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.491032,
            31.378494
        ],
        "address": "同济支路157号",
        "name": "智慧柒立方",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.331722,
            31.455997
        ],
        "address": "萧云路1318弄",
        "name": "霄云湾公寓",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.375254,
            31.217064
        ],
        "address": "蒲松北路10号",
        "name": "申亚时代广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.580087,
            31.257725
        ],
        "address": "金桥路939号",
        "name": "宏南投资大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.528515,
            31.301608
        ],
        "address": "安波路533弄1-3号，安波路569号",
        "name": "海上硕和国际办公楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.212666,
            31.380381
        ],
        "address": "慈竹路836弄",
        "name": "同盛园",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.448139,
            31.199239
        ],
        "address": "肇嘉浜路688弄",
        "name": "徐家汇景福苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.39672,
            31.332758
        ],
        "address": "涵青路398弄",
        "name": "经纬城市绿洲学府涵青家园",
        "count": 166,
        "style": 0
    },
    {
        "lnglat": [
            121.359072,
            31.222344
        ],
        "address": "金钟路658弄",
        "name": "东华大学国家大学科技园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.410336,
            31.242903
        ],
        "address": "曹杨路930号",
        "name": "汇尚商务楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.475664,
            31.268395
        ],
        "address": "恒业路129弄",
        "name": "德华苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.619735,
            31.096242
        ],
        "address": "青黛路508号",
        "name": "新菲尔生物科技园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.458,
            31.24213
        ],
        "address": "汉中路158号",
        "name": "汉中广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.43078,
            31.330174
        ],
        "address": "长临路1318弄",
        "name": "九英里城",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.40667,
            31.203854
        ],
        "address": "遵义南路8号",
        "name": "锦明大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.42903,
            31.145257
        ],
        "address": "老沪闵路668号",
        "name": "幽澜苑办公楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.499528,
            31.220501
        ],
        "address": "复兴东路248号",
        "name": "中复大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.669749,
            31.273241
        ],
        "address": "川沙路688号",
        "name": "浦江智汇创业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.472898,
            31.207036
        ],
        "address": "鲁班路88号",
        "name": "大同花园三期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.554808,
            30.9839
        ],
        "address": "航南公路1981弄8号",
        "name": "申亚花满庭",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.459348,
            31.266544
        ],
        "address": "共和新路1453弄",
        "name": "新柳公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.340548,
            31.383253
        ],
        "address": "上海市宝山区天家路99弄",
        "name": "美罗家园宝欣苑八村",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.447638,
            31.224436
        ],
        "address": "常德路175",
        "name": "轻工机械大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.432234,
            31.204864
        ],
        "address": "华山路1520弄55号",
        "name": "正力公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.425103,
            31.197029
        ],
        "address": "淮海西路343号",
        "name": "淮海鑫城苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.426909,
            31.185042
        ],
        "address": "宜山路439号",
        "name": "七建大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.501171,
            31.260327
        ],
        "address": "公平路768弄",
        "name": "东方都市景苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.518231,
            31.3022
        ],
        "address": "政旦东路8弄",
        "name": "财富商业广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.44455,
            30.925415
        ],
        "address": "航南公路6161号",
        "name": "奉贤农机综合大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.414145,
            31.217953
        ],
        "address": "长宁路1200号",
        "name": "贝多芬广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.466867,
            31.23407
        ],
        "address": "成都北路600号",
        "name": "中华保险华盛大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.507351,
            31.168699
        ],
        "address": "云台路529弄",
        "name": "恒大广场国际公寓_爵仕悦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.578287,
            31.348201
        ],
        "address": "花山路796弄",
        "name": "花山锦地苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.431398,
            31.20395
        ],
        "address": "曲阳路990弄",
        "name": "运光大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.91031,
            30.865002
        ],
        "address": "新城镇海基六路218弄",
        "name": "海立方科技园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.47379,
            31.268759
        ],
        "address": "新二路999弄",
        "name": "四季绿城",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.312787,
            31.191794
        ],
        "address": "申滨南路1126号",
        "name": "龙湖虹桥天街",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.051498,
            31.001588
        ],
        "address": "章练塘路880弄",
        "name": "旭辉朗悦庭",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.282267,
            31.37631
        ],
        "address": "叶城东路350弄",
        "name": "唐家苑北区",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.305717,
            31.149733
        ],
        "address": "涞坊路1000号",
        "name": "新虹桥企业天地",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.387228,
            31.355467
        ],
        "address": "沙浦路311弄",
        "name": "新天地荻泾花园",
        "count": 75,
        "style": 0
    },
    {
        "lnglat": [
            121.518141,
            31.292564
        ],
        "address": "黄兴路1999弄",
        "name": "皇朝新城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.020779,
            30.892325
        ],
        "address": "曹穗北路135弄",
        "name": "忆华里",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.479715,
            31.295916
        ],
        "address": "新市南路780弄",
        "name": "望隆苑（望华苑）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.544852,
            31.292483
        ],
        "address": "延吉东路140弄",
        "name": "长华绿苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.431924,
            31.186956
        ],
        "address": "文定路200号",
        "name": "盛源恒华大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.408852,
            31.072255
        ],
        "address": "颛兴东路1550弄",
        "name": "剑桥馨苑",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.564335,
            30.862769
        ],
        "address": "民乐路28弄",
        "name": "世茂爱马尚郡",
        "count": 55,
        "style": 0
    },
    {
        "lnglat": [
            121.572141,
            31.24893
        ],
        "address": "云山路1050弄",
        "name": "陆家嘴新景园(1050弄)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.582951,
            31.349864
        ],
        "address": "学后街28号",
        "name": "银桥商务大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.418663,
            31.275793
        ],
        "address": "大华三路81号",
        "name": "美隆大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.341969,
            31.309687
        ],
        "address": "山连路799号",
        "name": "新天地创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432365,
            31.195764
        ],
        "address": "乐山路33号",
        "name": "交大慧谷创业园三部",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.449351,
            31.051265
        ],
        "address": "虹梅南路4999弄",
        "name": "燎申智城",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.50655,
            31.241245
        ],
        "address": "银城中路68号5楼",
        "name": "时代金融中心",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.482579,
            31.291016
        ],
        "address": "汶水东路351号 ",
        "name": "1876老站创意园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.398761,
            31.206355
        ],
        "address": "仙霞路333号",
        "name": "东方维京大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.433611,
            31.236872
        ],
        "address": "长寿路633弄3号",
        "name": "长寿大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.532003,
            31.219022
        ],
        "address": "峨山路91弄200号",
        "name": "新鹏大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.31106,
            31.203422
        ],
        "address": "兴虹路368弄",
        "name": "万科润园时一区三期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.452937,
            31.156816
        ],
        "address": "黄石路80弄",
        "name": "龙龙家园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.418663,
            31.275793
        ],
        "address": "大华三路81号",
        "name": "美隆大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.452044,
            31.288172
        ],
        "address": "共和新路2993号",
        "name": "中环企业广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.584624,
            31.306133
        ],
        "address": "繁锦路1288弄",
        "name": "新城碧翠园",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.448087,
            31.233236
        ],
        "address": "西康路464号",
        "name": "康定大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.537378,
            31.054323
        ],
        "address": "浦连路439弄",
        "name": "浦江丽都一期",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.473029,
            31.270836
        ],
        "address": "花园路128号",
        "name": "虹口德必运动Loft",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.543406,
            31.275777
        ],
        "address": "隆昌路588号",
        "name": "复旦软件园（杨浦）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.595207,
            31.252786
        ],
        "address": "平度路485弄488弄",
        "name": "金桥一景",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.410522,
            31.232575
        ],
        "address": "杏山路8号",
        "name": "银都名庭",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.406813,
            31.074728
        ],
        "address": "沪光路555弄",
        "name": "招商雍华府（招商雍华苑）",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.476034,
            31.283727
        ],
        "address": "水电路688号",
        "name": "万泰大厦",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.48471,
            31.25146
        ],
        "address": "四川北路1318号",
        "name": "上海盛邦国际大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.635044,
            31.22422
        ],
        "address": "龙东大道3000号",
        "name": "张江集电港",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.45074,
            31.22744
        ],
        "address": "南阳路183弄1-2号",
        "name": "南阳大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.421924,
            31.194924
        ],
        "address": "凯旋路1669号",
        "name": "天星城",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.422318,
            31.125218
        ],
        "address": "莲花南路588弄",
        "name": "未名园",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.374062,
            31.267253
        ],
        "address": "祁连山南路2891弄",
        "name": "未来岛科技园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.411926,
            31.122055
        ],
        "address": "罗锦路",
        "name": "游悉谷",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.438667,
            31.191903
        ],
        "address": "漕溪北路28-38号",
        "name": "实业公寓(上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.481806,
            31.205093
        ],
        "address": "局门路295弄",
        "name": "江南世纪新苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.437351,
            31.246141
        ],
        "address": "陕西北路1789弄",
        "name": "都华名苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.459554,
            31.200414
        ],
        "address": "医学院路15号",
        "name": "嘉馨公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.313953,
            31.283326
        ],
        "address": "银翔路1227弄",
        "name": "安居时代广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.85373,
            30.98018
        ],
        "address": "万松路88号",
        "name": "金盾产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.537595,
            31.262282
        ],
        "address": "宁国路111号",
        "name": "绿地汇方广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.508673,
            31.251807
        ],
        "address": "东大名路1096号",
        "name": "长江大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.62884,
            31.20564
        ],
        "address": "盛夏路666号",
        "name": "普洛斯盛银大厦(上投盛银大厦)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.133846,
            31.146119
        ],
        "address": "华青南路481-485号",
        "name": "芊岱大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.511783,
            31.224888
        ],
        "address": "张杨路188号",
        "name": "汤臣中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.462743,
            31.249003
        ],
        "address": "共和新路340号",
        "name": "宝丰大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.533002,
            31.240217
        ],
        "address": "乳山路505弄",
        "name": "上海滩花园洋房_南北区",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.476277,
            31.197871
        ],
        "address": "鲁班路600号",
        "name": "江南造船大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.386817,
            31.025653
        ],
        "address": "银春路2200弄",
        "name": "万科马桥景城乐康苑",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.530674,
            31.224768
        ],
        "address": "福山路388号",
        "name": "越秀大厦",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.551156,
            31.249628
        ],
        "address": "浦东大道2220号、2160号",
        "name": "上安大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.442367,
            31.168409
        ],
        "address": "龙漕路200弄19号",
        "name": "龙漕德必易园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.446918,
            31.168208
        ],
        "address": "龙华路3208弄",
        "name": "龙兆苑",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.473014,
            31.237098
        ],
        "address": "北京西路1号",
        "name": "新金桥广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.216002,
            31.417078
        ],
        "address": "金兰路333号",
        "name": "全通上海金融谷",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.447033,
            31.325401
        ],
        "address": "一二八纪念路933弄",
        "name": "好天缘家苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.59769,
            31.332939
        ],
        "address": "泰谷路18号",
        "name": "鲁能大厦(外高桥写字楼)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.507161,
            31.263593
        ],
        "address": "大连路839号",
        "name": "合生财富广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.403317,
            31.195192
        ],
        "address": "黄金城道500弄",
        "name": "古北瑞仕花园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.516199,
            31.069369
        ],
        "address": "恒南路399号",
        "name": "茸锦浦江科技园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.425734,
            31.18196
        ],
        "address": "宜山路508号",
        "name": "景鸿大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.420155,
            31.191452
        ],
        "address": "中山西路1281号",
        "name": "海螺大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.447865,
            31.191442
        ],
        "address": "宛平南路381号",
        "name": "沪港国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.430416,
            31.187458
        ],
        "address": "宜山路333号",
        "name": "汇鑫国际大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.443806,
            31.235986
        ],
        "address": "余姚路19号余姚路27号",
        "name": "永昌大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.483762,
            31.255065
        ],
        "address": "四川北路1500号",
        "name": "叶大昌商厦(上海投资组合中心大厦)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.531979,
            31.241289
        ],
        "address": "浦东大道988号",
        "name": "东晶国际公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.416665,
            31.21774
        ],
        "address": "长宁路1055号",
        "name": "汇都大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.363639,
            31.252068
        ],
        "address": "新郁路846弄56号",
        "name": "兆地商务金座_B座",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.561418,
            31.12161
        ],
        "address": "梓康路580弄",
        "name": "双秀西园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.497455,
            31.218072
        ],
        "address": "中华路429弄1-5号",
        "name": "绿地名人坊",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.746363,
            30.877845
        ],
        "address": "正旭路733弄",
        "name": "凤凰城天悦",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.532306,
            31.260974
        ],
        "address": "平凉路1055号",
        "name": "上海创意联盟产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441969,
            31.246525
        ],
        "address": "江宁路1306弄17号",
        "name": "富丽花苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.484533,
            31.215405
        ],
        "address": "西藏南路758号",
        "name": "桥苑公寓(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.606509,
            31.315874
        ],
        "address": "台中南路2号",
        "name": "新贸楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.445915,
            31.2986
        ],
        "address": "江场西路180号",
        "name": "和典创意园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.426316,
            31.224688
        ],
        "address": "江苏北路89号",
        "name": "新亚药业大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.656346,
            31.0291
        ],
        "address": "众安路879弄",
        "name": "上海意得商城",
        "count": 140,
        "style": 0
    },
    {
        "lnglat": [
            121.291898,
            31.296938
        ],
        "address": "翔江公路518号",
        "name": "寅尚工业产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.463356,
            31.230316
        ],
        "address": "吴江路31号",
        "name": "东方有线大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.440212,
            31.248312
        ],
        "address": "江宁路1600号",
        "name": "浅水湾1600",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.441903,
            31.193697
        ],
        "address": "天钥桥路69弄",
        "name": "凯歌公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.361468,
            31.06443
        ],
        "address": "春常路66号",
        "name": "君茂科创",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.435766,
            31.240432
        ],
        "address": "长寿路518弄",
        "name": "纺鑫苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.444808,
            31.239794
        ],
        "address": "陕西北路1155弄",
        "name": "静安晶华园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.465117,
            31.199803
        ],
        "address": "斜土路1175号",
        "name": "景泰大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.395227,
            31.103612
        ],
        "address": "春申路3355弄",
        "name": "春申复地城一期",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.590737,
            31.046052
        ],
        "address": "沪南公路5268号",
        "name": "宏澜智慧谷",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.411174,
            31.100066
        ],
        "address": "莲花南路1388号8号楼",
        "name": "北建华清商业广场商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.460884,
            31.266159
        ],
        "address": "柳营路515弄",
        "name": "鑫安公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.519579,
            31.199959
        ],
        "address": "东方路1968弄",
        "name": "馥园(东方名筑）",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.515927,
            31.235577
        ],
        "address": "南泉北路201号",
        "name": "房地大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.514687,
            31.293677
        ],
        "address": "国定路101弄",
        "name": "兴平昌苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.321951,
            31.289555
        ],
        "address": "银翔路655号",
        "name": "蓝天创业广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.487405,
            31.269566
        ],
        "address": "欧阳路318弄",
        "name": "绿缘大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.407273,
            31.231157
        ],
        "address": "金沙江路65弄",
        "name": "金沙江小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.434336,
            31.255758
        ],
        "address": "石泉东路168弄",
        "name": "香溢花城",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.488205,
            31.251122
        ],
        "address": "吴淞路469号",
        "name": "森林湾大厦",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.622357,
            31.25984
        ],
        "address": "新金桥路1888号36号楼",
        "name": "凯龙金领大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.390131,
            31.170061
        ],
        "address": "莲花路1733号",
        "name": "华纳商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.396306,
            31.215204
        ],
        "address": "天山支路168弄",
        "name": "虹桥电子时代广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.409787,
            31.298495
        ],
        "address": "真大路560号",
        "name": "永久1940iHUB创意产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.472753,
            31.198148
        ],
        "address": "瞿溪路1168号",
        "name": "开源大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.488142,
            31.089704
        ],
        "address": "陈行公路3702号",
        "name": "前滩大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.397505,
            31.073109
        ],
        "address": "光华路18号",
        "name": "晶森商务大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.574944,
            31.117541
        ],
        "address": "上南路7992号",
        "name": "泰苑公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.492912,
            31.208653
        ],
        "address": "国货路370弄",
        "name": "惠国公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.447444,
            31.188243
        ],
        "address": "零陵路585号",
        "name": "爱邦大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.511283,
            31.304232
        ],
        "address": "大学路63弄",
        "name": "创智坊SOHO办公楼",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.426739,
            31.272643
        ],
        "address": "灵石路1177弄",
        "name": "远龙公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.401467,
            31.234012
        ],
        "address": "枣阳路297弄",
        "name": "金阳怡景苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.487245,
            31.342729
        ],
        "address": "淞发路901弄",
        "name": "祥腾生活广场之商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.518022,
            31.076351
        ],
        "address": "联航路1505弄",
        "name": "复地浦江商务中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.464893,
            31.264188
        ],
        "address": "陈家宅路56",
        "name": "上海古林都市工业大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.385118,
            31.106187
        ],
        "address": " 闵城路199弄",
        "name": "好世鹿鸣苑",
        "count": 67,
        "style": 0
    },
    {
        "lnglat": [
            121.478673,
            31.328222
        ],
        "address": "一二八纪念东路518弄",
        "name": "象屿郦庭",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.482623,
            31.235526
        ],
        "address": "汉口路400号",
        "name": "华盛大厦（上海）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.371719,
            31.017652
        ],
        "address": "银林路1002弄1~30号",
        "name": "马桥景城馨苑",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.43735,
            31.227144
        ],
        "address": "武定路1145弄",
        "name": "沪中新苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.516905,
            31.20757
        ],
        "address": "浦东南路2157、2159号",
        "name": "众城商厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.433507,
            31.344333
        ],
        "address": "蕰川路6号",
        "name": "智慧湾",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.478175,
            31.346262
        ],
        "address": "长江西路101号",
        "name": "上海节能环保园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.591082,
            31.34234
        ],
        "address": "富特西一路139号",
        "name": "中国石化物资大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.401802,
            31.07069
        ],
        "address": "老沪闵路3105号",
        "name": "东苑米蓝城",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.355958,
            31.121683
        ],
        "address": "友东路85号",
        "name": "友东路85号商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.483846,
            31.257618
        ],
        "address": "东宝兴路157号",
        "name": "精武大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.491091,
            31.253496
        ],
        "address": "九龙路575号",
        "name": "新亚小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.537595,
            31.262282
        ],
        "address": "宁国路111号",
        "name": "绿地汇方广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.37958,
            31.178467
        ],
        "address": "合川路3089号",
        "name": "富群商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.180909,
            31.285752
        ],
        "address": "安谐路99弄",
        "name": "新城尚上城",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.424503,
            31.226971
        ],
        "address": "江苏北路125号",
        "name": "华联创意广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.523477,
            31.18123
        ],
        "address": "北艾路1660弄1-26号",
        "name": "大华锦绣华城2_2街坊（1_华绣路）",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.1601,
            31.158461
        ],
        "address": "崧润路800弄",
        "name": "逸泰雅苑二期",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.460938,
            31.198864
        ],
        "address": "大木桥路158弄",
        "name": "金色港湾公寓",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.440398,
            31.245915
        ],
        "address": "澳门路477号",
        "name": "中华1912创意园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.367745,
            31.124956
        ],
        "address": "秀文路908号(莘庄商务区内)",
        "name": "中铁诺德国际中心",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.532415,
            31.231857
        ],
        "address": "张杨路1328号",
        "name": "明竹公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.438562,
            31.232867
        ],
        "address": "昌平路935号",
        "name": "昌平大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.40383,
            31.073603
        ],
        "address": "都市路2888弄",
        "name": "都市府邸",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.593134,
            31.347499
        ],
        "address": "富特北路33号",
        "name": "卓越金融大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.487177,
            31.207291
        ],
        "address": "西藏南路1332号",
        "name": "协作大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.484254,
            31.248357
        ],
        "address": "四川北路859号",
        "name": "上海中信广场",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.462146,
            31.227865
        ],
        "address": "石门一路211号",
        "name": "旺旺大厦(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.391816,
            31.179161
        ],
        "address": "吴中路889号",
        "name": "君怡公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.418219,
            31.237843
        ],
        "address": "曹杨路450号",
        "name": "绿地和创大厦",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.457743,
            31.191108
        ],
        "address": "枫林路380号",
        "name": "枫林国际中心一期",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.446008,
            31.198804
        ],
        "address": "吴兴路283号",
        "name": "申谊大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.667615,
            31.205827
        ],
        "address": "南曹路1117弄",
        "name": "唐镇中芯花园",
        "count": 70,
        "style": 0
    },
    {
        "lnglat": [
            121.50352,
            31.231466
        ],
        "address": "银城中路600弄",
        "name": "中粮海景壹号",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.392131,
            31.253454
        ],
        "address": "真北路2150号",
        "name": "中环光学科技园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.347285,
            31.281085
        ],
        "address": "白丽路185弄",
        "name": "联星丽景苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.291084,
            31.168778
        ],
        "address": "高泾路999弄",
        "name": "高景花园",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.416127,
            31.215371
        ],
        "address": "凯旋路369号",
        "name": "龙之梦雅仕大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.426202,
            31.218635
        ],
        "address": "愚园路1221弄1号",
        "name": "御华名苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.463215,
            31.255246
        ],
        "address": "共和新路708弄",
        "name": "天道俪晶大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.425844,
            31.182718
        ],
        "address": "中山西路2006号",
        "name": "百第宜山大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.253798,
            31.212515
        ],
        "address": "华徐公路3029弄5号",
        "name": "MeGa美格文创园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.521654,
            31.232785
        ],
        "address": "商城路889号",
        "name": "波特营园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.217049,
            31.0392
        ],
        "address": "新松江路1060号",
        "name": "恒杰商务大楼B座",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.414345,
            31.177845
        ],
        "address": "桂林路418号",
        "name": "中电科华鑫创享园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.347588,
            31.135899
        ],
        "address": "中谊路1215号",
        "name": "福克斯商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.483794,
            31.262689
        ],
        "address": "四川北路1941号",
        "name": "金海岸商厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.474709,
            31.201626
        ],
        "address": "鲁班路388弄",
        "name": "海悦花园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.503606,
            31.181092
        ],
        "address": "齐河路257弄",
        "name": "上南花苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.447415,
            31.367857
        ],
        "address": "水产路2289号",
        "name": "壹间宝山花园城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.457914,
            31.200029
        ],
        "address": "医学院路69弄",
        "name": "上海华业大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.605051,
            31.3133
        ],
        "address": "加枫路26号",
        "name": "科技楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.497368,
            31.353344
        ],
        "address": "长江路43号",
        "name": "闿和长江源",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.447215,
            31.236753
        ],
        "address": "昌平路418弄",
        "name": "贤居天下苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.445571,
            31.271821
        ],
        "address": "大宁路701号",
        "name": "歌林汇",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.589595,
            31.338982
        ],
        "address": "夏碧路79弄",
        "name": "瑞禾明苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.495648,
            31.170883
        ],
        "address": "成山路220号",
        "name": "上海城建大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.444151,
            31.237939
        ],
        "address": "西康路838号",
        "name": "康海大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.561527,
            31.151713
        ],
        "address": "康杉路359弄",
        "name": "颐盛云锦苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.42995,
            31.288182
        ],
        "address": "高平路598弄",
        "name": "阳城美景",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.442493,
            31.195156
        ],
        "address": "肇嘉浜路999弄",
        "name": "上海帝景苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.515069,
            31.208053
        ],
        "address": "浦东南路2162号",
        "name": "浦江2162",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.40064,
            31.201794
        ],
        "address": "延安西路2299号",
        "name": "上海世贸商城",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.520144,
            31.230316
        ],
        "address": "世纪大道1090号",
        "name": "斯米克大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.525858,
            31.24113
        ],
        "address": "浦东大道1200弄",
        "name": "巨洋大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.369142,
            31.092329
        ],
        "address": "沁春路717号",
        "name": "青春商务园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.606546,
            31.239455
        ],
        "address": "锦绣东路1999号",
        "name": "麦腾智慧天地",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.458835,
            31.201618
        ],
        "address": "肇家浜路393号",
        "name": "兴南花园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.485369,
            31.29166
        ],
        "address": "汶水东路181弄",
        "name": "三九大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.385389,
            31.189583
        ],
        "address": "虹梅路3325弄",
        "name": "金泉苑二期",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.431145,
            31.182253
        ],
        "address": "凯进路151号",
        "name": "中油大厦（中油企业大厦）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.513755,
            31.204908
        ],
        "address": "浦东南路2250号",
        "name": "滨江2250",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.393855,
            31.252183
        ],
        "address": "铜川路1422弄",
        "name": "绿洲公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.486577,
            31.321081
        ],
        "address": "高逸路29号",
        "name": "复客北翼创想中心",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.420155,
            31.191452
        ],
        "address": "中山西路1281号",
        "name": "海螺大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.33699,
            31.157265
        ],
        "address": "中春路8888弄",
        "name": "万科城市花园新区",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.865315,
            30.948029
        ],
        "address": "老芦公路857号895号",
        "name": "禹洲城市广场西区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.422604,
            31.02182
        ],
        "address": "剑川路953弄322",
        "name": "沪升e谷交大科创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.542612,
            31.244437
        ],
        "address": "巨野路22号",
        "name": "陆家嘴滨江公馆（申城公寓）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.282347,
            31.20874
        ],
        "address": "金丰路55号",
        "name": "林茵湖畔（东区）",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.481805,
            31.232589
        ],
        "address": "广东路500号",
        "name": "上海世界贸易大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.521586,
            31.272948
        ],
        "address": "长浜路330弄",
        "name": "江升公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.539334,
            31.233743
        ],
        "address": "张杨路1500弄",
        "name": "证大宽域公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.365331,
            31.176769
        ],
        "address": "青杉路200弄1号",
        "name": "俊领国际（青杉路200弄1号）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.427544,
            31.218258
        ],
        "address": "愚园路1155弄",
        "name": "愚园公馆",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.343007,
            31.29126
        ],
        "address": "真南路3435弄",
        "name": "安达家园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.446246,
            31.189276
        ],
        "address": "斜土路2526号",
        "name": "新亚徐汇公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.424337,
            31.230819
        ],
        "address": "光复西路1003号",
        "name": "开伦江南场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.519755,
            31.321424
        ],
        "address": "民京路658弄",
        "name": "民庆家园二期",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.445571,
            31.271821
        ],
        "address": "大宁路701号",
        "name": "歌林汇",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.628652,
            31.209524
        ],
        "address": "盛夏路500弄",
        "name": "张江光大园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.119407,
            31.149547
        ],
        "address": "公园路348号",
        "name": "青浦科技园商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.497938,
            31.211126
        ],
        "address": "陆家浜路456号",
        "name": "赛元大酒店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.366355,
            31.000523
        ],
        "address": "天宁路51号",
        "name": "福缘集团园区",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.356699,
            31.21787
        ],
        "address": "天山西路567号",
        "name": "神州智慧天地",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.454059,
            31.24221
        ],
        "address": "恒丰路318弄",
        "name": "苏河融景",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.440284,
            31.2824
        ],
        "address": "灵石路712号",
        "name": "大宁人才公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.609123,
            31.279721
        ],
        "address": "巨峰路1058弄",
        "name": "新紫茂国际城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.599238,
            31.252611
        ],
        "address": "金新路58号",
        "name": "银桥大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.417865,
            31.176881
        ],
        "address": "宜山路700号",
        "name": "上海普天信息产业园",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.505476,
            31.235345
        ],
        "address": "世纪大道88号",
        "name": "金茂大厦",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.468392,
            31.240093
        ],
        "address": "光复路195号",
        "name": "创意仓库",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.607097,
            31.167222
        ],
        "address": "盛荣路388弄",
        "name": "百佳通",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.42637,
            31.20208
        ],
        "address": "新华路329弄47-71号",
        "name": "新华名门",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.487973,
            31.273077
        ],
        "address": "欧阳路501弄50号",
        "name": "裕群公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.489863,
            31.203065
        ],
        "address": "西藏南路1501弄",
        "name": "弘辉名苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.513208,
            31.308595
        ],
        "address": "国京路50弄",
        "name": "平安佳苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.487934,
            30.954852
        ],
        "address": "庆园路189弄",
        "name": "桐南美麓",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.498938,
            31.290429
        ],
        "address": "辉河路100号",
        "name": "复旦科技园_创业基地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.514375,
            31.087843
        ],
        "address": "江凯路199号1号楼",
        "name": "蕾特商务中心一期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.536182,
            31.045956
        ],
        "address": "浦涛路505弄",
        "name": "虹浦新城南区",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.312108,
            31.121456
        ],
        "address": "恒江路8号",
        "name": "elife生活社区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.182144,
            31.192216
        ],
        "address": "重固镇大街518号",
        "name": "逸皓华庭",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.524667,
            31.293935
        ],
        "address": "国顺东路800号",
        "name": "五角场800号艺术空间",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.364756,
            31.145377
        ],
        "address": "新镇路603弄",
        "name": "东方花园二期",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.383998,
            31.175912
        ],
        "address": "吴中路1189号",
        "name": "M8",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.260427,
            31.364461
        ],
        "address": "回城南路930弄",
        "name": "香溢都荟",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.46241,
            31.297167
        ],
        "address": "虹口江场路1067弄、江场路1099弄",
        "name": "海虹欣苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.468137,
            30.932722
        ],
        "address": "航南公路5088号",
        "name": "绿庭国际大厦",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.463249,
            31.256255
        ],
        "address": "共和新路736弄1号",
        "name": "灵广花园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.547126,
            31.166407
        ],
        "address": "锦绣路3891号",
        "name": "中环锦绣商务",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.419274,
            31.187643
        ],
        "address": "吴中路39号",
        "name": "新概念大厦",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.496661,
            31.281557
        ],
        "address": "赤峰路95、97号",
        "name": "赤峰冶金公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.24227,
            31.055706
        ],
        "address": "广富林路799弄22-26号",
        "name": "中展瑞景",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.334767,
            31.238744
        ],
        "address": "高潮路215号",
        "name": "北虹桥松日中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.44373,
            31.235167
        ],
        "address": "昌平路556号",
        "name": "金昌大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.522112,
            31.186137
        ],
        "address": "齐恒路177弄",
        "name": "凯德嘉博名邸",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.240262,
            31.181109
        ],
        "address": "乐高路288弄之1-24号",
        "name": "徐泾北城馨浦苑北区(288)",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.466783,
            31.29973
        ],
        "address": "桃林路1141弄",
        "name": "新天家园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.315412,
            31.066628
        ],
        "address": "新镇街1058弄",
        "name": "东渡海派青城",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.422604,
            31.02182
        ],
        "address": "剑川路953弄322",
        "name": "沪升e谷交大科创园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.553822,
            31.21103
        ],
        "address": "花木路916弄",
        "name": "四季全景台",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.598197,
            31.208729
        ],
        "address": "郭守敬路498号",
        "name": "浦东软件园郭守敬园及祖冲之园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.535874,
            31.062823
        ],
        "address": "江玮路450弄",
        "name": "闵浦新苑五村",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.269744,
            31.092015
        ],
        "address": "洞泾镇同乐路699号",
        "name": "智象中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.410677,
            31.229399
        ],
        "address": "中山西路933号",
        "name": "虹桥银城",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.428249,
            31.281252
        ],
        "address": "晋城路663弄",
        "name": "阳城世家",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.547408,
            31.231225
        ],
        "address": "灵山路717弄",
        "name": "中星景园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.435145,
            31.3513
        ],
        "address": "蕴川路516号",
        "name": "泰德科技园（二期）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.376064,
            31.178084
        ],
        "address": "金汇路460弄",
        "name": "韵动时代（金汇丽舍）",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.447886,
            31.190932
        ],
        "address": "宛平南路401号",
        "name": "辉煌大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.512735,
            31.240435
        ],
        "address": "昌邑路55弄",
        "name": "浦江茗园(艺术传家堡)",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.556013,
            31.208099
        ],
        "address": "白杨路199弄",
        "name": "大唐盛世花园一期",
        "count": 106,
        "style": 0
    },
    {
        "lnglat": [
            121.437531,
            31.230307
        ],
        "address": "康定路1033号5A",
        "name": "同济佳苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.589894,
            31.344362
        ],
        "address": "外高桥保税区奥纳路18号",
        "name": "奥吉大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.327768,
            31.283078
        ],
        "address": "槎溪路222弄",
        "name": "万城银座",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.454988,
            31.32095
        ],
        "address": "岭南路1115号",
        "name": "中铁商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.540956,
            31.317995
        ],
        "address": "市光二村103-106号",
        "name": "新钢大楼(市光二村)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.444811,
            31.221786
        ],
        "address": "南京西路1717号",
        "name": "会德丰国际广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.459783,
            31.204538
        ],
        "address": "嘉善路508号",
        "name": "尚街LOFT",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.431896,
            31.042551
        ],
        "address": "园区北路19号",
        "name": "上海雍臻公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.55317,
            31.232625
        ],
        "address": "灵山路898号",
        "name": "融汇898创意园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.443847,
            31.266486
        ],
        "address": "沪太路799号",
        "name": "上海新慧谷科技产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.486193,
            31.301153
        ],
        "address": "逸仙路432弄",
        "name": "久久公寓",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.423764,
            31.162979
        ],
        "address": "冠生园路403号",
        "name": "康沁苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.425833,
            31.243014
        ],
        "address": "东新支路90弄8号",
        "name": "东新苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.613026,
            31.30642
        ],
        "address": "富特南路301号",
        "name": "松港U库",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.441191,
            30.987401
        ],
        "address": "扶兰路9弄",
        "name": "南渡新苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.16204,
            31.290107
        ],
        "address": "曹安公路5588号、5616号",
        "name": "安亭财富广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.456701,
            31.201321
        ],
        "address": "肇嘉浜路539号",
        "name": "平华大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.444354,
            31.236625
        ],
        "address": "西康路757号",
        "name": "侨侨大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.40276,
            31.048312
        ],
        "address": "瓶安路1258号",
        "name": "中臻科创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.38715,
            31.215222
        ],
        "address": "天山路338号",
        "name": "衡辰酒店式公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.36136,
            31.107106
        ],
        "address": "莘福路388号",
        "name": "莘东置业大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.504219,
            31.286786
        ],
        "address": "中山北二路1121号",
        "name": "同济科技大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.263419,
            31.347647
        ],
        "address": "天祝路377弄",
        "name": "华都商务广场",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.771385,
            31.053285
        ],
        "address": "拱极路2626弄",
        "name": "新凤凰城",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.482104,
            31.228504
        ],
        "address": "浙江南路78号",
        "name": "东新商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.485255,
            31.389031
        ],
        "address": "双城路803弄",
        "name": "宝莲城",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.454945,
            31.23107
        ],
        "address": "江宁路188号",
        "name": "亚盛大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.515549,
            31.281673
        ],
        "address": "江浦路2089弄",
        "name": "恒联新天地",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.77703,
            31.053932
        ],
        "address": "拱极路2368弄29支弄",
        "name": "华钜御庭一期",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.451817,
            31.143499
        ],
        "address": "喜泰路255号",
        "name": "海桐商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.51414,
            31.26072
        ],
        "address": "荆州路334弄108号",
        "name": "荣广商务中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.279743,
            31.380814
        ],
        "address": "澄浏中路2539弄",
        "name": "嘉乐东润广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.491872,
            31.204893
        ],
        "address": "瞿溪路301弄",
        "name": "蓬莱家园(二期)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.577489,
            31.090866
        ],
        "address": "沈梅路99号",
        "name": "智慧产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.430198,
            31.181188
        ],
        "address": "中山西路2240号",
        "name": "鼎力创意园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.605622,
            31.312963
        ],
        "address": "加枫路28号",
        "name": "新康楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.485449,
            31.258148
        ],
        "address": "邢家桥北路269号",
        "name": "天伦家园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.481937,
            31.281635
        ],
        "address": "广纪路65弄1号",
        "name": "合虹公寓",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.490516,
            31.205831
        ],
        "address": "保屯路129弄",
        "name": "北方花苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.549371,
            31.146152
        ],
        "address": "康桥路787号",
        "name": "中天科技商务园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.44717,
            31.323586
        ],
        "address": "一二八纪念路968号",
        "name": "宝山万达写字楼",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.51414,
            31.273508
        ],
        "address": "控江路1777号",
        "name": "君欣时代广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.487245,
            31.342729
        ],
        "address": "淞发路901弄",
        "name": "祥腾生活广场之商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.448024,
            31.236048
        ],
        "address": "昌平路399号",
        "name": "良清公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.415759,
            31.335113
        ],
        "address": "南蕴藻路408号",
        "name": "栋霖科技园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.495957,
            31.255846
        ],
        "address": "海伦路75号",
        "name": "海伦大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.498444,
            31.210585
        ],
        "address": "海潮路23号",
        "name": "中福花苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.440982,
            31.186362
        ],
        "address": "零陵路777弄68号",
        "name": "鑫国家园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.385568,
            31.170349
        ],
        "address": "万源路2289号",
        "name": "万源新城三期",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.490669,
            31.210994
        ],
        "address": "南车站路69弄1-3号",
        "name": "华教大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.508673,
            31.251807
        ],
        "address": "东大名路1096号",
        "name": "长江大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.512199,
            31.256905
        ],
        "address": "长阳路288号",
        "name": "兰侨大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.592388,
            31.070879
        ],
        "address": "航瑞路175弄-1-119号",
        "name": "鹤沙航城汇康锦苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.451755,
            31.247066
        ],
        "address": "长安路1138号",
        "name": "中房华东大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.423028,
            31.035303
        ],
        "address": "都市路384号",
        "name": "铂晶商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.536333,
            31.243434
        ],
        "address": "浦东大道1525-1539号",
        "name": "中国石化大厦(上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.399403,
            31.198041
        ],
        "address": "红宝石路500号",
        "name": "东银中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.439203,
            30.941307
        ],
        "address": "南桥镇程普路377号",
        "name": "悠口创意园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.481324,
            31.291283
        ],
        "address": "新市南路515弄",
        "name": "五矿公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.445254,
            31.236614
        ],
        "address": "西康路658弄7-9号",
        "name": "静安东海园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.469873,
            31.197221
        ],
        "address": "瑞金南路345弄",
        "name": "裕兴大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.399586,
            31.204322
        ],
        "address": "古北路686号",
        "name": "长福公寓(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.397859,
            31.160144
        ],
        "address": "漕宝路1108号",
        "name": "燎申漕宝大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.596062,
            31.335043
        ],
        "address": "美盛路27号",
        "name": "烨博大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.482339,
            31.203111
        ],
        "address": "局门路427号",
        "name": "智造局二期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.462678,
            31.248845
        ],
        "address": "京江路299号",
        "name": "宝丰大厦南楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.499798,
            31.033799
        ],
        "address": "永颂路455弄",
        "name": "永康城颂和苑",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.26299,
            31.19512
        ],
        "address": "徐祥路368号",
        "name": "8090青年创业基地数字经济总部园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.436267,
            31.173871
        ],
        "address": "田东路377弄3号",
        "name": "金衡公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.533693,
            31.271783
        ],
        "address": "长阳路1687号",
        "name": "长阳谷创意园区",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.595903,
            31.341466
        ],
        "address": "富特北路258号",
        "name": "高华大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.475128,
            31.210429
        ],
        "address": "马当路588弄",
        "name": "淡水湾花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.114321,
            31.161473
        ],
        "address": "城中北路866弄",
        "name": "贺桥公寓",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.524178,
            31.2729
        ],
        "address": "周家嘴路2809号",
        "name": "凤城巷三期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.374488,
            31.352473
        ],
        "address": "菊泉街158弄",
        "name": "中怡雅苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.451549,
            31.235054
        ],
        "address": "江宁路495号",
        "name": "博鸿大厦",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.44745,
            31.106358
        ],
        "address": "银都路466号",
        "name": "上海聚科生物园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.395284,
            31.170601
        ],
        "address": "宜山路1398号",
        "name": "皓顺大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.419495,
            31.334203
        ],
        "address": "康文路330弄",
        "name": "共康雅苑三期",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.443748,
            31.280676
        ],
        "address": "万荣路777号",
        "name": "大宁音乐广场H座",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.497576,
            31.387453
        ],
        "address": "水产路409号",
        "name": "上海炮台商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.451439,
            31.246258
        ],
        "address": "天目西路511号",
        "name": "外贸锦程大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.473581,
            31.223523
        ],
        "address": "淮海中路300号",
        "name": "香港新世界大厦(商场)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.240103,
            31.179888
        ],
        "address": "乐高路200弄1-13号",
        "name": "徐泾北城馨浦苑东区",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.550428,
            31.220473
        ],
        "address": "民生路1518号",
        "name": "金鹰大厦（上海)",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.443009,
            31.141954
        ],
        "address": "百色路451弄",
        "name": "园南二村",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.366349,
            31.178254
        ],
        "address": "青杉路150弄",
        "name": "龙柏四季花园",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.588146,
            31.34458
        ],
        "address": "杨高北路610号",
        "name": "三铭公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.542186,
            31.044173
        ],
        "address": "浦航路178弄",
        "name": "汇秀景苑一街坊",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.529189,
            31.224673
        ],
        "address": "向成路58号",
        "name": "东方国际科技大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.439874,
            31.131655
        ],
        "address": "罗秀路200弄",
        "name": "长桥八村",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.594223,
            31.25422
        ],
        "address": "胶东路266弄",
        "name": "金燕家苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.606302,
            31.170751
        ],
        "address": "盛荣路188弄",
        "name": "盛大天地创意中心一期（青春里）",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.384802,
            31.184459
        ],
        "address": "虹梅路3215弄201号",
        "name": "圣伦兰商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.606185,
            31.25963
        ],
        "address": "金海路1286弄",
        "name": "金海苑(上海)",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.487227,
            31.231419
        ],
        "address": "延安东路600-618号",
        "name": "远洋商业大厦(一期)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.501028,
            31.152456
        ],
        "address": "杨南路689弄",
        "name": "上海叠翠苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.454393,
            31.223126
        ],
        "address": "延安中路841号",
        "name": "东方海外大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.51686,
            31.260793
        ],
        "address": "长阳路666号",
        "name": "燕舞东方保利广场M楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.360679,
            31.234786
        ],
        "address": "同普路1680弄",
        "name": "玫瑰苑（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.199363,
            31.242032
        ],
        "address": "华蔡路655",
        "name": "集池宇智造创新园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.509971,
            31.23426
        ],
        "address": "世纪大道210号",
        "name": "上海二十一世纪中心大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.265936,
            31.340099
        ],
        "address": "希望路689弄",
        "name": "嘉定宝龙中心（四期）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.515648,
            31.263589
        ],
        "address": "昆明路739号",
        "name": "文通大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.381301,
            31.117135
        ],
        "address": "水清路378弄25支弄",
        "name": "水清二村",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.59684,
            31.272521
        ],
        "address": "五莲路1168号",
        "name": "新馨白领公寓五莲路店",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.408439,
            31.197794
        ],
        "address": "虹桥路1163弄",
        "name": "长发虹桥公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.746103,
            30.875847
        ],
        "address": "正旭路599弄",
        "name": "凤凰城天境",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.493235,
            31.26911
        ],
        "address": "曲阳路31号",
        "name": "曲阳公寓(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.491954,
            31.257722
        ],
        "address": "海伦路306弄",
        "name": "海昌苑(虹口)",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.471013,
            31.201529
        ],
        "address": "斜土路816弄1号",
        "name": "卢宛816",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.10725,
            31.16893
        ],
        "address": "竹盈路160号",
        "name": "浪潮科创园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.410207,
            31.24524
        ],
        "address": "曹杨路1040弄2号",
        "name": "中谊大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.216181,
            31.032725
        ],
        "address": "文诚路500弄",
        "name": "安信生活广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.37247,
            31.249351
        ],
        "address": "祁连山南路1988号",
        "name": "嘉龙大厦_上海",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.446685,
            31.218919
        ],
        "address": "华山路301号",
        "name": "上海静安商楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.481731,
            31.404499
        ],
        "address": "牡丹江路1588-1号",
        "name": "宝地宝杨商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.562641,
            31.204162
        ],
        "address": "龙阳路2277弄",
        "name": "永达国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.410699,
            31.215515
        ],
        "address": "中山西路380号",
        "name": "家电大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.241562,
            31.344144
        ],
        "address": "临泽路88弄/89弄/188弄/189弄，崇信路1518弄，云屏路1399弄，白银路1563，,165号",
        "name": "新城金郡（上海）",
        "count": 87,
        "style": 0
    },
    {
        "lnglat": [
            121.448985,
            31.112173
        ],
        "address": "华展路168弄",
        "name": "景华新苑",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.308834,
            31.258891
        ],
        "address": "金园五路333号",
        "name": "领兆创客空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.623337,
            31.242366
        ],
        "address": "锦绣东路2777弄",
        "name": "锦绣申江（金桥华虹创新园）",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.237459,
            31.10994
        ],
        "address": "泗凤公路1500弄",
        "name": "新凯城玉兰苑",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.502361,
            30.981997
        ],
        "address": "金闸公路225弄",
        "name": "汇中苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.128139,
            31.145344
        ],
        "address": "青湖路998-1002号",
        "name": "万福财富中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.565075,
            31.155984
        ],
        "address": "沪南路2419弄",
        "name": "地杰商业大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.474818,
            31.237228
        ],
        "address": "云南北路59号",
        "name": "六合大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.549883,
            31.27473
        ],
        "address": "贵阳路398号",
        "name": "文通国际广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.380455,
            31.192356
        ],
        "address": "虹桥路2222弄33号",
        "name": "王子公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.514744,
            31.279867
        ],
        "address": "铁岭路50弄23号",
        "name": "铁岭大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.412611,
            31.185871
        ],
        "address": "吴中路369号",
        "name": "美恒大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.426656,
            31.225078
        ],
        "address": "江苏北路30号",
        "name": "荣兆园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.520586,
            30.849418
        ],
        "address": "海拓路3号",
        "name": "风溪文化创意产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.386287,
            31.1861
        ],
        "address": "虹梅路3213号",
        "name": "红春大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.444743,
            31.230308
        ],
        "address": "武定路881号",
        "name": "881创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.480124,
            31.223527
        ],
        "address": "柳林路150号",
        "name": "建发柳林大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.153412,
            31.161974
        ],
        "address": "盈港东路7802号",
        "name": "宝龙中心（青浦）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.29069,
            30.987799
        ],
        "address": "车阳路116号",
        "name": "文昌企业园二期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.388019,
            31.169265
        ],
        "address": "万源路2158号",
        "name": "泓毅大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.409487,
            31.171469
        ],
        "address": "虹漕路77号",
        "name": "华鑫慧享城",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.765451,
            31.048263
        ],
        "address": "人民东路2729弄38支弄",
        "name": "东方城市豪庭",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.160143,
            31.139232
        ],
        "address": "崧涟二路66弄",
        "name": "昱翠雅苑",
        "count": 55,
        "style": 0
    },
    {
        "lnglat": [
            121.404576,
            31.268269
        ],
        "address": "真金路251弄",
        "name": "真欣园",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.463308,
            31.226558
        ],
        "address": "石门一路116号",
        "name": "中邦艾格美国际公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.363585,
            31.252809
        ],
        "address": "曹安路1775号",
        "name": "上海国际鞋城",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.300818,
            31.011419
        ],
        "address": "车嘉路180号",
        "name": "路东科技产业园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.243429,
            31.3505
        ],
        "address": "洪德路1125弄",
        "name": "新城香溢澜庭",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.477534,
            31.203357
        ],
        "address": "斜土路468号",
        "name": "白云公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.413646,
            31.191678
        ],
        "address": "宋园路62弄",
        "name": "开城公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.451755,
            31.196085
        ],
        "address": "东安路149弄",
        "name": "四季园（上海）",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.465633,
            31.272753
        ],
        "address": "北宝兴路158号",
        "name": "嘉利明珠商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.479212,
            31.223849
        ],
        "address": "桃源路111弄",
        "name": "淮海晶华苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.402833,
            31.15996
        ],
        "address": "虹梅路1123号 ",
        "name": "上企置业广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.518284,
            31.219531
        ],
        "address": "浦东南路1630号",
        "name": "闻通商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.31825,
            31.141282
        ],
        "address": "沪亭北路199弄",
        "name": "九亭中心",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.522642,
            31.179966
        ],
        "address": "北艾路1766号",
        "name": "大华锦绣国际写字楼",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.52866,
            31.175248
        ],
        "address": "成山路1488弄",
        "name": "大华锦绣华城15街区一期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.443831,
            31.22221
        ],
        "address": "华山路2号",
        "name": "静安高和大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.417245,
            31.266933
        ],
        "address": "新村路789弄",
        "name": "嘉华苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.472016,
            31.209555
        ],
        "address": "重庆南路310号",
        "name": "新电大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.444562,
            31.222603
        ],
        "address": "南京西路1728号",
        "name": "百乐门大都会",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.41107,
            31.23368
        ],
        "address": "中山北路3618弄",
        "name": "银城大厦(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.411588,
            31.212288
        ],
        "address": "玉屏南路9号",
        "name": "新联大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.520602,
            31.241276
        ],
        "address": "昌邑路538弄5号",
        "name": "裕景国际商务广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.338167,
            30.821984
        ],
        "address": "金流路1438号",
        "name": "金准园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.444314,
            31.182594
        ],
        "address": "天钥桥路869号",
        "name": "美晶佳园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.18158,
            31.280245
        ],
        "address": "于田南路36号",
        "name": "智能网联新能源汽车创新孵化中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.441629,
            31.296312
        ],
        "address": "江场西路299弄",
        "name": "中铁中环时代广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.513617,
            31.195629
        ],
        "address": "临沂路128号",
        "name": "惠盛大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.45654,
            31.253409
        ],
        "address": "沪太路140弄",
        "name": "展望大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.418824,
            31.240669
        ],
        "address": "中山北路2790号",
        "name": "上海杰地大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.436544,
            31.23754
        ],
        "address": "胶州路941号",
        "name": "长久商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.26767,
            31.19095
        ],
        "address": "华徐公路569号",
        "name": "麦迪睿医械e港",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.283451,
            31.100101
        ],
        "address": "泗砖路600号",
        "name": "松江钢材城南区园区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.569014,
            31.218067
        ],
        "address": "花木路1983号",
        "name": "四季雅苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.472446,
            31.197484
        ],
        "address": "打浦路398弄",
        "name": "东晖花苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.529765,
            31.139706
        ],
        "address": "环林东路879弄",
        "name": "杉林新月一期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.42687,
            31.404778
        ],
        "address": "德都路58弄",
        "name": "恒德苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.324293,
            31.332525
        ],
        "address": "北陈路382号",
        "name": "希望屺盛孵化基地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.305838,
            31.041421
        ],
        "address": "新界路1号",
        "name": "微衡1号工坊",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.509779,
            31.309111
        ],
        "address": "政立路415号",
        "name": "天盛广场",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.491168,
            31.291939
        ],
        "address": "曲阳路990弄",
        "name": "运光大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.443491,
            31.099209
        ],
        "address": "景联路439号",
        "name": "上海电子物联产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.486542,
            31.185136
        ],
        "address": "世博馆路50、52号",
        "name": "鲁能国际中心AB座",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.416673,
            31.237868
        ],
        "address": "曹杨路619号",
        "name": "近铁云中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.402538,
            31.133711
        ],
        "address": "沪闵路7866弄",
        "name": "莲花国际广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.464437,
            31.199889
        ],
        "address": "斜土路1221号",
        "name": "之俊大厦（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.314305,
            31.247777
        ],
        "address": "金园一路1118弄",
        "name": "双佳翠庭",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.53406,
            31.148877
        ],
        "address": "杨高南路5135弄",
        "name": "日月豪庭",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.424037,
            31.210064
        ],
        "address": "延安西路1399号",
        "name": "汇享1399",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.359776,
            31.066014
        ],
        "address": "春常路142号",
        "name": "抱家燕汇谷智慧产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.426147,
            31.185262
        ],
        "address": "古宜路99弄",
        "name": "天杰徐汇宜德苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.384236,
            31.356498
        ],
        "address": "宝绿路99号",
        "name": "环绿国际",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.25698,
            31.337235
        ],
        "address": "川沙路4198号",
        "name": "爱情谷",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.444438,
            31.224176
        ],
        "address": "愚园路168号",
        "name": "环球世界大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450227,
            31.236456
        ],
        "address": "江宁路599弄",
        "name": "静安新格公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.564242,
            31.229547
        ],
        "address": "丁香路1399弄",
        "name": "仁恒河滨城会所",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.481499,
            31.230938
        ],
        "address": "延安东路550号",
        "name": "海洋大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.197055,
            31.292457
        ],
        "address": "双浦路70弄",
        "name": "花香澜庭",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.403972,
            31.138343
        ],
        "address": "古美路377弄、莲花路288弄",
        "name": "阳光美景城_西区",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.230204,
            31.008692
        ],
        "address": "秀水新路145弄",
        "name": "龙潭南苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.346411,
            31.264936
        ],
        "address": "嘉怡路279弄260~264号",
        "name": "嘉城桃花岛",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.525019,
            31.263812
        ],
        "address": "长阳路1080号",
        "name": "上海国际设计交流中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.388523,
            31.356735
        ],
        "address": "沙浦路128弄",
        "name": "上海绿洲花园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.412589,
            31.233328
        ],
        "address": "中山北路3300号",
        "name": "环球港",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.346917,
            31.144063
        ],
        "address": "联明路389号",
        "name": "麦可将文创园区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.445343,
            31.378005
        ],
        "address": "宝杨路3003号",
        "name": "闿和阳光广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.526454,
            31.255528
        ],
        "address": "怀德路383弄",
        "name": "保利香槟苑一期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.519799,
            31.242168
        ],
        "address": "昌邑路555弄",
        "name": "滨江茗园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.385991,
            31.169139
        ],
        "address": "万源路2163号",
        "name": "新桥商务中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.492215,
            31.164029
        ],
        "address": "杨新路88号",
        "name": "尚馥骊湾88文化创意园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.497832,
            31.3196
        ],
        "address": "政青路599弄",
        "name": "三湘七星府邸",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.431682,
            31.212216
        ],
        "address": "延安西路1030弄",
        "name": "佳信都市花园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.499641,
            31.210531
        ],
        "address": "中山南路1358弄",
        "name": "中福花苑二期",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.453829,
            31.135485
        ],
        "address": "龙吴路1500号B幢",
        "name": "上海交大科技园海科园区B楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.506166,
            31.250778
        ],
        "address": "东大名路948号",
        "name": "白金湾广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.458331,
            31.197641
        ],
        "address": "小木桥路251号",
        "name": "上海天亿大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.428016,
            31.001749
        ],
        "address": "新闵路481弄",
        "name": "星河景苑",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.240972,
            31.370227
        ],
        "address": "裕民路1000弄",
        "name": "清水颐园",
        "count": 105,
        "style": 0
    },
    {
        "lnglat": [
            121.085161,
            31.143104
        ],
        "address": "崧子浦路55弄",
        "name": "顾会庭",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.4974,
            31.215314
        ],
        "address": "黄家路18号",
        "name": "南门大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.351431,
            31.402344
        ],
        "address": "美丹路222号",
        "name": "上置美兰优湖",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.441692,
            31.255176
        ],
        "address": "中山北路1412号",
        "name": "远景大厦A座",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.54224,
            31.23937
        ],
        "address": "民生路118弄",
        "name": "滨江万科中心",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.469597,
            31.207021
        ],
        "address": "徐家汇路558弄1号",
        "name": "双钱公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.48515,
            31.207389
        ],
        "address": "斜土东路333弄",
        "name": "华浩苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.424311,
            31.183359
        ],
        "address": "中山西路1800号",
        "name": "兆丰环球大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.43217,
            31.180543
        ],
        "address": "中山西路2368号",
        "name": "华鼎大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.260556,
            31.345663
        ],
        "address": "阿克苏路1099号",
        "name": "宝龙城市广场_商务楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.383151,
            31.194531
        ],
        "address": "虹梅路3990弄",
        "name": "晨韵公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.528444,
            31.211235
        ],
        "address": "东方路1381号",
        "name": "兰村大厦",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.601813,
            31.252818
        ],
        "address": "浙桥路289弄2号",
        "name": "碧云公馆",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.478474,
            31.269509
        ],
        "address": "花园路16号",
        "name": "嘉和国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.406727,
            31.142289
        ],
        "address": "平阳路151弄",
        "name": "金领华庭",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.157314,
            31.370329
        ],
        "address": "喜泉路118弄",
        "name": "外冈景苑",
        "count": 160,
        "style": 0
    },
    {
        "lnglat": [
            121.365027,
            31.122923
        ],
        "address": "莘庄镇园秀路28弄",
        "name": "旭辉莘庄中心",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.326121,
            31.302651
        ],
        "address": "宝翔路158弄",
        "name": "旭辉U天地",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.519166,
            31.215451
        ],
        "address": "浦东南路1877号",
        "name": "东旅大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.498011,
            31.211275
        ],
        "address": "陆家浜路285弄",
        "name": "三角大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.698638,
            31.183657
        ],
        "address": "川沙路5558弄",
        "name": "绿地东海岸国际广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.391483,
            31.105161
        ],
        "address": "宝城路155弄",
        "name": "名都新城一二期",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.332284,
            31.240059
        ],
        "address": "沙河路58号",
        "name": "美好中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.358894,
            31.14097
        ],
        "address": "中谊路699号",
        "name": "华友大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.248342,
            31.099506
        ],
        "address": "泽悦路88弄",
        "name": "桂花锦苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.307584,
            31.121227
        ],
        "address": "久富路650号",
        "name": "立同久富商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.397865,
            31.168404
        ],
        "address": "虹梅路1801号A区",
        "name": "凯科国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.274167,
            31.108927
        ],
        "address": "沪松公路2972弄22号",
        "name": "绿波景园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.517348,
            30.935009
        ],
        "address": "万顺路709弄",
        "name": "金域华庭(万科金域华府)",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.48353,
            31.252509
        ],
        "address": "四川北路1363号及1361号",
        "name": "壹丰广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.601136,
            31.341503
        ],
        "address": "华申路198号",
        "name": "六宁大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.462403,
            31.258628
        ],
        "address": "共和新路912号",
        "name": "云华科技大厦",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.467894,
            31.198441
        ],
        "address": "瑞金南路500号",
        "name": "新视觉500",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.108492,
            31.196722
        ],
        "address": "天一路568号",
        "name": "8090青年创业基地青浦新城园",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.431736,
            31.205144
        ],
        "address": "华山路1520弄",
        "name": "恒力公寓（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.187837,
            31.013441
        ],
        "address": "乐都西路1636弄",
        "name": "荣乐雅筑",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.388719,
            31.136978
        ],
        "address": "顾戴路1199弄96号",
        "name": "江南星城1期96号楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.483434,
            31.400133
        ],
        "address": "宝林路458号",
        "name": "云派PARK",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.555041,
            31.237298
        ],
        "address": "羽山路967弄",
        "name": "森林湾家园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.39972,
            31.20535
        ],
        "address": "古北路666号",
        "name": "嘉麒大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.48104,
            31.225362
        ],
        "address": "淮海东路99号",
        "name": "恒积大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.324907,
            31.07435
        ],
        "address": "明中路1588弄1-1086号",
        "name": "沿海丽水馨庭（丽水馨庭）",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.484612,
            31.232272
        ],
        "address": "广东路339号",
        "name": "中福现代城",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.582134,
            31.201634
        ],
        "address": "祖冲之路295号",
        "name": "夏新大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.424864,
            31.166999
        ],
        "address": "柳州路300弄",
        "name": "豪门府邸新大公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.712937,
            31.089585
        ],
        "address": "宣秋路129号",
        "name": "上海尧煊实业有限公司(园区)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.429522,
            31.393276
        ],
        "address": "杨泰路2158弄",
        "name": "远洋悦庭二期",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.450562,
            31.193298
        ],
        "address": "斜土路2088号",
        "name": "徐汇创客中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.316932,
            31.187898
        ],
        "address": "申长路518号",
        "name": "虹桥绿谷WE",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.442665,
            31.223118
        ],
        "address": "愚园路309号",
        "name": "紫安大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.542789,
            31.061712
        ],
        "address": "江文路125弄",
        "name": "浦江宝邸三期",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.373642,
            30.994191
        ],
        "address": "江川路1551号",
        "name": "美惠全商业广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.484859,
            31.30444
        ],
        "address": "仁德路333号",
        "name": "平溪商业广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.476166,
            31.253753
        ],
        "address": "宝山路268弄",
        "name": "复地新都国际",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.541873,
            31.236057
        ],
        "address": "张杨路1667弄",
        "name": "金露苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.341873,
            31.263942
        ],
        "address": "海蓝路398弄",
        "name": "嘉城馥邸",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.794851,
            30.912473
        ],
        "address": "秋兴路875号",
        "name": "中汽联（临港）全球汽车零部件创新中心",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.44642,
            31.236147
        ],
        "address": "昌平路428弄",
        "name": "静安兴海城",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.462023,
            30.947043
        ],
        "address": "航谊路8号",
        "name": "宏普信息园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.588683,
            31.300729
        ],
        "address": "德爱路450弄",
        "name": "阳光城MODO自由区（上海MODO自由区）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.214888,
            31.011697
        ],
        "address": "永丰路270弄",
        "name": "玉龙苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.435064,
            31.18611
        ],
        "address": "蒲汇塘路50号",
        "name": "玉兰花苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.396658,
            31.182748
        ],
        "address": "吴中路686弄2号",
        "name": "金虹桥广场E座",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.606321,
            31.297969
        ],
        "address": "俱进路90弄",
        "name": "铂庭俱进家园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.462859,
            31.254842
        ],
        "address": "共和新路688弄",
        "name": "广兴广隆公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.574319,
            31.175898
        ],
        "address": "五星路706弄26号楼",
        "name": "御河企业公馆D2E3",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.481892,
            31.203106
        ],
        "address": "局门路436号",
        "name": "8号桥五里园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.507916,
            31.195347
        ],
        "address": "浦东南路3456号",
        "name": "江天大厦（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.397696,
            31.11358
        ],
        "address": "莘朱路820弄",
        "name": "梅香苑",
        "count": 79,
        "style": 0
    },
    {
        "lnglat": [
            121.441315,
            31.19443
        ],
        "address": "肇嘉浜路1065号",
        "name": "飞雕国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.633433,
            31.160098
        ],
        "address": "康桥东路1159弄105号",
        "name": "松港产业园_康桥东路",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.478655,
            31.296371
        ],
        "address": "车站北路177弄",
        "name": "虹口玫瑰苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.493785,
            31.336574
        ],
        "address": "逸仙路2816号",
        "name": "华滋奔腾大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.463628,
            31.188496
        ],
        "address": "小木桥路800号",
        "name": "UTOP联创空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.532458,
            31.269511
        ],
        "address": "涞坊路699弄",
        "name": "汇贤阁",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.1571,
            31.154969
        ],
        "address": "秀泽路226弄",
        "name": "佳福雅苑A4",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.39653,
            31.18267
        ],
        "address": "吴中路686弄D座",
        "name": "东航金融中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.398981,
            31.197217
        ],
        "address": "黄金城道688弄9号",
        "name": "御翠豪庭",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.276843,
            31.271724
        ],
        "address": "翔江公路2299号",
        "name": "北虹桥松日2299广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.58623,
            31.150897
        ],
        "address": "康桥路1789号",
        "name": "丰动力康桥中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.562825,
            31.257626
        ],
        "address": "居家桥路199弄",
        "name": "昕泰苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.533479,
            31.232193
        ],
        "address": "张杨路1348号",
        "name": "春竹大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.370397,
            31.366651
        ],
        "address": "菊泉街2899弄1-8号",
        "name": "馨佳园社区四街坊",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.397219,
            31.213349
        ],
        "address": "天山路600弄2号",
        "name": "新虹桥捷运大厦",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.358489,
            31.222757
        ],
        "address": "金钟路658弄11号楼",
        "name": "东华大学国家大学科技园11号楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.646226,
            31.216407
        ],
        "address": "春泉路45弄",
        "name": "张江名流豪庭",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.392301,
            31.056877
        ],
        "address": "鑫都路2688号",
        "name": "天恒名城",
        "count": 61,
        "style": 0
    },
    {
        "lnglat": [
            121.423201,
            31.243133
        ],
        "address": "中山北路2550号",
        "name": "上海有色金属交易中心(物贸大厦)",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.447355,
            31.298876
        ],
        "address": "江场一路28号",
        "name": "电信发展公司大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.739162,
            31.06413
        ],
        "address": "听悦路1200弄",
        "name": "惠益绿苑西苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.397739,
            31.194359
        ],
        "address": "荣华东道46-49号",
        "name": "雅典花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.42786,
            31.210864
        ],
        "address": "延安西路1221号",
        "name": "泛太大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.324804,
            31.279882
        ],
        "address": "武威路2909弄",
        "name": "连飞虹湖天地国际公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.412288,
            31.177621
        ],
        "address": "钦江路28弄",
        "name": "东方康洛",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.441636,
            30.925383
        ],
        "address": "航南公路6666号",
        "name": "上海魏晋文化创意产业园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.501247,
            31.311997
        ],
        "address": "三门路333弄",
        "name": "三门路333弄（空军干部家属院）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.531766,
            31.257803
        ],
        "address": "龙江路317弄",
        "name": "圣骊河滨苑一期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.400005,
            31.21787
        ],
        "address": "古北路69弄",
        "name": "虹桥万博花园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.491346,
            30.935506
        ],
        "address": "金海公路4808号",
        "name": "万景峰一期",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.528636,
            31.259876
        ],
        "address": "榆林路858弄",
        "name": "滨江晶典",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.443557,
            31.235084
        ],
        "address": "昌平路658弄",
        "name": "丽致公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.403772,
            31.328842
        ],
        "address": "纬地路88弄",
        "name": "经纬城市绿洲阳光水岸家园",
        "count": 106,
        "style": 0
    },
    {
        "lnglat": [
            121.53323,
            31.222847
        ],
        "address": "浦电路438号",
        "name": "双鸽大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.47578,
            31.255425
        ],
        "address": "永兴路39弄",
        "name": "蒙特利城一期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.443114,
            31.221918
        ],
        "address": "乌鲁木齐北路211号",
        "name": "聚安大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.609318,
            31.179568
        ],
        "address": "百业路167弄31号",
        "name": "泊寓翡翠公园店",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.428726,
            31.203729
        ],
        "address": "番愚路390号",
        "name": "时代大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.454845,
            31.228483
        ],
        "address": "陕西北路278号",
        "name": "金鹰国际购物中心(上海店)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.433937,
            31.166167
        ],
        "address": "沪闵路9510号",
        "name": "泰成商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.456692,
            31.403827
        ],
        "address": "湄浦路361弄",
        "name": "互联宝地锦溥园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.539968,
            31.234243
        ],
        "address": "张杨路1518弄",
        "name": "金博尚品苑办公楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.167274,
            31.030735
        ],
        "address": "鼎源路618弄",
        "name": "时尚谷创意园",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.396606,
            31.194398
        ],
        "address": "荣华东道59弄",
        "name": "里昂花园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.430387,
            31.162632
        ],
        "address": "钦州路108号",
        "name": "梓树园",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.456377,
            31.236129
        ],
        "address": "泰兴路555号",
        "name": "武泰公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.711441,
            31.077117
        ],
        "address": "南六公路851号",
        "name": "翔灵电商园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.450626,
            31.284753
        ],
        "address": "共和新路2802号",
        "name": "智苑文创空间",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.174306,
            31.284086
        ],
        "address": "安驰路509弄",
        "name": "尚都国际大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.587682,
            31.349648
        ],
        "address": "外高桥保税区基隆路1号",
        "name": "汤臣国际贸易大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.463627,
            31.388115
        ],
        "address": "宝杨路2033号",
        "name": "华泰大厦(上海)",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.473953,
            31.258921
        ],
        "address": "中华新路288号",
        "name": "绿洲雅宾利花园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.393855,
            31.260492
        ],
        "address": "真北路2500号",
        "name": "星河世纪广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.525001,
            31.273902
        ],
        "address": "凤城路1号",
        "name": "同和凤城园（凤城巷）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.589595,
            31.338982
        ],
        "address": "夏碧路79弄",
        "name": "瑞禾明苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.354513,
            31.127551
        ],
        "address": "顾戴路2959号",
        "name": "中展大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.807228,
            30.897688
        ],
        "address": "彩云路567弄",
        "name": "云松景庭",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.43866,
            31.278339
        ],
        "address": "广中西路777弄88号",
        "name": "华清大厦",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.522256,
            31.21595
        ],
        "address": "北张家浜路88弄",
        "name": "左岸88",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.514504,
            31.278093
        ],
        "address": "铁岭路32号",
        "name": "同叶大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.422253,
            31.282911
        ],
        "address": "沪太路1618号",
        "name": "向阳900不夜城",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.388697,
            31.277592
        ],
        "address": "武威东路788弄",
        "name": "恒盛鼎城华公馆",
        "count": 53,
        "style": 0
    },
    {
        "lnglat": [
            121.457886,
            31.163798
        ],
        "address": "云锦路600号 ",
        "name": "航汇大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.523271,
            31.228757
        ],
        "address": "张杨路828-838号",
        "name": "华都大厦(上海)",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.490064,
            31.249002
        ],
        "address": "吴淞路258号，308号",
        "name": "耀江国际广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.513477,
            31.059887
        ],
        "address": "沈杜公路4285号",
        "name": "程文商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.508954,
            31.237631
        ],
        "address": "陆家嘴东路161号",
        "name": "招商局大厦（上海）",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.51734,
            31.077728
        ],
        "address": "联航路1588号",
        "name": "产业大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.478711,
            31.233353
        ],
        "address": "广西北路228弄",
        "name": "中福城二期",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.510222,
            31.188468
        ],
        "address": "东方路3601号",
        "name": "上海丰华园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.626545,
            31.2028
        ],
        "address": "秋月路26号",
        "name": "矽岸国际",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.62054,
            31.256779
        ],
        "address": "新金桥路1599弄",
        "name": "东方万国企业中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.539394,
            31.238289
        ],
        "address": "商城路2000号",
        "name": "宜嘉商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.470489,
            31.218777
        ],
        "address": "南昌路45号",
        "name": "城汇大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.561975,
            31.245473
        ],
        "address": "张杨路2771",
        "name": "信罗大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.453833,
            31.234411
        ],
        "address": "武定路333号",
        "name": "申银发展大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.341852,
            31.457178
        ],
        "address": "罗宁路1288弄",
        "name": "联东U谷宝山国际企业港",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.453117,
            31.255129
        ],
        "address": "沪太路315弄2号",
        "name": "华舟公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.457156,
            31.393634
        ],
        "address": "友谊路1518弄",
        "name": "永景国际大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.507312,
            31.281404
        ],
        "address": "四平路1388号",
        "name": "同济联合广场",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.484658,
            31.294174
        ],
        "address": "广纪路838号",
        "name": "中国出版蓝桥创意产业园A楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.489243,
            30.894063
        ],
        "address": "杨牌路488号",
        "name": "奥帛德文科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.388707,
            31.104144
        ],
        "address": "珠城路158号",
        "name": "解放日报大厦C座",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.50425,
            31.155128
        ],
        "address": "上南路3521号",
        "name": "宝丰生活广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.441238,
            31.185406
        ],
        "address": "斜土路2899甲号",
        "name": "光启文化广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.344602,
            31.064454
        ],
        "address": "金都西路1000号",
        "name": "松港闵新创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.534769,
            31.261596
        ],
        "address": "眉州路381号",
        "name": "华谊星城大厦",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.436957,
            31.168874
        ],
        "address": "龙漕路51弄1号",
        "name": "金海大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.518756,
            31.308707
        ],
        "address": "政德东路88号",
        "name": "椰泰公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.448708,
            31.240601
        ],
        "address": "海防路58弄1-14号",
        "name": "静安康鑫家园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.396986,
            31.141319
        ],
        "address": "顾戴路645弄",
        "name": "风荷云墅",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.418353,
            31.20579
        ],
        "address": "新华路720号",
        "name": "交通公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.445011,
            31.245387
        ],
        "address": "长寿路28弄",
        "name": "秋水云庐",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.464971,
            31.198622
        ],
        "address": "茶陵北路20号",
        "name": "X2创意空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.584419,
            31.309621
        ],
        "address": "莱阳路2328弄",
        "name": "高弘家苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.313833,
            31.118676
        ],
        "address": "金马路59号",
        "name": "松港商务园_金马路",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.487319,
            31.212448
        ],
        "address": "陆家浜路1141号",
        "name": "六角大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.54478,
            31.181175
        ],
        "address": "成山路2399弄",
        "name": "海上国际花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.602154,
            31.205943
        ],
        "address": "金科路2889弄",
        "name": "长泰广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.604541,
            31.172566
        ],
        "address": "盛荣路88弄1-16号",
        "name": "盛大天地源创谷",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.415664,
            31.238124
        ],
        "address": "中山北路3000号",
        "name": "上海长城大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.513768,
            31.195327
        ],
        "address": "临沂路115弄1-3号",
        "name": "上海汇景阁",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.388565,
            31.021039
        ],
        "address": "银林路100弄",
        "name": "银康苑",
        "count": 82,
        "style": 0
    },
    {
        "lnglat": [
            121.603441,
            31.335345
        ],
        "address": "泰谷路168号",
        "name": "烨博智慧园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.400693,
            31.160528
        ],
        "address": "古美路1458弄",
        "name": "中友嘉园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.467915,
            31.276153
        ],
        "address": "同心路1115弄",
        "name": "春满园B区",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.460184,
            31.275206
        ],
        "address": "平型关路680弄",
        "name": "崇文园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.534143,
            31.26909
        ],
        "address": "长阳路1616号",
        "name": "互联网教育大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.476261,
            31.214727
        ],
        "address": "合肥路215号",
        "name": "精益商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.371902,
            31.231871
        ],
        "address": "同普路1130弄9号",
        "name": "璨申智创工坊",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.394071,
            31.098022
        ],
        "address": "都市路4418号",
        "name": "金铭大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.233218,
            31.051474
        ],
        "address": "谷阳北路2501弄",
        "name": "御上海MC街",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.545515,
            31.04152
        ],
        "address": "闵驰一路50弄",
        "name": "聚缘中庭",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.278103,
            31.262701
        ],
        "address": "博园路1333号1号楼",
        "name": "北虹桥新能源产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.428482,
            31.266232
        ],
        "address": "新村路423弄",
        "name": "绿地普陀商务广场",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.505666,
            31.310641
        ],
        "address": "国霞路55号",
        "name": "君庭公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.379083,
            31.021846
        ],
        "address": "富国路199弄(富国路银春路交汇处)",
        "name": "禹洲府",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.112379,
            31.158522
        ],
        "address": "城中北路876弄",
        "name": "上善水樾",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.525185,
            31.220676
        ],
        "address": "崂山路689号",
        "name": "潍坊综合楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.467559,
            31.199779
        ],
        "address": "瑞金南路458弄",
        "name": "瑞金南苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.532338,
            31.224032
        ],
        "address": "竹林路101号",
        "name": "陆家嘴基金大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.370181,
            31.268195
        ],
        "address": "绥德路470弄128号",
        "name": "海天下集团",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.249354,
            31.047439
        ],
        "address": "茸兴路407号",
        "name": "茸407创意园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.325795,
            31.133542
        ],
        "address": "沪亭路240弄",
        "name": "美丽星城",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.458773,
            31.281544
        ],
        "address": "平型关路1083弄",
        "name": "慧芝湖花园二期",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.610793,
            31.276969
        ],
        "address": "乐园路198号",
        "name": "FSPACE金桥中心",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.486169,
            31.248082
        ],
        "address": "塘沽路463号",
        "name": "虹口科技金融大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.554922,
            31.222375
        ],
        "address": "锦绣路800弄",
        "name": "天安花园",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.544254,
            31.312162
        ],
        "address": "民星路270号",
        "name": "谊客科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.600358,
            31.340201
        ],
        "address": "华申路215号",
        "name": "自贸壹号simbaypark（二期）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.496179,
            31.06654
        ],
        "address": "浦雪南路366弄1-55号",
        "name": "滨浦新苑5村",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.42997,
            31.259091
        ],
        "address": "延长西路633弄3号",
        "name": "志丹苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.36751,
            31.180725
        ],
        "address": "红松路333弄",
        "name": "汇金公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.401635,
            31.133796
        ],
        "address": "古方路76号",
        "name": "南方休闲广场",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.437903,
            31.21664
        ],
        "address": "镇宁路90-98号",
        "name": "爱俪轩大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.530464,
            31.186894
        ],
        "address": "高科西路1862号",
        "name": "浦东外贸大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.51659,
            31.200728
        ],
        "address": "临沂路8弄",
        "name": "阳光摩天城二期(光鸿苑)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.461024,
            30.9427
        ],
        "address": "南桥镇奉浦大道97号",
        "name": "绿地智尊",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.16269,
            31.300865
        ],
        "address": "墨玉路398号",
        "name": "承安翡翠公馆",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.383079,
            31.133476
        ],
        "address": "平阳路1515弄",
        "name": "龙祥嘉园（闵行）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.454309,
            31.21079
        ],
        "address": "汾阳路77号",
        "name": "安盛商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.210596,
            31.03776
        ],
        "address": "新松江路1277号",
        "name": "东鼎商务大厦",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.439477,
            31.219202
        ],
        "address": "延安西路300号",
        "name": "静安大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.373881,
            31.360872
        ],
        "address": "菊泉街1281弄1-15号",
        "name": "馨佳园十三街坊",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.117039,
            31.149336
        ],
        "address": "青安路40号",
        "name": "凯特利广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.461959,
            31.27008
        ],
        "address": "洛川东路360号",
        "name": "东方公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.528549,
            31.161482
        ],
        "address": "高青路2861弄",
        "name": "金色里程",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.715015,
            31.248032
        ],
        "address": "东川公路5237号",
        "name": "日角大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.524053,
            31.083311
        ],
        "address": "万康路290号",
        "name": "伟创禾谷科创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42283,
            31.008754
        ],
        "address": "沪闵路277号",
        "name": "冠寓_闵行公园店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.39647,
            31.246349
        ],
        "address": "大渡河路1516弄",
        "name": "真西驰骋苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.435701,
            31.234487
        ],
        "address": "余姚路420号",
        "name": "荣瑞商务中心(汇智金昌园区)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.411482,
            31.234396
        ],
        "address": "中山北路3323号",
        "name": "春之声大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.469569,
            31.237707
        ],
        "address": "黄河路288号",
        "name": "福海公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.410741,
            31.241536
        ],
        "address": "曹杨路903弄",
        "name": "中桥大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.422569,
            31.211245
        ],
        "address": "昭化路488号",
        "name": "金森大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.502346,
            31.234057
        ],
        "address": "花园石桥路66号",
        "name": "东亚银行金融大厦",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.244731,
            31.091861
        ],
        "address": "王家厍路199弄",
        "name": "塘和家园顺康苑",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.496174,
            31.259718
        ],
        "address": "物华路58号",
        "name": "物华大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.514336,
            31.261789
        ],
        "address": "昆明路640号",
        "name": "亚町工坊",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.47787,
            31.272837
        ],
        "address": "中山北一路160号",
        "name": "久乐大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.444832,
            31.201553
        ],
        "address": "吴兴路219号",
        "name": "吴兴公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.236839,
            31.04049
        ],
        "address": "通波路725弄",
        "name": "安琪佳苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.140203,
            31.161944
        ],
        "address": "盈港东路8300弄",
        "name": "佳乐苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.576465,
            31.235968
        ],
        "address": "碧云路86弄",
        "name": "金洋十方庭",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.468946,
            31.220483
        ],
        "address": "淮海中路527号",
        "name": "上海锦江国际购物中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.574933,
            31.158257
        ],
        "address": "御桥路2066弄",
        "name": "地杰国际城E街坊",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.480079,
            31.286604
        ],
        "address": "广灵四路116号",
        "name": "智慧桥创意产业园二期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.484719,
            31.213522
        ],
        "address": "西藏南路900弄",
        "name": "开元坊",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.512876,
            31.228046
        ],
        "address": "浦城路366弄",
        "name": "菊园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.432022,
            31.190189
        ],
        "address": "南丹路189号",
        "name": "南虹公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.251417,
            31.093107
        ],
        "address": "沈砖公路5599号",
        "name": "伟凯科技产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.533954,
            30.824452
        ],
        "address": "海马路2155弄(近海佳路)",
        "name": "嘉业海悦苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.602154,
            31.205943
        ],
        "address": "金科路2889弄",
        "name": "长泰广场",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.422498,
            31.216279
        ],
        "address": "定西路1310弄4号",
        "name": "国泰大厦(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.512897,
            31.307515
        ],
        "address": "淞沪路388号",
        "name": "创智天地",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.521911,
            31.228575
        ],
        "address": "张杨路800号",
        "name": "长航大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.388356,
            31.176761
        ],
        "address": "吴中路1059号",
        "name": "灿虹精英大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.923707,
            30.920526
        ],
        "address": "白荆路389号",
        "name": "万科金领澜湾鹭语墅",
        "count": 73,
        "style": 0
    },
    {
        "lnglat": [
            121.418073,
            31.201588
        ],
        "address": "安顺路158弄",
        "name": "金电大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.557849,
            31.240921
        ],
        "address": "张杨路2242弄",
        "name": "翡翠湾公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.448228,
            31.184059
        ],
        "address": "中山南二路932弄6号",
        "name": "龙山公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.240162,
            31.096412
        ],
        "address": "洞塔路500弄",
        "name": "樾山璟里",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.47547,
            31.216116
        ],
        "address": "复兴中路369号",
        "name": "大同商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.519581,
            31.195733
        ],
        "address": "东方路2851弄",
        "name": "明丰佳园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.492646,
            31.270572
        ],
        "address": "曲阳路167号",
        "name": "宏城公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.235256,
            31.062889
        ],
        "address": "广富林路1188弄",
        "name": "保利西子湾",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.257641,
            31.36838
        ],
        "address": "沪宜公路3099号",
        "name": "绿地嘉创国际商务广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.253907,
            31.34252
        ],
        "address": "合作路1000弄",
        "name": "天悦嘉都_创融嘉天地",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.610439,
            31.254634
        ],
        "address": "金湘路333号",
        "name": "爱立诚大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426694,
            31.231937
        ],
        "address": "长寿路1112弄",
        "name": "水岸茗苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.420681,
            31.233619
        ],
        "address": "曹杨路303弄",
        "name": "锦绿新城二期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.478852,
            31.342852
        ],
        "address": "郁江巷路129弄",
        "name": "三湘海尚",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.508727,
            31.036185
        ],
        "address": "盐铁塘路272弄1-21号",
        "name": "永康城丽华园",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.458339,
            30.928488
        ],
        "address": "陈桥路299弄",
        "name": "同盛南桥花园",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.39653,
            31.18267
        ],
        "address": "吴中路686弄D座",
        "name": "东航金融中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.482926,
            31.268088
        ],
        "address": "四川北路2261-2263号",
        "name": "嘉兰大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.423841,
            31.023878
        ],
        "address": "沧源路1200号",
        "name": "思源创新园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.384745,
            31.068338
        ],
        "address": "光华路728号",
        "name": "728space",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.386428,
            31.069879
        ],
        "address": "光华路598号",
        "name": "598创业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.427154,
            31.279751
        ],
        "address": "沪太路1111号",
        "name": "孩子王(上海静安大融城店)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.383499,
            31.134194
        ],
        "address": "平阳路1481号",
        "name": "古美现代服务企业中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.465388,
            31.279434
        ],
        "address": "株洲路399弄",
        "name": "宝华城市花园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.515173,
            31.228279
        ],
        "address": "浦东南路1088号",
        "name": "中融大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.334291,
            31.397375
        ],
        "address": "年喜路29弄",
        "name": "中集金地美兰城澜都(北区南区公寓）",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.563694,
            31.14786
        ],
        "address": "康桥路1001弄",
        "name": "阳光城愉景公馆（上海康桥美乐）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.445173,
            31.237719
        ],
        "address": " 海防路429弄8号",
        "name": "领航静安艺庭",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.461115,
            31.217353
        ],
        "address": "淮海中路887号",
        "name": "永新大厦",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.398014,
            31.061689
        ],
        "address": "联农路179号",
        "name": "福克斯连锁商务大厦（联农）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.562892,
            31.25904
        ],
        "address": "浦东大道2554号",
        "name": "仙都绿苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.457881,
            31.197006
        ],
        "address": "小木桥路268弄",
        "name": "泰康大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.429509,
            31.224675
        ],
        "address": "武定西路1398弄",
        "name": "静安城",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.388348,
            31.100548
        ],
        "address": "春申路3755号",
        "name": "春申路3755号商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.437115,
            31.191965
        ],
        "address": "漕溪北路88号",
        "name": "圣爱大厦",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.420993,
            31.180862
        ],
        "address": "钦州北路188号",
        "name": "华京商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.483611,
            31.262235
        ],
        "address": "四川北路1915号",
        "name": "上海时装商厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.605319,
            31.128415
        ],
        "address": "秀浦路2388号",
        "name": "上海康桥先进制造技术创业园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.384099,
            31.173747
        ],
        "address": "环镇南路200弄",
        "name": "万源新城四期",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.605707,
            31.309009
        ],
        "address": "富特西三路77号",
        "name": "北八道集团大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.593997,
            31.210422
        ],
        "address": "郭守敬路277号",
        "name": "凯顿酒店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.397652,
            31.32749
        ],
        "address": "纬地路358弄",
        "name": "经纬城市绿洲观澜泓郡家园",
        "count": 116,
        "style": 0
    },
    {
        "lnglat": [
            121.481025,
            31.24675
        ],
        "address": "河南北路233号",
        "name": "圣和圣广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.387154,
            31.116246
        ],
        "address": "莘建东路58号",
        "name": "绿地科技岛",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.441136,
            31.185471
        ],
        "address": "斜土路2899号",
        "name": "上影公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.481178,
            31.227425
        ],
        "address": "金陵东路569号",
        "name": "汇通大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.423352,
            31.330812
        ],
        "address": "大康路896弄",
        "name": "恒达家园",
        "count": 73,
        "style": 0
    },
    {
        "lnglat": [
            121.424654,
            31.21671
        ],
        "address": "宣化路299弄",
        "name": "富都花园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.181678,
            31.193582
        ],
        "address": "重固镇大街588号",
        "name": "新世纪商业广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.531949,
            31.281108
        ],
        "address": "控江路980弄5号楼",
        "name": "杨浦公寓商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.515731,
            31.267516
        ],
        "address": "周家嘴路2001弄",
        "name": "东银茗苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.435541,
            31.236405
        ],
        "address": "叶家宅南路66弄128支弄1号",
        "name": "复景创园壹号",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.531924,
            31.243578
        ],
        "address": "浦东大道1097弄",
        "name": "珠江玫瑰花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.591775,
            31.114397
        ],
        "address": "年家浜东路129弄",
        "name": "印象春城",
        "count": 78,
        "style": 0
    },
    {
        "lnglat": [
            121.514862,
            31.274466
        ],
        "address": "控江路1690号",
        "name": "凤凰大厦(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.280565,
            31.157844
        ],
        "address": "徐和路58弄",
        "name": "首创禧瑞庭",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.569305,
            31.346236
        ],
        "address": "花山路333弄",
        "name": "宝厦雅苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.434942,
            31.097011
        ],
        "address": "虹梅南路2588号",
        "name": "绿亮科创园总部",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.485736,
            31.214329
        ],
        "address": "西藏南路831弄",
        "name": "南吉公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.601576,
            31.340679
        ],
        "address": "华申路221号",
        "name": "诺至未（中航兰田）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.536808,
            31.307935
        ],
        "address": "翔殷路500弄之1-64号",
        "name": "莱茵半岛",
        "count": 47,
        "style": 0
    },
    {
        "lnglat": [
            121.137019,
            31.157897
        ],
        "address": "华科路399弄",
        "name": "青水湾公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.253971,
            31.02176
        ],
        "address": "松东路326号",
        "name": "锐服高新技术产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.447236,
            31.174642
        ],
        "address": "天钥桥路1188号",
        "name": "创邑朵云轩",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.247614,
            31.396286
        ],
        "address": "环城路762弄5号楼",
        "name": "信业未来中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.512906,
            31.254386
        ],
        "address": "临潼路188号",
        "name": "临潼188金融创新中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.489654,
            31.216862
        ],
        "address": "迎勋北路8弄",
        "name": "唐城公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.619578,
            31.198314
        ],
        "address": "高科中路1976号",
        "name": "衡谷1976",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.47493,
            31.244273
        ],
        "address": "七浦路535号",
        "name": "七浦商厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.516224,
            31.021249
        ],
        "address": "汇延路59弄",
        "name": "瑞和城",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.426687,
            31.204997
        ],
        "address": "法华镇路457弄/483弄",
        "name": "海富公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.448603,
            31.198065
        ],
        "address": "肇嘉浜路789号",
        "name": "均瑶国际广场",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.472209,
            31.19608
        ],
        "address": "中山南一路1065",
        "name": "天歌大地大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.621467,
            31.254073
        ],
        "address": "金皖路501号",
        "name": "金皖路501号园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.466677,
            31.227009
        ],
        "address": "成都北路199号",
        "name": "恒利国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.447385,
            31.23413
        ],
        "address": "西康路520号",
        "name": "华通公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.489644,
            31.291622
        ],
        "address": "中山北一路1250号",
        "name": "沪办大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.403093,
            31.053339
        ],
        "address": "瓶北路155号",
        "name": "英格尔认证检测大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.482976,
            31.407758
        ],
        "address": "盘古路388弄",
        "name": "祥腾国际广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.318291,
            31.288298
        ],
        "address": "古猗园路88弄",
        "name": "骏丰嘉骊花园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.605299,
            31.309462
        ],
        "address": "富特西三路77号10幢",
        "name": "信泰融资大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.41775,
            31.113389
        ],
        "address": "春申路2328弄12幢",
        "name": "M创客空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.647853,
            31.212731
        ],
        "address": "银樽路58弄",
        "name": "张江国际豪庭",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.519597,
            30.940948
        ],
        "address": "清宁路85弄",
        "name": "白沙东苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.408661,
            31.246975
        ],
        "address": "曹杨路1222弄1-16号",
        "name": "颐宁苑(上海)",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.508804,
            31.2397
        ],
        "address": "浦东南路256号",
        "name": "华夏银行大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.496871,
            31.253701
        ],
        "address": "周家嘴路338弄",
        "name": "馨虹苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.417562,
            31.002326
        ],
        "address": "江川路291弄20号",
        "name": "上企创业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.43618,
            31.330029
        ],
        "address": "三泉路1859弄",
        "name": "宝宸怡景园",
        "count": 104,
        "style": 0
    },
    {
        "lnglat": [
            121.238351,
            31.185482
        ],
        "address": "凤坚塘路65弄",
        "name": "欣乐苑东苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.413934,
            31.19961
        ],
        "address": "中山西路999号",
        "name": "华闻国际大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.429688,
            31.212598
        ],
        "address": "延安西路1033号",
        "name": "大众金融大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.443858,
            31.272894
        ],
        "address": "万荣路388弄、大宁路883弄",
        "name": "歌林春天馨园",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.482644,
            31.218469
        ],
        "address": "复兴中路1号",
        "name": "申能国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.565677,
            31.150429
        ],
        "address": "沪南路2518弄",
        "name": "百舸馨苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.376111,
            31.264962
        ],
        "address": "绥德路与祁连山南路交叉口西280米",
        "name": "多礼米",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.454475,
            31.288973
        ],
        "address": "共和新路2999弄",
        "name": "明园森林都市一期森林都市滴翠苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.353569,
            31.158931
        ],
        "address": "新龙路399弄56号",
        "name": "七宝宝龙城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.61649,
            31.204608
        ],
        "address": "张江路665号",
        "name": "德宏大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.315631,
            31.062451
        ],
        "address": "新南街350弄",
        "name": "新桥首府",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.499898,
            31.164773
        ],
        "address": "杨思路855弄",
        "name": "申江豪城",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.48651,
            31.2304
        ],
        "address": "河南南路16号",
        "name": "中汇大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.460184,
            31.230072
        ],
        "address": "吴江路188号",
        "name": "静安新时代大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.389413,
            31.086388
        ],
        "address": "春东路508号",
        "name": "如果创意产业园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.448589,
            31.227404
        ],
        "address": "北京西路1399号",
        "name": "信达大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.439046,
            30.937278
        ],
        "address": "环城西路2511号2栋",
        "name": "上海现代服务业南桥科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.417865,
            31.176881
        ],
        "address": "宜山路700号",
        "name": "普天科创产业园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.379286,
            31.17137
        ],
        "address": "金汇南路60弄",
        "name": "锦绣江南一期",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.565458,
            31.250597
        ],
        "address": "博山东路188弄1-24号",
        "name": "通联苑北区",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.371214,
            31.251152
        ],
        "address": "曹安公路1509号",
        "name": "福瑞大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.531605,
            31.217184
        ],
        "address": "峨山路91弄101号5号楼",
        "name": "陆家嘴科技园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.518833,
            31.195942
        ],
        "address": "东方路2880弄",
        "name": "临沂大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.774748,
            31.055864
        ],
        "address": "拱北路289弄29支弄1-28号",
        "name": "华钜御庭二期",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.499189,
            31.27226
        ],
        "address": "四平路778号",
        "name": "盛业大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.551485,
            31.238168
        ],
        "address": "苗圃路438弄",
        "name": "新城名园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.583608,
            31.202231
        ],
        "address": "碧波路573弄1-18号",
        "name": "创业公寓(碧波路)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.549599,
            31.246675
        ],
        "address": "栖山路401弄1号",
        "name": "凌高小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.4203,
            31.215341
        ],
        "address": "安化路492号",
        "name": "长宁德必易园",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.20504,
            31.416662
        ],
        "address": " 汇源路218号",
        "name": "中茂世纪财富广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.37514,
            31.325886
        ],
        "address": "塘祁路677-679弄",
        "name": "保利叶之林三期",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.439072,
            31.297111
        ],
        "address": "江场西路395号",
        "name": "上海新市北工业园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.32501,
            31.073689
        ],
        "address": "明中路1777弄",
        "name": "新弘国际城",
        "count": 90,
        "style": 0
    },
    {
        "lnglat": [
            121.554808,
            30.9839
        ],
        "address": "航南公路1981弄8号",
        "name": "申亚花满庭",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.467163,
            31.232134
        ],
        "address": "成都北路500号",
        "name": "峻岭广场",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.316942,
            31.134793
        ],
        "address": "九新公路33弄1～6号",
        "name": "青春驿站",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.443808,
            31.29853
        ],
        "address": "江场二路99号",
        "name": "莱赛现代生活港",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.509731,
            31.171329
        ],
        "address": "成山路588号",
        "name": "展峰大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.472131,
            31.241926
        ],
        "address": "西藏北路88号",
        "name": "盈凯文创广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.458992,
            31.231562
        ],
        "address": "北京西路833号",
        "name": "京泰大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.489207,
            31.27482
        ],
        "address": "曲阳路489弄8号",
        "name": "虹口创客服务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.472369,
            31.320077
        ],
        "address": "殷高西路518号",
        "name": "尚景天地",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.272224,
            31.391747
        ],
        "address": "塔城东路288弄",
        "name": "嘉贤庄",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.520611,
            31.239285
        ],
        "address": "东方路135号",
        "name": "海东大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.393846,
            31.171877
        ],
        "address": "虹梅路2007号",
        "name": "远中产业园6号楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.208242,
            31.128205
        ],
        "address": "米筛浜路699弄",
        "name": "佘北家园松和苑",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.409594,
            31.170604
        ],
        "address": "虹漕路39号",
        "name": "华鑫科技园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.441272,
            31.247356
        ],
        "address": "江宁路1400号",
        "name": "红豆公寓江宁路",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.394822,
            31.072944
        ],
        "address": "光中路133弄99号5栋",
        "name": "海创汇诺旋智能孵化基地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.478425,
            31.20582
        ],
        "address": "蒙自路207号",
        "name": "宏慧盟智园1号楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.465289,
            31.233363
        ],
        "address": "凤阳路588弄",
        "name": "静安华庭一街区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.335382,
            31.270316
        ],
        "address": "嘉涌路99弄",
        "name": "Max未来",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.453034,
            31.183337
        ],
        "address": "宛平南路921弄",
        "name": "临江豪园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.315816,
            31.25579
        ],
        "address": "金园一路588号",
        "name": "588创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.865315,
            30.948029
        ],
        "address": "老芦公路857号895号",
        "name": "禹洲城市广场西区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.57473,
            31.160047
        ],
        "address": "御水路199弄",
        "name": "地杰国际城D街坊",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.40922,
            31.177059
        ],
        "address": "虹漕路448号",
        "name": "现代物流大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.354881,
            31.176699
        ],
        "address": "航东路528弄45支弄",
        "name": "新明星花园三期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.481408,
            31.23312
        ],
        "address": "福州路465号",
        "name": "德必上海书城WE",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.463726,
            31.210796
        ],
        "address": "永嘉路31号,35号",
        "name": "茂名大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.461965,
            31.160808
        ],
        "address": "龙爱路139号",
        "name": "诺布中心",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.249742,
            31.038603
        ],
        "address": "茸兴路285号",
        "name": "时亦商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.744843,
            31.067232
        ],
        "address": "听健路151弄",
        "name": "秀园西园",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.459215,
            31.241446
        ],
        "address": "恒通路222号",
        "name": "地铁恒通大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.507444,
            31.201422
        ],
        "address": "东三街30号",
        "name": "东三街大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.478927,
            31.307099
        ],
        "address": "场中路28弄1-10号",
        "name": "场中公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.216823,
            31.238909
        ],
        "address": "嘉松中路1299弄88号",
        "name": "兴悦智汇园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.517129,
            31.215875
        ],
        "address": "张家浜路37弄3号",
        "name": "京城大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.435977,
            31.231694
        ],
        "address": "昌平路1009",
        "name": "昌平综合大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.354552,
            31.345265
        ],
        "address": "联杨路1078弄",
        "name": "保利叶上海",
        "count": 90,
        "style": 0
    },
    {
        "lnglat": [
            121.489412,
            31.228192
        ],
        "address": "福佑路333号",
        "name": "时代城隍广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.445961,
            31.166119
        ],
        "address": "龙吴路288弄",
        "name": "徐汇御景苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.424669,
            31.206723
        ],
        "address": "定西路710弄59-67号",
        "name": "云阳花苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441902,
            31.230218
        ],
        "address": "胶州路397号",
        "name": "阳光科技广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.59599,
            31.126699
        ],
        "address": "康佳路38弄-39弄",
        "name": "康桥月苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.358537,
            31.131215
        ],
        "address": "顾戴路2582号",
        "name": "闵行市政园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.488049,
            31.295836
        ],
        "address": "逸仙路158号",
        "name": "宝隆一方大厦",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.429387,
            31.226958
        ],
        "address": "万航渡路858弄25-38号",
        "name": "静安丽舍",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.447568,
            31.298618
        ],
        "address": "江场一路18号",
        "name": "华瑞大厦（上海）",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.490644,
            30.898647
        ],
        "address": "宁富路288号",
        "name": "上海磐业网络科技园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.517349,
            31.287993
        ],
        "address": "国权路85弄",
        "name": "市益小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.182772,
            31.100611
        ],
        "address": "细林路298弄",
        "name": "佘山水岸名邸",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.3346,
            31.26727
        ],
        "address": "临洮路1000弄",
        "name": "宁兴上尚湾",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.140471,
            31.026325
        ],
        "address": "崇南公路599弄",
        "name": "山水华庭(佘山院子)",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.1644,
            31.301473
        ],
        "address": "安亭镇和静路986号",
        "name": "世康大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.438445,
            31.190551
        ],
        "address": "漕溪北路375号",
        "name": "中金国际广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.695049,
            31.200298
        ],
        "address": "川沙路718号",
        "name": "曹路创新产业园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.436117,
            31.207993
        ],
        "address": "兴国路228号",
        "name": "嘉豪苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.423214,
            31.216151
        ],
        "address": "定西路1310弄",
        "name": "金都苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.201266,
            31.229284
        ],
        "address": "华南路680号",
        "name": "梁杭电商U库",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.406941,
            31.172892
        ],
        "address": "宜山路810号",
        "name": "上海贝岭大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.539673,
            31.21117
        ],
        "address": "锦绣路1650弄",
        "name": "香梅花园一期",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.525474,
            31.282785
        ],
        "address": "靖宇南路99弄",
        "name": "九州花苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.390597,
            31.268055
        ],
        "address": "交通路4711号",
        "name": "李子园大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.374934,
            31.081233
        ],
        "address": "申旺路789号",
        "name": "慧高光创园(光创园)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.371214,
            31.251152
        ],
        "address": "曹安公路1509号",
        "name": "福瑞大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.37514,
            31.325886
        ],
        "address": "塘祁路677-679弄",
        "name": "保利叶之林三期",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.470966,
            31.243812
        ],
        "address": "华徐公路1199号",
        "name": "碧家国际社区(国家会展中心店)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.383803,
            31.214737
        ],
        "address": "天山路209弄",
        "name": "天山中华园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.398795,
            31.159951
        ],
        "address": "古美路1471号",
        "name": "华城广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.442099,
            31.186087
        ],
        "address": "天钥桥路500弄",
        "name": "新贵都万体景苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.450183,
            31.226581
        ],
        "address": "铜仁路258号",
        "name": "九安广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.481366,
            31.208014
        ],
        "address": "丽园路501号",
        "name": "丽园路501号二期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.080666,
            31.132748
        ],
        "address": "淀山湖大道1079弄",
        "name": "青浦万达茂商务楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.471431,
            31.31977
        ],
        "address": "高跃路176号，殷高西路608号，殷高西路638号",
        "name": "景瑞生活广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.488566,
            31.27584
        ],
        "address": "大连西路253弄",
        "name": "玉龙大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.491651,
            31.202231
        ],
        "address": "中山南路1877号",
        "name": "金中苑商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.411781,
            31.127661
        ],
        "address": "罗秀路1555弄1-23号",
        "name": "罗秀苑南区",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.466511,
            31.292246
        ],
        "address": "广粤路501号",
        "name": "上海信南实业大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.457036,
            31.203839
        ],
        "address": "太原路289弄",
        "name": "太原邸",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.516187,
            31.266389
        ],
        "address": "周家嘴路2000弄",
        "name": "锦丽斯公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.360438,
            31.260646
        ],
        "address": "金鼎路2588弄",
        "name": "金鼎香樟苑2588弄",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.431146,
            31.192428
        ],
        "address": "虹桥路400弄",
        "name": "南丹小区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.514628,
            31.230115
        ],
        "address": "东园三村331号、335号",
        "name": "东泰大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.482035,
            31.235362
        ],
        "address": "九江路501号",
        "name": "外滩WE",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.427782,
            31.070496
        ],
        "address": "莲花南路2338号",
        "name": "沫谷城市空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.477886,
            31.346839
        ],
        "address": "长江西路255号",
        "name": "上海国际节能环保园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.50907,
            31.177952
        ],
        "address": "东明路660弄",
        "name": "住友昌盛新苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.535985,
            31.047572
        ],
        "address": "浦涛路510弄",
        "name": "虹浦新城北区",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.414125,
            31.236047
        ],
        "address": "中山北路3064号",
        "name": "绿洲广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.238275,
            31.382689
        ],
        "address": "环城路2390号",
        "name": "嘉加德必易园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.520144,
            31.230316
        ],
        "address": "世纪大道1090号",
        "name": "斯米克大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.5723,
            31.094832
        ],
        "address": "建豪路91-99号",
        "name": "圣太科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.314618,
            31.135011
        ],
        "address": "九新公路10弄",
        "name": "亭园大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.589033,
            31.336715
        ],
        "address": "季景路259弄",
        "name": "永久城市花园",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.488646,
            31.290733
        ],
        "address": "中山北一路1230号",
        "name": "柏树大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.203713,
            31.01263
        ],
        "address": "乐都西路959弄",
        "name": "乐都新界",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.2561,
            31.117228
        ],
        "address": "泗通路246号",
        "name": "嘉南红塔大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.464963,
            31.227205
        ],
        "address": "威海路333弄",
        "name": "中凯城市之光花园",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.55048,
            31.30849
        ],
        "address": "翔殷路128号",
        "name": "上海理工科技园二期",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.40923,
            31.371416
        ],
        "address": "富联二路99号（富联二路177弄1号等）",
        "name": "保集e智谷",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.460188,
            31.242032
        ],
        "address": "梅园路77号",
        "name": "人才大厦(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.672473,
            31.28274
        ],
        "address": "海鸣路98弄",
        "name": "中虹家园",
        "count": 90,
        "style": 0
    },
    {
        "lnglat": [
            121.324625,
            31.127669
        ],
        "address": "九亭大街586弄",
        "name": "三元公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.373319,
            31.119475
        ],
        "address": "七莘路646号",
        "name": "兴城商务广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.4712,
            31.391113
        ],
        "address": "宝杨路2000号",
        "name": "宝杨慧照商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.425766,
            31.221883
        ],
        "address": "长宁路515号",
        "name": "兴联大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.336839,
            31.394605
        ],
        "address": "美丹路1058弄",
        "name": "佳欣苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.486216,
            31.182202
        ],
        "address": "博航路68号",
        "name": "招商局上海中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.525872,
            31.174872
        ],
        "address": "华鹏路300弄",
        "name": "大华锦绣华城14街区",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.583102,
            31.264176
        ],
        "address": "柳埠路196弄 ",
        "name": "新沪东公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.441008,
            31.228474
        ],
        "address": "延平路121号",
        "name": "三和大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.31875,
            31.045662
        ],
        "address": "新飞路1756号",
        "name": "翔展创客园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.262346,
            31.330755
        ],
        "address": "双单路889弄",
        "name": "臻品嘉园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.278321,
            31.076286
        ],
        "address": "洞宁路655弄",
        "name": "润景苑",
        "count": 81,
        "style": 0
    },
    {
        "lnglat": [
            121.538044,
            31.206399
        ],
        "address": "浦建路1086弄",
        "name": "锦绣华庭",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.449333,
            31.144575
        ],
        "address": "龙吴路1137弄17.18号",
        "name": "百龙小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.318314,
            31.038684
        ],
        "address": "新飞路1500号",
        "name": "上海市松江科技创业中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.426695,
            31.280133
        ],
        "address": "沪太路1108号",
        "name": "五冶广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.213956,
            31.230592
        ],
        "address": "华志路1258号-1",
        "name": "华志科创园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.347361,
            31.063517
        ],
        "address": "金都西路833号",
        "name": "松港商务园_金都西路",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.498178,
            31.344253
        ],
        "address": "淞发路25弄",
        "name": "鎏园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.807597,
            30.955046
        ],
        "address": "祥凯路2013弄",
        "name": "天健翠园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.515136,
            31.090438
        ],
        "address": "立跃路2795号",
        "name": "上海由谷产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.34217,
            31.395465
        ],
        "address": "罗真路188弄1-21号",
        "name": "罗兰佳苑东区",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.080571,
            30.87311
        ],
        "address": "润兴路8弄",
        "name": "金山玫瑰公馆",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.436307,
            31.374545
        ],
        "address": "宝杨路3288弄",
        "name": "宝启花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.503246,
            31.153061
        ],
        "address": "上南路3899弄",
        "name": "瀚林苑（恒大翰城）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.45158,
            30.941561
        ],
        "address": "奉浦大道518号",
        "name": "海业大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.16591,
            31.164706
        ],
        "address": "崧复路777号",
        "name": "集池宇科创空间",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.371415,
            31.229112
        ],
        "address": "云岭西路356弄",
        "name": "璨申众创空间",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.413321,
            31.270408
        ],
        "address": "大华一路210号",
        "name": "大华虎城嘉年华",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.558883,
            31.206094
        ],
        "address": "樱花路802弄",
        "name": "大唐国际公寓",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.407878,
            31.296639
        ],
        "address": "真大路520号",
        "name": "米谷创业园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.25389,
            31.084401
        ],
        "address": "洞舟路459号",
        "name": "亿弘实业工业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.497026,
            31.340224
        ],
        "address": "逸仙路3000号",
        "name": "上海国际工业设计中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.450635,
            31.200074
        ],
        "address": "乌鲁木齐南路299号",
        "name": "联业大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.442357,
            31.287997
        ],
        "address": "万荣路959号",
        "name": "悦舜959创意生活广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.486237,
            31.289033
        ],
        "address": "中山北一路1100弄",
        "name": "新华一村干休所",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.462035,
            31.2473
        ],
        "address": "天目中路749弄71号",
        "name": "海鸥康恒大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.421023,
            31.186548
        ],
        "address": "柳州路980弄",
        "name": "中瑞公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.499641,
            31.210531
        ],
        "address": "中山南路1358弄",
        "name": "中福花苑二期",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.550114,
            31.250093
        ],
        "address": "浦东大道2123号",
        "name": "龙珠广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.537378,
            31.054323
        ],
        "address": "浦连路439弄",
        "name": "浦江丽都一期",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.448249,
            31.318855
        ],
        "address": "共和新路4703弄100号",
        "name": "民主花苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.74761,
            31.071668
        ],
        "address": "拱海路595弄",
        "name": "兰丽苑东苑",
        "count": 79,
        "style": 0
    },
    {
        "lnglat": [
            121.532598,
            31.224828
        ],
        "address": "世纪大道1500号",
        "name": "东方大厦（上海）",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.345139,
            31.139401
        ],
        "address": "中春路7089号",
        "name": 7089,
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.530135,
            31.243
        ],
        "address": "浦东大道1093弄",
        "name": "名门滨江苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.482556,
            31.196757
        ],
        "address": "蒙自路763号",
        "name": "丰盛创建大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.807586,
            30.910747
        ],
        "address": "云汉路978弄",
        "name": "荷风景庭",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.478679,
            31.271071
        ],
        "address": "西江湾路388号",
        "name": "凯德龙之梦虹口广场(商场)",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.495951,
            31.26335
        ],
        "address": "临平路333号",
        "name": "瑞虹新城一期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.356702,
            31.642738
        ],
        "address": "新闸路218号",
        "name": "中泰公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.434288,
            30.919209
        ],
        "address": "运河北路258号",
        "name": "绿地方舟",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.396728,
            31.324751
        ],
        "address": "纬地路375弄",
        "name": "经纬城市绿洲泓汇地标家园",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.489622,
            31.204295
        ],
        "address": "西藏南路1433弄",
        "name": "新中苑生活大师",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.436387,
            31.218867
        ],
        "address": "镇宁路233号",
        "name": "荣轩大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.447707,
            31.240093
        ],
        "address": "江宁路838号",
        "name": "富容大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.533564,
            31.266482
        ],
        "address": "宁国路399号",
        "name": "碧桂园中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.43712,
            31.241639
        ],
        "address": "常德路1258弄",
        "name": "上青佳园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.478755,
            31.2567
        ],
        "address": "宝通路239弄",
        "name": "包运大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.431566,
            31.237205
        ],
        "address": "长寿路748弄1号",
        "name": "湖南大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.456787,
            31.291393
        ],
        "address": "广延路1199弄",
        "name": "明园森林都市叠翠苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.600717,
            31.333592
        ],
        "address": "泰谷路85号",
        "name": "永富大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.352516,
            30.726865
        ],
        "address": "龙胜路67号",
        "name": "合生海景公馆",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.804755,
            30.911409
        ],
        "address": "云汉路1096弄",
        "name": "荷风华庭",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.484916,
            31.295598
        ],
        "address": "纪念路486弄",
        "name": "荣振大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.378704,
            31.085472
        ],
        "address": "银都路4277号",
        "name": "金地威新闵行科创园(银都路园)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.391103,
            31.253564
        ],
        "address": "真北路2167号",
        "name": "鸿海大厦（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.518628,
            30.913792
        ],
        "address": "福光路160弄",
        "name": "贤浦名苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.385309,
            31.145346
        ],
        "address": "古龙路1065弄",
        "name": "新时代富嘉花园",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.429684,
            31.395957
        ],
        "address": "杨泰路2158弄50-68号",
        "name": "远洋悦庭三期",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.587682,
            31.349648
        ],
        "address": "外高桥保税区基隆路1号",
        "name": "汤臣国际贸易大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.191497,
            31.011243
        ],
        "address": "乐都西路1455弄",
        "name": "华亭新家银杏苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.628366,
            31.300499
        ],
        "address": "美约路166号",
        "name": "美约路166号园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.424867,
            31.22597
        ],
        "address": "长宁支路237弄1号",
        "name": "长芝大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.267438,
            31.101711
        ],
        "address": "沪松公路3128弄",
        "name": "永翔商务广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.536135,
            31.292835
        ],
        "address": "松花江路251弄",
        "name": "白玉兰广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.467629,
            31.204537
        ],
        "address": "瑞金南路1号",
        "name": "海兴广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.548322,
            31.243248
        ],
        "address": "苗圃路218弄",
        "name": "维多利华庭",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.379297,
            31.325796
        ],
        "address": "华秋路349弄",
        "name": "保利叶之林",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.482378,
            31.226281
        ],
        "address": "淮海东路45号",
        "name": "东淮海国际大厦(东淮海壹号)",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.481458,
            31.17104
        ],
        "address": "耀华路550弄",
        "name": "耀华大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.581849,
            31.196909
        ],
        "address": "晨晖路88号",
        "name": "金蝶软件园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.562641,
            31.204162
        ],
        "address": "龙阳路2277弄",
        "name": "永达国际大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.808834,
            30.901376
        ],
        "address": "池月路333弄",
        "name": "丽都华庭",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.352205,
            31.221836
        ],
        "address": "金钟路968号",
        "name": "天会商务广场(原凌空SOHO)",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.493903,
            31.254794
        ],
        "address": "梧州路218弄",
        "name": "中皇广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.522271,
            31.241137
        ],
        "address": "昌邑路600号",
        "name": "万源晶典公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.475763,
            31.258551
        ],
        "address": "中兴路373号",
        "name": "兴园373号",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.700093,
            31.175652
        ],
        "address": "华戴路599弄 ",
        "name": "凯佳公寓二期",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.433641,
            31.365594
        ],
        "address": "薀川路516号",
        "name": "泰德商务大厦(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.41165,
            31.163684
        ],
        "address": "漕宝路400号",
        "name": "明申商务广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.597598,
            31.199284
        ],
        "address": "晨晖路828弄",
        "name": "张江汤臣豪园三期",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.46929,
            31.319952
        ],
        "address": "殷高西路711号",
        "name": "高境文化广场",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.628295,
            31.155225
        ],
        "address": "康桥东路1088号",
        "name": "松港1088创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.724786,
            31.229014
        ],
        "address": "环庆南路239",
        "name": "庆利苑",
        "count": 78,
        "style": 0
    },
    {
        "lnglat": [
            121.582134,
            31.201634
        ],
        "address": "祖冲之路295号",
        "name": "夏新大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.523879,
            31.202854
        ],
        "address": "北园路258弄",
        "name": "东方汇景苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.467559,
            31.199779
        ],
        "address": "瑞金南路458弄",
        "name": "瑞金南苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.446246,
            31.189276
        ],
        "address": "斜土路2526号",
        "name": "新亚徐汇公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.609393,
            31.036703
        ],
        "address": "航头路118号",
        "name": "宏澜商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.490195,
            31.228313
        ],
        "address": "丽水路58号",
        "name": "城隍珠宝",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.521924,
            31.082495
        ],
        "address": "三鲁公路3398号",
        "name": "上海国茸浦江科创园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.454893,
            31.256927
        ],
        "address": "芷江西路593弄",
        "name": "锦福公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.437472,
            31.169224
        ],
        "address": "龙漕路51弄4号",
        "name": "银星名庭",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.508518,
            31.297191
        ],
        "address": "国定路335号",
        "name": "杨浦科技创业中心",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.390666,
            31.175451
        ],
        "address": "环镇南路88弄58号",
        "name": "苹果园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.523049,
            31.232924
        ],
        "address": "东方路428号",
        "name": "宏声商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.328051,
            31.124839
        ],
        "address": "沪亭南路208弄",
        "name": "紫金花园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.445927,
            31.195578
        ],
        "address": "宛平南路75号",
        "name": "建科大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.27659,
            31.023094
        ],
        "address": "松胜路758号",
        "name": "松胜路758号商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.535069,
            31.198824
        ],
        "address": "东绣路1155弄",
        "name": "中福公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.403451,
            31.217147
        ],
        "address": "娄山关路999弄",
        "name": "上海春天花园",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.466442,
            31.230581
        ],
        "address": "南京西路555号",
        "name": "555大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.593215,
            31.246659
        ],
        "address": "新金桥路58号",
        "name": "银东大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.441804,
            31.228477
        ],
        "address": "延平路98号",
        "name": "98创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.493302,
            31.092743
        ],
        "address": "浦锦路1266-1328号",
        "name": "新浦江城四期LOFT",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.454339,
            31.230282
        ],
        "address": "北京西路1068号",
        "name": "银发大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.515069,
            31.208053
        ],
        "address": "浦东南路2162号",
        "name": "浦江2162",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.232218,
            31.151771
        ],
        "address": "沪青平公路2799弄",
        "name": "珠江国际中心悦公馆",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.450439,
            31.231135
        ],
        "address": "西康路300号",
        "name": "本本大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.512016,
            30.941656
        ],
        "address": "清宁路469弄",
        "name": "白沙西苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.501827,
            31.286965
        ],
        "address": "国康路100号",
        "name": "上海国际设计中心",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.492594,
            31.092598
        ],
        "address": "浦锦路1275号",
        "name": "浦锦新天地",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.436204,
            31.361176
        ],
        "address": "莲花山路817弄",
        "name": "康桥水都第一街区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.408156,
            31.313805
        ],
        "address": "上大路1号",
        "name": "文景楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.511033,
            31.257076
        ],
        "address": "保定路20弄10-40号",
        "name": "云舫小区",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.26206,
            31.366047
        ],
        "address": "沪宜公路3066弄",
        "name": "南北周嘉苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.59252,
            31.344357
        ],
        "address": "奥纳路79号2幢",
        "name": "交能国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.487248,
            31.250734
        ],
        "address": "海宁路307号",
        "name": "爱思大厦",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.374353,
            31.17844
        ],
        "address": "金汇路465-1临",
        "name": "星发大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.343337,
            31.145715
        ],
        "address": "中春路7628号",
        "name": "优房商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.387583,
            31.178567
        ],
        "address": "吴中路1050号",
        "name": "虹桥盛世莲花广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.529657,
            31.258171
        ],
        "address": "平凉路1090弄",
        "name": "天科国际商务楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.24595,
            31.090508
        ],
        "address": "塘浚路51弄",
        "name": "塘和家园齐康苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.591942,
            31.336554
        ],
        "address": "杨高北路1188号",
        "name": "阳明花园广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.433119,
            31.195256
        ],
        "address": "广元西路303号",
        "name": "丰业广元公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.519381,
            31.228601
        ],
        "address": "张杨路655号",
        "name": "福兴大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.523026,
            31.27144
        ],
        "address": "春常路142号",
        "name": "抱家燕汇谷智慧产业园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.133421,
            31.140312
        ],
        "address": "华青南路99弄",
        "name": "仁恒运杰河滨花园",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.474194,
            31.198656
        ],
        "address": "瞿溪路1072弄",
        "name": "南园新村",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.524069,
            31.259029
        ],
        "address": "许昌路630弄",
        "name": "全家福家园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.494252,
            31.257101
        ],
        "address": "海伦路178号",
        "name": "宏伦大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.749953,
            31.151138
        ],
        "address": "航城三路288弄",
        "name": "同悦湾华庭北区",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.565959,
            31.180729
        ],
        "address": "新陈路303弄",
        "name": "莲泰苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.396606,
            31.194398
        ],
        "address": "荣华东道59弄",
        "name": "里昂花园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.43258,
            31.185365
        ],
        "address": "裕德路168号",
        "name": "徐汇商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.424669,
            31.206723
        ],
        "address": "定西路710弄59-67号",
        "name": "云阳花苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.462317,
            31.27449
        ],
        "address": "延长路99弄",
        "name": "峥宸苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.37496,
            31.216119
        ],
        "address": "天山西路125号",
        "name": "宜嘉坊",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.335118,
            31.230969
        ],
        "address": "北沈路288弄",
        "name": "万博欣园",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.398039,
            31.27484
        ],
        "address": "真金路577弄，武威东路477弄，武威东路479弄",
        "name": "颐和华城",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.390671,
            31.168786
        ],
        "address": "宜山路1698号",
        "name": "兴迪商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.366934,
            31.239787
        ],
        "address": "金沙江路2348弄",
        "name": "金沙雅苑一期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.281839,
            31.318449
        ],
        "address": "育英南街55弄",
        "name": "恒大御景湾(上海)",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.513622,
            31.254452
        ],
        "address": "东大名路999号",
        "name": "北外滩来福士广场",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.359674,
            31.362645
        ],
        "address": "潘广路1765号",
        "name": "馨佳园七街坊",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.417498,
            31.232958
        ],
        "address": "宁夏路366弄",
        "name": "绿地世家",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.43823,
            31.27683
        ],
        "address": "广中西路883弄",
        "name": "景星苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.516984,
            31.296185
        ],
        "address": "黄兴路2053弄",
        "name": "蓝天小区2号院",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.436634,
            31.168426
        ],
        "address": "龙漕路38弄",
        "name": "龙漕家园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.437992,
            31.242691
        ],
        "address": "西康路1255号",
        "name": "普陀科技大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.391448,
            31.235648
        ],
        "address": "中江路889号",
        "name": "曹杨商务大厦",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.635132,
            31.09813
        ],
        "address": "蓝靛路1488号",
        "name": "阳光城丽景湾（上海丽景湾）",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.369101,
            31.255942
        ],
        "address": "曹安路4671号",
        "name": "上海北虹桥协通产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.493243,
            31.293377
        ],
        "address": "邯郸路43号",
        "name": "中观产业园（中观大厦）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.437532,
            31.204122
        ],
        "address": "淮海中路1950弄2号",
        "name": "兴国大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.49155,
            31.26382
        ],
        "address": "临平北路88号",
        "name": "虹诚大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.485281,
            31.232814
        ],
        "address": "北京东路668号",
        "name": "科技京城",
        "count": 69,
        "style": 0
    },
    {
        "lnglat": [
            121.50088,
            31.348969
        ],
        "address": "逸仙路3508弄",
        "name": "尚城汇景园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.482275,
            31.284152
        ],
        "address": "广纪路173弄",
        "name": "香杉商务中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.490801,
            31.116904
        ],
        "address": "芦恒路378弄",
        "name": "一品漫城四五期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.388453,
            31.190821
        ],
        "address": "虹许路731号",
        "name": "老外街国际文创生活园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.498708,
            31.14964
        ],
        "address": "灵岩南路769弄",
        "name": "源城锦苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.495667,
            31.207939
        ],
        "address": "普育东路200弄",
        "name": "东元坊",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.5263,
            31.25638
        ],
        "address": "怀德路366弄",
        "name": "保利香槟花园二期保利香槟花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.430622,
            31.334516
        ],
        "address": "场北路399弄",
        "name": "新梅绿岛苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.434646,
            31.214075
        ],
        "address": "延安西路777号",
        "name": "裕丰国际广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.30699,
            31.134414
        ],
        "address": "沪松公路1658号",
        "name": "九润商务大厦(九亭)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.452773,
            31.266662
        ],
        "address": "洛川中路777弄",
        "name": "悠和家园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.482101,
            31.197581
        ],
        "address": "蒙自路757号",
        "name": "平安滨江金融中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.49438,
            31.286295
        ],
        "address": "中山北二路1800号",
        "name": "海鸥商务大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.763622,
            31.044575
        ],
        "address": "城东路96弄",
        "name": "惠城大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.429076,
            31.391743
        ],
        "address": "白沙园路333弄",
        "name": "四季都会（荣万宝邸）",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.484658,
            31.294174
        ],
        "address": "广纪路838号",
        "name": "中国出版蓝桥创意产业园A楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.533011,
            31.0612
        ],
        "address": "江文路688弄",
        "name": "闵浦新苑四村",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.491652,
            31.244506
        ],
        "address": "黄浦路53号",
        "name": "海湾大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.227826,
            31.010721
        ],
        "address": "人民北路71弄",
        "name": "松石苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.482506,
            31.210518
        ],
        "address": "制造局路27号",
        "name": "紫宇大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.389015,
            31.306328
        ],
        "address": "丰皓路658弄1-14号",
        "name": "丰皓苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.519579,
            31.199959
        ],
        "address": "东方路1968弄",
        "name": "馥园(东方名筑）",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.364512,
            31.171612
        ],
        "address": "紫藤路99弄",
        "name": "紫藤居",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.465869,
            31.267022
        ],
        "address": "平型关路108弄",
        "name": "108广场（金银108创意广场）",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.472133,
            31.241102
        ],
        "address": "西藏北路18号",
        "name": "四行天地",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.589315,
            31.242488
        ],
        "address": "红枫路300弄，碧云路1188,1202,1218号",
        "name": "碧云东方公寓",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.475448,
            31.204609
        ],
        "address": "鲁班路277号299号",
        "name": "银杏家园2",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.383632,
            31.272777
        ],
        "address": "真南路822弄129号",
        "name": "李子园同济科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.497363,
            30.959489
        ],
        "address": "广丰路100弄",
        "name": "金水佳苑",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.442355,
            31.246054
        ],
        "address": "江宁路1306弄7号",
        "name": "富丽大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.531605,
            31.217184
        ],
        "address": "峨山路91弄101号5号楼",
        "name": "陆家嘴科技园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.773368,
            31.128137
        ],
        "address": "祝潘公路699号",
        "name": "嘉荣商务广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.417634,
            31.230658
        ],
        "address": "顺义路188号",
        "name": "顺达公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.413366,
            31.094805
        ],
        "address": "绿莲路99弄、绿莲路100弄",
        "name": "银河新都",
        "count": 149,
        "style": 0
    },
    {
        "lnglat": [
            121.52138,
            31.07753
        ],
        "address": "联航路1369号",
        "name": "浦江人才公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.432332,
            31.366799
        ],
        "address": "红林路99弄",
        "name": "印象苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.486051,
            31.254354
        ],
        "address": "吴淞路669号",
        "name": "申贝大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.393628,
            31.193956
        ],
        "address": "水城南路17号",
        "name": "万科广场17号",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.523474,
            31.227776
        ],
        "address": "东方路778号",
        "name": "上海紫金山大酒店（江苏大厦）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.521391,
            31.325828
        ],
        "address": "政悦路88弄",
        "name": "涵碧景苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.464409,
            31.228841
        ],
        "address": "青海路132号",
        "name": "云海苑（公寓楼）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.486619,
            31.254395
        ],
        "address": "衡水路89弄1号",
        "name": "国际明佳城",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.252424,
            31.034092
        ],
        "address": "茸平路333弄",
        "name": "国乐广场",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.17368,
            31.350544
        ],
        "address": "恒荣路589号",
        "name": "恒荣府邸",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.564418,
            31.225961
        ],
        "address": "锦绣路300弄",
        "name": "浦东虹桥花园",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.467304,
            31.28559
        ],
        "address": "广灵四路561弄",
        "name": "中虹翡翠苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.42676,
            31.280139
        ],
        "address": "沪太路1111弄",
        "name": "静安大融城",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.118875,
            31.139432
        ],
        "address": "青松路405弄",
        "name": "帕缇欧香苑三期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.441939,
            31.194865
        ],
        "address": "肇嘉浜路1033号",
        "name": "徐家汇国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.433907,
            31.252038
        ],
        "address": "普陀区中山北路1759号",
        "name": "浦发广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.594527,
            31.31745
        ],
        "address": "兰嵩路555号",
        "name": "森兰美伦公寓楼",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.534769,
            31.261596
        ],
        "address": "眉州路381号",
        "name": "华谊星城大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.466867,
            31.23407
        ],
        "address": "成都北路600号",
        "name": "中华保险华盛大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.434092,
            31.170354
        ],
        "address": "漕溪路250号",
        "name": "银海大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.510712,
            31.178701
        ],
        "address": "东明路511弄",
        "name": "昌里雅苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.460681,
            31.330777
        ],
        "address": "虎林路159弄 ",
        "name": "丽雅花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.246694,
            31.370522
        ],
        "address": "富蕴路555弄",
        "name": "景河名苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.445591,
            31.282122
        ],
        "address": "灵石路666弄",
        "name": "大宁八一坊",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.411664,
            31.209053
        ],
        "address": "天山路1855号",
        "name": "联业大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.630611,
            31.265211
        ],
        "address": "金吉路778号",
        "name": "中国浦发囯机园区",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.486898,
            31.104716
        ],
        "address": "北江榉路588弄",
        "name": "万科早城",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.397609,
            31.195204
        ],
        "address": "黄金城道777号",
        "name": "黄金豪园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.437472,
            31.169224
        ],
        "address": "龙漕路51弄4号",
        "name": "现代商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.403093,
            31.053339
        ],
        "address": "瓶北路155号",
        "name": "英格尔认证检测大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.3653,
            31.342862
        ],
        "address": "宝菊路133弄",
        "name": "保利叶语",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.471495,
            31.202463
        ],
        "address": "斜土路791号",
        "name": "三毛集团办公楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.484769,
            31.230649
        ],
        "address": "延安东路175号",
        "name": "旺角广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.47343,
            31.224466
        ],
        "address": "金陵西路28号",
        "name": "金陵大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.468185,
            31.273473
        ],
        "address": "同丰路667号",
        "name": "紫金公馆",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.343541,
            31.15862
        ],
        "address": "七莘路3333号",
        "name": "万科城市花园老区",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.456019,
            31.393023
        ],
        "address": "友谊路1508号",
        "name": "晶钢商务馆",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.436868,
            31.335393
        ],
        "address": "场北路39弄",
        "name": "和欣国际花园",
        "count": 74,
        "style": 0
    },
    {
        "lnglat": [
            121.435863,
            31.164548
        ],
        "address": "宾阳路28弄",
        "name": "保利星苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.480505,
            31.267053
        ],
        "address": "东江湾路188号",
        "name": "空间188创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.426357,
            31.227985
        ],
        "address": "长宁支路125弄",
        "name": "长宁88金廷",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.439232,
            31.240733
        ],
        "address": "长寿路285号",
        "name": "恒达大厦A幢",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.409797,
            31.20594
        ],
        "address": "中山西路800弄57号",
        "name": "紫虹大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.553022,
            31.238713
        ],
        "address": "南洋泾路280号",
        "name": "中新公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.433973,
            31.235328
        ],
        "address": "安远路710号",
        "name": "大昌商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.320541,
            31.075653
        ],
        "address": "明中路1800弄",
        "name": "明中苑",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.514515,
            30.955097
        ],
        "address": "百团路326弄",
        "name": "聚贤雅苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.445333,
            31.24297
        ],
        "address": "江宁路1078号",
        "name": "玉佛城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.429491,
            31.372677
        ],
        "address": "宝安公路7弄1号",
        "name": "上坤极客公寓宝安公路店",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.436514,
            31.15068
        ],
        "address": "龙川北路777弄",
        "name": "城开汇社区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.431549,
            31.183655
        ],
        "address": "凯旋路3188弄",
        "name": "凯旋豪庭",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.44431,
            31.225474
        ],
        "address": "北京西路1701号",
        "name": "静安中华大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.533159,
            31.242217
        ],
        "address": "浦东大道1139号",
        "name": "惠扬大厦",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.488133,
            31.266819
        ],
        "address": "欧阳路196号",
        "name": "法兰桥",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.547067,
            31.237423
        ],
        "address": "巨野路455弄",
        "name": "龙威名邸",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.513874,
            31.200284
        ],
        "address": "东三里桥路211弄",
        "name": "爱嘉苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.519236,
            31.230474
        ],
        "address": "商城路738号",
        "name": "胜康廖氏大厦",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.428911,
            31.089875
        ],
        "address": "金都路1199号",
        "name": "越界1199",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.395285,
            31.193907
        ],
        "address": "荣华东道19弄",
        "name": "鹿特丹花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.397716,
            31.169072
        ],
        "address": "虹梅路1905号",
        "name": "远中科研楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.612734,
            31.254791
        ],
        "address": "金港路333号",
        "name": "禹洲国际大厦(一期)",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.505464,
            31.324288
        ],
        "address": "国泓路818弄",
        "name": "绿地海珀璞晖",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.427794,
            31.194467
        ],
        "address": "番禺路1028号",
        "name": "番禺路1028号(上海数娱大厦)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.401469,
            31.04285
        ],
        "address": "中春路1088号",
        "name": "金地威新中科园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.50425,
            31.155128
        ],
        "address": "上南路3521号",
        "name": "宝丰生活广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.524086,
            31.071949
        ],
        "address": "三鲁公路2799号",
        "name": "禾谷文创四达园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.394555,
            31.235099
        ],
        "address": "怒江北路219弄1号",
        "name": "开开大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.605505,
            31.264735
        ],
        "address": "杨高北路5291弄",
        "name": "金桥新城（金石苑）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.484003,
            31.215966
        ],
        "address": "西藏南路748号",
        "name": "惠达大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.516531,
            31.023916
        ],
        "address": "汇延路199弄",
        "name": "瑞和城壹街区",
        "count": 79,
        "style": 0
    },
    {
        "lnglat": [
            121.448821,
            31.254805
        ],
        "address": "交通西路48弄",
        "name": "嘉华苑（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.432034,
            31.369481
        ],
        "address": "蕰川路1623号",
        "name": "柏丽华庭",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.489277,
            31.25336
        ],
        "address": "武进路41号",
        "name": "吉汇大厦(虹口SOHO)",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.3743,
            31.020555
        ],
        "address": "银康路750号",
        "name": "马桥景城和苑",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.457553,
            31.225353
        ],
        "address": "威海路755号",
        "name": "文新大厦(上海)",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.45767,
            31.222029
        ],
        "address": "巨鹿路417号",
        "name": "欣广大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.509197,
            31.261567
        ],
        "address": "长阳路8号",
        "name": "建爱大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.342913,
            31.389633
        ],
        "address": "美平路500弄1-14号",
        "name": "美罗家园绣苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.349338,
            31.466366
        ],
        "address": "潘泾路4777弄",
        "name": "宝山上河苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.475835,
            31.233751
        ],
        "address": "上海市黄浦区西藏中路336号",
        "name": "华旭国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.375401,
            31.099998
        ],
        "address": "中春路4999号",
        "name": "莘庄商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.508125,
            31.239183
        ],
        "address": "陆家嘴环路958号",
        "name": "华能联合大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.508401,
            31.259527
        ],
        "address": "唐山路835弄",
        "name": "家化公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.429699,
            31.235417
        ],
        "address": "长寿路822弄45支弄",
        "name": "汇丽花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.129697,
            31.178536
        ],
        "address": "华青路995弄",
        "name": "亿燕人才公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.924833,
            30.896969
        ],
        "address": "浦东新区临港新城申港大道87号",
        "name": "毓阳泓智大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.221689,
            31.40581
        ],
        "address": "城北路1355号",
        "name": "上海大学国家大学科技园嘉定基地",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.318255,
            31.109649
        ],
        "address": "松江区同利路2-4号",
        "name": "福贵诚工业园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.487794,
            31.29018
        ],
        "address": "中山北一路1200号",
        "name": "明道大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.372405,
            31.234687
        ],
        "address": "金沙江路1989号",
        "name": "金沙商务广场",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.415111,
            31.180898
        ],
        "address": "钦州北路567号",
        "name": "长春新苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.408311,
            31.135183
        ],
        "address": "梅陇西路413号",
        "name": "莲花商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.565302,
            31.159413
        ],
        "address": "沪南路2199号",
        "name": "万科海上传奇(御桥芳澜苑)",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.378301,
            31.214257
        ],
        "address": "新渔东路800号",
        "name": "莲森集团商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.530225,
            31.140498
        ],
        "address": "环林东路875弄",
        "name": "杉林新月三期",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.525872,
            31.174872
        ],
        "address": "华鹏路300弄",
        "name": "大华锦绣华城14街区",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.43331,
            31.244188
        ],
        "address": "常德路1436号",
        "name": "德诚大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.373252,
            31.233684
        ],
        "address": "金沙江路1959号",
        "name": "金环商务花园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.505292,
            31.071932
        ],
        "address": "联航路2015弄1-43",
        "name": "世博家园十四街坊",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.189535,
            31.014746
        ],
        "address": "乐都西路1558弄",
        "name": "万科金色华亭",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.404415,
            31.171015
        ],
        "address": "宜山路889号",
        "name": "齐来大厦及齐来工业城",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.479059,
            31.256168
        ],
        "address": "宝通路157弄",
        "name": "和馨苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.45813,
            31.348667
        ],
        "address": "呼兰路201弄",
        "name": "智慧大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.235233,
            31.18952
        ],
        "address": "凤徐路85弄",
        "name": "新丰公寓",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.438106,
            31.24211
        ],
        "address": "西康路1249弄",
        "name": "泰极大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.512653,
            31.327625
        ],
        "address": "政和路388弄",
        "name": "仁恒怡庭",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.613729,
            31.25581
        ],
        "address": "金豫路50弄",
        "name": "禹洲国际大厦（二期）",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.232195,
            31.368393
        ],
        "address": "嘉安公路200弄1-30号",
        "name": "绿洲丰怡园",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.437801,
            31.137013
        ],
        "address": "上中路55弄",
        "name": "长桥一村",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.510898,
            31.229468
        ],
        "address": "商城路341号",
        "name": "紫光大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.3929,
            31.196564
        ],
        "address": "水城南路55号",
        "name": "六月汇",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.489113,
            31.231282
        ],
        "address": "延安东路45号",
        "name": "工商联大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.482329,
            31.239307
        ],
        "address": "北京东路431号",
        "name": "松柏公寓(上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.374975,
            31.019485
        ],
        "address": "银康路735弄",
        "name": "马桥景城元景富文苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.385306,
            31.153007
        ],
        "address": "东兰路1111号",
        "name": "欧风花都",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.423473,
            31.216383
        ],
        "address": "定西路1310弄10号",
        "name": "建宁大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.420885,
            31.205137
        ],
        "address": "新华路664号",
        "name": "万宝国际商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.163724,
            31.296361
        ],
        "address": "安亭镇墨玉路151号",
        "name": "墨玉商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.473263,
            31.253149
        ],
        "address": "永兴路258弄1号楼",
        "name": "兴亚广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.391777,
            31.236641
        ],
        "address": "怒江北路302弄",
        "name": "中天新曹杨商务楼",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.387983,
            31.18755
        ],
        "address": "虹梅路3200弄",
        "name": "虹桥花苑",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.393252,
            31.198104
        ],
        "address": "水城南路348弄",
        "name": "金麟公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.324572,
            31.289859
        ],
        "address": "众仁路399号",
        "name": "上海运通星财富广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.42717,
            31.23071
        ],
        "address": "长寿路1118号",
        "name": "悦达国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.282077,
            31.042837
        ],
        "address": "曹农路538号",
        "name": "上海娃娃谷工业园(上海宏隆包装制品有限公司)",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.4743,
            31.212699
        ],
        "address": "淡水路361号",
        "name": "淡水公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.327845,
            31.142867
        ],
        "address": "沪松公路1221号",
        "name": "星晨商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.466782,
            31.321316
        ],
        "address": "江杨南路880号",
        "name": "新杨湾科创园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.360765,
            31.244026
        ],
        "address": "丰庄路99弄",
        "name": "金沙丽晶苑一期",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.45,
            31.042717
        ],
        "address": "尚义路229弄",
        "name": "虹梅景苑二街坊",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.403637,
            31.243458
        ],
        "address": "兰溪路180号",
        "name": "安居兰庭",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.437962,
            30.933002
        ],
        "address": "张翁庙路525号",
        "name": "晨日科技创意园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.46251,
            30.930277
        ],
        "address": "航南公路5699号",
        "name": "奉贤宝龙城市广场(商务楼)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.458501,
            31.190303
        ],
        "address": "枫林路420号",
        "name": "枫林国际中心二期",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.43712,
            31.241639
        ],
        "address": "常德路1258弄",
        "name": "上青佳园",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.524446,
            31.301823
        ],
        "address": "翔殷路873弄",
        "name": "梅花村",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.535624,
            31.273522
        ],
        "address": "双阳路300弄",
        "name": "幸福苑(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.444151,
            31.237939
        ],
        "address": "西康路838号",
        "name": "康海大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.48104,
            31.225362
        ],
        "address": "淮海东路99号",
        "name": "恒积大厦",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.476424,
            31.238142
        ],
        "address": "广西北路528号",
        "name": "地王中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.550928,
            31.249472
        ],
        "address": "浦东大道2188号",
        "name": "上安商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.194321,
            31.272055
        ],
        "address": "浦东大道1525-1539号",
        "name": "中国石化大厦(上海)",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.443367,
            31.043678
        ],
        "address": "曹家塘路390弄",
        "name": "塘泾北苑",
        "count": 100,
        "style": 0
    },
    {
        "lnglat": [
            121.454166,
            31.280606
        ],
        "address": "共和新路2399弄",
        "name": "宝华现代城",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.55858,
            31.255931
        ],
        "address": "龙居路2弄",
        "name": "龙居苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.388255,
            31.168603
        ],
        "address": "万源路2138号",
        "name": "泓茂中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.442619,
            31.189382
        ],
        "address": "天钥桥路321号",
        "name": "天和苑综合办公楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.174064,
            31.147685
        ],
        "address": "沪青平公路3938弄",
        "name": "移动智地青浦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.404825,
            31.185383
        ],
        "address": "吴中路500号",
        "name": "涵博大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.587904,
            31.243796
        ],
        "address": "红枫路108弄",
        "name": "金桥酒店公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.58623,
            31.150897
        ],
        "address": "康桥路1789号",
        "name": "丰动力康桥中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.406209,
            31.204319
        ],
        "address": "遵义南路88号",
        "name": "协泰中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.370699,
            31.189711
        ],
        "address": "虹桥路2328弄",
        "name": "西郊家园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.260556,
            31.345663
        ],
        "address": " 阿克苏路1099号",
        "name": "宝龙城市广场_公寓楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.451168,
            31.134277
        ],
        "address": "罗秀路55弄",
        "name": "华馨公寓(上海)",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.492646,
            31.270572
        ],
        "address": "曲阳路167号",
        "name": "宏城公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.709631,
            31.178402
        ],
        "address": "川周公路8288弄",
        "name": "浦发馨汇佳苑",
        "count": 62,
        "style": 0
    },
    {
        "lnglat": [
            121.4322,
            31.191883
        ],
        "address": "虹桥路188号",
        "name": "元福大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.459944,
            31.202203
        ],
        "address": "肇嘉浜路359号",
        "name": "航天科工集团大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.536341,
            31.242488
        ],
        "address": "浦东大道1476号",
        "name": "山海大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.361631,
            31.256665
        ],
        "address": "定边路35号",
        "name": "东方汽配城",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.527085,
            31.076412
        ],
        "address": "联川路213号",
        "name": "新必产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.185221,
            31.345272
        ],
        "address": "恒永路328号",
        "name": "联东U谷上海嘉定国际企业港",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.501855,
            30.994017
        ],
        "address": "金闸公路959弄58号",
        "name": "奥帛金汇科创园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.443176,
            31.187389
        ],
        "address": "斜土路2601号",
        "name": "嘉汇广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.445497,
            31.237629
        ],
        "address": "海防路421号",
        "name": "静工园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.514901,
            31.077692
        ],
        "address": "恒南路851号、899号",
        "name": "浦江国际",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.374883,
            31.170356
        ],
        "address": "虹泉路1000号",
        "name": "井亭大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.610463,
            31.152817
        ],
        "address": "康桥东路518号",
        "name": "绿太阳园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.499371,
            31.10297
        ],
        "address": "江桦路199弄、200弄、399弄、400弄、600弄，江柳路200弄、400弄",
        "name": "华侨城一二期（新浦江城一期）",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.483217,
            31.287612
        ],
        "address": "中山北一路865弄21号",
        "name": "阜和综合楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.470536,
            31.263986
        ],
        "address": "宝昌路738弄",
        "name": "广盛公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.453731,
            31.125658
        ],
        "address": "华发路99弄",
        "name": "明丰新纪苑",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.546334,
            31.039666
        ],
        "address": "闵驰一路29弄1-22号",
        "name": "聚缘南庭",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.429641,
            31.133285
        ],
        "address": "天等路128弄",
        "name": "明秀公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.415599,
            31.212632
        ],
        "address": "武夷路718弄",
        "name": "武夷花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.450347,
            31.235997
        ],
        "address": "江宁路565、575号",
        "name": "康宁雅庭",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.44079,
            31.211168
        ],
        "address": "武康路112号",
        "name": "康兴公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.431603,
            31.203151
        ],
        "address": "法华镇路129号",
        "name": "上海新华豪庭",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.471864,
            31.203297
        ],
        "address": "南塘浜路133号",
        "name": "华业公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.583658,
            31.125172
        ],
        "address": "周东路782弄22支弄",
        "name": "日月星城（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.465675,
            31.215435
        ],
        "address": "香山路33号",
        "name": "香山丽舍",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.507413,
            31.2665
        ],
        "address": "大连路990号",
        "name": "海上海新城",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.213242,
            31.220698
        ],
        "address": "华隆路1758号",
        "name": "增洲大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.459416,
            31.231524
        ],
        "address": "北京西路819号",
        "name": "北泰电信大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.285864,
            31.106109
        ],
        "address": "泗砖路269弄",
        "name": "唯富科技产业园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.455261,
            31.240847
        ],
        "address": "汉中路333弄",
        "name": "河滨花园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.410677,
            31.229399
        ],
        "address": "中山西路933号",
        "name": "虹桥银城",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.443485,
            31.284547
        ],
        "address": "灵石路709号60幢",
        "name": "万灵谷花园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.474709,
            31.201626
        ],
        "address": "鲁班路388弄",
        "name": "海悦花园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.548009,
            31.150462
        ],
        "address": "锦绣路4899弄55号",
        "name": "天成科创园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.602222,
            31.119455
        ],
        "address": "康弘路428弄",
        "name": "达城锦园",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.604296,
            31.195003
        ],
        "address": "哈雷路998号",
        "name": "悦颂生命科学园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.60318,
            31.178137
        ],
        "address": "海趣路236号",
        "name": "绿地Mtown",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.450984,
            31.370626
        ],
        "address": "杨鑫路98弄",
        "name": "禄德华苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.519956,
            31.176507
        ],
        "address": "杨高南路2875号",
        "name": "康琳大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.407039,
            31.130704
        ],
        "address": "莲花南路155弄",
        "name": "世纪苑",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.561181,
            31.22512
        ],
        "address": "芳甸路333号",
        "name": "水清木华国际公寓",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.43842,
            31.188651
        ],
        "address": "南丹东路300弄",
        "name": "亚都商务楼",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.491354,
            31.262052
        ],
        "address": "银欣路38号",
        "name": "麒麟大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.276843,
            31.271724
        ],
        "address": "翔江公路2299号",
        "name": "北虹桥松日2299广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.193667,
            30.793226
        ],
        "address": "新村路550弄",
        "name": "西部名邸",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.380541,
            31.025126
        ],
        "address": "富卓路789号65栋-79栋",
        "name": "马桥景城品雅苑三期",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.61244,
            31.255838
        ],
        "address": "金湘路201弄15号",
        "name": "禹洲燕海国际大厦(三期)",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.441111,
            31.229073
        ],
        "address": "延平路128号",
        "name": "盛达园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.405889,
            31.160577
        ],
        "address": "桂平路333号",
        "name": "上海桂林科技园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.63632,
            31.058333
        ],
        "address": "新场镇康新公路1588号",
        "name": "千禾创业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.523268,
            31.08942
        ],
        "address": "新骏环路115号",
        "name": "寰启商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.395275,
            31.211953
        ],
        "address": "芙蓉江路276弄1号",
        "name": "天华公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.501616,
            31.078164
        ],
        "address": "南江燕路229弄1-106边门",
        "name": "世博家园八街坊",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.569029,
            31.134246
        ],
        "address": "康沈路633弄、秀沿路867弄、秀沿路836弄",
        "name": "中邦城市园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.373187,
            31.172009
        ],
        "address": "吴中路1439号",
        "name": "莱茵虹景中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.375973,
            31.185154
        ],
        "address": "合川路3111号",
        "name": "近铁虹桥中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.600807,
            31.252279
        ],
        "address": "浙桥路277号",
        "name": "碧海现代苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.524708,
            31.151032
        ],
        "address": "尚博路799弄",
        "name": "金橘新苑北区",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.403054,
            31.143937
        ],
        "address": "顾戴路251弄",
        "name": "成亿家园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.45856,
            31.239926
        ],
        "address": "恒丰路31号",
        "name": "金峰大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.463639,
            31.292314
        ],
        "address": "汶水东路918号",
        "name": "信南都市型产业园区5号楼信南商务大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.441925,
            31.327783
        ],
        "address": "共和新路5308弄32号",
        "name": "上海共康创意设计园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.464432,
            31.218693
        ],
        "address": "淮海中路755号",
        "name": "新华联大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.539968,
            31.234243
        ],
        "address": "张杨路1518弄",
        "name": "金博尚品苑办公楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.501171,
            31.260327
        ],
        "address": "公平路768弄",
        "name": "东方都市景苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.48364,
            31.237328
        ],
        "address": "南京东路328号雅戈尔大厦",
        "name": "雅戈尔大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.495465,
            31.204877
        ],
        "address": "中山南路1669弄69号",
        "name": "中山大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.571815,
            31.266393
        ],
        "address": "浦东大道2742弄",
        "name": "中环滨江大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.398116,
            31.280799
        ],
        "address": "古浪路55弄",
        "name": "祥和星宇",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.436278,
            31.174917
        ],
        "address": "漕溪路167弄",
        "name": "铭源大楼（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.519479,
            31.274098
        ],
        "address": "江浦路1508号",
        "name": "东方星座酒店公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.605622,
            31.312963
        ],
        "address": "加枫路28号",
        "name": "新康楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.729066,
            31.018822
        ],
        "address": "园通路128号",
        "name": "东方智谷",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.469953,
            31.200774
        ],
        "address": "斜土路810弄",
        "name": "郁金香花苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.391483,
            31.105161
        ],
        "address": "宝城路155弄",
        "name": "名都新城一二期",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.570528,
            31.104846
        ],
        "address": "沪南公路3665号",
        "name": "上海金盾大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.513991,
            31.205644
        ],
        "address": "浦东南路2240号",
        "name": "永业商业大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.456919,
            31.245138
        ],
        "address": "天目西路218号",
        "name": "嘉里不夜城一期",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.316721,
            31.095582
        ],
        "address": "九新公路877号",
        "name": "临港卓越科技园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.265936,
            31.340099
        ],
        "address": "希望路689弄",
        "name": "嘉定宝龙中心（三期）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.580809,
            31.117662
        ],
        "address": "周市路416号",
        "name": "慧晶国际公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.494745,
            31.29462
        ],
        "address": "邯郸路98号",
        "name": "上海无锡大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432529,
            31.339794
        ],
        "address": "呼兰西路123号",
        "name": "龙盛活力小镇",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.474468,
            31.213985
        ],
        "address": "合肥路289弄（淡水路）",
        "name": "复兴苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.52413,
            31.226568
        ],
        "address": "东方路800号",
        "name": "宝安大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.704102,
            31.176698
        ],
        "address": "妙川路800弄",
        "name": "阳光城愉景湾（上海愉景湾）",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.477367,
            31.233247
        ],
        "address": "汉口路689弄",
        "name": "中福城三期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.491257,
            31.262872
        ],
        "address": "四平路200号",
        "name": "盛泰国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.365134,
            31.110269
        ],
        "address": "西环路629号",
        "name": "同久文创园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.62867,
            31.299507
        ],
        "address": "富特东三路526号",
        "name": "外高桥国际智能制造服务产业园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.36686,
            31.208721
        ],
        "address": "仙霞西路300弄",
        "name": "虹康花苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.508043,
            31.252593
        ],
        "address": "东大名路1089号",
        "name": "北外滩来福士办公楼东塔",
        "count": 116,
        "style": 0
    },
    {
        "lnglat": [
            121.495055,
            31.214645
        ],
        "address": "中华路868弄",
        "name": "明日星城二期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.489071,
            31.212564
        ],
        "address": "陆家浜路1011号",
        "name": "新世纪大厦酒店式公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.389545,
            31.352894
        ],
        "address": "顾荻路161弄",
        "name": "韶光花园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.404991,
            31.162518
        ],
        "address": "漕宝路650号",
        "name": "知汇大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.389801,
            31.267796
        ],
        "address": "交通路4703弄",
        "name": "李子园商务区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.314433,
            31.11853
        ],
        "address": "九新公路800号",
        "name": "临港电姆产业园",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.372189,
            31.252689
        ],
        "address": "祁连山南路2199号",
        "name": "真新商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.529989,
            31.256472
        ],
        "address": "龙江路370弄",
        "name": "丹江商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.274735,
            31.043686
        ],
        "address": "明南路85号",
        "name": "启迪漕河泾（中山）科技园水紫荆园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.427621,
            31.109627
        ],
        "address": "兴梅路485号",
        "name": "中环科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.447691,
            31.294667
        ],
        "address": "共和新路3088弄",
        "name": "祥腾财富广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.285864,
            31.106109
        ],
        "address": "泗砖路269弄",
        "name": "唯富科技产业园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.510382,
            31.227911
        ],
        "address": "商城路108弄",
        "name": "汇豪天下",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.313953,
            31.283326
        ],
        "address": "银翔路1227弄",
        "name": "安居时代广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.471266,
            31.207382
        ],
        "address": "徐家汇路518号",
        "name": "天天花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.439351,
            31.240484
        ],
        "address": "长寿路295弄8号",
        "name": "恒达公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.481364,
            31.252342
        ],
        "address": "罗浮路89弄",
        "name": "金芙世纪公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.516393,
            31.336475
        ],
        "address": "政和路999弄",
        "name": "合生江湾国际公寓（上海合生江湾）",
        "count": 89,
        "style": 0
    },
    {
        "lnglat": [
            121.44153,
            31.247049
        ],
        "address": "澳门路356号",
        "name": "三维大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.49412,
            31.213578
        ],
        "address": "河南南路1009弄",
        "name": "明日星城",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.332184,
            31.229106
        ],
        "address": "北华路22弄",
        "name": "虹桥乐贤居",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.364555,
            31.098832
        ],
        "address": "莘松路855号",
        "name": "青春商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.376466,
            31.191264
        ],
        "address": "虹桥路2272号",
        "name": "虹桥商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.217919,
            31.248666
        ],
        "address": "华昌路9号",
        "name": "金象大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.22955,
            31.180953
        ],
        "address": "凤马塘路200弄",
        "name": "瑞和锦庭东区",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.30937,
            31.19412
        ],
        "address": "申滨路9号",
        "name": "九星虹桥商务中心",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.218408,
            31.382598
        ],
        "address": "秋竹路801弄",
        "name": "金色榴乡园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.341852,
            31.457178
        ],
        "address": "罗宁路1288弄",
        "name": "联东U谷宝山国际企业港",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.526253,
            31.221089
        ],
        "address": "浦电路400弄",
        "name": "兴业嘉园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.231787,
            31.385362
        ],
        "address": "盘安路501号",
        "name": "菊园智慧中心",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.9244,
            30.914727
        ],
        "address": "雪绒花路369弄",
        "name": "金域澜湾",
        "count": 67,
        "style": 0
    },
    {
        "lnglat": [
            121.240783,
            31.105197
        ],
        "address": "古楼公路1458弄",
        "name": "清泉警苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.509848,
            31.235776
        ],
        "address": "世纪大道201号",
        "name": "渣打银行大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.258322,
            31.409044
        ],
        "address": "永靖路1100号",
        "name": "财智金岸",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.394732,
            31.305305
        ],
        "address": "丰皓路138弄",
        "name": "乾皓苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.336059,
            31.154357
        ],
        "address": "中春路8889弄",
        "name": "万科城花新园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.439155,
            31.171697
        ],
        "address": "漕溪四村70号",
        "name": "兆嘉园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.471481,
            31.343358
        ],
        "address": "长江西路755号",
        "name": "碧家国际社区(长江西路店)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.457832,
            31.246494
        ],
        "address": "天目西路111号",
        "name": "慧空间(长三角乡村振兴联合服务平台)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.497026,
            31.340224
        ],
        "address": "逸仙路3000号",
        "name": "上海国际工业设计中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.492912,
            31.208653
        ],
        "address": "国货路370弄",
        "name": "惠国公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.485598,
            31.396743
        ],
        "address": "牡丹江路1378号",
        "name": "璟都新园（景都新苑）",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.377259,
            31.109258
        ],
        "address": "莘松路58号",
        "name": "东苑丽宝广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.518124,
            31.253548
        ],
        "address": "平凉路207号",
        "name": "平凉园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441875,
            31.19102
        ],
        "address": "天钥桥路180弄",
        "name": "徐家汇馆(华狮国际公寓)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.470383,
            31.229261
        ],
        "address": "黄陂北路227号",
        "name": "中区广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.314618,
            31.135011
        ],
        "address": "九新公路10弄",
        "name": "亭园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.432584,
            31.175038
        ],
        "address": "田林东路100弄",
        "name": "爱建园",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.193239,
            31.196699
        ],
        "address": "崧建路339弄",
        "name": "佳兆业君汇上品（上海）",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.408311,
            31.135183
        ],
        "address": "梅陇西路413号",
        "name": "莲花商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426146,
            31.2075
        ],
        "address": "定西路710弄83号",
        "name": "达安长宁公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.332496,
            31.133007
        ],
        "address": "虬泾路99弄",
        "name": "九亭明珠苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.368246,
            31.236367
        ],
        "address": "金沙江路2145弄",
        "name": "普罗娜商务广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.439481,
            31.194916
        ],
        "address": "衡山路922号",
        "name": "建汇大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.498735,
            31.272763
        ],
        "address": "四平路775弄",
        "name": "天宝华庭",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.473328,
            31.197637
        ],
        "address": "打浦路443号",
        "name": "荣科大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.458278,
            31.266611
        ],
        "address": "柳营路635弄",
        "name": "惠龙公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.324182,
            31.227961
        ],
        "address": "华江路1260弄12号",
        "name": "上海禾智谷科创园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.439064,
            31.187696
        ],
        "address": "天钥桥路380弄36号37号",
        "name": "南溪公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.549007,
            31.247651
        ],
        "address": "浦东大道2000号",
        "name": "阳光世界大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.568709,
            31.092272
        ],
        "address": "建韵路618号",
        "name": "建韵路618号园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.400424,
            31.209419
        ],
        "address": "古北路458号",
        "name": "佰威商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.346338,
            31.137034
        ],
        "address": "中春路7001号",
        "name": "明谷科技园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.419495,
            31.334203
        ],
        "address": "康文路330弄",
        "name": "共康雅苑三期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.488133,
            31.266819
        ],
        "address": "欧阳路196号",
        "name": "法兰桥",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.48927,
            31.2588
        ],
        "address": "四平路96号",
        "name": "金融街海伦中心D座",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.297017,
            31.087404
        ],
        "address": "陆家圈路168弄（陆家圈路269弄）",
        "name": "中海悦庭（中海悦府）",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.442329,
            31.243038
        ],
        "address": "长寿路137号",
        "name": "财富时代广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.388453,
            31.190821
        ],
        "address": "虹许路731号",
        "name": "老外街国际文创生活园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.516128,
            31.229462
        ],
        "address": "浦东南路999号",
        "name": "新梅联合广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.348417,
            31.26436
        ],
        "address": "嘉怡路296号",
        "name": "雯婕商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.419935,
            31.205447
        ],
        "address": "新华路668号",
        "name": "申畅国际商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.406321,
            31.206896
        ],
        "address": "遵义路107号",
        "name": "安泰大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.526937,
            31.181315
        ],
        "address": "北艾路1500号",
        "name": "大华锦绣华城2街区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.441851,
            31.281416
        ],
        "address": "万荣路700号",
        "name": "大宁中心广场A3",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.179268,
            31.286295
        ],
        "address": "安悦路100弄",
        "name": "新城尚上城二期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.544254,
            31.312162
        ],
        "address": "民星路270号",
        "name": "谊客科技园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.446451,
            31.18143
        ],
        "address": "中山南二路999弄19号",
        "name": "中信中山大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.507842,
            31.287944
        ],
        "address": "国泰路11号",
        "name": "上海复旦科技园大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.422065,
            31.234387
        ],
        "address": "谈家渡路28号",
        "name": "盛泉大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.515927,
            31.235577
        ],
        "address": "南泉北路201号",
        "name": "房地大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.476034,
            31.283727
        ],
        "address": "水电路688号",
        "name": "万泰大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.337714,
            31.149609
        ],
        "address": "沪淞公路565弄",
        "name": "水清年华花园",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.548733,
            31.229538
        ],
        "address": "民生路999弄",
        "name": "中星恬园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.43423,
            31.1334
        ],
        "address": "老沪闵路875弄1、2号",
        "name": "松枫花园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.460509,
            31.251342
        ],
        "address": "永兴路888弄",
        "name": "万锦城",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.475249,
            31.283082
        ],
        "address": "水电路682号",
        "name": "天虹商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.498949,
            31.29258
        ],
        "address": "松花江路2628号",
        "name": "冠寓_复旦大学店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.493086,
            31.255901
        ],
        "address": "梧州路299弄",
        "name": "凯虹家园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.316418,
            31.14157
        ],
        "address": "沪亭北路199弄10号楼",
        "name": "宝龙公寓(九亭中心)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.400659,
            31.206465
        ],
        "address": "仙霞路319号",
        "name": "远东国际广场",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.323355,
            31.290638
        ],
        "address": "银翔路609号",
        "name": "汇锦南翔中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.519479,
            31.274098
        ],
        "address": "江浦路1508号",
        "name": "东方星座酒店公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.373319,
            31.119475
        ],
        "address": "七莘路646号",
        "name": "兴城商务广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.447739,
            31.188637
        ],
        "address": "零陵路583号",
        "name": "海洋石油大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.518124,
            31.253548
        ],
        "address": "平凉路207号",
        "name": "平凉园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.587434,
            31.184195
        ],
        "address": "毕升路299弄",
        "name": "富海商务苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.588029,
            31.308144
        ],
        "address": "张杨北路2899弄",
        "name": "金地未未来",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.464963,
            31.227205
        ],
        "address": "威海路333弄",
        "name": "中凯城市之光花园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.497455,
            31.218072
        ],
        "address": "中华路429弄1-5号",
        "name": "绿地名人坊",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.117039,
            31.149336
        ],
        "address": "青安路40号",
        "name": "凯特利广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.382814,
            31.175909
        ],
        "address": "吴中路1217号",
        "name": "长江商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426922,
            31.404648
        ],
        "address": "德都路50弄",
        "name": "嘉城国际花园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.383499,
            31.134194
        ],
        "address": "平阳路1481号",
        "name": "古美现代服务企业中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.317703,
            31.104006
        ],
        "address": "九新公路338号",
        "name": "佳钢智慧园_九新公路",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.479656,
            31.225934
        ],
        "address": "淮海中路2--8号",
        "name": "兰生大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.48471,
            31.25146
        ],
        "address": "四川北路1318号",
        "name": "上海盛邦国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.525483,
            31.240871
        ],
        "address": "浦东大道727弄1号",
        "name": "VIP大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.402149,
            31.309589
        ],
        "address": "环镇北路699弄",
        "name": "上大阳光乾泽园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.57612,
            31.23101
        ],
        "address": "明月路188号",
        "name": "世茂湖滨花园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.385312,
            31.127777
        ],
        "address": "虹莘路1518弄28支弄",
        "name": "春意苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.458977,
            31.338175
        ],
        "address": "长江西路1180号",
        "name": "泗塘大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.425734,
            31.18196
        ],
        "address": "宜山路508号",
        "name": "景鸿大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.512876,
            31.228046
        ],
        "address": "浦城路366弄",
        "name": "菊园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.53832,
            31.294085
        ],
        "address": "松花江路215弄",
        "name": "延吉大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.457511,
            31.201522
        ],
        "address": "肇嘉浜路433号",
        "name": "金兰花苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.269825,
            31.198615
        ],
        "address": "徐祥路38号",
        "name": "西虹桥同联创新产业园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.479736,
            31.266645
        ],
        "address": "东江湾路151号",
        "name": "绿地创客",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.480438,
            31.27088
        ],
        "address": "东江湾路444号",
        "name": "虹口足球场(商务区)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.406456,
            31.267802
        ],
        "address": "真金路250弄",
        "name": "真金苑",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.447638,
            31.224436
        ],
        "address": "常德路175",
        "name": "轻工机械大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.30906,
            31.23588
        ],
        "address": "金耀南路299弄",
        "name": "绿地新江桥城(陈)",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.393475,
            31.106534
        ],
        "address": "宝城路158弄",
        "name": "莘城公寓_上海",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.483006,
            31.223078
        ],
        "address": "人民路998号",
        "name": "金天地国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.467167,
            31.243829
        ],
        "address": "天目中路428号",
        "name": "凯旋门大厦（上海）",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.48927,
            31.2588
        ],
        "address": "四平路96号",
        "name": "金融街海伦中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.458992,
            31.231562
        ],
        "address": "北京西路833号",
        "name": "京泰大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.540387,
            31.312032
        ],
        "address": "民星路376弄",
        "name": "锦都玫瑰园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.488542,
            31.21484
        ],
        "address": "中华路168弄",
        "name": "浦江公馆",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.412626,
            31.200446
        ],
        "address": "中山西路930号",
        "name": "云都虹桥大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.51432,
            31.20967
        ],
        "address": "茂兴路88号",
        "name": "仁恒广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.488406,
            31.237622
        ],
        "address": "四川中路320号",
        "name": "安利大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.478208,
            31.268774
        ],
        "address": "西江湾路230号",
        "name": "驰民大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.447756,
            31.141162
        ],
        "address": "上中路479号",
        "name": "上中路483弄（479弄）商办楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.318291,
            31.288298
        ],
        "address": "古猗园路88弄",
        "name": "骏丰嘉骊花园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.412288,
            31.177621
        ],
        "address": "钦江路28弄",
        "name": "东方康洛",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.717712,
            31.157904
        ],
        "address": "川六公路1159弄",
        "name": "龙馨公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.40024,
            31.187233
        ],
        "address": "古北路1700弄",
        "name": "名都古北",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.605796,
            31.169961
        ],
        "address": "盛荣路288弄",
        "name": "盛大天地创意中心二期（青春里）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.908463,
            30.89215
        ],
        "address": "方竹路333弄1-153号",
        "name": "滴水湖馨苑南区",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.480258,
            31.230279
        ],
        "address": "延安东路618号",
        "name": "远洋商业大厦(二期)",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.253798,
            31.212515
        ],
        "address": "华徐公路3029弄5号",
        "name": "MeGa美格文创园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.494833,
            31.066535
        ],
        "address": "浦雪南路369弄",
        "name": "滨浦新苑7村",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.851313,
            30.866298
        ],
        "address": "渔港路399弄",
        "name": "朗诗里程",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.221689,
            31.40581
        ],
        "address": "城北路1355号",
        "name": "上海大学国家大学科技园嘉定基地",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.397728,
            31.268507
        ],
        "address": "新村路2080弄",
        "name": "万里晶品苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.462931,
            31.204656
        ],
        "address": "陕西南路333弄5号",
        "name": "联兴大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.349788,
            31.401638
        ],
        "address": "美兰湖地铁站2号口",
        "name": "中集金地美兰城",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.320464,
            31.136748
        ],
        "address": "沪松公路1399弄",
        "name": "九久青年城",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.471262,
            31.210299
        ],
        "address": "建国中路25号",
        "name": "8号桥建国园南区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.535774,
            31.192452
        ],
        "address": "锦绣路2580弄",
        "name": "浦东星河湾",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.371719,
            31.017652
        ],
        "address": "银林路1002弄1~30号",
        "name": "马桥景城馨苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.437532,
            31.204122
        ],
        "address": "淮海中路1950弄2号",
        "name": "兴国大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.361631,
            31.256665
        ],
        "address": "定边路35号",
        "name": "东方汽配城",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.448855,
            31.268683
        ],
        "address": "延长中路619号",
        "name": "延中大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.562903,
            31.136128
        ],
        "address": "秀康路958弄",
        "name": "周康新苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.470703,
            31.035035
        ],
        "address": "紫龙路200弄",
        "name": "万科青藤公园",
        "count": 72,
        "style": 0
    },
    {
        "lnglat": [
            121.57499,
            31.178087
        ],
        "address": "五星路707弄",
        "name": "御河企业公馆",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.397859,
            31.160144
        ],
        "address": "漕宝路1108号",
        "name": "燎申漕宝大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.244639,
            31.362754
        ],
        "address": "叶城路1128号",
        "name": "中青旅东方国际酒店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432196,
            31.238605
        ],
        "address": "长寿路652号",
        "name": "景源时尚产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.481357,
            31.233984
        ],
        "address": "福建中路205号",
        "name": "中怡公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.303018,
            31.288344
        ],
        "address": "民主街495弄",
        "name": "绿洲茗馨公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.533617,
            31.243525
        ],
        "address": "桃林路18号",
        "name": "环球广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.371415,
            31.229112
        ],
        "address": "云岭西路356弄",
        "name": "璨申众创空间",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.495178,
            31.063329
        ],
        "address": "浦瑞南路76弄",
        "name": "滨浦新苑8村",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.513286,
            31.30072
        ],
        "address": "国宾路36号",
        "name": "五角场万达广场",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.442605,
            31.191128
        ],
        "address": "天钥桥路191弄",
        "name": "南天大楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.447795,
            31.26901
        ],
        "address": "延长中路629弄",
        "name": "延铁家园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.425118,
            31.178881
        ],
        "address": "钦州路920号",
        "name": "钦州路920号",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.478848,
            31.230715
        ],
        "address": "广东路689号",
        "name": "海通证券大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.417032,
            31.216922
        ],
        "address": "汇川路99弄",
        "name": "新时空国际商务广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.481359,
            31.226566
        ],
        "address": "云南南路180号",
        "name": "淮云大厦",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.433078,
            31.338658
        ],
        "address": "呼兰西路100号",
        "name": "永谊大厦",
        "count": 70,
        "style": 0
    },
    {
        "lnglat": [
            121.237076,
            31.05357
        ],
        "address": "谷阳北路2558弄",
        "name": "龙湖新壹城",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.384349,
            31.134267
        ],
        "address": "平阳路1465弄",
        "name": "平阳苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.761691,
            30.873023
        ],
        "address": "新杨公路1666号",
        "name": "临港润材智能产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.357137,
            31.125698
        ],
        "address": "中春路6111号",
        "name": "慧峰商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.606941,
            31.193808
        ],
        "address": "蔡伦路780号",
        "name": "推广大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.37569,
            31.020829
        ],
        "address": "富岩路60号",
        "name": "卓越维港",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.736569,
            31.069595
        ],
        "address": "拱海路79弄",
        "name": "民乐城惠康苑",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.421126,
            31.22502
        ],
        "address": "万航渡路1455号",
        "name": "华阳公寓（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.517604,
            31.21586
        ],
        "address": "浦东南路1862弄",
        "name": "众鑫大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.541083,
            31.272424
        ],
        "address": "长阳路2080号",
        "name": "宁武小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.508518,
            31.297191
        ],
        "address": "国定路335号",
        "name": "杨浦科技创业中心",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.482644,
            31.218469
        ],
        "address": "复兴中路1号",
        "name": "申能国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.488875,
            31.260928
        ],
        "address": "溧阳路1088号",
        "name": "龙邸大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.403365,
            31.018805
        ],
        "address": "瑞丽路918弄",
        "name": "海赋尚品苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.460771,
            31.196427
        ],
        "address": "日晖六村33号",
        "name": "新徐汇商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.518412,
            31.198335
        ],
        "address": "临沂路61弄",
        "name": "龙阳花苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.364536,
            31.176022
        ],
        "address": "青衫路341号",
        "name": "青衫商务园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.518022,
            31.076351
        ],
        "address": "联航路1505弄",
        "name": "复地浦江商务中心",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.436573,
            31.201561
        ],
        "address": "华山路1765弄2号",
        "name": "海斯大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.317077,
            31.21318
        ],
        "address": "申虹路1188弄",
        "name": "恒基旭辉中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.390597,
            31.268055
        ],
        "address": "交通路4711号",
        "name": "李子园大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.457634,
            31.260377
        ],
        "address": "中山北路831弄1-5号",
        "name": "吉兴大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.458773,
            31.281544
        ],
        "address": "平型关路1083弄",
        "name": "慧芝湖花园二期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.173377,
            31.174377
        ],
        "address": "崧泽大道6699号",
        "name": "百丽商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.529511,
            31.229532
        ],
        "address": "福山路309号",
        "name": "竹园商务公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.532145,
            31.257285
        ],
        "address": "龙江路388弄",
        "name": "圣骊河滨苑三期",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.508899,
            30.955829
        ],
        "address": "团汇公路258弄",
        "name": "逸贤雅苑",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.420915,
            31.124213
        ],
        "address": "罗锦路50号",
        "name": "西岸蓝海企业天地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.486033,
            31.208471
        ],
        "address": "西藏南路1200弄",
        "name": "黄浦丽园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.511283,
            31.304232
        ],
        "address": "大学路63弄",
        "name": "创智坊SOHO办公楼",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.444515,
            31.235683
        ],
        "address": "西康路699弄",
        "name": "静安鼎鑫佳苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.532458,
            31.269511
        ],
        "address": "黄兴路1号",
        "name": "中通大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.452937,
            31.156816
        ],
        "address": "黄石路80弄",
        "name": "龙龙家园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.510222,
            31.188468
        ],
        "address": "东方路3601号",
        "name": "上海丰华园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.438119,
            31.33188
        ],
        "address": "三泉路1858弄",
        "name": "宝宸共和家园",
        "count": 72,
        "style": 0
    },
    {
        "lnglat": [
            121.428249,
            31.281252
        ],
        "address": "晋城路663弄",
        "name": "阳城世家",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.522642,
            31.179966
        ],
        "address": "北艾路1766号",
        "name": "大华锦绣国际写字楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.482976,
            31.407758
        ],
        "address": "盘古路388弄",
        "name": "祥腾国际广场",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.568761,
            31.091357
        ],
        "address": "沈梅路600号",
        "name": "环宇集团上海智能产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.704585,
            31.242803
        ],
        "address": "瑞庆路528号、胜利路836号",
        "name": "张江医疗器械园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.444354,
            31.236625
        ],
        "address": "西康路757号",
        "name": "侨侨大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.481486,
            31.192576
        ],
        "address": "局门路801号",
        "name": "黄浦海事局大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.755515,
            31.067697
        ],
        "address": "听达路325弄",
        "name": "丽水雅苑南苑",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.417867,
            31.194615
        ],
        "address": "中山西路1231号",
        "name": "锦城公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.517399,
            30.953301
        ],
        "address": "万顺路1885弄",
        "name": "敬贤雅苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.467887,
            31.237968
        ],
        "address": "青岛路66弄",
        "name": "金色家园（上海）",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.54333,
            31.210106
        ],
        "address": "花木路500弄",
        "name": "花木苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.386096,
            31.18844
        ],
        "address": "虹梅路3297弄",
        "name": "华光花园",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.4215,
            31.190011
        ],
        "address": "吴中东路588弄",
        "name": "上海华中大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.535774,
            31.192452
        ],
        "address": "锦绣路2580弄",
        "name": "浦东星河湾",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.284768,
            31.18297
        ],
        "address": "会恒路200弄：会恒路666弄",
        "name": "中建锦绣名都",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.600358,
            31.340201
        ],
        "address": "华申路215号",
        "name": "自贸壹号simbaypark（二期）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.425266,
            31.259317
        ],
        "address": "交通路2447号",
        "name": "甘泉德必易园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.383132,
            31.211097
        ],
        "address": "茅台路868号",
        "name": "光华大厦（上海）",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.525152,
            31.321674
        ],
        "address": "世界路133号",
        "name": "133绿源天地广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.260957,
            31.091091
        ],
        "address": "沈砖公路6000号",
        "name": "创异工房",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.480368,
            31.207771
        ],
        "address": "局门路153号",
        "name": "千羽创意园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.587391,
            31.345736
        ],
        "address": "杨高北路528号",
        "name": "招商中心大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.554315,
            31.21039
        ],
        "address": "梅花路777弄",
        "name": "建华新苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.511783,
            31.224888
        ],
        "address": "张杨路188号",
        "name": "汤臣中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.351288,
            31.229813
        ],
        "address": "临虹路289弄1号楼",
        "name": "虹桥金座1号楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.37029,
            31.232713
        ],
        "address": "同普路1220号",
        "name": "同普大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.380911,
            31.1029
        ],
        "address": "沪闵路5600弄88支弄",
        "name": "邻里苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.472898,
            31.207036
        ],
        "address": "鲁班路88号",
        "name": "大同花园三期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.439497,
            31.27848
        ],
        "address": "广中西路777弄55号",
        "name": "启迪大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.512884,
            31.274314
        ],
        "address": "鞍山路5号",
        "name": "杨浦商城（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.406045,
            31.271781
        ],
        "address": "新村路1759弄",
        "name": "凯旋花园",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.203668,
            31.287111
        ],
        "address": "曹安公路4908弄",
        "name": "曹安景林",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.325788,
            31.23831
        ],
        "address": "鹤友路336弄",
        "name": "万达城市公寓（上海）",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.483809,
            31.214975
        ],
        "address": "建国新路28弄",
        "name": "建新公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.46251,
            30.930277
        ],
        "address": "航南公路5699号",
        "name": "奉贤宝龙城市广场(商务楼)",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.444818,
            31.266887
        ],
        "address": "延长中路801号",
        "name": "新华文化科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.424611,
            31.1898
        ],
        "address": "吴中东路491号",
        "name": "宏云广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.551485,
            31.238168
        ],
        "address": "苗圃路438弄",
        "name": "新城名园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.282735,
            31.149858
        ],
        "address": "九泾路655号",
        "name": "上海嘉南红塔商务广场",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.524178,
            31.2729
        ],
        "address": "周家嘴路2809号",
        "name": "凤城巷三期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.387345,
            31.233615
        ],
        "address": "金沙江路1340弄",
        "name": "新曹杨中南大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.59773,
            30.978234
        ],
        "address": "光泰路1151号",
        "name": "奥帛弘汇科创园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.599397,
            31.248751
        ],
        "address": "新金桥路255号",
        "name": "金桥商务公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.434755,
            31.371107
        ],
        "address": "梅林路866弄1-19号",
        "name": "宝虹水岸",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.180909,
            31.29846
        ],
        "address": "阜康路19弄",
        "name": "玉兰一村商住楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.405471,
            31.20732
        ],
        "address": "紫云西路28弄",
        "name": "翠庭",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.531696,
            31.222502
        ],
        "address": "福山路500号",
        "name": "城建国际中心",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.59102,
            31.341942
        ],
        "address": "富特西一路135号",
        "name": "东上海石化商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.445915,
            31.2986
        ],
        "address": "江场西路180号",
        "name": "和典创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.455196,
            31.180574
        ],
        "address": "宛平南路1415号",
        "name": "保利西岸明轩",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.476261,
            31.214727
        ],
        "address": "合肥路215号",
        "name": "精益商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.603101,
            31.1768
        ],
        "address": "环科路515号",
        "name": "绿地智创商务中心",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.384412,
            31.293226
        ],
        "address": "祁安路365弄5-125号",
        "name": "安居金祁新城一期",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.293664,
            31.097138
        ],
        "address": "高技路205弄",
        "name": "5G产业基地",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.452991,
            31.204305
        ],
        "address": "岳阳路217号",
        "name": "岳阳公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.398184,
            31.238347
        ],
        "address": "梅川路255弄",
        "name": "怒江苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.396493,
            31.213305
        ],
        "address": "天山路600弄",
        "name": "思创大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.315489,
            31.201745
        ],
        "address": "申虹路663号",
        "name": "鱼跃大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.569305,
            31.346236
        ],
        "address": "花山路333弄",
        "name": "宝厦雅苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.159725,
            31.165066
        ],
        "address": "崧润路1176弄",
        "name": "秀景苑一期",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.477745,
            31.232515
        ],
        "address": "福州路666号",
        "name": "华鑫海欣大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.26299,
            31.19512
        ],
        "address": "徐祥路368号",
        "name": "8090青年创业基地数字经济总部园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.441902,
            31.230218
        ],
        "address": "胶州路397号",
        "name": "阳光科技广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.469597,
            31.207021
        ],
        "address": "徐家汇路558弄1号",
        "name": "双钱公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.4335,
            31.063218
        ],
        "address": "莲花南路2899号",
        "name": "莲谷新兴科技产业园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.181217,
            31.195209
        ],
        "address": "重固镇大街666弄",
        "name": "锦绣雅苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.513617,
            31.195629
        ],
        "address": "临沂路128号",
        "name": "慧盛大厦办公楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.412896,
            31.150924
        ],
        "address": "浦北路999弄1-3号",
        "name": "百合花苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.406356,
            31.261339
        ],
        "address": "三源路66弄",
        "name": "曹杨雅苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.535281,
            30.850502
        ],
        "address": "民乐路328弄",
        "name": "派米雷星火产业园A区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.293589,
            31.164192
        ],
        "address": "高泾路599号",
        "name": "中国北斗产业基地",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.50279,
            31.353445
        ],
        "address": "逸仙路3901号",
        "name": "东海航运大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.363285,
            30.734916
        ],
        "address": "同凯路228弄",
        "name": "建邦国宸府（建邦华庭）",
        "count": 86,
        "style": 0
    },
    {
        "lnglat": [
            121.459733,
            31.190289
        ],
        "address": "枫林路485号",
        "name": "枫林Link",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.434315,
            31.211825
        ],
        "address": "江苏路813号",
        "name": "华山花园上海",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.450242,
            31.304781
        ],
        "address": "共和新路3699号、3737号",
        "name": "共和国际商务广场",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.446205,
            31.198813
        ],
        "address": "肇嘉浜路768号",
        "name": "欧江大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.435766,
            31.240432
        ],
        "address": "长寿路518弄",
        "name": "纺鑫苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.486611,
            31.239484
        ],
        "address": "上海黄浦区宁波路1号",
        "name": "申华金融大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.432332,
            31.366799
        ],
        "address": "红林路99弄",
        "name": "印象苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.398691,
            31.203573
        ],
        "address": "虹古路8弄之1-11号",
        "name": "虹景家苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.512436,
            31.219347
        ],
        "address": "浦明路868弄",
        "name": "保利one56",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.435701,
            31.234487
        ],
        "address": "余姚路420号",
        "name": "荣瑞商务中心(汇智金昌园区)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.507078,
            31.151086
        ],
        "address": "上南路3855号",
        "name": "如日商务园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.422813,
            31.228309
        ],
        "address": "光复西路1107号",
        "name": "苏河汇",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.777148,
            31.025745
        ],
        "address": "黄家路88弄",
        "name": "浩城华苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.372189,
            31.252689
        ],
        "address": "祁连山南路2199号",
        "name": "真新商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.465636,
            31.267274
        ],
        "address": "平型关路108弄37号、39号",
        "name": "108广场(品座尚座)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.44745,
            31.106358
        ],
        "address": "银都路466号",
        "name": "上海聚科生物园区",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.408661,
            31.246975
        ],
        "address": "曹杨路1222弄1-16号",
        "name": "颐宁苑(上海)",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.549682,
            31.272687
        ],
        "address": "平凉路2241号",
        "name": "智慧坊",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.743618,
            31.064468
        ],
        "address": "拱川路411弄",
        "name": "荣春苑北苑",
        "count": 65,
        "style": 0
    },
    {
        "lnglat": [
            121.445254,
            31.236614
        ],
        "address": "西康路658弄7-9号",
        "name": "静安东海园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.66969,
            31.235586
        ],
        "address": "卡园二路58号",
        "name": "银信创智园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.375313,
            31.184778
        ],
        "address": "程家桥路258号",
        "name": "银洲国际商务大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.435882,
            31.241151
        ],
        "address": "常德路1265号",
        "name": "兴运大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.418073,
            31.201588
        ],
        "address": "安顺路158弄",
        "name": "金电大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.418149,
            31.237916
        ],
        "address": "曹杨路540号",
        "name": "中联大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.396369,
            31.195765
        ],
        "address": "荣华东道79弄",
        "name": "马赛花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.544662,
            31.145454
        ],
        "address": "永泰路2080弄",
        "name": "浦发绿城（南区）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.421519,
            31.176847
        ],
        "address": "徐汇区柳州路585弄",
        "name": "申德公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.547011,
            31.118046
        ],
        "address": "渡桥路78弄",
        "name": "中骏柏景湾(上海)",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.424197,
            31.205607
        ],
        "address": "法华镇路555号",
        "name": "法华门大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.514543,
            31.30077
        ],
        "address": "淞沪路1号",
        "name": "巴黎春天(五角场店)",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.338626,
            31.400703
        ],
        "address": "陆翔路3489弄",
        "name": "佳翔苑",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.435192,
            31.183633
        ],
        "address": "中漕路20号",
        "name": "中漕小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.283007,
            31.149993
        ],
        "address": "九泾路959号",
        "name": "上海豪禺创业园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.317991,
            31.116964
        ],
        "address": "连富路155号",
        "name": "久仰科创园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.420681,
            31.233619
        ],
        "address": "曹杨路303弄",
        "name": "锦绿新城一期",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.589422,
            31.241622
        ],
        "address": "黄杨路69弄",
        "name": "信和花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.559836,
            31.2454
        ],
        "address": "博山东路20弄",
        "name": "锦绣河山小区",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.480066,
            31.208964
        ],
        "address": "局门路1号（徐家汇路）",
        "name": "中汇公寓上海",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.079357,
            31.137033
        ],
        "address": "上海市青浦区青泰路616弄",
        "name": "西虹桥壹号",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.497938,
            31.211126
        ],
        "address": "陆家浜路456号",
        "name": "赛元大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.484838,
            31.214718
        ],
        "address": "西藏南路760号",
        "name": "安基大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.485591,
            31.166559
        ],
        "address": "德州路382弄",
        "name": "德馨公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.443181,
            31.23716
        ],
        "address": "海防路538弄",
        "name": "达安锦园小区",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.417487,
            31.073669
        ],
        "address": "颛兴东路1313号",
        "name": "云部落大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.511119,
            31.076663
        ],
        "address": "浦星公路1969号",
        "name": "红星国际广场(上海)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.315833,
            31.061544
        ],
        "address": "新南街301弄",
        "name": "万宇阳光苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.430416,
            31.187458
        ],
        "address": "宜山路333号",
        "name": "汇鑫国际大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.445962,
            31.306997
        ],
        "address": "曲沃路66弄",
        "name": "闻喜华庭(上海)",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.43829,
            31.270553
        ],
        "address": "宜川路778弄",
        "name": "宁泰馨苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.549883,
            31.27473
        ],
        "address": "贵阳路398号",
        "name": "文通国际广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.443567,
            31.236753
        ],
        "address": "海防路555号",
        "name": "同乐坊",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.385118,
            31.106187
        ],
        "address": " 闵城路199弄",
        "name": "好世鹿鸣苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.241955,
            31.363872
        ],
        "address": "福海路777号",
        "name": "嘉福汇商务广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.193238,
            31.292906
        ],
        "address": "于塘南路280弄",
        "name": "恒大名都(上海)",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.384921,
            31.16709
        ],
        "address": "宜山路2016号",
        "name": "合川大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.381354,
            31.18882
        ],
        "address": "华光路300弄",
        "name": "凯迪华光公寓",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.510407,
            31.23928
        ],
        "address": "浦东南路379号",
        "name": "金穗大厦（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.266721,
            31.195201
        ],
        "address": "华徐公路605号",
        "name": "西虹桥德必易园",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.47379,
            31.268759
        ],
        "address": "中山北一路9号",
        "name": "近铁虹口金融产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.384756,
            31.214008
        ],
        "address": "威宁路369号",
        "name": "缤谷大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.557267,
            31.242127
        ],
        "address": "崮山路538号",
        "name": "浦东中港汇大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46114,
            31.191395
        ],
        "address": "小木桥路538弄,518弄",
        "name": "新湖云庭",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.532478,
            31.176872
        ],
        "address": "成山路1850弄",
        "name": "大华锦绣华城17街区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.589967,
            31.347311
        ],
        "address": "菲拉路45号",
        "name": "众上文化大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.403806,
            31.205269
        ],
        "address": "仙霞路88号",
        "name": "太阳广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.515873,
            31.257222
        ],
        "address": "霍山路398号",
        "name": "光大安石中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.43109,
            31.205026
        ],
        "address": "幸福路111弄1-6号（新华路）",
        "name": "恒力苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.476183,
            31.198844
        ],
        "address": "鲁班路558号",
        "name": "经纬国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.371865,
            31.360649
        ],
        "address": "菊泉街1280弄",
        "name": "馨佳园十二街坊",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.327811,
            31.477269
        ],
        "address": "长虹路779弄",
        "name": "海上御景苑一期",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.371055,
            31.345255
        ],
        "address": "陆翔路111号",
        "name": "宝山正大乐城",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.542775,
            31.226639
        ],
        "address": "桃林路1141弄",
        "name": "新天家园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.503978,
            31.222209
        ],
        "address": "复兴东路2号",
        "name": "豫园股份",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.518798,
            30.953115
        ],
        "address": "农民街118弄",
        "name": "汇贤雅苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.538313,
            31.330716
        ],
        "address": "包头路1150弄",
        "name": "城市名园",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.506109,
            31.310695
        ],
        "address": "国安路55号",
        "name": "君庭广场",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.263419,
            31.347647
        ],
        "address": "天祝路377弄",
        "name": "华都商务广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.491847,
            31.276912
        ],
        "address": "大连西路180号",
        "name": "玉四大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.393422,
            31.194658
        ],
        "address": "水城南路37号",
        "name": "万科广场37",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.409594,
            31.170604
        ],
        "address": "虹漕路39号",
        "name": "华鑫科技园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.490962,
            31.220704
        ],
        "address": "河南南路555弄",
        "name": "士林华苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.495574,
            31.212161
        ],
        "address": "陆家浜路688弄",
        "name": "金日世家",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.530674,
            31.224768
        ],
        "address": "福山路388号",
        "name": "越秀大厦",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.39631,
            31.130499
        ],
        "address": "闵虹路166弄",
        "name": "中庚环球创意中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.456701,
            31.201321
        ],
        "address": "肇嘉浜路539号",
        "name": "平华大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.50119,
            31.219729
        ],
        "address": "白渡路258弄",
        "name": "福鑫大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.474225,
            31.195411
        ],
        "address": "打浦路585弄1-4号",
        "name": "中辉新苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.605644,
            31.260298
        ],
        "address": "金高路2330号",
        "name": "金桥炜业",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.30674,
            31.269796
        ],
        "address": "吴杨东路333弄",
        "name": "金帝城市岸泊",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.312314,
            31.155797
        ],
        "address": "沪亭北路1080弄",
        "name": "金丰蓝庭一期",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.214978,
            31.133383
        ],
        "address": "华莹山路450弄",
        "name": "莘泽苑",
        "count": 72,
        "style": 0
    },
    {
        "lnglat": [
            121.427393,
            31.211105
        ],
        "address": "延安西路1235弄",
        "name": "佳达新苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.485565,
            31.210563
        ],
        "address": "西藏南路1108弄",
        "name": "黄浦新苑东区",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.278741,
            31.159011
        ],
        "address": "联民路88弄",
        "name": "上海捷克住宅小区",
        "count": 106,
        "style": 0
    },
    {
        "lnglat": [
            121.856388,
            30.868631
        ],
        "address": "港辉路372号",
        "name": "海滨时代大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.456015,
            31.09253
        ],
        "address": "龙吴路3389号",
        "name": "滨江商务生活广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.428733,
            31.148115
        ],
        "address": "石龙路980弄",
        "name": "麦克花园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.388441,
            31.17392
        ],
        "address": "环镇南路858-888号",
        "name": "中环天地",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.413291,
            31.239475
        ],
        "address": "兰溪路10弄",
        "name": "曹杨君悦苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.40453,
            31.068807
        ],
        "address": "都市路2501弄",
        "name": "金铭文博水景苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.359518,
            31.220042
        ],
        "address": "金钟路633号",
        "name": "晨讯科技大楼",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.318118,
            31.309073
        ],
        "address": "栖林路392弄",
        "name": "金地格林风范城城市公馆",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.059474,
            31.128429
        ],
        "address": "淀园路288弄",
        "name": "境秋华庭",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.560013,
            31.208995
        ],
        "address": "樱花路801弄",
        "name": "大唐盛世花园二期",
        "count": 84,
        "style": 0
    },
    {
        "lnglat": [
            121.919248,
            30.918681
        ],
        "address": "铃兰路508弄",
        "name": "保利铃兰公馆",
        "count": 97,
        "style": 0
    },
    {
        "lnglat": [
            121.260957,
            31.091091
        ],
        "address": "沈砖公路6000号",
        "name": "创异工房",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.282919,
            31.149949
        ],
        "address": "九泾路898号",
        "name": "898国际商务中心",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.37255,
            31.175091
        ],
        "address": "虹井路120号",
        "name": "新华红星国际广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.452773,
            31.266662
        ],
        "address": "洛川中路777弄",
        "name": "悠和家园",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.435863,
            31.164548
        ],
        "address": "宾阳路28弄",
        "name": "保利星苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.326633,
            31.142776
        ],
        "address": "沪松公路1251号",
        "name": "云端电商家园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.36486,
            31.235657
        ],
        "address": "金沙江路2299弄",
        "name": "金沙雅苑未来街区ABC区",
        "count": 109,
        "style": 0
    },
    {
        "lnglat": [
            121.432599,
            31.20506
        ],
        "address": "华山路1520弄25号",
        "name": "华山嘉苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.499189,
            31.27226
        ],
        "address": "四平路778号",
        "name": "盛业大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.460006,
            31.197729
        ],
        "address": "斜土路1515号",
        "name": "银亿茗悦公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.476667,
            31.270181
        ],
        "address": "中山北一路82号",
        "name": "花园商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.491872,
            31.204893
        ],
        "address": "瞿溪路301弄",
        "name": "蓬莱家园(二期)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.434832,
            31.174209
        ],
        "address": "漕溪路190号",
        "name": "华林大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.365358,
            31.264664
        ],
        "address": "定边路629号",
        "name": "智谷S06园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.326121,
            31.302651
        ],
        "address": "宝翔路158弄",
        "name": "旭辉U天地",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.516656,
            31.146457
        ],
        "address": "尚博路366弄",
        "name": "湾流域三期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.481529,
            31.213838
        ],
        "address": "建国新路91号",
        "name": "南鼎建国大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.424417,
            31.210415
        ],
        "address": "延安西路1355弄1、2号（定西路）",
        "name": "银都公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.451817,
            31.143499
        ],
        "address": "喜泰路255号",
        "name": "海桐商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.458766,
            31.199421
        ],
        "address": "清真路55弄",
        "name": "大闻公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.603297,
            31.334612
        ],
        "address": "泰谷路169号",
        "name": "华源国际大厦(上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.433858,
            31.25287
        ],
        "address": "光新路182弄",
        "name": "一品国际",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.379106,
            31.216254
        ],
        "address": "天山路30号",
        "name": "天山大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.463916,
            31.20321
        ],
        "address": "肇嘉浜路201号",
        "name": "上海生产资料交易市场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.423601,
            31.262564
        ],
        "address": "双山路167弄",
        "name": "甘泉公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.380541,
            31.025126
        ],
        "address": "马桥镇富卓路789弄",
        "name": "马桥景城品雅苑（万科公园大道）",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.265139,
            31.196553
        ],
        "address": "华徐公路685号",
        "name": "e通世界",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.190888,
            31.312978
        ],
        "address": "宝安公路4997号",
        "name": "上海安亭国际医疗产业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.490908,
            31.223135
        ],
        "address": "昼锦路180弄",
        "name": "复地雅园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.538305,
            31.271883
        ],
        "address": "双阳路50弄",
        "name": "新疆克拉玛依大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.530223,
            31.049784
        ],
        "address": "三鲁公路1739弄",
        "name": "水月锦绣苑",
        "count": 82,
        "style": 0
    },
    {
        "lnglat": [
            121.442726,
            31.222504
        ],
        "address": "乌鲁木齐北路199号",
        "name": "世纪时空大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.448589,
            31.227404
        ],
        "address": "北京西路1399号",
        "name": "信达大厦（上海）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.454751,
            31.053861
        ],
        "address": "曲吴路589号",
        "name": "中国梦谷南上海文化创意产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.48951,
            31.265869
        ],
        "address": "欧阳路85号",
        "name": "金陵国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.49117,
            31.274185
        ],
        "address": "曲阳路440号",
        "name": "东渡名人大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.431603,
            31.203151
        ],
        "address": "法华镇路129号",
        "name": "上海新华豪庭",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.316933,
            31.132495
        ],
        "address": "九新公路58弄",
        "name": "嘉和阳光城",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.462513,
            31.224344
        ],
        "address": "延安中路596号",
        "name": "天壹坊",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.434171,
            31.157434
        ],
        "address": "南宁路970号",
        "name": "徐汇万科中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.57326,
            31.248818
        ],
        "address": "云山路1039弄",
        "name": "陆家嘴新景园(1039弄)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.443431,
            31.239553
        ],
        "address": "西康路928号",
        "name": "静安创展中心",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.42154,
            31.217402
        ],
        "address": "定西路1507号",
        "name": "中山大楼(定西路)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.088593,
            31.13283
        ],
        "address": "黄泥娄路108号",
        "name": "首创禧悦铭庭",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.62054,
            31.256779
        ],
        "address": "新金桥路1599弄B2栋",
        "name": "东方万国企业中心B2栋",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.564105,
            31.260063
        ],
        "address": "浦东大道2568弄",
        "name": "军官公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.39598,
            31.113963
        ],
        "address": "莘朱路718弄",
        "name": "莘东两湾苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.489001,
            31.261741
        ],
        "address": "四平路257号",
        "name": "永融企业中心",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.62054,
            31.256779
        ],
        "address": "新金桥路1599弄",
        "name": "东方万国企业中心",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.402641,
            31.204349
        ],
        "address": "娄山关路83号",
        "name": "新虹桥中心大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.496422,
            31.162714
        ],
        "address": "振兴东路15弄",
        "name": "成发苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.473761,
            31.252113
        ],
        "address": "虬江路997弄",
        "name": "东新大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.529176,
            31.221822
        ],
        "address": "东方路985号",
        "name": "一百大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.524667,
            31.293935
        ],
        "address": "国顺东路800号",
        "name": "国顺东路800号东楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.341969,
            31.309687
        ],
        "address": "山连路799号",
        "name": "新天地创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.487533,
            31.174586
        ],
        "address": "长清路12号",
        "name": "长清教师公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.470225,
            31.403309
        ],
        "address": "盘古路708号",
        "name": "宝建大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.580335,
            31.120413
        ],
        "address": "川周公路8682弄",
        "name": "鼎鑫名流苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.489493,
            31.262511
        ],
        "address": "四平路277号",
        "name": "福龙大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.420514,
            31.203116
        ],
        "address": "新华路569弄77号",
        "name": "鉴赏新华小区",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.344844,
            31.063556
        ],
        "address": "金都西路999号",
        "name": "上海乐港电器园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.239399,
            31.001015
        ],
        "address": "松汇中路351号",
        "name": "天汇佳园",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.453347,
            31.239014
        ],
        "address": "昌平路68号",
        "name": "静安现代大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.474857,
            31.223718
        ],
        "address": "淮海中路282号",
        "name": "香港广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.38493,
            31.112769
        ],
        "address": "莘建东路198弄",
        "name": "地铁明珠苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.441681,
            31.193105
        ],
        "address": "天钥桥路93号",
        "name": "中福实业大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.323576,
            31.205163
        ],
        "address": "丰虹路199号星月虹桥中心",
        "name": "德必虹桥国际WE",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.484893,
            31.227221
        ],
        "address": "人民路777弄",
        "name": "东淮海公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.508251,
            31.309452
        ],
        "address": "政高路77号",
        "name": "同和国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.521128,
            31.200067
        ],
        "address": "东方路1870号",
        "name": "东方明珠商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.705304,
            31.192804
        ],
        "address": "城南路278弄",
        "name": "东方城市豪苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.296724,
            31.121468
        ],
        "address": "望东中路99弄",
        "name": "森祥投资晟维商务园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.375639,
            31.105592
        ],
        "address": "莘建路228弄",
        "name": "闵富大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.431682,
            31.212216
        ],
        "address": "延安西路1030弄",
        "name": "佳信都市花园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.418202,
            31.363676
        ],
        "address": "红林路576号",
        "name": "和家欣园B区",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.432462,
            31.311462
        ],
        "address": "康宁路1211号",
        "name": "幸福商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.433545,
            31.251438
        ],
        "address": "中山北路1777号",
        "name": "飞洲时代大厦",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.323119,
            31.134256
        ],
        "address": "九亭镇伴亭路488号",
        "name": "磊鑫大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437472,
            31.342764
        ],
        "address": "共和新路5895号",
        "name": "开伦智汇园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.401546,
            31.15014
        ],
        "address": "古龙路287弄",
        "name": "新时代景庭",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.489837,
            31.086424
        ],
        "address": "浦秀路1139弄",
        "name": "浦秀馨苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.259407,
            31.351741
        ],
        "address": "白银路399号",
        "name": "晶鼎大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.506532,
            31.310789
        ],
        "address": "国霞路60号",
        "name": "君庭广场7号楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.409662,
            31.26542
        ],
        "address": "真华路157弄",
        "name": "万里一期157弄",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.434594,
            31.223922
        ],
        "address": "镇宁路545弄7号",
        "name": "天星公寓（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.166812,
            30.883272
        ],
        "address": "罗星南路115号",
        "name": "万祥金邸",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.368229,
            31.188818
        ],
        "address": "虹井路888号",
        "name": "嘉利豪园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.482016,
            30.950949
        ],
        "address": "金海公路6055号（临港南桥科技城）",
        "name": "漕河泾开发区南桥园区（临港南桥园区）",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.503859,
            31.312978
        ],
        "address": "国安路259弄",
        "name": "上和园一期（世嘉园）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.463308,
            31.226558
        ],
        "address": "石门一路116号",
        "name": "中邦艾格美国际公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.487065,
            31.301982
        ],
        "address": "逸仙路661号",
        "name": "新海商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.424988,
            31.183057
        ],
        "address": "中山西路1878号",
        "name": "凯托大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.505689,
            31.249982
        ],
        "address": "东大名路888弄19号",
        "name": "新外滩花苑综合楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.577686,
            31.259211
        ],
        "address": "金桥路989弄",
        "name": "今达花园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.432841,
            31.195163
        ],
        "address": "广元西路333弄",
        "name": "紫元大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.55318,
            31.211117
        ],
        "address": "花木路908号",
        "name": "雍景台（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.507161,
            31.263593
        ],
        "address": "大连路839号",
        "name": "合生财富广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.102767,
            31.190359
        ],
        "address": "新胜路155号",
        "name": "圆益科创产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.388523,
            31.356735
        ],
        "address": "沙浦路128弄",
        "name": "上海绿洲花园",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.477181,
            31.261452
        ],
        "address": "宝山路625号",
        "name": "上海金宝大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.48316,
            31.211111
        ],
        "address": "陆家浜路1378号",
        "name": "万事利大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.422894,
            31.208866
        ],
        "address": "延安西路1448弄",
        "name": "华融国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.456013,
            31.216069
        ],
        "address": "淮海中路1010号",
        "name": "嘉华中心（上海）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.348561,
            31.258963
        ],
        "address": "曹安公路2038号",
        "name": "华拓大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.386626,
            31.234282
        ],
        "address": "金沙江路1340弄57号",
        "name": "上海新曹杨高新技术工业园区一街坊三期(D区)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.391961,
            31.172604
        ],
        "address": "虹梅路2071号",
        "name": "远中产业园三四期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.574933,
            31.158257
        ],
        "address": "御桥路2066弄",
        "name": "地杰国际城E街坊",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.441238,
            31.185406
        ],
        "address": "斜土路2899甲号",
        "name": "光启文化广场",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.461115,
            31.217353
        ],
        "address": "淮海中路887号",
        "name": "永新大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.404623,
            31.239417
        ],
        "address": "兰溪路145号",
        "name": "安天大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.445121,
            31.331135
        ],
        "address": "长江西路1952弄2号（通河四村69号）",
        "name": "骏利财智园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.155732,
            31.14104
        ],
        "address": "秀涓路46弄",
        "name": "观景雅苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.401037,
            31.208827
        ],
        "address": "古北路507号（仙霞路）",
        "name": "申菱大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.663671,
            30.911694
        ],
        "address": "兰博路1189弄",
        "name": "绿地风清苑",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.350467,
            31.066282
        ],
        "address": "金都西路688号",
        "name": "上海喜乐嘉工业园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.481816,
            31.196852
        ],
        "address": "龙华东路325号",
        "name": "博荟广场",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.533364,
            31.331774
        ],
        "address": "国伟路300号",
        "name": "爱久家园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.439147,
            31.343837
        ],
        "address": "呼青路158号",
        "name": "上海交运智慧湾科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.441969,
            31.246525
        ],
        "address": "江宁路1306弄17号",
        "name": "富丽花苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.915695,
            30.874378
        ],
        "address": "海洋一路399号",
        "name": "海科广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.453761,
            31.260169
        ],
        "address": "普善路390弄",
        "name": "普善新苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.478719,
            31.232071
        ],
        "address": "福州路655号",
        "name": "黄浦图书馆大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.443831,
            31.18379
        ],
        "address": "天钥桥路859号",
        "name": "北海大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.490901,
            31.263597
        ],
        "address": "四平路210号",
        "name": "家纺大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.540261,
            31.204001
        ],
        "address": "锦安东路88弄",
        "name": "锦绣满堂花园",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.433973,
            31.235328
        ],
        "address": "安远路710号",
        "name": "大昌商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.388348,
            31.277566
        ],
        "address": "普陀区武威东路888弄",
        "name": "恒盛鼎城圣都汇",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.46708,
            31.201252
        ],
        "address": "斜土路1077号",
        "name": "鼎园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.444925,
            31.193096
        ],
        "address": "辛耕路81弄",
        "name": "永新世纪苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.417808,
            31.206332
        ],
        "address": "新华路728号",
        "name": "华联发展大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.374455,
            31.172038
        ],
        "address": "吴中路1369号",
        "name": "欧银中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.372814,
            31.207007
        ],
        "address": "仙霞路1388弄",
        "name": "虹康景博苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.412215,
            31.212322
        ],
        "address": "玉屏南路1号",
        "name": "玉屏大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.433907,
            31.252038
        ],
        "address": "普陀区中山北路1759号",
        "name": "浦发广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.446276,
            31.289491
        ],
        "address": "永和路118弄",
        "name": "东方环球企业中心43号",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.711445,
            31.15922
        ],
        "address": "川宏路508号",
        "name": "贺海科技孵化器",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.442099,
            31.186087
        ],
        "address": "天钥桥路500弄",
        "name": "新贵都万体景苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.4337,
            31.181867
        ],
        "address": "凯旋路3500弄",
        "name": "华苑大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.162743,
            31.287528
        ],
        "address": "墨玉南路1033号",
        "name": "嘉亭大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.378313,
            31.116808
        ],
        "address": "庙泾路52弄",
        "name": "水清三村",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.23853,
            31.17901
        ],
        "address": "尚茂路798弄",
        "name": "徐泾北城馨浦苑西区",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.503521,
            31.261521
        ],
        "address": "岳州路399弄",
        "name": "紫虹嘉苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.630956,
            31.300503
        ],
        "address": "美约路222号",
        "name": "生物医药园_上海",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.393194,
            31.211843
        ],
        "address": "新渔东路60号",
        "name": "安龙大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.402285,
            31.205323
        ],
        "address": "娄山关路８５号",
        "name": "东方国际大厦A座",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.431549,
            31.183655
        ],
        "address": "凯旋路3188弄",
        "name": "凯旋豪庭",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.490966,
            31.248541
        ],
        "address": "吴淞路218号",
        "name": "宝矿国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.482388,
            31.201105
        ],
        "address": "局门路550号",
        "name": "8号桥瞿溪园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.59769,
            31.332939
        ],
        "address": "泰谷路18号",
        "name": "鲁能大厦(外高桥写字楼)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.26903,
            31.038745
        ],
        "address": "文翔东路58号",
        "name": "上海友喜国际高科技园区二期",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.42935,
            31.23452
        ],
        "address": "武宁路8弄1号",
        "name": "大众河滨大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.413321,
            31.270408
        ],
        "address": "大华一路210号",
        "name": "嘉年华大厦（宝山）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.500172,
            31.312382
        ],
        "address": "三门路351弄",
        "name": "尊堡园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.360355,
            31.202492
        ],
        "address": "福泉路550弄",
        "name": "樱源晶舍",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.492144,
            31.232303
        ],
        "address": "中山东二路8号",
        "name": "外滩8号",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.67398,
            31.270854
        ],
        "address": "川沙路809号",
        "name": "超煜809文创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.555972,
            31.183785
        ],
        "address": "北中路187弄",
        "name": "北蔡休闲广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.428592,
            31.303052
        ],
        "address": "场中路3386弄",
        "name": "龙馨嘉园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.244246,
            31.386729
        ],
        "address": "城中路200号",
        "name": "冠寓_嘉定城中路店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.444304,
            31.179398
        ],
        "address": "中山南二路1057弄2号",
        "name": "协昌小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.477736,
            31.265552
        ],
        "address": "西江湾路5号",
        "name": "冠都公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.496174,
            31.259718
        ],
        "address": "物华路58号",
        "name": "物华大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.479157,
            31.224613
        ],
        "address": "淮海中路93号",
        "name": "大上海时代广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.415333,
            31.178162
        ],
        "address": "桂林路565号",
        "name": "明佳公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.418646,
            31.153723
        ],
        "address": "浦北路388号",
        "name": "康健星辰",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.431852,
            31.253919
        ],
        "address": "光新路256弄",
        "name": "城公大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.418582,
            31.198018
        ],
        "address": "长顺路36号",
        "name": "紫勋雅苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.424337,
            31.230819
        ],
        "address": "光复西路1003号",
        "name": "开伦江南场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.419111,
            31.204977
        ],
        "address": "新华路699弄1-3号",
        "name": "新华嘉利公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.31106,
            31.203422
        ],
        "address": "兴虹路368弄",
        "name": "万科润园时一区三期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.511294,
            31.277281
        ],
        "address": "鞍山路160弄",
        "name": "申安公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.44717,
            31.323586
        ],
        "address": "一二八纪念路968号",
        "name": "宝山万达写字楼",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.31935,
            31.287901
        ],
        "address": "银翔路819弄1号",
        "name": "中暨大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.448708,
            31.240601
        ],
        "address": "海防路58弄1-14号",
        "name": "静安康鑫家园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.470052,
            31.280825
        ],
        "address": "凉城路68弄",
        "name": "凉城路68弄",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.554673,
            31.239726
        ],
        "address": "张杨路2100弄",
        "name": "华阳苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.437992,
            31.242691
        ],
        "address": "西康路1255号",
        "name": "普陀科技大厦",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.523955,
            31.196753
        ],
        "address": "东方路1881弄",
        "name": "东方城市花园二期",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.374353,
            31.17844
        ],
        "address": "金汇路465-1临",
        "name": "星发大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.332649,
            31.395909
        ],
        "address": "美康路818弄",
        "name": "金丰苑一区",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.472369,
            31.320077
        ],
        "address": "殷高西路518号",
        "name": "尚景天地",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.551751,
            31.275192
        ],
        "address": "平凉路2440号",
        "name": "芯工创意园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.530363,
            31.229661
        ],
        "address": "张杨路1050弄3号",
        "name": "福竹大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.491651,
            31.202231
        ],
        "address": "中山南路1877号",
        "name": "金中苑商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.569014,
            31.218067
        ],
        "address": "花木路1983号",
        "name": "四季雅苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.503615,
            31.2735
        ],
        "address": "大连路1548号",
        "name": "莱克大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.440986,
            31.190998
        ],
        "address": "天钥桥路180弄8号",
        "name": "南馨公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.481719,
            31.274209
        ],
        "address": "东体育会路100弄2号",
        "name": "兴华小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.548076,
            31.113821
        ],
        "address": "渡桥路288弄",
        "name": "保利首创颂",
        "count": 74,
        "style": 0
    },
    {
        "lnglat": [
            121.401407,
            31.146844
        ],
        "address": "古美路675弄",
        "name": "望族新城",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.229181,
            31.377819
        ],
        "address": "红石路333弄",
        "name": "新城悠活城",
        "count": 62,
        "style": 0
    },
    {
        "lnglat": [
            121.516577,
            31.207175
        ],
        "address": "浦东南路2169号",
        "name": "久事大桥公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.458923,
            31.205062
        ],
        "address": "建国西路285号",
        "name": "科投大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.529652,
            31.203739
        ],
        "address": "杨高南路1288号",
        "name": "中远龙阳公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.492594,
            31.092598
        ],
        "address": "浦锦路1275号",
        "name": "浦锦新天地",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.481976,
            31.231331
        ],
        "address": "湖北路20号",
        "name": "中信福申大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.610869,
            31.181136
        ],
        "address": "川和路中科路",
        "name": "万科翡翠公园六期",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.42211,
            31.211206
        ],
        "address": "昭化路508号",
        "name": "新衡商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.487245,
            31.342729
        ],
        "address": "淞发路901弄",
        "name": "祥腾生活广场之公寓楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.403762,
            31.188791
        ],
        "address": "红松东路321弄",
        "name": "古北大成公馆",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.44455,
            30.925415
        ],
        "address": "航南公路6161号",
        "name": "奉贤农机综合大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.458184,
            31.259443
        ],
        "address": "中山北路814弄",
        "name": "协和公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.382467,
            31.21257
        ],
        "address": "新渔东路456弄",
        "name": "知雅园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.343337,
            31.145715
        ],
        "address": "中春路7628号",
        "name": "优房商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.381583,
            31.192068
        ],
        "address": "虹桥路2222弄55号",
        "name": "爱都公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.593874,
            31.115433
        ],
        "address": "年家浜东路159弄",
        "name": "印象生活广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.249354,
            31.047439
        ],
        "address": "茸兴路407号",
        "name": "茸407创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.4239,
            31.210401
        ],
        "address": "定西路988号",
        "name": "银统大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.499711,
            31.379464
        ],
        "address": "化成路366弄-8",
        "name": "三水国际广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.518231,
            31.3022
        ],
        "address": "政旦东路8弄",
        "name": "财富商业广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.48619,
            31.273741
        ],
        "address": "欧阳路568号",
        "name": "庐迅大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.413952,
            31.173168
        ],
        "address": "桂林路406号",
        "name": "华鑫中心",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.252064,
            31.181837
        ],
        "address": "淮海中路918号",
        "name": "久事复兴大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.519878,
            31.26236
        ],
        "address": "许昌路899号",
        "name": "明昌公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.527975,
            31.224505
        ],
        "address": "东方路877号",
        "name": "嘉兴大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.923841,
            30.898233
        ],
        "address": "申港大道158号",
        "name": "昊坤国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.586205,
            31.341731
        ],
        "address": "春晖路148弄",
        "name": "运银公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.47096,
            31.210018
        ],
        "address": "建国中路29号",
        "name": "国信商务大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.317015,
            31.29673
        ],
        "address": "德华路80弄",
        "name": "威廉公馆二期（清猗园北区）",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.303309,
            31.306018
        ],
        "address": "德园路1055弄",
        "name": "海谊苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.593406,
            31.340216
        ],
        "address": "日京路35号",
        "name": "凯兴大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.457438,
            31.202477
        ],
        "address": "肇嘉浜路376号",
        "name": "轻工大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.436325,
            31.242883
        ],
        "address": "澳门路715号",
        "name": "715创意园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.420236,
            31.218542
        ],
        "address": "长宁路855号",
        "name": "亨通国际大厦",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.519329,
            31.290477
        ],
        "address": "黄兴路1725号",
        "name": "怡富商务广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.416189,
            31.243069
        ],
        "address": "武宁路423号",
        "name": "五零智慧产业科技园",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.247505,
            31.021022
        ],
        "address": "方塔北路605号",
        "name": "企德天地",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.382346,
            31.214436
        ],
        "address": "天山路177弄",
        "name": "南洋新都",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.458735,
            31.297623
        ],
        "address": "江场路1228弄",
        "name": "中环协信中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.437834,
            31.218915
        ],
        "address": "延安西路376弄22号",
        "name": "永兴商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.488867,
            31.264646
        ],
        "address": "欧阳路28弄",
        "name": "新文苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.176406,
            31.174568
        ],
        "address": "崧泽大道6555号",
        "name": "奥帛置业大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.337397,
            31.436978
        ],
        "address": "萧云路99弄",
        "name": "万科启宸（智云新苑）",
        "count": 90,
        "style": 0
    },
    {
        "lnglat": [
            121.353199,
            31.410878
        ],
        "address": "月罗公路2368号",
        "name": "程居汽车办公产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.36168,
            31.23281
        ],
        "address": "同普路1501弄",
        "name": "牡丹苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.413178,
            31.278536
        ],
        "address": "大华路988弄",
        "name": "滨江雅苑",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.396198,
            31.166473
        ],
        "address": "田林路418号",
        "name": "徐汇乐业天地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.438667,
            31.191903
        ],
        "address": "漕溪北路28-38号",
        "name": "实业公寓(上海)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.442355,
            31.246054
        ],
        "address": "江宁路1306弄7号",
        "name": "富丽大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.201266,
            31.229284
        ],
        "address": "华南路680号",
        "name": "梁杭电商U库",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.503662,
            31.21148
        ],
        "address": "中山南路1088号",
        "name": "南浦大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.408977,
            31.27583
        ],
        "address": "真华路999弄",
        "name": "水岸蓝桥",
        "count": 97,
        "style": 0
    },
    {
        "lnglat": [
            121.593547,
            31.332674
        ],
        "address": "季景路555弄",
        "name": "仁恒家园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.476581,
            31.232275
        ],
        "address": "西藏中路268号",
        "name": "来福士广场",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.364134,
            31.394206
        ],
        "address": "美艾路177弄",
        "name": "万科琥珀郡园",
        "count": 83,
        "style": 0
    },
    {
        "lnglat": [
            121.518147,
            31.192518
        ],
        "address": "东方路3261号B座",
        "name": "振华企业广场B座",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.470641,
            31.210664
        ],
        "address": "建国中路8-10号",
        "name": "八号桥（8号桥建国园北区）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.429318,
            31.22713
        ],
        "address": "万航渡路858弄8号",
        "name": "蓝朝部落",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.600947,
            31.177545
        ],
        "address": "金科路4560号",
        "name": "金创大厦(金科路)",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.272968,
            31.049998
        ],
        "address": "广富林东路199号",
        "name": "启迪漕河泾（中山）科技园水木园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.461823,
            30.929119
        ],
        "address": "富竹路39弄",
        "name": "秋月朗庭",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.488584,
            31.245078
        ],
        "address": "上海市虹口区北苏州路88号",
        "name": "中美信托金融大厦",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.276468,
            31.419072
        ],
        "address": "启悦路700弄",
        "name": "碧桂园嘉誉",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.555146,
            31.242531
        ],
        "address": "张杨路2389弄",
        "name": "置汇旭辉广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.494923,
            31.097724
        ],
        "address": "北江燕路338弄浦江世博家园6街坊(近浦池路)",
        "name": "世博家园六街坊",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.421388,
            31.215878
        ],
        "address": "定西路1279号",
        "name": "名光大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.096644,
            31.165876
        ],
        "address": "清河湾路699弄",
        "name": "旭辉玫瑰湾",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.462403,
            31.258628
        ],
        "address": "共和新路912号",
        "name": "云华科技大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.362237,
            31.134848
        ],
        "address": "七莘路1839号",
        "name": "财富108广场",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.554922,
            31.222375
        ],
        "address": "锦绣路800弄",
        "name": "天安花园",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.402724,
            31.202453
        ],
        "address": "娄山关路35号",
        "name": "大虹桥德必WE",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.475535,
            31.196278
        ],
        "address": "中山南一路904号",
        "name": "中南公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.431096,
            31.243435
        ],
        "address": "宜昌路588弄",
        "name": "大上海城市花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.446193,
            31.188543
        ],
        "address": "零陵路635号",
        "name": "爱博大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.379135,
            31.18022
        ],
        "address": "合川路3051号",
        "name": "莱茵虹桥中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.439325,
            31.210554
        ],
        "address": "高邮路1号、3号",
        "name": "兴盛公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.529685,
            31.221481
        ],
        "address": "东方路989号",
        "name": "中达广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.428847,
            31.250717
        ],
        "address": "镇坪路48号",
        "name": "嘉富利大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.389808,
            31.108774
        ],
        "address": "友情路50弄",
        "name": "名都新城四期",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.319886,
            31.243661
        ],
        "address": "鹤望路679弄",
        "name": "亿达北虹桥创业城",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.443847,
            31.266486
        ],
        "address": "沪太路799号",
        "name": "上海新慧谷科技产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.449111,
            31.243356
        ],
        "address": "安远路16弄",
        "name": "宗鑫公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.306814,
            31.260087
        ],
        "address": "金园五路208号",
        "name": "梁杭文化创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.471415,
            31.201643
        ],
        "address": "斜土路768号",
        "name": "致远大厦",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.158765,
            31.14446
        ],
        "address": "崧润路49弄",
        "name": "德康雅苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.4576,
            31.222785
        ],
        "address": "陕西南路3号",
        "name": "城市一品苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.404675,
            31.237873
        ],
        "address": "杏山路500弄",
        "name": "曹杨华庭",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.52119,
            31.277005
        ],
        "address": "控江路1500弄、凤城路51弄",
        "name": "新凤城",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.435503,
            31.338185
        ],
        "address": "呼兰西路60号",
        "name": "卓越时代广场公寓楼",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.40753,
            31.20358
        ],
        "address": "延安西路2077号",
        "name": "金桥大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.427844,
            31.209853
        ],
        "address": "延安西路1228弄2号",
        "name": "上海嘉利大厦",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.697461,
            31.176242
        ],
        "address": "妙川路300弄",
        "name": "凯佳公寓",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.467744,
            31.264878
        ],
        "address": "平型关路38号",
        "name": "和源大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.210596,
            31.03776
        ],
        "address": "新松江路1277号",
        "name": "东鼎商务大厦",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.515492,
            31.276197
        ],
        "address": "本溪路152-222号",
        "name": "中通雅苑_华元豪庭",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.412676,
            31.213891
        ],
        "address": "中山西路555号",
        "name": "绿洲大厦（上海）",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.765451,
            31.048263
        ],
        "address": "人民东路2729弄38支弄",
        "name": "东方城市豪庭",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.226916,
            31.061781
        ],
        "address": "龙马路433号",
        "name": "合景天悦",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.4718,
            30.967824
        ],
        "address": "望园路2066弄",
        "name": "百村创业园A区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.452331,
            31.265368
        ],
        "address": "洛川中路840号",
        "name": "文汇新民培训中心大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436957,
            31.168874
        ],
        "address": "龙漕路51弄1号",
        "name": "金海大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.427067,
            31.191943
        ],
        "address": "南丹路368弄",
        "name": "汇贤雅居",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.34943,
            31.16848
        ],
        "address": "航新路260弄",
        "name": "横泾苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.416596,
            31.073274
        ],
        "address": "颛兴东路1331号",
        "name": "TMT大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.129025,
            31.184944
        ],
        "address": "北青公路9399号",
        "name": "德力西园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.486601,
            31.381908
        ],
        "address": "水产路1269号",
        "name": "吴淞口创业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.607843,
            31.293072
        ],
        "address": "东靖路1831号",
        "name": "先行国际综合商务楼（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.478655,
            31.296371
        ],
        "address": "车站北路177弄",
        "name": "虹口玫瑰苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.258234,
            31.099888
        ],
        "address": "登云路38号",
        "name": "塘和家园君康苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.596062,
            31.335043
        ],
        "address": "美盛路27号",
        "name": "烨博大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.416987,
            31.237435
        ],
        "address": "曹杨路609弄",
        "name": "曹杨汽车公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.385389,
            31.189583
        ],
        "address": "虹梅路3325弄",
        "name": "金泉苑二期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.216181,
            31.032725
        ],
        "address": "文诚路500弄",
        "name": "安信生活广场",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.348575,
            31.170494
        ],
        "address": "航北路669弄",
        "name": "小桥里",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.524798,
            31.239899
        ],
        "address": "浦东大道720号2B",
        "name": "上海国际航运大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.435859,
            31.112945
        ],
        "address": "老沪闵路1482号",
        "name": "瑞星商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.424864,
            31.166999
        ],
        "address": "柳州路300弄",
        "name": "豪门府邸新大公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.510407,
            31.23928
        ],
        "address": "浦东南路379号",
        "name": "金穗大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.493903,
            31.338304
        ],
        "address": "长逸路188号",
        "name": "复旦软件园二期",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.616102,
            31.252474
        ],
        "address": "宁桥路615号",
        "name": "由度工场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.509393,
            31.23884
        ],
        "address": "浦东南路360号",
        "name": "新上海国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.456664,
            31.24125
        ],
        "address": "恒丰路218号",
        "name": "现代交通商务大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.460921,
            31.230432
        ],
        "address": "南京西路819号",
        "name": "中创大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.448228,
            31.184059
        ],
        "address": "中山南二路932弄6号",
        "name": "龙山公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.274025,
            31.045932
        ],
        "address": "中创路266号",
        "name": "波汇科技园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.436387,
            31.218867
        ],
        "address": "镇宁路233号",
        "name": "荣轩大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.318314,
            31.038684
        ],
        "address": "新飞路1500号",
        "name": "上海市松江科技创业中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.490269,
            31.246471
        ],
        "address": "吴淞路130号",
        "name": "城投控股大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.319498,
            31.307427
        ],
        "address": "栖林路265弄",
        "name": "金地格林风范城高尔夫公馆",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.389413,
            31.086388
        ],
        "address": "春东路508号",
        "name": "如果创意产业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.468287,
            31.304558
        ],
        "address": "丰镇路828号",
        "name": "绿亮科创园(丰镇路)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.316794,
            31.202839
        ],
        "address": "申虹路666弄",
        "name": "正荣中心",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.480297,
            31.244324
        ],
        "address": "山西北路222弄",
        "name": "联富假日公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.448467,
            31.268926
        ],
        "address": "延长中路625号",
        "name": "延长工业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.428738,
            31.162025
        ],
        "address": "钦州南路8号",
        "name": "中海馨园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.515549,
            31.281673
        ],
        "address": "江浦路2089弄",
        "name": "恒联新天地",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.395867,
            31.11191
        ],
        "address": "莘朱路695号",
        "name": "莘南综合楼(稷下商务中心)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.470277,
            31.228441
        ],
        "address": "威海路48号",
        "name": "民生银行大厦（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.761688,
            31.072502
        ],
        "address": "拱荣路175弄",
        "name": "玉秀苑东苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.458234,
            31.204933
        ],
        "address": "建国西路287弄",
        "name": "阳光四季公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.275378,
            31.346172
        ],
        "address": "沪宜公路2641号",
        "name": "远香湖1号商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.494087,
            31.350381
        ],
        "address": "长江路392号",
        "name": "KEY设计园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.551571,
            31.222823
        ],
        "address": "迎春路670号",
        "name": "上海移动（浦东店）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.550272,
            31.202338
        ],
        "address": "杜鹃路188弄",
        "name": "上海市浦东新区花木星晨苑小区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.528491,
            31.211263
        ],
        "address": "东方路1381号、1383号",
        "name": "base(蓝村路)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.469186,
            31.281724
        ],
        "address": "凉城路139弄",
        "name": "锦秀文华",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.611428,
            31.255671
        ],
        "address": "金湘路268号",
        "name": "中新传媒广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.468261,
            31.271197
        ],
        "address": "柳营路127号",
        "name": "明光公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.542992,
            31.292563
        ],
        "address": "靖宇东路55弄",
        "name": "靖宇家园",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.409228,
            31.207477
        ],
        "address": "紫云路118号",
        "name": "虹桥豪苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.483303,
            31.25821
        ],
        "address": "四川北路1688号",
        "name": "福德商务中心",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.418653,
            31.20652
        ],
        "address": "新华路726号",
        "name": "新华世纪园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.458501,
            31.190303
        ],
        "address": "枫林路420号",
        "name": "枫林国际中心二期",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.261768,
            31.023318
        ],
        "address": "松卫北路665号",
        "name": "企福天地",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.532983,
            31.21625
        ],
        "address": "峨山路91弄48号",
        "name": "开伦鑫座",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.461261,
            31.203541
        ],
        "address": "肇嘉浜路258-268号",
        "name": "紫苑大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.510898,
            31.229468
        ],
        "address": "商城路341号",
        "name": "紫光大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.658022,
            31.265358
        ],
        "address": "金海路2668弄",
        "name": "金泰广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.490282,
            31.294599
        ],
        "address": "逸仙路25号",
        "name": "同济逸仙大厦（同济晶度）",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.515012,
            31.141023
        ],
        "address": "永泰路595弄42-68号",
        "name": "金谊河畔二期",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.480185,
            31.201216
        ],
        "address": "蒙自路501弄",
        "name": "德福苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.400718,
            31.26885
        ],
        "address": "水泉路99弄",
        "name": "达安春之声花园二期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.5575,
            31.272188
        ],
        "address": "杨树浦路2893号",
        "name": "海尚大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.426177,
            31.284049
        ],
        "address": "阳城路283弄",
        "name": "大华阳城花园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.480442,
            31.204522
        ],
        "address": "斜土路298弄",
        "name": "永业仁德坊",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.429699,
            31.235417
        ],
        "address": "长寿路822弄45支弄",
        "name": "汇丽花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.695049,
            31.200298
        ],
        "address": "川沙路718号",
        "name": "曹路创新产业园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.442356,
            31.241137
        ],
        "address": "陕西北路1283弄9号",
        "name": "玉城大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.440904,
            31.093636
        ],
        "address": "金都路618号",
        "name": "大量科创园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.544131,
            31.202365
        ],
        "address": "浦建路1458弄",
        "name": "志豪公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.387583,
            31.178567
        ],
        "address": "吴中路1050号",
        "name": "虹桥盛世莲花广场A楼",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.482567,
            31.25871
        ],
        "address": "四川北路1717号",
        "name": "嘉杰国际广场(办公楼)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.321951,
            31.289555
        ],
        "address": "银翔路655号",
        "name": "蓝天创业广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.448847,
            31.100321
        ],
        "address": "景联路257号",
        "name": "绿亮科创园(景联路)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.516797,
            31.205984
        ],
        "address": "临沂北路150弄",
        "name": "东南华庭",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.634752,
            31.208777
        ],
        "address": "张东路1761号",
        "name": "创企天地产业园",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.376809,
            31.176696
        ],
        "address": "先锋街525号",
        "name": "虹桥525",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.462478,
            31.248369
        ],
        "address": "共和新路318弄",
        "name": "凯成苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.507716,
            31.251479
        ],
        "address": "东大名路1050号",
        "name": "绿地浦创商务大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.189705,
            31.003139
        ],
        "address": "云逸路925弄",
        "name": "辰源新苑",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.493296,
            31.266706
        ],
        "address": "四平路460弄",
        "name": "新陆花苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.468481,
            31.227989
        ],
        "address": "威海路128号",
        "name": "长发大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.44513,
            31.367086
        ],
        "address": "水产路2399号",
        "name": "泰富商业广场（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.291885,
            31.20993
        ],
        "address": "繁兴路399弄1号",
        "name": "华漕生活馆",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.801261,
            30.89819
        ],
        "address": "彩云路843弄",
        "name": "云树仁居",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.501038,
            31.205956
        ],
        "address": "半淞园路20号",
        "name": "世发大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.218018,
            31.066699
        ],
        "address": "云恩路59弄",
        "name": "松江悦都二期",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.460864,
            31.231078
        ],
        "address": "南京西路818号",
        "name": "长春藤运通大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.426173,
            31.193661
        ],
        "address": "虹桥路666弄",
        "name": "虹桥乐庭",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.477465,
            31.262033
        ],
        "address": "华昌路79号",
        "name": "华昌公寓(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.513617,
            31.195629
        ],
        "address": "临沂路128号",
        "name": "惠盛大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.396493,
            31.213305
        ],
        "address": "天山路600弄1号",
        "name": "同达创业大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.205528,
            31.228039
        ],
        "address": "华南路555号",
        "name": "顺丰上海产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.480132,
            31.227123
        ],
        "address": "金陵东路500号",
        "name": "亚龙国际广场",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.515018,
            31.232394
        ],
        "address": "浦东南路855号",
        "name": "世界广场",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.386663,
            31.269936
        ],
        "address": "真南路708号",
        "name": "申环商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.402642,
            31.267838
        ],
        "address": "水泉路88弄",
        "name": "达安春之声一期",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.278668,
            31.159126
        ],
        "address": "联民路100弄",
        "name": "正荣府",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.39972,
            31.20535
        ],
        "address": "古北路666号",
        "name": "嘉麒大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.484142,
            31.204906
        ],
        "address": "制造局路466号",
        "name": "裕和公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.174306,
            31.284086
        ],
        "address": "安驰路509弄",
        "name": "尚都国际大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.267697,
            31.38144
        ],
        "address": "新成路261弄之1-18号",
        "name": "迎园东一坊",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.362866,
            31.25927
        ],
        "address": "金鼎路2388弄",
        "name": "金鼎香樟苑2388弄",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.408156,
            31.313805
        ],
        "address": "上大路1号",
        "name": "文景楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.428622,
            31.183807
        ],
        "address": "宜山路425号",
        "name": "光启城",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.361124,
            31.129959
        ],
        "address": "顾戴路2337号",
        "name": "维璟中心A座",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.31825,
            31.141282
        ],
        "address": "沪亭北路199弄",
        "name": "九亭中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.408523,
            31.259753
        ],
        "address": "潮州路508号",
        "name": "仁杰众创空间产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.447733,
            31.394191
        ],
        "address": "友谊路1869弄",
        "name": "海尚明城",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.397607,
            31.267065
        ],
        "address": "真南路150号",
        "name": "沪西德必易园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.46534,
            31.243952
        ],
        "address": "天目中路520号",
        "name": "北苑大厦(520号)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.487413,
            31.214838
        ],
        "address": "黄家阙路65-69号",
        "name": "惠德大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.507322,
            31.241745
        ],
        "address": "银城中路8号",
        "name": "中融碧玉蓝天",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.527501,
            31.208815
        ],
        "address": "浦建路365弄",
        "name": "金龙东苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.59354,
            31.328503
        ],
        "address": "秋岚路251弄",
        "name": "高行绿洲二期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.612298,
            31.269104
        ],
        "address": "佳乐路77弄",
        "name": "阳光国际公寓",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.488684,
            31.256236
        ],
        "address": "新嘉路1弄",
        "name": "瑞嘉苑小区",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.486611,
            31.239484
        ],
        "address": "上海黄浦区宁波路1号",
        "name": "申华金融大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450406,
            31.234316
        ],
        "address": "陕西北路688号",
        "name": "静工创意智社（智社iCommune）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.610237,
            31.254079
        ],
        "address": "金湘路345号",
        "name": "同华大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.418423,
            31.356392
        ],
        "address": "水产西路680弄",
        "name": "绿地宝里",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.558606,
            31.252008
        ],
        "address": "德平路58弄",
        "name": "金云苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.442028,
            31.192403
        ],
        "address": "天钥桥路123号",
        "name": "城开YOYO联合办公",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.375254,
            31.217064
        ],
        "address": "蒲松北路10号",
        "name": "申亚时代广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.369101,
            31.255942
        ],
        "address": "曹安路4671号",
        "name": "上海北虹桥协通产业园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.418653,
            31.20652
        ],
        "address": "新华路726号",
        "name": "新华世纪园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.743113,
            31.062713
        ],
        "address": "拱乐路2400弄",
        "name": "荣春苑南苑",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.596763,
            31.346603
        ],
        "address": "奥纳路188号",
        "name": "诚信国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.520775,
            31.287614
        ],
        "address": "黄兴路1599弄",
        "name": "新纪元国际广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.497397,
            31.262629
        ],
        "address": "天宝路181弄",
        "name": "瑞虹新城 铭庭",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.496484,
            31.251371
        ],
        "address": "东汉阳路338弄",
        "name": "宇泰公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.442437,
            31.330967
        ],
        "address": "长江西路2036弄1、2号",
        "name": "汇秀公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.651631,
            31.201304
        ],
        "address": "创新西路333弄",
        "name": "唐丰苑",
        "count": 78,
        "style": 0
    },
    {
        "lnglat": [
            121.50859,
            31.234689
        ],
        "address": "世纪大道160号",
        "name": "览海国际广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.530955,
            31.223817
        ],
        "address": "福山路450号",
        "name": "新天国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.420112,
            31.178145
        ],
        "address": "柳州路600弄",
        "name": "金丽广场(上海)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.536939,
            31.266085
        ],
        "address": "锦州湾路27弄",
        "name": "和瑞雅苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.437869,
            31.218424
        ],
        "address": "延安西路396号",
        "name": "美丽园大酒店",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.429281,
            31.193002
        ],
        "address": "虹桥路500号",
        "name": "中城国际大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.459037,
            31.256037
        ],
        "address": "大统路1038号",
        "name": "博苑公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.510362,
            31.163538
        ],
        "address": "板泉路1555弄",
        "name": "尚东国际名园一期",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.398128,
            31.120744
        ],
        "address": "罗锦路888弄",
        "name": "上海阳城(1至8支弄)",
        "count": 73,
        "style": 0
    },
    {
        "lnglat": [
            121.772793,
            31.055729
        ],
        "address": "拱北路313弄",
        "name": "汇港国际商务广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.669749,
            31.273241
        ],
        "address": "川沙路688号",
        "name": "浦江智汇创业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.605319,
            31.128415
        ],
        "address": "秀浦路2388号",
        "name": "上海康桥先进制造技术创业园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.459037,
            31.256037
        ],
        "address": "大统路1038号",
        "name": "博苑公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.492801,
            31.33087
        ],
        "address": "何家湾路111弄",
        "name": "美岸栖庭三期",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.444652,
            31.191342
        ],
        "address": "南丹东路99弄",
        "name": "天际花园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.112151,
            31.181966
        ],
        "address": "久业路89号",
        "name": "松港智造工坊",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.535388,
            31.293711
        ],
        "address": "佳木斯路353号",
        "name": "白玉兰环保广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.498023,
            31.064156
        ],
        "address": "浦雪南路206弄",
        "name": "滨浦新苑六村",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.396493,
            31.213305
        ],
        "address": "天山路600弄",
        "name": "思创大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.325376,
            31.288884
        ],
        "address": "众仁路375号",
        "name": "勇立大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.432954,
            31.365532
        ],
        "address": "蕴川路1498号",
        "name": "天馨花园",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.482623,
            31.235526
        ],
        "address": "汉口路400号",
        "name": "华盛大厦（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.430522,
            31.393669
        ],
        "address": "虹梅南路4999弄",
        "name": "燎申智城",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.513768,
            31.195327
        ],
        "address": "临沂路115弄1-3号",
        "name": "上海汇景阁",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.700093,
            31.175652
        ],
        "address": "华戴路599弄 ",
        "name": "凯佳公寓二期",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.473636,
            31.220713
        ],
        "address": "太仓路233号",
        "name": "新茂大厦",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.50091,
            31.274069
        ],
        "address": "四平路2500弄",
        "name": "金岛大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.438562,
            31.232867
        ],
        "address": "昌平路935号",
        "name": "昌平大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.411235,
            31.219881
        ],
        "address": "中山西路179号，189弄",
        "name": "虹桥世家花园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.456007,
            31.394166
        ],
        "address": "友谊路1506号",
        "name": "东智商务广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.421907,
            31.125115
        ],
        "address": "虹梅南路833号",
        "name": "国民新能源环保孵化园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.32396,
            31.205828
        ],
        "address": "申昆路1999号",
        "name": "长三角电子商务中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.441955,
            31.246461
        ],
        "address": "江宁路1306弄10、12号",
        "name": "燕兴大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.53911,
            31.299792
        ],
        "address": "包头南路629弄",
        "name": "杨浦欣园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.438445,
            31.190551
        ],
        "address": "漕溪北路375号",
        "name": "中金国际广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.480119,
            31.225106
        ],
        "address": "淮海中路1号",
        "name": "柳林大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.422362,
            31.200428
        ],
        "address": "安顺路89弄8号",
        "name": "浦江大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.543788,
            31.287661
        ],
        "address": "控江路128弄",
        "name": "韵都城（上海）",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.4399,
            31.19191
        ],
        "address": "漕溪北路45号",
        "name": "航空科技大厦",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.512199,
            31.256905
        ],
        "address": "长阳路288号",
        "name": "兰侨大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.520359,
            30.916969
        ],
        "address": "德泉路336弄",
        "name": "贤德名苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.415243,
            31.362507
        ],
        "address": "顾北东路39弄",
        "name": "和家欣苑D区",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.432774,
            31.161938
        ],
        "address": "沪闵路9260号",
        "name": "徐汇公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.736829,
            31.068665
        ],
        "address": "拱海路78弄",
        "name": "民乐城惠康苑(西苑)",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.384871,
            31.211258
        ],
        "address": "威宁路258号",
        "name": "天申综合大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.421809,
            31.265723
        ],
        "address": "灵石路1669弄",
        "name": "东旺雍景苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.470984,
            31.233581
        ],
        "address": "黄河路21号",
        "name": "鸿祥大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.603098,
            31.116331
        ],
        "address": "周邓公路6600弄",
        "name": "海尚乐苑",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.46511,
            31.249364
        ],
        "address": "虬江路1488弄",
        "name": "精文城市花园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.365522,
            31.067926
        ],
        "address": "华西路600号",
        "name": "优大科技园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.413811,
            31.266762
        ],
        "address": "新村路1321号",
        "name": "新村路1321号",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.418382,
            31.108625
        ],
        "address": "梅富路228号",
        "name": "春申创意园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.4418,
            31.156129
        ],
        "address": "石龙路329号",
        "name": "智慧谷(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42786,
            31.210864
        ],
        "address": "延安西路1221号",
        "name": "泛太大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.262559,
            31.103951
        ],
        "address": "洞伟路655弄1-13号",
        "name": "塘和家园文康苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.44409,
            31.322059
        ],
        "address": "共和新路5000号",
        "name": "绿地新都会（风尚天地）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.166874,
            31.318544
        ],
        "address": "德友路77号",
        "name": "旭辉公元（上海）",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.428866,
            31.349401
        ],
        "address": "共富路228弄",
        "name": "共富花园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.534552,
            31.291808
        ],
        "address": "松花江路287号",
        "name": "伊格尔公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.444941,
            31.258149
        ],
        "address": "骊山路34弄12号",
        "name": "华经大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.461024,
            30.9427
        ],
        "address": "南桥镇奉浦大道97号",
        "name": "绿地智尊",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.518049,
            31.230226
        ],
        "address": "商城路618号",
        "name": "上海良友大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.402278,
            31.132612
        ],
        "address": "古方路18号",
        "name": "南方休闲广场商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42351,
            31.045076
        ],
        "address": "放鹤路2323号",
        "name": "万顺苑小区",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.239114,
            31.373482
        ],
        "address": "塔城路718弄",
        "name": "金地格林春岸",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.474864,
            30.96109
        ],
        "address": "望园路1698弄",
        "name": "聚惠领域_百村创业园B区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.580087,
            31.257725
        ],
        "address": "金桥路939号",
        "name": "宏南投资大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.54306,
            31.236579
        ],
        "address": "张杨路1673弄",
        "name": "生安花苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.415723,
            31.173968
        ],
        "address": "宜山路705号",
        "name": "上海科技大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.477181,
            31.261452
        ],
        "address": "宝山路625号",
        "name": "上海金宝大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.430334,
            31.160162
        ],
        "address": "浦北路6号",
        "name": "德必世纪WE",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.439183,
            31.154422
        ],
        "address": "永川路187号",
        "name": "经纬梦园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.425103,
            31.197029
        ],
        "address": "淮海西路343号",
        "name": "淮海鑫城苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.424146,
            31.194764
        ],
        "address": "虹桥路808号",
        "name": "加华广场(汇宜众创空间)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.46047,
            31.20781
        ],
        "address": "嘉善路251弄",
        "name": "嘉善公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.481789,
            31.280576
        ],
        "address": "广纪路19号",
        "name": "翰林苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.52866,
            31.175248
        ],
        "address": "成山路1488弄",
        "name": "大华锦绣华城15街区二期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.503381,
            31.341161
        ],
        "address": "国权北路1688弄",
        "name": "湾谷科技园",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.744681,
            31.059798
        ],
        "address": "拱鸣路60弄",
        "name": "丽冬苑",
        "count": 63,
        "style": 0
    },
    {
        "lnglat": [
            121.433858,
            31.25287
        ],
        "address": "光新路182弄",
        "name": "一品国际",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.353642,
            31.146324
        ],
        "address": "宝联路88弄",
        "name": "枫荷兰庭",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.426147,
            31.185262
        ],
        "address": "古宜路99弄",
        "name": "天杰徐汇宜德苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.314094,
            31.119776
        ],
        "address": "金马路159号",
        "name": "春乐投资商务园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.425928,
            31.219444
        ],
        "address": "愚园路1258号",
        "name": "绿地商务大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.515846,
            31.211279
        ],
        "address": "塘桥新路201弄",
        "name": "东方天伦大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.446685,
            31.218919
        ],
        "address": "华山路301号",
        "name": "上海静安商楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.311486,
            31.234345
        ],
        "address": "金耀南路80弄",
        "name": "绿地新江桥城80弄",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.376466,
            31.191264
        ],
        "address": "虹桥路2272号",
        "name": "虹桥商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.492263,
            31.262671
        ],
        "address": "临平北路60弄",
        "name": "银欣花苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.486529,
            31.275712
        ],
        "address": "欧阳路681弄1-7号",
        "name": "山水苑(上海)",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.28428,
            31.37157
        ],
        "address": "茂华路99弄",
        "name": "华谊禄丰苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.458435,
            31.204464
        ],
        "address": "襄阳南路489号",
        "name": "金环大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.478421,
            31.26572
        ],
        "address": "同心路28弄",
        "name": "嘉宏紫薇园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.496799,
            31.15714
        ],
        "address": "灵岩南路295号",
        "name": "三林世博创意园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.606509,
            31.315874
        ],
        "address": "台中南路2号",
        "name": "新贸楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.557849,
            31.240921
        ],
        "address": "张杨路2242弄",
        "name": "翡翠湾公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.302596,
            31.232595
        ],
        "address": "爱特路866号",
        "name": "歆翱国际商务园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.602178,
            31.335148
        ],
        "address": "富特北路399号",
        "name": "华三实业",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.596593,
            31.188247
        ],
        "address": "张衡路666弄",
        "name": "盛大全球研发中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.53053,
            31.208251
        ],
        "address": "浦建路727号",
        "name": "东方金座",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.226411,
            31.130763
        ],
        "address": "嘉松中路6788弄",
        "name": "龙湖滟澜山一期",
        "count": 85,
        "style": 0
    },
    {
        "lnglat": [
            121.361951,
            31.221762
        ],
        "address": "淞虹路128弄",
        "name": "金淞家园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.485736,
            31.214329
        ],
        "address": "西藏南路831弄",
        "name": "交通大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.488542,
            31.21484
        ],
        "address": "中华路168弄",
        "name": "浦江公馆",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.518718,
            31.230505
        ],
        "address": "商城路660号",
        "name": "乐凯大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.564196,
            31.229408
        ],
        "address": "丁香路1399弄30号",
        "name": "仁恒邻里之家",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.495648,
            31.170883
        ],
        "address": "成山路220号",
        "name": "上海城建大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.447653,
            31.319201
        ],
        "address": "共和新路4727号",
        "name": "新陆国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.622357,
            31.25984
        ],
        "address": "新金桥路1888号36号楼",
        "name": "凯龙金领大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.225786,
            31.376306
        ],
        "address": "胜辛路3285号",
        "name": "运通大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.22205,
            31.380739
        ],
        "address": "秋竹路618弄",
        "name": "叠翠峰苑一期",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.419855,
            31.138052
        ],
        "address": "凌云路梅陇四村95号",
        "name": "梅陇四村凌云公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.420185,
            31.269082
        ],
        "address": "新沪路198弄",
        "name": "久华佳苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.519858,
            31.287247
        ],
        "address": "国科路39弄",
        "name": "贵仁绿苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.462977,
            31.213618
        ],
        "address": "茂名南路205号",
        "name": "瑞金大厦（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.417865,
            31.176881
        ],
        "address": "宜山路700号",
        "name": "普天科创产业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.500845,
            31.256659
        ],
        "address": "丹徒路405号",
        "name": "景泰大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.352339,
            31.411975
        ],
        "address": "月罗公路2333号",
        "name": "兰湖美域",
        "count": 95,
        "style": 0
    },
    {
        "lnglat": [
            121.497576,
            31.387453
        ],
        "address": "水产路409号",
        "name": "上海炮台商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.517512,
            31.267792
        ],
        "address": "周家嘴路2188弄",
        "name": "泰鸿苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.477715,
            31.198774
        ],
        "address": "瞿溪路988号",
        "name": "汇暻生活广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.496871,
            31.253701
        ],
        "address": "周家嘴路338弄",
        "name": "馨虹苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.588683,
            31.300729
        ],
        "address": "德爱路450弄",
        "name": "阳光城MODO自由区（上海MODO自由区）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.459363,
            31.236018
        ],
        "address": "石门二路333弄3号",
        "name": "振安广场_恒安大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.445866,
            31.04175
        ],
        "address": "曹家塘路229弄",
        "name": "永德宝邸南区",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.471449,
            31.239117
        ],
        "address": "南苏州路999号",
        "name": "象屿集团大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.483462,
            31.247648
        ],
        "address": "黄浦路99号",
        "name": "上海滩国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.439504,
            31.188753
        ],
        "address": "南丹东路228弄",
        "name": "金轩公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.198409,
            31.410886
        ],
        "address": "汇源路778弄",
        "name": "首创旭辉城2期",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.452218,
            31.244827
        ],
        "address": "长安路1001号",
        "name": "长安大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.417498,
            31.232958
        ],
        "address": "宁夏路366弄",
        "name": "绿地世家",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.269708,
            31.406196
        ],
        "address": "胜竹路1364号（双坪路285弄）",
        "name": "景悦名苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.414617,
            31.200083
        ],
        "address": "安顺路251号",
        "name": "虹桥银都大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.255982,
            31.352404
        ],
        "address": "德富路1388弄",
        "name": "阳光城新界(上海新界）",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.593086,
            31.135763
        ],
        "address": "秀沿路1668号",
        "name": "八元桥创新创业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.36462,
            31.253917
        ],
        "address": "曹安公路1718号",
        "name": "威隆大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.509853,
            31.129501
        ],
        "address": "林德路718弄",
        "name": "东方康德家园二期",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.500686,
            31.183055
        ],
        "address": "浦东南路4250弄",
        "name": "雪野家园",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.484881,
            31.295571
        ],
        "address": "纪念路488弄",
        "name": "荣振馨苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.456377,
            31.236129
        ],
        "address": "泰兴路555号",
        "name": "武泰公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.428132,
            31.2251
        ],
        "address": "长宁路269弄",
        "name": "静安风华苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.47329,
            31.19283
        ],
        "address": "龙华东路868号",
        "name": "绿地海外滩中心",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.40179,
            31.28496
        ],
        "address": "真北路3725弄11号",
        "name": "V领地青年社区真北路社区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.614465,
            31.144176
        ],
        "address": "川周公路2880号",
        "name": "旭辉亚瑟郡",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.410287,
            31.236723
        ],
        "address": "梅岭南路380弄",
        "name": "常高公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.411911,
            31.240913
        ],
        "address": "曹杨路859弄",
        "name": "联农大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.415759,
            31.335113
        ],
        "address": "南蕴藻路408号",
        "name": "栋霖科技园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.36121,
            31.266057
        ],
        "address": "绥德路889弄",
        "name": "3点3万小区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.277776,
            30.996851
        ],
        "address": "欣浪路888弄",
        "name": "松南城华品苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.372045,
            31.185655
        ],
        "address": "程家桥路168弄39号",
        "name": "大树下新媒体创意产业园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.727952,
            31.225688
        ],
        "address": "高科东路与庆利路交界口东北角",
        "name": "绿地海岸城",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.420801,
            31.29046
        ],
        "address": "沪太路1861弄39号",
        "name": "岛里创新园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.529685,
            31.221481
        ],
        "address": "东方路989号",
        "name": "中达广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.418741,
            31.236007
        ],
        "address": "曹杨路455弄",
        "name": "尚诚国际苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.492236,
            31.201393
        ],
        "address": "西藏南路1639号",
        "name": "精文苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.473328,
            31.197637
        ],
        "address": "打浦路443号",
        "name": "荣科大厦（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.442888,
            31.188805
        ],
        "address": "天钥桥路325号",
        "name": "嘉汇国际广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.634392,
            31.317354
        ],
        "address": "园二路299弄",
        "name": "广盛佳苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.537085,
            31.36475
        ],
        "address": "顺凌路49弄1-45号、顺凌路147号",
        "name": "金色郦苑",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.560826,
            31.258768
        ],
        "address": "浦东大道2515号、2521号",
        "name": "金茂花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.511865,
            31.261391
        ],
        "address": "唐山路1018号",
        "name": "宝地广场",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.316538,
            31.120395
        ],
        "address": "久富路225号",
        "name": "玖福大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.343007,
            31.29126
        ],
        "address": "真南路3435弄",
        "name": "安达家园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.381143,
            31.26984
        ],
        "address": "真南路895弄",
        "name": "真南路895弄",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.446809,
            31.283427
        ],
        "address": "灵石路697-3号",
        "name": "巨丰国际商务广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.529657,
            31.258171
        ],
        "address": "平凉路1090弄",
        "name": "天科国际商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.422651,
            31.194722
        ],
        "address": "虹桥路888号",
        "name": "阳光名邸",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.424414,
            31.112058
        ],
        "address": "春申路1955号",
        "name": "陇盛大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.520223,
            31.214081
        ],
        "address": "峨山路679弄",
        "name": "浦江映象",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.499736,
            31.259403
        ],
        "address": "公平路761号",
        "name": "虹业大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.337913,
            31.384845
        ],
        "address": "上海市宝山区天家路200弄",
        "name": "美罗家园宝欣苑五村",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.401729,
            31.157986
        ],
        "address": "东兰路238号",
        "name": "古美创智中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.715015,
            31.248032
        ],
        "address": "东川公路5237号",
        "name": "日角大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.606546,
            31.239455
        ],
        "address": "锦绣东路1999号",
        "name": "麦腾智慧天地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.48512,
            31.292581
        ],
        "address": "吴家湾路61弄24-34号",
        "name": "住安产业中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.537366,
            31.264865
        ],
        "address": "宁国路228号B座",
        "name": "郡江国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.548394,
            31.230818
        ],
        "address": "灵山路708弄",
        "name": "申立苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.433397,
            31.187179
        ],
        "address": "蒲汇塘路101号",
        "name": "沪贵苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.212657,
            31.039241
        ],
        "address": "新松江路1234号",
        "name": "恒杰商务大楼A座",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.486075,
            31.285126
        ],
        "address": "东体育会路880弄",
        "name": "银联花园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.460891,
            31.204547
        ],
        "address": "陕西南路888弄",
        "name": "汇景苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.401428,
            31.238611
        ],
        "address": "梅川路145号",
        "name": "西部秀苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.412962,
            31.097106
        ],
        "address": "莲花南路1500弄",
        "name": "麦多生活广场",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.324291,
            31.136663
        ],
        "address": "沪亭路880号",
        "name": "云亭德必易园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.442493,
            31.195156
        ],
        "address": "肇嘉浜路999弄",
        "name": "上海帝景苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.447959,
            31.227171
        ],
        "address": "北京西路1465号",
        "name": "国立大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.488205,
            31.251122
        ],
        "address": "吴淞路469号",
        "name": "森林湾大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.347784,
            30.750705
        ],
        "address": "海芙路186弄",
        "name": "金山悦立方商业广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.486577,
            31.321081
        ],
        "address": "高逸路29号",
        "name": "复客北翼创想中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.355036,
            31.280582
        ],
        "address": "武威路2600弄",
        "name": "新华悦都",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.436521,
            31.201597
        ],
        "address": "华山路1765弄",
        "name": "海斯大厦（裙楼）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.47029,
            31.232354
        ],
        "address": "南京西路288号",
        "name": "创兴金融中心",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.510627,
            31.235526
        ],
        "address": "世纪大道211号",
        "name": "上海信息大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.467163,
            31.232134
        ],
        "address": "成都北路500号",
        "name": "峻岭广场",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.526253,
            31.221089
        ],
        "address": "浦电路400弄",
        "name": "兴业嘉园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.60283,
            31.074415
        ],
        "address": "鹤永路600弄",
        "name": "鹤沙航城东茗苑(上海)",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.422873,
            31.204064
        ],
        "address": "新华路519号",
        "name": "新华御庭",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.086243,
            31.135477
        ],
        "address": "朱家角路158弄",
        "name": "大发融悦华庭",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.432563,
            31.201756
        ],
        "address": "新华路2号",
        "name": "鸿发苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.399614,
            31.132782
        ],
        "address": "沪闵路7580弄111支弄",
        "name": "南方城(上海)",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.470143,
            31.220842
        ],
        "address": "雁荡路5号",
        "name": "金雁坊",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.479364,
            31.207034
        ],
        "address": "丽园路700号",
        "name": "经纬天地园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.567856,
            31.16797
        ],
        "address": "莲振路269号",
        "name": "贤诺国际青年社区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.416127,
            31.215371
        ],
        "address": "凯旋路369号",
        "name": "龙之梦雅仕大厦",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.478894,
            31.22255
        ],
        "address": "普安路189号",
        "name": "曙光大厦(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.406139,
            31.071117
        ],
        "address": "颛桥镇颛兴东路1559号万达广场(颛桥店)F1层",
        "name": "孩子王(上海颛桥万达店)",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.086243,
            31.135477
        ],
        "address": "朱家角路158弄",
        "name": "大发融悦华庭",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.465797,
            31.195746
        ],
        "address": "零陵北路9弄",
        "name": "日晖新城",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.416673,
            31.237868
        ],
        "address": "曹杨路619号",
        "name": "近铁云中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.562925,
            31.229038
        ],
        "address": "迎春路1355弄",
        "name": "浦东虹桥公寓",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.43443,
            31.201471
        ],
        "address": "淮海西路55号",
        "name": "申通信息广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.448256,
            31.240493
        ],
        "address": "江宁路826弄",
        "name": "天香公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.448467,
            31.268926
        ],
        "address": "延长中路625号",
        "name": "延长工业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.235476,
            31.355167
        ],
        "address": "招贤路1181号",
        "name": "意安乐创中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.339175,
            31.449144
        ],
        "address": "金勺路1688号",
        "name": "卓维园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.491481,
            31.287027
        ],
        "address": "曲阳路800号",
        "name": "上海商务中心大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.366743,
            31.243255
        ],
        "address": "祁连山南路999弄",
        "name": "金沙嘉年华",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.497263,
            31.166859
        ],
        "address": "上南路2779号",
        "name": "大桥海达楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.501491,
            31.241787
        ],
        "address": "东园路18号",
        "name": "中国金融信息中心",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.807369,
            30.899604
        ],
        "address": "彩云路568弄",
        "name": "云松华庭",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.450133,
            31.092589
        ],
        "address": "双柏路518号",
        "name": "双柏工业园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.491517,
            31.263507
        ],
        "address": "临平北路68号",
        "name": "虹临大厦（虹临宝都）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.248088,
            31.364783
        ],
        "address": "良舍路199号",
        "name": "右岸嘉园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.65591,
            31.025437
        ],
        "address": "牌楼东路528弄",
        "name": "清林径",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.486051,
            31.254354
        ],
        "address": "吴淞路669号",
        "name": "申贝大厦（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.513477,
            31.059887
        ],
        "address": "沈杜公路4285号",
        "name": "程文商务中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.440398,
            31.245915
        ],
        "address": "澳门路477号",
        "name": "中华1912创意园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.52918,
            31.240188
        ],
        "address": "源深路92号",
        "name": "航科大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.418353,
            31.20579
        ],
        "address": "新华路720号",
        "name": "交通公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.628515,
            31.083766
        ],
        "address": "康新公路2333号",
        "name": "天慈生物医药生产基地（天慈国际产业园）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.40112,
            31.114809
        ],
        "address": "伟业路780弄",
        "name": "梅香苑东苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.49039,
            31.337026
        ],
        "address": "长逸路388弄",
        "name": "鹏程花苑（上海）",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.482339,
            31.203111
        ],
        "address": "局门路427号",
        "name": "智造局二期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.48364,
            31.237328
        ],
        "address": "南京东路328号雅戈尔大厦",
        "name": "雅戈尔大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.431145,
            31.182253
        ],
        "address": "凯进路151号",
        "name": "中油大厦（中油企业大厦）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.311372,
            31.203531
        ],
        "address": "申郑路18弄",
        "name": "万科时一区一期(虹桥万科润园)",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.554012,
            31.227039
        ],
        "address": "丁香路999弄",
        "name": "联洋花园二期",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.349338,
            31.466366
        ],
        "address": "潘泾路4777弄",
        "name": "宝山上河苑",
        "count": 69,
        "style": 0
    },
    {
        "lnglat": [
            121.243277,
            31.058027
        ],
        "address": "广富林路658号",
        "name": "松江万达广场商务楼",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.478681,
            31.295087
        ],
        "address": "车站南路198弄",
        "name": "虹口嘉苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.612046,
            31.211635
        ],
        "address": "张江路75号10幢",
        "name": "海德堡中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.431414,
            31.161489
        ],
        "address": "钦州路111弄6号",
        "name": "钦州大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.610793,
            31.276969
        ],
        "address": "乐园路198号",
        "name": "FSPACE金桥中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.444652,
            31.191342
        ],
        "address": "南丹东路99弄",
        "name": "天际花园三期",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.483491,
            31.261503
        ],
        "address": "四川北路1851号",
        "name": "荣欣大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.483004,
            31.212548
        ],
        "address": "方斜路525号",
        "name": "明华大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.502021,
            31.278676
        ],
        "address": "赤峰路59弄",
        "name": "书香公寓",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.27984,
            31.330568
        ],
        "address": "宝安公路3386号",
        "name": "孩子王(上海大融城店)",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.490817,
            31.215324
        ],
        "address": "尚文路168号",
        "name": "东波大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.297351,
            31.207358
        ],
        "address": "繁兴路99-1临",
        "name": "泊寓（虹桥繁星店）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.248415,
            31.101672
        ],
        "address": "泽悦路212弄",
        "name": "水仙雅苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.603441,
            31.335345
        ],
        "address": "泰谷路168号",
        "name": "烨博智慧园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.328242,
            31.257299
        ],
        "address": "临夏路800弄",
        "name": "汇丰沁苑北区",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.484679,
            31.316107
        ],
        "address": "逸仙路1300号",
        "name": "悦樘公寓(殷高西路店)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.424311,
            31.183359
        ],
        "address": "中山西路1800号",
        "name": "兆丰环球大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.603031,
            31.273889
        ],
        "address": "凌河路777弄",
        "name": "金桥一方雅苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.461369,
            31.240004
        ],
        "address": "南苏州路1455号",
        "name": "南苏55苏河文创中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.474032,
            31.259488
        ],
        "address": "宝昌路399弄",
        "name": "绿景晓园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.388348,
            31.100548
        ],
        "address": "春申路3755号",
        "name": "春申路3755号商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.475224,
            31.264195
        ],
        "address": "华昌路183弄",
        "name": "华清名苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.43426,
            31.214368
        ],
        "address": "延安西路719号",
        "name": "佳都大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.55902,
            31.156062
        ],
        "address": "康杉路108弄3号",
        "name": "沃众创业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.524906,
            31.266692
        ],
        "address": "齐齐哈尔路928号",
        "name": "印坊928",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.422318,
            31.125218
        ],
        "address": "莲花南路588弄",
        "name": "未名园",
        "count": 53,
        "style": 0
    },
    {
        "lnglat": [
            121.42376,
            31.206433
        ],
        "address": "定西路657号",
        "name": "大吉地世贸大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.401661,
            31.001136
        ],
        "address": "江川路680弄",
        "name": "友好佳苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.409444,
            31.245213
        ],
        "address": "曹杨路1040弄1号",
        "name": "中友大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.457345,
            31.198248
        ],
        "address": "小木桥路224号",
        "name": "儿科大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.481805,
            31.232589
        ],
        "address": "广东路500号",
        "name": "上海世界贸易大厦",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.510321,
            31.229357
        ],
        "address": "商城路297号",
        "name": "申金大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.586468,
            31.114207
        ],
        "address": "年家浜路28弄",
        "name": "逸亭佳苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.559255,
            31.212756
        ],
        "address": "银霄路39弄",
        "name": "浦东世纪花园二期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.397219,
            31.213349
        ],
        "address": "天山路600弄2号",
        "name": "新虹桥捷运大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.433312,
            31.233442
        ],
        "address": "余姚路566弄",
        "name": "均泰丽轩",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.50362,
            31.265001
        ],
        "address": "飞虹路288弄",
        "name": "宇泰景苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.431242,
            31.299944
        ],
        "address": "少年村路451弄68号",
        "name": "景和创意园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.552908,
            31.222856
        ],
        "address": "迎春路736弄",
        "name": "联洋新苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.44985,
            31.236774
        ],
        "address": "江宁路631号",
        "name": "新建大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426965,
            31.228227
        ],
        "address": "长宁路88号",
        "name": "长宁八八中心",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.38343,
            31.221925
        ],
        "address": "云岭东路599弄",
        "name": "汇银金融商务楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.4144,
            31.267718
        ],
        "address": "大华一路239弄",
        "name": "大华虎城商务中心",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.412366,
            31.216217
        ],
        "address": "长宁路1277弄",
        "name": "中山公寓",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.41983,
            31.207718
        ],
        "address": "法华镇路881弄",
        "name": "东湖名苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.529958,
            31.222815
        ],
        "address": "东方路971号",
        "name": "钱江大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.534527,
            31.223638
        ],
        "address": "世纪大道1600号",
        "name": "陆家嘴商务广场（浦项商务广场）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.516905,
            31.20757
        ],
        "address": "浦东南路2157、2159号",
        "name": "众城商厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.372668,
            31.186249
        ],
        "address": "程家桥路175弄",
        "name": "虹桥奕境文创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.614117,
            31.142531
        ],
        "address": "川周公路2928弄",
        "name": "康庭苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.440507,
            31.29318
        ],
        "address": "万荣路1188号",
        "name": "龙软万荣基地",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.510619,
            31.305927
        ],
        "address": "伟成路62号",
        "name": "创智天地企业中心3号楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.717499,
            31.181877
        ],
        "address": "运盐河路1255弄",
        "name": "妙虹新苑",
        "count": 88,
        "style": 0
    },
    {
        "lnglat": [
            121.382046,
            31.154073
        ],
        "address": "龙茗路1897号",
        "name": "和润家园",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.481025,
            31.24675
        ],
        "address": "河南北路233号",
        "name": "圣和圣广场(丽晶馆)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.520547,
            31.228144
        ],
        "address": "张杨路628弄",
        "name": "繁荣昌盛",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.514674,
            31.255493
        ],
        "address": "大连路265号",
        "name": "振天商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.42351,
            31.154582
        ],
        "address": "桂林东街28弄",
        "name": "海上名邸",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.237441,
            31.042758
        ],
        "address": "文翔路928号",
        "name": "松云水苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.520046,
            31.215974
        ],
        "address": "北张家浜路28弄",
        "name": "嘉德公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.462652,
            31.280169
        ],
        "address": "广中路657号",
        "name": "ID657创意园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.433722,
            31.229853
        ],
        "address": "武宁南路287号",
        "name": "康定汽车公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.470679,
            31.201525
        ],
        "address": "斜土路780号",
        "name": "经宇商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.447736,
            31.21745
        ],
        "address": "常熟路85弄",
        "name": "神州商务大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.533453,
            31.223753
        ],
        "address": "世纪大道1568号",
        "name": "中建大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.412451,
            31.218598
        ],
        "address": "长宁路1318弄",
        "name": "城宁花苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.486296,
            31.267702
        ],
        "address": "四平路415号（四达路58弄靠近世博花园）",
        "name": "馥敦坊",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.454466,
            31.2306
        ],
        "address": "江宁路167号",
        "name": "新城大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.315116,
            31.208167
        ],
        "address": "申长路1466弄",
        "name": "虹桥富力中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.397145,
            31.344933
        ],
        "address": "沪太路4361号",
        "name": "海宝示范园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.430011,
            31.208368
        ],
        "address": "平武路31弄1-3号",
        "name": "平武公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.439501,
            31.189509
        ],
        "address": "南丹东路223弄",
        "name": "莱诗邸",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.711441,
            31.077117
        ],
        "address": "南六公路851号",
        "name": "翔灵电商园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.475283,
            31.27659
        ],
        "address": "水电路393弄1.2号",
        "name": "吉联大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.484169,
            31.234749
        ],
        "address": "福州路318号",
        "name": "华设大厦(浦汇大厦)",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.409397,
            31.232519
        ],
        "address": "杏山路12弄-1-9号",
        "name": "泰富苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.43941,
            31.237521
        ],
        "address": "安远路531号",
        "name": "阳光商务广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.336822,
            31.341947
        ],
        "address": "科福路825号",
        "name": "梁杭产业园(嘉定)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.423201,
            31.243133
        ],
        "address": "中山北路2550号",
        "name": "上海有色金属交易中心(物贸大厦)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.468829,
            31.252049
        ],
        "address": "西藏北路568号",
        "name": "上海铭德国际广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.336059,
            31.154357
        ],
        "address": "中春路8889弄",
        "name": "新都名园",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.604484,
            31.338933
        ],
        "address": "美盛路255号",
        "name": "众原企业天地",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.529795,
            31.224113
        ],
        "address": "向城路19号",
        "name": "众城公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.524226,
            31.229065
        ],
        "address": "东方路710号",
        "name": "汤臣金融大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.485414,
            31.251757
        ],
        "address": "武进路289号",
        "name": "海泰时代大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.373298,
            31.168144
        ],
        "address": "虹莘路3800弄",
        "name": "风度国际",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.431896,
            31.042551
        ],
        "address": "园区北路19号",
        "name": "上海雍臻公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.479493,
            31.262092
        ],
        "address": "宝山路778号",
        "name": "海伦国际",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.45788,
            31.205636
        ],
        "address": "襄阳南路500号",
        "name": "巴黎时韵",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.547408,
            31.231225
        ],
        "address": "灵山路717弄",
        "name": "中星景园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.422588,
            31.214719
        ],
        "address": "定西路1277-1279号",
        "name": "长峰大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.483965,
            31.292638
        ],
        "address": "广纪路738号",
        "name": "上海明珠创意产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.250332,
            31.10577
        ],
        "address": "古楼公路1198弄",
        "name": "同润山河小城",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.404861,
            31.324929
        ],
        "address": "纬地路99弄",
        "name": "经纬城市绿洲学士逸居家园",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.523173,
            31.149547
        ],
        "address": "尚博路650弄",
        "name": "金橘新苑南区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.706545,
            31.246095
        ],
        "address": "汇庆路366号",
        "name": "怡新生命科技园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.604541,
            31.172566
        ],
        "address": "盛荣路88弄1-16号",
        "name": "盛大天地源创谷",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.469891,
            31.250045
        ],
        "address": "西藏北路528弄",
        "name": "博园大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.504636,
            31.142005
        ],
        "address": "莘松路958弄三林道89号",
        "name": "上海康城二期",
        "count": 119,
        "style": 0
    },
    {
        "lnglat": [
            121.327377,
            30.895499
        ],
        "address": "车亭公路3489弄",
        "name": "长三角物流园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.589222,
            31.351632
        ],
        "address": "新兰路9号",
        "name": "晓富金融大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.455813,
            31.262785
        ],
        "address": "柳营路768弄",
        "name": "上海枫景苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.451953,
            31.234657
        ],
        "address": "江宁路445号",
        "name": "时美大厦商业楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.303437,
            31.295427
        ],
        "address": "沪宜公路1158号",
        "name": "久友大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.45714,
            31.240441
        ],
        "address": "恒通路360号",
        "name": "一天下大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.387345,
            31.233615
        ],
        "address": "金沙江路1340弄",
        "name": "新曹杨工业园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.464587,
            31.203103
        ],
        "address": "肇嘉浜路159号",
        "name": "友谊时代大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.438819,
            31.229165
        ],
        "address": "武定路1128弄",
        "name": "瀚林府邸",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.477812,
            31.201558
        ],
        "address": "鲁班路509弄",
        "name": "卢湾都市花园",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.519158,
            31.149194
        ],
        "address": "尚博路569弄",
        "name": "湾流域二期",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.524053,
            31.083311
        ],
        "address": "万康路290号",
        "name": "伟创禾谷科创园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.222384,
            31.185076
        ],
        "address": "嘉松中路4528号",
        "name": "8090青年创业基地华新园",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.422065,
            31.234387
        ],
        "address": "谈家渡路28号",
        "name": "谈家28文化信息商务港",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.511007,
            31.238716
        ],
        "address": "浦东大道1号",
        "name": "船舶大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.600818,
            31.343848
        ],
        "address": "富特东一路200号",
        "name": "嘉利斯大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.292636,
            30.987358
        ],
        "address": "车阳路50号",
        "name": "文昌企业园一期",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.41979,
            31.207997
        ],
        "address": "延安西路1600号",
        "name": "禾森商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.376116,
            31.325728
        ],
        "address": "塘祁路577弄",
        "name": "保利叶之林二期",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.422269,
            31.212248
        ],
        "address": "武夷路416弄",
        "name": "天诚花苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.389193,
            31.065533
        ],
        "address": "颛兴路666弄",
        "name": "日月华城",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.316495,
            31.06124
        ],
        "address": "新南街299弄",
        "name": "亚龙华泽新苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.462023,
            30.947043
        ],
        "address": "航谊路8号",
        "name": "宏普信息园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.507515,
            30.970989
        ],
        "address": "北行路555弄",
        "name": "朗诗未来街区",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.424663,
            31.221757
        ],
        "address": "长宁路546号",
        "name": "尚街Loft长宁会馆",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.586468,
            31.114207
        ],
        "address": "年家浜路28弄",
        "name": "逸亭佳苑商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.430049,
            31.174813
        ],
        "address": "钦州路840号-900号",
        "name": "钦州花苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.336385,
            31.150999
        ],
        "address": "新龙路1333弄",
        "name": "七宝万新国际中心",
        "count": 132,
        "style": 0
    },
    {
        "lnglat": [
            121.349153,
            31.156694
        ],
        "address": "吴宝路27弄50支弄",
        "name": "上海嘉丽苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.534161,
            31.358626
        ],
        "address": "康悦路325弄",
        "name": "浦凌佳苑",
        "count": 80,
        "style": 0
    },
    {
        "lnglat": [
            121.293289,
            31.150069
        ],
        "address": "朗亭路288弄",
        "name": "朗庭上郡苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.409883,
            31.224677
        ],
        "address": "中山北路3751弄3号",
        "name": "悦樘公寓(华师大店)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.573977,
            31.132688
        ],
        "address": "康沈路726弄",
        "name": "周康五村",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.44266,
            31.342861
        ],
        "address": "呼兰路799号9号楼",
        "name": "乐活家时尚公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.115811,
            31.159029
        ],
        "address": "盈港路453号",
        "name": "港隆国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.441132,
            31.289871
        ],
        "address": "万荣路1050号",
        "name": "万荣阳光苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.591493,
            31.245645
        ],
        "address": "新金桥路28号",
        "name": "新金桥大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.426316,
            31.224688
        ],
        "address": "江苏北路89号",
        "name": "新亚药业大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.436437,
            31.240773
        ],
        "address": "常德路1239号",
        "name": "常德大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.557522,
            31.272492
        ],
        "address": "杨树浦路2866号",
        "name": "上海国际时尚中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.302734,
            31.142946
        ],
        "address": "涞寅路1200弄2号",
        "name": "上海源花城物业楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.395928,
            31.146308
        ],
        "address": "万源路788弄",
        "name": "万源城逸郡",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.365632,
            31.155385
        ],
        "address": "宝南路55弄",
        "name": "九星家园",
        "count": 64,
        "style": 0
    },
    {
        "lnglat": [
            121.617993,
            31.194695
        ],
        "address": "蔡伦路255号",
        "name": "佳宝",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.490129,
            31.211869
        ],
        "address": "陆家浜路976号",
        "name": "富南大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.487152,
            31.230541
        ],
        "address": "河南南路1号",
        "name": "星腾大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.519799,
            31.242168
        ],
        "address": "昌邑路555弄",
        "name": "滨江茗园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.532071,
            31.19958
        ],
        "address": "东绣路1389弄",
        "name": "涵合园",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.426441,
            31.076993
        ],
        "address": "颛兴东路745号",
        "name": "拉法叶园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.492215,
            31.164029
        ],
        "address": "杨新路88号",
        "name": "尚馥骊湾88文化创意园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.457532,
            31.164923
        ],
        "address": "云锦路500号",
        "name": "绿地汇中心",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.466909,
            31.195746
        ],
        "address": "零陵路29弄",
        "name": "丝庐花语",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.275763,
            31.377086
        ],
        "address": "嘉戬公路301弄",
        "name": "保利梧桐语（上海）",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.227999,
            31.13404
        ],
        "address": "嘉松中路6688弄",
        "name": "龙湖滟澜山二期",
        "count": 83,
        "style": 0
    },
    {
        "lnglat": [
            121.418073,
            31.201588
        ],
        "address": "安顺路158弄3-15号",
        "name": "新安公寓",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.435871,
            31.227097
        ],
        "address": "武定西路1158弄",
        "name": "瑞丽公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.460999,
            31.2266
        ],
        "address": "威海路567号",
        "name": "晶采世纪大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.487248,
            31.250734
        ],
        "address": "海宁路307号",
        "name": "爱思大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.693167,
            31.20581
        ],
        "address": "川沙路4198号",
        "name": "爱情谷",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.493785,
            31.336574
        ],
        "address": "逸仙路2816号",
        "name": "华滋奔腾大厦",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.247094,
            31.330582
        ],
        "address": "希望路1333号",
        "name": "常发豪庭",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.435195,
            31.253345
        ],
        "address": "中山北路1655弄10支弄1-6号",
        "name": "月亮湾小区",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.35371,
            31.222914
        ],
        "address": "协和路1033号",
        "name": "文洋大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.474468,
            31.213985
        ],
        "address": "合肥路289弄（淡水路）",
        "name": "复兴苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.498563,
            31.290792
        ],
        "address": "辉河路118号",
        "name": "辉华大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.210184,
            31.277927
        ],
        "address": "杭桂路1118号",
        "name": "中波研发中心商务大楼",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.510944,
            31.256484
        ],
        "address": "长阳路235号",
        "name": "鼎立大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.438056,
            31.296138
        ],
        "address": "江场三路305号",
        "name": "上海新市北工业园区二期",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.601576,
            31.340679
        ],
        "address": "华申路221号",
        "name": "诺至未（中航兰田）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.400005,
            31.21787
        ],
        "address": "古北路69弄",
        "name": "虹桥万博花园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.519236,
            31.230474
        ],
        "address": "商城路738号",
        "name": "胜康廖氏大厦",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.425654,
            31.176266
        ],
        "address": "宜山路655弄6号",
        "name": "高知楼_高级知识分子楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.582406,
            31.327876
        ],
        "address": "行南路1150弄",
        "name": "南新西园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.50352,
            31.231466
        ],
        "address": "银城中路600弄",
        "name": "中粮海景壹号",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.482381,
            31.228301
        ],
        "address": "金陵东路368号",
        "name": "金陵商厦（兴业证券）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.17209,
            31.268718
        ],
        "address": "安智路155号",
        "name": "万创坊",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.579706,
            31.130553
        ],
        "address": "秀沿路1028弄",
        "name": "康桥城中花园（康桥半岛秀溪公寓）",
        "count": 135,
        "style": 0
    },
    {
        "lnglat": [
            121.454683,
            31.190382
        ],
        "address": "东安路338弄1号",
        "name": "东安小区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.430344,
            31.247272
        ],
        "address": "中山北路2130号",
        "name": "万千大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.517828,
            31.296134
        ],
        "address": "黄兴路2030弄",
        "name": "蓝天小区1号院",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.467187,
            31.263911
        ],
        "address": "止园路577号",
        "name": "和兰苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.42463,
            31.240093
        ],
        "address": "通河一村1号-4号",
        "name": "通河一村",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.746877,
            30.963237
        ],
        "address": "大团镇南芦公路989弄",
        "name": "同润蓝美俊庭",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.519329,
            31.290477
        ],
        "address": "黄兴路1725号",
        "name": "怡富商务广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.237076,
            31.05357
        ],
        "address": "谷阳北路2558弄",
        "name": "冠寓_谷阳北路店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.591942,
            31.336554
        ],
        "address": "杨高北路1188号",
        "name": "阳明花园广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.53389,
            31.227189
        ],
        "address": "松林路283-287号",
        "name": "新港大厦(松林路)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.542407,
            31.309895
        ],
        "address": "翔殷路258弄",
        "name": "星云苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.494355,
            31.134851
        ],
        "address": "三林路88弄",
        "name": "明通文化创意产业园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.506888,
            31.212369
        ],
        "address": "外马路974号",
        "name": "三盛宏业大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.374004,
            31.242058
        ],
        "address": "万镇路381号",
        "name": "运旺新村阳光世家",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.468193,
            31.227774
        ],
        "address": "威海路168弄",
        "name": "杰仕豪庭",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.421481,
            31.212623
        ],
        "address": "武夷路438号",
        "name": "星辰公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.526454,
            31.255528
        ],
        "address": "怀德路383弄",
        "name": "保利香槟苑一期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.528792,
            31.300593
        ],
        "address": "安波路567号",
        "name": "海上硕和国际城",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.513286,
            31.30072
        ],
        "address": "国宾路36号",
        "name": "五角场万达广场",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.363585,
            31.252809
        ],
        "address": "曹安路1775号",
        "name": "上海国际鞋城",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.441272,
            31.247356
        ],
        "address": "江宁路1400号",
        "name": "红豆公寓江宁路",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.415664,
            31.238124
        ],
        "address": "中山北路3000号",
        "name": "上海长城大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.614123,
            31.252192
        ],
        "address": "金港路501号",
        "name": "北大资源科技园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.464437,
            31.199889
        ],
        "address": "斜土路1221号",
        "name": "之俊大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.542627,
            31.279821
        ],
        "address": "水丰路15弄",
        "name": "帆升公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.37835,
            31.115658
        ],
        "address": "庙泾路58号",
        "name": "莘庄经济城",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.416854,
            31.180483
        ],
        "address": "钦州北路475号",
        "name": "广厦公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.388255,
            31.168603
        ],
        "address": "万源路2138号",
        "name": "泓茂中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.405889,
            31.160577
        ],
        "address": "桂平路333号",
        "name": "桂林聚科商务园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.080666,
            31.132748
        ],
        "address": "淀山湖大道1079弄",
        "name": "青浦万达茂商务楼",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.503233,
            31.030714
        ],
        "address": "鲁康路1198弄",
        "name": "永康城盛华园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.411427,
            31.226825
        ],
        "address": "中山北路3856弄2号",
        "name": "中环大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.482917,
            31.202837
        ],
        "address": "局门路457号",
        "name": "金地威新8号桥汝南园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.446285,
            31.09961
        ],
        "address": "景联路389号",
        "name": "华东理工大学国家大学科技园（梅陇基地）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.468466,
            31.252615
        ],
        "address": "西藏北路605号",
        "name": "兴中心创意园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.406775,
            31.194592
        ],
        "address": "富贵东路229弄 ",
        "name": "古北国际广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.367601,
            31.231021
        ],
        "address": "云岭西路600弄",
        "name": "金环商务花园二期",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.45856,
            31.228909
        ],
        "address": "南京西路993号",
        "name": "上海锦江向阳大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.102767,
            31.190359
        ],
        "address": "新胜路155号",
        "name": "圆益科创产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.468739,
            31.209235
        ],
        "address": "建国中路115弄之1-4号",
        "name": "吉大公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.383998,
            31.175912
        ],
        "address": "吴中路1189号",
        "name": "M8",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.020831,
            30.911066
        ],
        "address": "枫兰路999弄",
        "name": "华发招商依云四季",
        "count": 75,
        "style": 0
    },
    {
        "lnglat": [
            121.384125,
            31.12383
        ],
        "address": "报春路558弄",
        "name": "绿茵苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.398621,
            31.202715
        ],
        "address": "虹古路11弄",
        "name": "虹景花苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.399586,
            31.204322
        ],
        "address": "古北路686号",
        "name": "长福公寓(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.349248,
            31.264539
        ],
        "address": "海川路58弄",
        "name": "嘉城新航域二期",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.593547,
            31.332674
        ],
        "address": "季景路555弄",
        "name": "仁恒家园",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.53601,
            31.22696
        ],
        "address": "源深路836号",
        "name": "香榭丽花园",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.268257,
            31.111929
        ],
        "address": "鼓浪路801弄",
        "name": "润和苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.619578,
            31.198314
        ],
        "address": "高科中路1976号",
        "name": "衡谷1976",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.475031,
            31.341452
        ],
        "address": "通南路91弄99支弄",
        "name": "上海骏景雅苑",
        "count": 33,
        "style": 0
    },
    {
        "lnglat": [
            121.439956,
            31.343787
        ],
        "address": "呼兰路911弄11号",
        "name": "博济上海智汇园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.404479,
            31.272359
        ],
        "address": "真金路457弄",
        "name": "凯旋华庭",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.516861,
            30.959135
        ],
        "address": "万顺路2089弄",
        "name": "百曲乐苑",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.53785,
            31.049779
        ],
        "address": "浦涛路400弄",
        "name": "瑞和新苑北区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.447944,
            31.215718
        ],
        "address": "长乐路801号",
        "name": "华尔登广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.443009,
            31.141954
        ],
        "address": "百色路451弄",
        "name": "园南二村",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.559399,
            31.259106
        ],
        "address": "浦东大道2511弄19号",
        "name": "柚米国际公寓(浦东大道店)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.598197,
            31.208729
        ],
        "address": "郭守敬路498号",
        "name": "浦东软件园郭守敬园及祖冲之园",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.496979,
            31.208154
        ],
        "address": "海潮路222弄",
        "name": "雅士公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.129906,
            31.154214
        ],
        "address": "青竹路161弄",
        "name": "中铁逸都",
        "count": 70,
        "style": 0
    },
    {
        "lnglat": [
            121.478881,
            31.344861
        ],
        "address": "长江西路162、200号",
        "name": "湘源大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.533307,
            31.226372
        ],
        "address": "向城路288号",
        "name": "国华人寿金融大厦",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.442493,
            31.188061
        ],
        "address": "天钥桥路333号",
        "name": "上海腾飞大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.388413,
            31.076392
        ],
        "address": "春光路99弄55号",
        "name": "广陆创客佳园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.457754,
            31.241917
        ],
        "address": "汉中路188号",
        "name": "青年文化活动中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.254467,
            31.113856
        ],
        "address": "泗凤公路508弄",
        "name": "金地自在城三期",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.368944,
            31.359835
        ],
        "address": "菊盛路851弄",
        "name": "馨佳园十一街坊",
        "count": 56,
        "style": 0
    },
    {
        "lnglat": [
            121.447691,
            31.294667
        ],
        "address": "共和新路3088弄",
        "name": "祥腾财富广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.435138,
            31.224296
        ],
        "address": "镇宁路525号",
        "name": "新东纺国际商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.413399,
            31.162447
        ],
        "address": "虹漕南路99弄",
        "name": "金桂苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.363328,
            31.150133
        ],
        "address": "新镇路888号",
        "name": "水景书香园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.57245,
            31.109956
        ],
        "address": "周康路129弄",
        "name": "南郊花园东区",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.406497,
            31.204904
        ],
        "address": "仙霞路80号",
        "name": "天虹大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.458977,
            31.338175
        ],
        "address": "长江西路1180号",
        "name": "泗塘大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.328751,
            31.143944
        ],
        "address": "沪松公路1197号",
        "name": "星汇大厦(上海)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.460319,
            31.263889
        ],
        "address": "共和新路1301号",
        "name": "蓝天绿地商务广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.441629,
            31.296312
        ],
        "address": "江场西路299弄",
        "name": "中铁中环时代广场",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.409859,
            31.29235
        ],
        "address": "真华路1989弄",
        "name": "梧桐城邦四期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.534172,
            31.217295
        ],
        "address": "杨高南路428号",
        "name": "由由世纪广场",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.588575,
            31.327729
        ],
        "address": "行南路900弄",
        "name": "南新东园",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.531979,
            31.241289
        ],
        "address": "浦东大道988号",
        "name": "东晶国际公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.471431,
            31.31977
        ],
        "address": "高跃路176号，殷高西路608号，殷高西路638号",
        "name": "景瑞生活广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.420869,
            31.185963
        ],
        "address": "柳州路928号",
        "name": "上海百丽国际广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.548216,
            31.239619
        ],
        "address": "张杨路1811弄",
        "name": "海上景庭",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.482114,
            31.257374
        ],
        "address": "四川北路1661号",
        "name": "凯润金城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.246703,
            31.057503
        ],
        "address": "广富林路600号",
        "name": "三迪曼哈顿",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.56487,
            31.223921
        ],
        "address": "锦绣路333号",
        "name": "金樽花园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.493546,
            31.285166
        ],
        "address": "中山北二路1631号",
        "name": "曲阳邮政大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437472,
            31.169224
        ],
        "address": "龙漕路51弄4号",
        "name": "银星名庭",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.430988,
            31.248021
        ],
        "address": "中山北路2052号",
        "name": "振源大厦",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.355658,
            31.122351
        ],
        "address": "友东路81号",
        "name": "友东路81号商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.267506,
            31.356967
        ],
        "address": "沪宜公路2857号",
        "name": "明发嘉定商业广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.482849,
            31.199766
        ],
        "address": "局门路620号",
        "name": "重矿大厦(局门路)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.36751,
            31.180725
        ],
        "address": "红松路333弄",
        "name": "汇金公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.381848,
            31.055937
        ],
        "address": "华宁路3333号",
        "name": "海联智谷",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.473782,
            31.401244
        ],
        "address": "友谊路318号",
        "name": "灏唯滨江智创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.412589,
            31.233328
        ],
        "address": "中山北路3300号",
        "name": "环球港",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.427417,
            31.162923
        ],
        "address": "冠生园路223-227号",
        "name": "智慧线创意园冠生园路分园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.416611,
            31.219131
        ],
        "address": "长宁路1018号",
        "name": "龙之梦购物中心大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.303018,
            31.288344
        ],
        "address": "民主街495弄",
        "name": "绿洲茗馨公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.400848,
            31.209052
        ],
        "address": "古北路505号",
        "name": "古北路505号",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.491329,
            31.199765
        ],
        "address": "西藏南路1717弄",
        "name": "白玉兰家园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.462945,
            31.196074
        ],
        "address": "大木桥路451号",
        "name": "协合徐汇公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.53906,
            31.238205
        ],
        "address": "商城路1986号",
        "name": "商城商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.407039,
            31.130704
        ],
        "address": "莲花南路155弄",
        "name": "世纪苑",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.237046,
            31.348757
        ],
        "address": "洪德路1500弄",
        "name": "嘉德豪庭",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.397739,
            31.194359
        ],
        "address": "荣华东道46-49号",
        "name": "雅典花园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.370318,
            31.179024
        ],
        "address": "虹井路482弄",
        "name": "金汇鸿锦苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.45856,
            31.239926
        ],
        "address": "恒丰路31号",
        "name": "金峰大厦(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.552265,
            31.224626
        ],
        "address": "长柳路58号",
        "name": "证大立方大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.432529,
            31.339794
        ],
        "address": "呼兰西路123号",
        "name": "龙盛活力小镇",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.516132,
            31.206519
        ],
        "address": "浦东南路2179弄",
        "name": "宏润公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.488098,
            31.213219
        ],
        "address": "大林路10弄1号",
        "name": "兴林公寓一期",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.42676,
            31.280139
        ],
        "address": "沪太路1111弄",
        "name": "静安大融城",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.284299,
            31.415571
        ],
        "address": "启源路900弄",
        "name": "绿洲香润苑",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.425791,
            31.166922
        ],
        "address": "柳州路399号甲",
        "name": "恒地仓国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.484146,
            31.118639
        ],
        "address": "江松路501弄",
        "name": "江锦北苑",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.376669,
            31.186174
        ],
        "address": "程家桥路388弄",
        "name": "古北金鹰府二期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.438201,
            31.244266
        ],
        "address": "西康路1288弄",
        "name": "光明城市花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.343323,
            31.078383
        ],
        "address": "新桥镇明中路881弄，1010弄",
        "name": "万科白马花园",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.260556,
            31.345663
        ],
        "address": "阿克苏路1099号",
        "name": "宝龙城市广场_商务楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.406827,
            31.13694
        ],
        "address": "沪闵路7940号",
        "name": "宁谷（国际）商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.472336,
            31.197802
        ],
        "address": "打浦路398弄4号-2临",
        "name": "衡辰商务楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.401467,
            31.234012
        ],
        "address": "枣阳路297弄",
        "name": "金阳怡景苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.623602,
            31.253874
        ],
        "address": "宁桥路999号",
        "name": "金桥开发区T15",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.545572,
            31.247319
        ],
        "address": "浦东大道1819弄",
        "name": "和达家园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.427382,
            31.335732
        ],
        "address": "南蕰藻路669号",
        "name": "庙行人才孵化园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.536244,
            31.181118
        ],
        "address": "北艾路1077弄",
        "name": "大华锦绣华城11街区",
        "count": 61,
        "style": 0
    },
    {
        "lnglat": [
            121.479982,
            31.258249
        ],
        "address": "宝源路301弄",
        "name": "申桂公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.425458,
            31.193736
        ],
        "address": "番愚路1099弄",
        "name": "东方时空公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.372241,
            31.239842
        ],
        "address": "清峪路258弄",
        "name": "上海豪园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.494862,
            31.250304
        ],
        "address": "旅顺路199弄",
        "name": "白金府邸",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.44431,
            31.225474
        ],
        "address": "北京西路1701号",
        "name": "静安中华大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.500771,
            31.211777
        ],
        "address": "陆家浜路305弄",
        "name": "上海阳光里",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.472528,
            31.169876
        ],
        "address": "耀元路58号",
        "name": "上海环球都会广场",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.388707,
            31.104144
        ],
        "address": "珠城路158号",
        "name": "解放日报大厦C座",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.300485,
            31.308056
        ],
        "address": "德园路1259弄",
        "name": "溪岸澜庭",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.52414,
            31.316209
        ],
        "address": "世界路15弄",
        "name": "明丰阳光苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.515377,
            30.848391
        ],
        "address": "奉炮公路1368号",
        "name": "阿莱德科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.370149,
            31.303628
        ],
        "address": "走马塘路1118弄",
        "name": "乾康苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.417865,
            31.176881
        ],
        "address": "宜山路700号",
        "name": "上海普天信息产业园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.457033,
            31.233181
        ],
        "address": "新闸路1001号",
        "name": "亚成公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.237127,
            31.112593
        ],
        "address": "泗凯路415弄",
        "name": "新凯城钟秀苑",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.553022,
            31.238713
        ],
        "address": "南洋泾路280号",
        "name": "中新公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.448012,
            31.238894
        ],
        "address": "江宁路777号",
        "name": "内外联公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.452232,
            31.282745
        ],
        "address": "共和新路2623号",
        "name": "企联大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.866637,
            30.978963
        ],
        "address": "老芦公路868号",
        "name": "金港世纪广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.544845,
            31.244167
        ],
        "address": "巨野路61弄",
        "name": "旭辉雅苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.411806,
            31.289618
        ],
        "address": "真华路1800弄",
        "name": "梧桐城邦一期",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.394592,
            31.077644
        ],
        "address": "申南路59弄",
        "name": "凯龙莘庄商务园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.423996,
            31.33367
        ],
        "address": "场北路669弄",
        "name": "中环国际公寓三期",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.608464,
            31.3154
        ],
        "address": "台中南路68号",
        "name": "远洋洲海大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.533693,
            31.271783
        ],
        "address": "长阳路1687号",
        "name": "长阳谷创意园区",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.468392,
            31.240093
        ],
        "address": "光复路195号",
        "name": "创意仓库",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.505689,
            31.249982
        ],
        "address": "东大名路888弄19号",
        "name": "新外滩花苑综合楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.43748,
            31.183167
        ],
        "address": "零陵路899号",
        "name": "飞洲国际广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.918005,
            30.884084
        ],
        "address": "古棕路168弄1-190号",
        "name": "绿地东岸涟城",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.382517,
            31.165564
        ],
        "address": "宜山路2301弄",
        "name": "九歌商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.36443,
            31.174761
        ],
        "address": "紫藤路266弄",
        "name": "龙柏易居",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.282735,
            31.149858
        ],
        "address": "九泾路701号",
        "name": "新雅创业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.565143,
            31.173606
        ],
        "address": "莲溪路1099弄",
        "name": "鹏裕苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.439556,
            31.194388
        ],
        "address": "漕溪北路333号(徐家汇地铁站5号口步行70米)",
        "name": "中金国际广场B楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.659859,
            30.908233
        ],
        "address": "兰博路1455弄",
        "name": "新城花屿湾",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.408439,
            31.197794
        ],
        "address": "虹桥路1163弄",
        "name": "长发虹桥公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.439591,
            31.230343
        ],
        "address": "延平路223弄",
        "name": "益民公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.467801,
            31.196855
        ],
        "address": "瑞金南路546,570号",
        "name": "双晖小区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.4241,
            31.184036
        ],
        "address": "中山西路1790号",
        "name": "兆丰虹桥公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.583801,
            31.248736
        ],
        "address": "枣庄路959号",
        "name": "锋巢宫寓(百舸商务酒店)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.317077,
            31.21318
        ],
        "address": "申虹路1188弄",
        "name": "恒基旭辉中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.432932,
            31.254204
        ],
        "address": "石泉东路215号",
        "name": "香溢花城三期",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.621738,
            31.25999
        ],
        "address": "新金桥路1122号",
        "name": "方正大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.411565,
            31.207912
        ],
        "address": "中山西路1号",
        "name": "水云间(上海)",
        "count": 69,
        "style": 0
    },
    {
        "lnglat": [
            121.436267,
            31.173871
        ],
        "address": "田东路377弄3号",
        "name": "金衡公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.248926,
            31.033525
        ],
        "address": "茸平路515弄",
        "name": "福都商务广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.439649,
            31.192944
        ],
        "address": "肇嘉浜路1111号",
        "name": "美罗城",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.455632,
            31.265403
        ],
        "address": "柳营路669弄",
        "name": "盛源家豪城",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.425844,
            31.182718
        ],
        "address": "中山西路2006号",
        "name": "百第宜山大楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.423519,
            31.213792
        ],
        "address": "武夷路351号",
        "name": "武夷商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.374086,
            31.208506
        ],
        "address": "仙霞路1281号",
        "name": "帝豪苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.456232,
            31.180836
        ],
        "address": "瑞宁路908弄",
        "name": "保利西岸",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.401015,
            31.052569
        ],
        "address": "瓶安路1358号",
        "name": "久创科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.246469,
            31.176128
        ],
        "address": "崧泽大道2333弄",
        "name": "万科天空之城云之谷",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.438034,
            31.263326
        ],
        "address": "延长西路220弄5号",
        "name": "浦安公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.435503,
            31.338185
        ],
        "address": "呼兰西路60号",
        "name": "卓越时代广场公寓楼",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.425932,
            31.172796
        ],
        "address": "田林东路556弄",
        "name": "田林亲家",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.405175,
            31.161809
        ],
        "address": "桂平路353号",
        "name": "越界睿园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.55858,
            31.255931
        ],
        "address": "龙居路2弄",
        "name": "龙居苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.305838,
            31.041421
        ],
        "address": "新界路1号",
        "name": "微衡1号工坊",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.533617,
            31.243525
        ],
        "address": "桃林路18号",
        "name": "环球广场",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.4033,
            31.127079
        ],
        "address": "罗秀路1955弄",
        "name": "嘉和花苑",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.4322,
            31.191883
        ],
        "address": "虹桥路188号",
        "name": "元福大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.084344,
            31.146678
        ],
        "address": "赵屯浦路380弄",
        "name": "新塘苑",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.52898,
            31.224043
        ],
        "address": "向城路15号",
        "name": "锦城大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.494531,
            31.338178
        ],
        "address": "长逸路180号",
        "name": "逸隆广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.476943,
            31.206504
        ],
        "address": "丽园路818弄",
        "name": "开城新苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.403637,
            31.243458
        ],
        "address": "兰溪路180号",
        "name": "安居兰庭",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.386287,
            31.1861
        ],
        "address": "虹梅路3213号",
        "name": "红春大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.404324,
            31.234324
        ],
        "address": "杨柳青路118弄",
        "name": "万都花园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.60318,
            31.178137
        ],
        "address": "海趣路236号",
        "name": "绿地Mtown",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.621467,
            31.254073
        ],
        "address": "金皖路501号",
        "name": "金皖路501号园区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.401635,
            31.133796
        ],
        "address": "古方路76号",
        "name": "南方休闲广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.491406,
            31.378795
        ],
        "address": "同济支路199号",
        "name": "智慧柒立方二期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.470392,
            31.23865
        ],
        "address": "新闸路166号",
        "name": "水景苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.469103,
            31.299834
        ],
        "address": "奎照路790弄",
        "name": "奎照路790弄",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.424624,
            31.220374
        ],
        "address": "长宁路599号 ",
        "name": "长宁区机关大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.512535,
            30.959867
        ],
        "address": "团汇公路479弄",
        "name": "汇港苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.368441,
            31.36611
        ],
        "address": "菊泉街1158-1596弄",
        "name": "馨佳园社区三街坊",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.370306,
            31.241943
        ],
        "address": "清峪路368弄",
        "name": "金沙雅苑三期滨湖世家",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.533014,
            31.292851
        ],
        "address": "营口路625弄",
        "name": "营口大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.459384,
            31.192784
        ],
        "address": "零陵路231号",
        "name": "天迈商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.316945,
            31.187936
        ],
        "address": "申长路519号",
        "name": "上海富力环球中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.495499,
            31.136403
        ],
        "address": "三林路158号",
        "name": "前滩尚博园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.606631,
            31.307547
        ],
        "address": "德堡路38号",
        "name": "沐远国际中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.441903,
            31.193697
        ],
        "address": "天钥桥路69弄 ",
        "name": "科汇公寓（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.252031,
            31.397529
        ],
        "address": "棋盘路1150弄",
        "name": "嘉康坊",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.446433,
            31.202951
        ],
        "address": "高安路61弄",
        "name": "汇成花园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.607023,
            31.336902
        ],
        "address": "泰谷路239号",
        "name": "天啸大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.471954,
            31.277752
        ],
        "address": "株洲路309号(近广中路)",
        "name": "宝华城立方",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42041,
            31.26399
        ],
        "address": "交暨路207弄5号",
        "name": "齐成创业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.284638,
            31.068907
        ],
        "address": "泗砖南路255弄",
        "name": "名企公馆新桥艺术园区",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.459944,
            31.202203
        ],
        "address": "肇嘉浜路359号",
        "name": "航天科工集团大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.317209,
            31.132851
        ],
        "address": "九新公路76号",
        "name": "嘉和阳光大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.434288,
            30.919209
        ],
        "address": "运河北路258号",
        "name": "绿地方舟",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.551151,
            31.247615
        ],
        "address": "栖山路465弄16号",
        "name": "鼎隆大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.358537,
            31.131215
        ],
        "address": "顾戴路2582号",
        "name": "闵行市政园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.464084,
            31.245141
        ],
        "address": "天目中路585号",
        "name": "新梅大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.510467,
            31.237063
        ],
        "address": "浦东南路500号",
        "name": "国家开发银行大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.292253,
            31.330736
        ],
        "address": "宝安公路2999弄",
        "name": "东方慧谷",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.435884,
            31.174594
        ],
        "address": "漕溪路169号",
        "name": "东宇商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.635223,
            31.240326
        ],
        "address": "金葵路1315弄",
        "name": "金葵佳苑",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.497363,
            30.959489
        ],
        "address": "广丰路100弄",
        "name": "金水佳苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.48781,
            31.393655
        ],
        "address": "牡丹江路1248号",
        "name": "安信财富中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.119407,
            31.149547
        ],
        "address": "公园路348号",
        "name": "青浦科技园商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.518141,
            31.292564
        ],
        "address": "黄兴路1999弄",
        "name": "皇朝新城",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.434029,
            31.168865
        ],
        "address": "漕溪路280号",
        "name": "汇腾广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.497587,
            31.31665
        ],
        "address": "政青路399弄",
        "name": "文化名邸",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.418711,
            31.237587
        ],
        "address": "曹杨路500号",
        "name": "普陀科技馆",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.426794,
            31.271533
        ],
        "address": "灵石路1188号",
        "name": "华仁商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.391772,
            31.194755
        ],
        "address": "荣华西道79弄、39弄",
        "name": "金鹿公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.386663,
            31.269936
        ],
        "address": "真南路708号",
        "name": "申环商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.587659,
            31.253858
        ],
        "address": "金桥路1389号",
        "name": "上海金桥大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.726478,
            31.049027
        ],
        "address": "人民西路1533弄",
        "name": "艺泰一品花园",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.751177,
            31.072337
        ],
        "address": "拱海路755弄",
        "name": "民乐汇雅苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.379659,
            31.23486
        ],
        "address": "金沙江路1698弄",
        "name": "绿洲湖畔花园",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.477204,
            31.245982
        ],
        "address": "海宁路899号",
        "name": "长泰企业天地广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.433194,
            31.230628
        ],
        "address": "武宁南路310-322号",
        "name": "宏安家园一期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.431182,
            31.191073
        ],
        "address": "虹桥路178弄",
        "name": "青之杰花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.381985,
            31.222909
        ],
        "address": "丹巴路98弄7号",
        "name": "龙裕财富中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.24629,
            31.016795
        ],
        "address": "荣乐东路2369号",
        "name": "绿地松江商务广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.419828,
            31.276215
        ],
        "address": "新沪路1083弄",
        "name": "上寓酒店公寓（唐鋆酒店公寓）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.496799,
            31.15714
        ],
        "address": "灵岩南路295号",
        "name": "三林世博创意园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.366568,
            31.414869
        ],
        "address": "月罗路2255号",
        "name": "博济上海美兰湖园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.549578,
            31.247656
        ],
        "address": "浦东新区栖山路401弄7号",
        "name": "雅华公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.412026,
            31.106332
        ],
        "address": "莲花南路1111弄",
        "name": "春申景城一期(春申景城湖滨晨韵)",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.403096,
            31.19762
        ],
        "address": "虹桥路1438号",
        "name": "古北国际财富中心",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.396065,
            31.213609
        ],
        "address": "天山支路201号",
        "name": "长宁科技大楼",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.550634,
            31.224255
        ],
        "address": "民生路1399号",
        "name": "太平人寿大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.420113,
            31.236925
        ],
        "address": "同普路299弄",
        "name": "浙铁绿城长风中心",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.479424,
            31.246049
        ],
        "address": "塘沽路835号",
        "name": "万豪公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.532951,
            31.267477
        ],
        "address": "宁国路503号（长阳路1568号）",
        "name": "四季广场（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.400887,
            31.133262
        ],
        "address": "沪闵路6088号",
        "name": "凯德龙之梦莘庄写字楼（凯德闵行商业中心（办公楼））",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.59252,
            31.344357
        ],
        "address": "奥纳路79号2幢",
        "name": "交能国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.41326,
            31.22976
        ],
        "address": "石湾路7弄51号101室",
        "name": "康泰公寓（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.483544,
            31.262135
        ],
        "address": "四川北路1885号",
        "name": "明猷商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.524427,
            31.282951
        ],
        "address": "靖宇南路118弄",
        "name": "金宇名邸",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.382368,
            31.181848
        ],
        "address": "虹中路335弄32号",
        "name": "虹桥集富大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.491369,
            31.306135
        ],
        "address": "吉浦路355号",
        "name": "财大公寓",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.441315,
            31.19443
        ],
        "address": "肇嘉浜路1065号",
        "name": "飞雕国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.451411,
            31.255275
        ],
        "address": "恒丰北路100号",
        "name": "林顿大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.230902,
            31.031127
        ],
        "address": "谷阳北路1500号",
        "name": "永翔大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.490195,
            31.228313
        ],
        "address": "丽水路58号",
        "name": "城隍珠宝",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.434497,
            31.187577
        ],
        "address": "文定路81弄",
        "name": "锦汇苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.382072,
            31.232897
        ],
        "address": "金沙江路1518弄",
        "name": "近铁城市广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.422562,
            31.19691
        ],
        "address": "淮海西路666号",
        "name": "中山万博国际中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.530464,
            31.186894
        ],
        "address": "高科西路1862号",
        "name": "浦东外贸大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.251748,
            31.365695
        ],
        "address": "叶城路818号",
        "name": "嘉禾大厦_上海",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.583102,
            31.264176
        ],
        "address": "柳埠路196弄 ",
        "name": "新沪东公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.552006,
            31.147304
        ],
        "address": "康花路499号",
        "name": "中天科技商务园(东园)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.483723,
            31.286802
        ],
        "address": "中山北一路805号",
        "name": "805公安大楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.396772,
            31.16927
        ],
        "address": "宜山路1289号",
        "name": "克隆科技园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.433564,
            31.352171
        ],
        "address": "蕰川路512号",
        "name": "红石科技大楼",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.39631,
            31.130499
        ],
        "address": "闵虹路166弄",
        "name": "中庚环球创意中心",
        "count": 126,
        "style": 0
    },
    {
        "lnglat": [
            121.48439,
            31.242518
        ],
        "address": "南苏州路325号",
        "name": "物资大厦(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.55218,
            31.238513
        ],
        "address": "张杨路1998弄1~2号",
        "name": "双城苑东苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.512588,
            31.086882
        ],
        "address": "恒南路1355号",
        "name": "禾谷文创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.410172,
            31.212048
        ],
        "address": "玉屏南路113弄17号",
        "name": "锦屏公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.478927,
            31.307099
        ],
        "address": "场中路28弄1-10号",
        "name": "场中公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.228626,
            31.180532
        ],
        "address": "凤马塘路205弄",
        "name": "瑞和锦庭西区",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.488493,
            31.262434
        ],
        "address": "溧阳路1155号",
        "name": "溧阳公馆",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.362397,
            31.205702
        ],
        "address": "淞虹路855弄",
        "name": "郁庭峰",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.518284,
            31.219531
        ],
        "address": "浦东南路1630号",
        "name": "闻通商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.420214,
            31.270458
        ],
        "address": "新沪路250号",
        "name": "久华商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.405471,
            31.20732
        ],
        "address": "紫云西路28弄",
        "name": "翠庭",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.420993,
            31.180862
        ],
        "address": "钦州北路188号",
        "name": "华京商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.317873,
            31.131095
        ],
        "address": "伴亭路855弄",
        "name": "象屿虹桥悦府",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.468137,
            30.932722
        ],
        "address": "航南公路5088号",
        "name": "绿庭国际大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.442357,
            31.287997
        ],
        "address": "万荣路959号",
        "name": "悦舜959创意生活广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.387577,
            31.223862
        ],
        "address": "泸定路180号",
        "name": "嘉庭国际广场商场（东渡国际企业中心）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.541152,
            31.271672
        ],
        "address": "宁武路510弄",
        "name": "珠江香樟园北园",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.356722,
            31.13682
        ],
        "address": "华友路550弄",
        "name": "碧林湾二期",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.482275,
            31.284152
        ],
        "address": "广纪路173弄",
        "name": "香杉商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.447044,
            31.255899
        ],
        "address": "交通西路129弄",
        "name": "智荟苑",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.412611,
            31.185871
        ],
        "address": "吴中路369号",
        "name": "美恒大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.532598,
            31.224828
        ],
        "address": "世纪大道1500号",
        "name": "东方大厦（上海）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.449273,
            31.189024
        ],
        "address": "宛平南路521号",
        "name": "恒昌花园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.380747,
            31.234937
        ],
        "address": "金沙江路1688弄",
        "name": "绿洲商业中心",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.485639,
            31.214288
        ],
        "address": "西藏南路879-899号",
        "name": "幸运福邸（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.371205,
            31.356429
        ],
        "address": "菊盛路468弄",
        "name": "宝翔苑",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.413951,
            31.26281
        ],
        "address": "富平路399弄",
        "name": "中环家园二期",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.319286,
            31.125395
        ],
        "address": "九亭大街851弄",
        "name": "富顿苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.532003,
            31.219022
        ],
        "address": "峨山路91弄200号",
        "name": "新鹏大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.24566,
            31.103818
        ],
        "address": "泽悦路325弄1-30号",
        "name": "茉莉雅苑",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.599238,
            31.252611
        ],
        "address": "金新路58号",
        "name": "银桥大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.451706,
            31.247674
        ],
        "address": "恒丰路638号",
        "name": "苏河1号",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.383074,
            31.254642
        ],
        "address": "武宁路2101号",
        "name": "嘉安大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.395542,
            31.235318
        ],
        "address": "大渡河路1142号",
        "name": "长风大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.312751,
            31.153314
        ],
        "address": "沪亭北路900弄",
        "name": "金丰蓝庭二期",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.557522,
            31.272492
        ],
        "address": "杨树浦路2866号",
        "name": "上海国际时尚中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426441,
            31.076993
        ],
        "address": " 颛兴东路745号",
        "name": "拉法叶园区B楼墨空间",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.213956,
            31.230592
        ],
        "address": "怀德路366弄",
        "name": "保利香槟花园二期保利香槟花园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.440677,
            31.238104
        ],
        "address": "安远路501弄2-5号梅山大楼",
        "name": "梅山大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.433507,
            31.344333
        ],
        "address": "蕰川路6号",
        "name": "智慧湾",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.489644,
            31.291622
        ],
        "address": "中山北一路1250号",
        "name": "沪办大厦",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.436514,
            31.15068
        ],
        "address": "龙川北路777弄",
        "name": "城开汇社区",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.51503,
            31.229004
        ],
        "address": "浦东南路1036号",
        "name": "隆宇大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.203713,
            31.01263
        ],
        "address": "乐都西路959弄",
        "name": "乐都新界",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.282735,
            31.149858
        ],
        "address": "九泾路262号",
        "name": "恒瑞中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.375115,
            31.12672
        ],
        "address": "水清路999弄",
        "name": "香树丽舍(上海)",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.483453,
            31.219842
        ],
        "address": "西藏南路555号",
        "name": "黄浦众鑫城",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.597578,
            31.122491
        ],
        "address": "康达路508弄",
        "name": "昱龙家园",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.439046,
            30.937278
        ],
        "address": "环城西路2511号1栋",
        "name": "菱光大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.399261,
            31.105894
        ],
        "address": "洱海路99弄",
        "name": "春申玫瑰苑",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.455111,
            31.201991
        ],
        "address": "肇嘉浜路446号",
        "name": "伊泰利大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.40453,
            31.068807
        ],
        "address": "都市路2501弄",
        "name": "金铭文博水景苑",
        "count": 54,
        "style": 0
    },
    {
        "lnglat": [
            121.487223,
            31.209461
        ],
        "address": "西藏南路1208弄",
        "name": "东吴证券大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.534945,
            31.144782
        ],
        "address": "永泰路1650弄",
        "name": "名嘉新苑",
        "count": 73,
        "style": 0
    },
    {
        "lnglat": [
            121.513506,
            31.232675
        ],
        "address": "东昌路600号",
        "name": "东昌大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.543674,
            31.05174
        ],
        "address": "浦涛路100弄",
        "name": "中虹浦江苑北区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.4712,
            31.391113
        ],
        "address": "宝杨路2000号",
        "name": "宝杨慧照商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.519422,
            31.20856
        ],
        "address": "浦建路76号",
        "name": "由由国际广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.567707,
            31.147745
        ],
        "address": "沪南公路2633弄",
        "name": "汇宝中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.520846,
            31.290397
        ],
        "address": "黄兴路1778号1号楼",
        "name": "东方蓝海国际广场公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.508293,
            31.260715
        ],
        "address": "东余杭路1320、1350号",
        "name": "唐山新苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.287278,
            31.333018
        ],
        "address": "宝安公路3136号",
        "name": "清水湾上海",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.712937,
            31.089585
        ],
        "address": "宣秋路129号",
        "name": "上海尧煊实业有限公司(园区)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.382442,
            31.151846
        ],
        "address": "龙茗路1597弄",
        "name": "东兰世茗雅苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.428943,
            31.346069
        ],
        "address": "联泰路56号",
        "name": "鑫鑫花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.476166,
            31.253753
        ],
        "address": "宝山路268弄",
        "name": "复地新都国际",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.609318,
            31.179568
        ],
        "address": "百业路167弄31号",
        "name": "泊寓翡翠公园店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.364489,
            31.13368
        ],
        "address": "七莘路1599弄3号楼",
        "name": "平金中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.476086,
            31.194566
        ],
        "address": "龙华东路647号",
        "name": "电科滨江中心",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.493903,
            31.254794
        ],
        "address": "梧州路218弄",
        "name": "中皇广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.291898,
            31.296938
        ],
        "address": "翔江公路518号",
        "name": "寅尚工业产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.539167,
            31.318312
        ],
        "address": "包头路国和路交叉口",
        "name": "市光四村",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.537004,
            31.052185
        ],
        "address": "江航路378弄",
        "name": "浦江丽都二期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.367098,
            31.397693
        ],
        "address": "抚远路699弄",
        "name": "远洋博悦花园中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.220102,
            31.038479
        ],
        "address": "新松江路887弄",
        "name": "单身公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.43853,
            31.189445
        ],
        "address": "南丹东路255号-275号",
        "name": "南天1号楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.322248,
            31.153052
        ],
        "address": "涞寅路106弄",
        "name": "上海奥林匹克花园北区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.101514,
            31.170855
        ],
        "address": "清河湾路1121弄62号楼",
        "name": "卓越商务广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.513874,
            31.200284
        ],
        "address": "东三里桥路211弄",
        "name": "爱嘉苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.411482,
            31.234396
        ],
        "address": "中山北路3323号",
        "name": "春之声大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.587982,
            31.34814
        ],
        "address": "马吉路2号",
        "name": "高帆大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.353908,
            31.126203
        ],
        "address": "友东路358号",
        "name": "闵欣大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.407308,
            31.259071
        ],
        "address": "潮州路536号",
        "name": "太安堂广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.442014,
            31.297354
        ],
        "address": "江场西路299弄1号楼",
        "name": "海棠大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.391777,
            31.236641
        ],
        "address": "怒江北路302弄",
        "name": "中天新曹杨商务楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.423084,
            31.214304
        ],
        "address": "定西路1232号",
        "name": "大盈商务中心",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.444045,
            31.164912
        ],
        "address": "南宁路501弄",
        "name": "馨汇南苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.482267,
            31.205703
        ],
        "address": "斜土路118弄1号",
        "name": "大众汽车公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.485126,
            31.206115
        ],
        "address": "制造局路363弄",
        "name": "豫欣公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.355177,
            31.249762
        ],
        "address": "丰庄北路5弄",
        "name": "住嘉佳园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.565075,
            31.155984
        ],
        "address": "沪南路2419弄",
        "name": "地杰商业大厦",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.283591,
            31.37479
        ],
        "address": "叶城东路363弄",
        "name": "唐家苑中区",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.550428,
            31.220473
        ],
        "address": "民生路1518号",
        "name": "金鹰大厦（上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.202138,
            31.133318
        ],
        "address": "业煌路1676弄",
        "name": "佘北家园丽雅苑",
        "count": 89,
        "style": 0
    },
    {
        "lnglat": [
            121.624373,
            31.173197
        ],
        "address": "勤政路88弄",
        "name": "华发四季",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.25993,
            31.028857
        ],
        "address": "松卫北路280号",
        "name": "凯富家园广场5号楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.514655,
            31.291328
        ],
        "address": "国顺路128弄",
        "name": "上海东方家园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.310515,
            31.202148
        ],
        "address": "兴虹路399弄",
        "name": "万科润园时一区四期",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.175768,
            31.147519
        ],
        "address": "沪青平公路3908号",
        "name": "松港智创天地",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.383765,
            31.215822
        ],
        "address": "天山路288弄",
        "name": "海逸公寓",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.281311,
            31.21155
        ],
        "address": "盘阳路66弄",
        "name": "融信绿地商务广场二期",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.431654,
            31.185821
        ],
        "address": "文定路218号",
        "name": "徐家汇WE",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.023203,
            31.121049
        ],
        "address": "绿湖路888弄",
        "name": "海上湾华庭闻涧",
        "count": 73,
        "style": 0
    },
    {
        "lnglat": [
            121.482557,
            31.257354
        ],
        "address": "四川北路1611号",
        "name": "凯润金城商务楼",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.413321,
            31.270408
        ],
        "address": "大华一路210号",
        "name": "大华虎城嘉年华",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.446724,
            31.226631
        ],
        "address": "常德路319号",
        "name": "京德大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.366891,
            31.234547
        ],
        "address": "同普路1412号",
        "name": "长征工业设计中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.496606,
            31.257211
        ],
        "address": "海伦路88号",
        "name": "浦江名邸",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.523049,
            31.232924
        ],
        "address": "东方路428号",
        "name": "宏声商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.536236,
            31.04387
        ],
        "address": "闵驰二路256弄",
        "name": "欣佳宝邸三期",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.422827,
            31.008301
        ],
        "address": "沪闵路269号",
        "name": "香樟时尚广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.433611,
            31.236872
        ],
        "address": "长寿路633弄3号",
        "name": "长寿大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.270118,
            31.161379
        ],
        "address": "叶联路699弄",
        "name": "南山雨果",
        "count": 66,
        "style": 0
    },
    {
        "lnglat": [
            121.485565,
            31.210563
        ],
        "address": "西藏南路1108弄",
        "name": "黄浦新苑办公楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.439246,
            31.191747
        ],
        "address": "漕溪北路99弄",
        "name": "尊园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.163724,
            31.296361
        ],
        "address": "安亭镇墨玉路151号",
        "name": "墨玉商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.628307,
            31.212716
        ],
        "address": "祖冲之路2305号",
        "name": "张江高科创新基地895孵化器",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.427821,
            31.212206
        ],
        "address": "昭化路68弄",
        "name": "晨飞公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.481428,
            31.239501
        ],
        "address": "山西南路350号(北京东路）",
        "name": "上海物资大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.391448,
            31.235648
        ],
        "address": "中江路889号",
        "name": "曹杨商务大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.481651,
            31.287266
        ],
        "address": "新市路251弄",
        "name": "曲阳名邸",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.471617,
            31.268373
        ],
        "address": "黄山路77 99 131号",
        "name": "黄山坊",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.761991,
            31.097684
        ],
        "address": "秋亭路88弄",
        "name": "朗诗未来树",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.481178,
            31.227425
        ],
        "address": "金陵东路569号",
        "name": "汇通大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.367369,
            30.765663
        ],
        "address": "华山路1643弄",
        "name": "华山花苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.446019,
            31.180987
        ],
        "address": "中山南二路1007号",
        "name": "中煌大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.24535,
            31.348173
        ],
        "address": "高台路1333弄",
        "name": "旭辉华庭",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.54732,
            31.306718
        ],
        "address": "翔殷路165号",
        "name": "上海创意联盟产业园(分部)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.225864,
            31.151849
        ],
        "address": "嘉松中路5888号",
        "name": "熊猫广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.514504,
            31.278093
        ],
        "address": "铁岭路32号",
        "name": "同叶大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.401838,
            31.223037
        ],
        "address": "枣阳路891弄",
        "name": "冠龙家园（风华水岸）",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.397916,
            31.048908
        ],
        "address": "新源路1356号",
        "name": "上海正珏科技电子商务产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.432234,
            31.204864
        ],
        "address": "华山路1520弄55号",
        "name": "正力公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.396986,
            31.141319
        ],
        "address": "顾戴路645弄",
        "name": "风荷云墅",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.284915,
            31.053472
        ],
        "address": "新庙三路669号",
        "name": "669科创园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.429034,
            31.145296
        ],
        "address": "老沪闵路666弄",
        "name": "幽澜苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.472684,
            30.925523
        ],
        "address": "高州路100弄",
        "name": "金辉天鹅湾",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.427125,
            31.210005
        ],
        "address": "延安西路1260号",
        "name": "延安公寓(延安西路)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.448603,
            31.198065
        ],
        "address": "肇嘉浜路789号",
        "name": "均瑶国际广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.37814,
            31.112338
        ],
        "address": "七莘路182号",
        "name": "182花园办公园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.346891,
            31.162569
        ],
        "address": "吴宝路390-1号",
        "name": "蒂芬妮文创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.446933,
            31.298651
        ],
        "address": "江场西路160号",
        "name": "美邦大楼",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.466607,
            31.2569
        ],
        "address": "南山路35弄",
        "name": "金棕榈公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.487177,
            31.207291
        ],
        "address": "西藏南路1332号",
        "name": "协作大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.59684,
            31.272521
        ],
        "address": "五莲路1168号",
        "name": "新馨白领公寓五莲路店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.44123,
            31.229859
        ],
        "address": "武定路1102号",
        "name": "怡甸公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.444552,
            31.175833
        ],
        "address": "龙华西路398弄",
        "name": "强生花苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.52198,
            31.315568
        ],
        "address": "国和路777号(近民庆路)",
        "name": "孩子王(上海中原店)",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.443414,
            31.218086
        ],
        "address": "乌鲁木齐北路480号",
        "name": "万泰国际大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.46132,
            31.202355
        ],
        "address": "肇嘉浜路301号",
        "name": "工商大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.530854,
            31.232437
        ],
        "address": "松林路111号",
        "name": "海怡私家花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.428279,
            31.209521
        ],
        "address": "延安西路1228弄4号",
        "name": "嘉阳公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.520211,
            31.072006
        ],
        "address": "三达路517号",
        "name": "乘秋517工坊",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.42976,
            31.300383
        ],
        "address": "少年村路479弄",
        "name": "白玉兰馨园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.462428,
            31.279685
        ],
        "address": "广中路680弄",
        "name": "珊瑚苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.359693,
            31.217843
        ],
        "address": "天山西路541号",
        "name": "光大安石虹桥中心",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.556021,
            31.231936
        ],
        "address": "杨高中路2112号",
        "name": "界龙总部园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.478328,
            31.236296
        ],
        "address": "浙江中路400号",
        "name": "春申江大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426146,
            31.2075
        ],
        "address": "定西路710弄83号",
        "name": "达安长宁公寓",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.487724,
            31.393994
        ],
        "address": "牡丹江路1211号",
        "name": "安信广场",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.418824,
            31.240669
        ],
        "address": "中山北路2790号",
        "name": "上海杰地大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.426656,
            31.225078
        ],
        "address": "江苏北路30号",
        "name": "荣兆园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.416716,
            31.247449
        ],
        "address": "石泉路450弄",
        "name": "宁泉新苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.340146,
            31.395423
        ],
        "address": "美丹路998弄1-27号",
        "name": "罗兰佳苑西区",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.451632,
            31.191123
        ],
        "address": "斜土路2096弄",
        "name": "锦蝶苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.583867,
            31.193452
        ],
        "address": "达尔文路88号",
        "name": "新希望半岛科技园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.392469,
            31.197488
        ],
        "address": "延安西路2633号",
        "name": "美丽华商务中心(美丽华商务大厦)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.466511,
            31.292246
        ],
        "address": "广粤路501号",
        "name": "上海信南实业大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.481214,
            31.39574
        ],
        "address": "同济路669弄7号楼",
        "name": "火炬城市峰汇",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.390083,
            31.251029
        ],
        "address": "铜川路1615弄",
        "name": "佳祥公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.433924,
            31.216251
        ],
        "address": "延安西路688弄",
        "name": "华敏世纪广场_上海",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.313342,
            31.192178
        ],
        "address": "申长路869号",
        "name": "龙湖虹桥天街北区",
        "count": 63,
        "style": 0
    },
    {
        "lnglat": [
            121.45293,
            31.210004
        ],
        "address": "汾阳路138号",
        "name": "轻科大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.396382,
            31.156651
        ],
        "address": "莲花路1308号",
        "name": "宏汇莲花广场",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.373805,
            31.366483
        ],
        "address": "潘广路1018弄",
        "name": "龙湖北城天街",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.465896,
            31.237984
        ],
        "address": "新昌路477弄",
        "name": "上海滩新昌城",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.452147,
            31.256504
        ],
        "address": "沪太路453弄88号",
        "name": "兴联公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.260427,
            31.364461
        ],
        "address": "回城南路930弄",
        "name": "香溢都荟",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.360579,
            31.183694
        ],
        "address": "延安西路3500号",
        "name": "南洋绿都",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.42304,
            31.28493
        ],
        "address": "阳城路388弄",
        "name": "浦联佳苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.430219,
            31.184632
        ],
        "address": "文定路288弄",
        "name": "文定天下苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.452582,
            31.118486
        ],
        "address": "华泾路599弄",
        "name": "漓江花园（上海漓江山水）",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.445626,
            31.216963
        ],
        "address": "常熟路100弄10号",
        "name": "宝立大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.395934,
            31.281235
        ],
        "address": "古浪路183弄",
        "name": "祥和星宇二期",
        "count": 42,
        "style": 0
    },
    {
        "lnglat": [
            121.436573,
            31.23256
        ],
        "address": "昌平路994号",
        "name": "传媒文化园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.309498,
            31.143502
        ],
        "address": "九杜路477号",
        "name": "九杜生活广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.406762,
            31.19705
        ],
        "address": "虹桥路1380-7、1386号",
        "name": "文广大厦(虹桥路)",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.277207,
            31.373346
        ],
        "address": "成泽路386弄",
        "name": "新城馥华里",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.265936,
            31.340099
        ],
        "address": "希望路689弄",
        "name": "嘉定宝龙中心一期",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.501591,
            31.082582
        ],
        "address": "浦申路633弄1-57号",
        "name": "世博家园二街坊",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.437816,
            31.218495
        ],
        "address": "镇宁路168号",
        "name": "美丽园酒店公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.587518,
            31.130648
        ],
        "address": "周园北路522弄",
        "name": "康湾苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.44063,
            31.287111
        ],
        "address": "永和路455号",
        "name": "创景空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.441939,
            31.187218
        ],
        "address": "天钥桥路438号，458号",
        "name": "申峰大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.257768,
            31.347217
        ],
        "address": "德富路1199号",
        "name": "太湖世家环球大厦（世家双塔）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.491032,
            31.378494
        ],
        "address": "同济支路157号",
        "name": "智慧柒立方",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.407394,
            31.218075
        ],
        "address": "长宁路1600弄",
        "name": "沈南小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.229696,
            31.187185
        ],
        "address": "凤强塘路1000弄",
        "name": "春江三月一期",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.447502,
            31.237525
        ],
        "address": "陕西北路900号",
        "name": "MOHO办公楼",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.246372,
            31.339612
        ],
        "address": "云屏路1199弄",
        "name": "盘古天地一期（上海）",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.429959,
            31.22843
        ],
        "address": "万航渡路849号",
        "name": "海森国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.470143,
            31.220842
        ],
        "address": "雁荡路5号",
        "name": "金雁坊",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.531766,
            31.257803
        ],
        "address": "龙江路317弄",
        "name": "圣骊河滨苑一期",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.52866,
            31.175248
        ],
        "address": "成山路1488弄",
        "name": "大华锦绣华城15街区一期",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.522466,
            31.146035
        ],
        "address": "三林路1466弄1662弄",
        "name": "阳辰美景（衡辰三林苑）",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.48232,
            31.286153
        ],
        "address": "广灵四路24号",
        "name": "上海开隆大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.284907,
            31.113939
        ],
        "address": "沪松公路2517弄",
        "name": "丽水豪庭",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.427782,
            31.070496
        ],
        "address": "莲花南路2338号",
        "name": "沫谷城市空间",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.472753,
            31.198148
        ],
        "address": "瞿溪路1168号",
        "name": "开源大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.406281,
            31.259652
        ],
        "address": "曹杨路2170弄",
        "name": "恒力锦沧花园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.534143,
            31.26909
        ],
        "address": "长阳路1616号",
        "name": "互联网教育大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.404998,
            31.191546
        ],
        "address": "伊犁南路34弄",
        "name": "虹桥明珠公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.541873,
            31.236057
        ],
        "address": "张杨路1667弄",
        "name": "金露苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.77703,
            31.053932
        ],
        "address": "拱极路2368弄29支弄",
        "name": "华钜御庭一期",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.217049,
            31.0392
        ],
        "address": "新松江路1060号",
        "name": "恒杰商务大楼B座",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.366355,
            31.000523
        ],
        "address": "天宁路51号",
        "name": "福缘集团园区",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.448531,
            31.141442
        ],
        "address": "上中路495号",
        "name": "汇达商务园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.430331,
            31.210834
        ],
        "address": "延安西路1118号",
        "name": "龙之梦大厦(延安路)",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.490966,
            31.248541
        ],
        "address": "吴淞路218号",
        "name": "宝矿国际大厦",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.374934,
            31.081233
        ],
        "address": "申旺路789号",
        "name": "慧高光创园(光创园)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.361235,
            31.255646
        ],
        "address": "曹安公路1930弄",
        "name": "曹安商办楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.407019,
            31.195795
        ],
        "address": "伊犁南路500弄",
        "name": "古北中央花园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.398039,
            31.27484
        ],
        "address": "真金路577弄，武威东路477弄，武威东路479弄",
        "name": "颐和华城",
        "count": 81,
        "style": 0
    },
    {
        "lnglat": [
            121.315875,
            31.020443
        ],
        "address": "车泾路99号",
        "name": "三宝园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.341807,
            31.381543
        ],
        "address": "罗和路118弄",
        "name": "美罗家园慧苑",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.42154,
            31.217402
        ],
        "address": "定西路1507号",
        "name": "中山大楼(定西路)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.517043,
            31.300953
        ],
        "address": "翔殷路1128号",
        "name": "沪东金融大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.522271,
            31.241137
        ],
        "address": "昌邑路600号",
        "name": "万源晶典公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.367132,
            31.174162
        ],
        "address": "白樟路99弄",
        "name": "中祥龙柏苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.229181,
            31.377819
        ],
        "address": "红石路333弄",
        "name": "新城悠活城",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.473014,
            31.237098
        ],
        "address": "北京西路1号",
        "name": "新金桥广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.482699,
            31.238336
        ],
        "address": "天津路180号",
        "name": "应氏大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.274735,
            31.043686
        ],
        "address": "明南路85号",
        "name": "启迪漕河泾（中山）科技园水紫荆园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.754942,
            31.071297
        ],
        "address": "听达路185弄",
        "name": "丽水雅苑北苑",
        "count": 88,
        "style": 0
    },
    {
        "lnglat": [
            121.494745,
            31.29462
        ],
        "address": "邯郸路98号",
        "name": "上海无锡大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.227615,
            31.387297
        ],
        "address": "红石路730号",
        "name": "汇丰凯苑",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.425308,
            31.229413
        ],
        "address": "万航渡后路77弄",
        "name": "蔚蓝水岸",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.551156,
            31.249628
        ],
        "address": "浦东大道2220号、2160号",
        "name": "上安大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.481731,
            31.404499
        ],
        "address": "牡丹江路1588-1号",
        "name": "宝地宝杨商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.393733,
            31.179701
        ],
        "address": "虹梅路2838弄",
        "name": "虹桥晶典苑",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.501702,
            31.260373
        ],
        "address": "岳州路319弄",
        "name": "虹领公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.381301,
            31.117135
        ],
        "address": "水清路378弄25支弄",
        "name": "水清二村",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.640564,
            31.09844
        ],
        "address": "蓝靛路1688弄",
        "name": "保利艾庐",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.395308,
            31.260514
        ],
        "address": "桃浦路296号",
        "name": "星河世纪广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.269664,
            31.167418
        ],
        "address": "育才路555弄",
        "name": "西郊美德苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.49028,
            31.215441
        ],
        "address": "尚文路185号",
        "name": "平利大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.44612,
            31.192352
        ],
        "address": "宛平南路300弄",
        "name": "宛平南苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.537785,
            31.237656
        ],
        "address": "商城路1900号",
        "name": "金桃大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.255992,
            31.125963
        ],
        "address": "泗通路688弄",
        "name": "万业名苑",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.453833,
            31.234411
        ],
        "address": "武定路333号",
        "name": "申银发展大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.406796,
            31.21767
        ],
        "address": "长宁路1666弄",
        "name": "虹桥馨苑",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.51022,
            31.30582
        ],
        "address": "伟成路70号",
        "name": "弘源创新大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.439046,
            30.937278
        ],
        "address": "环城西路2511号2栋",
        "name": "上海现代服务业南桥科创园",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.523338,
            31.177993
        ],
        "address": "北艾路1765弄",
        "name": "大华锦绣华城4街区",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.378704,
            31.085472
        ],
        "address": "银都路4277号",
        "name": "金地威新闵行科创园(银都路园)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.290155,
            31.220081
        ],
        "address": "繁兴路1000弄",
        "name": "景平苑",
        "count": 62,
        "style": 0
    },
    {
        "lnglat": [
            121.568623,
            31.099192
        ],
        "address": "沪南路3736弄5号",
        "name": "蒋蒋商务园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.8034,
            30.90094
        ],
        "address": "霞光路368弄",
        "name": "东港铭筑",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.340646,
            31.259804
        ],
        "address": "华江支路328弄",
        "name": "天际蓝桥",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.365331,
            31.176769
        ],
        "address": "青杉路200弄1号",
        "name": "俊领国际（青杉路200弄1号）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.41616,
            31.191036
        ],
        "address": "古羊路158号",
        "name": "虹三产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.388019,
            31.169265
        ],
        "address": "万源路2158号",
        "name": "泓毅大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.581971,
            31.110367
        ],
        "address": "周市路39弄",
        "name": "粤亮湾景苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.526675,
            31.213146
        ],
        "address": "东方路1357-1369号",
        "name": "海富花园(上海)",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.508133,
            31.27393
        ],
        "address": "锦西路185号",
        "name": "爱联大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.410009,
            31.314624
        ],
        "address": "沪太路2899弄",
        "name": "绿地科技中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.427317,
            31.333887
        ],
        "address": "场北路551弄",
        "name": "中环国际公寓一期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.59365,
            31.189783
        ],
        "address": "华佗路678号",
        "name": "高科苑",
        "count": 84,
        "style": 0
    },
    {
        "lnglat": [
            121.411287,
            31.230679
        ],
        "address": "宁夏路777号",
        "name": "坤田社区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.43443,
            31.201471
        ],
        "address": "淮海西路55号",
        "name": "申通信息广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.525113,
            31.215156
        ],
        "address": "峨山路485弄",
        "name": "山泉花苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.516381,
            31.239225
        ],
        "address": "浦东大道288号",
        "name": "SDL智汇东信",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.580809,
            31.117662
        ],
        "address": "周市路416号",
        "name": "慧晶国际公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.279085,
            30.989955
        ],
        "address": "车墩镇车阳路77弄",
        "name": "松南城舒雅苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.44985,
            31.236774
        ],
        "address": "江宁路631号",
        "name": "新建大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.46797,
            31.286408
        ],
        "address": "广粤路150弄",
        "name": "虹韵家园",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.334318,
            31.399414
        ],
        "address": "年吉路650弄",
        "name": "美罗家园润苑",
        "count": 44,
        "style": 0
    },
    {
        "lnglat": [
            121.493243,
            31.293377
        ],
        "address": "邯郸路43号",
        "name": "中观产业园（中观大厦）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.408413,
            31.164417
        ],
        "address": "漕宝路401号",
        "name": "漕宝路401号园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.418228,
            31.06572
        ],
        "address": "都会路1999-2059号",
        "name": "上海晶碧科技园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.080571,
            30.87311
        ],
        "address": "润兴路8弄",
        "name": "金山玫瑰公馆",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.510577,
            31.196693
        ],
        "address": "浦三路12弄",
        "name": "海浦小区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.401467,
            31.294334
        ],
        "address": "真大路450弄11号",
        "name": "中邮华东智能产业园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.527085,
            31.076412
        ],
        "address": "联川路213号",
        "name": "新必产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.41107,
            31.23368
        ],
        "address": "中山北路3618弄",
        "name": "银城大厦(上海)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.472446,
            31.197484
        ],
        "address": "打浦路398弄",
        "name": "东晖花苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.430685,
            31.218158
        ],
        "address": "宣化路28号",
        "name": "企业发展大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.431833,
            31.216205
        ],
        "address": "江苏路502弄",
        "name": "公信绿地大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.441939,
            31.194865
        ],
        "address": "肇嘉浜路1033号",
        "name": "徐家汇国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.371488,
            31.000232
        ],
        "address": "东川路3533号",
        "name": "上海天星苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.431722,
            31.220482
        ],
        "address": "愚园路888号",
        "name": "畅园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.447109,
            31.234671
        ],
        "address": "西康路556号",
        "name": "联谊西康大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.483434,
            31.400133
        ],
        "address": "宝林路458号",
        "name": "云派PARK",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.353569,
            31.158931
        ],
        "address": "新龙路399弄56号",
        "name": "七宝宝龙城",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.390677,
            31.234138
        ],
        "address": "中江路879号",
        "name": "天地软件园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.392496,
            31.160405
        ],
        "address": "莲花路1559号",
        "name": "旺琦商业广场(勇卫商务大厦)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.515426,
            31.222978
        ],
        "address": "潍坊西路55号",
        "name": "上海世茂大厦",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.539192,
            31.159292
        ],
        "address": "大道站路94弄",
        "name": "三林世博家园B区",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.60549,
            31.259402
        ],
        "address": "金高路2366号",
        "name": "金海商业广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.464575,
            31.39749
        ],
        "address": "友谊路1060号",
        "name": "璨阳文化科创园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.503895,
            31.177849
        ],
        "address": "云台路183弄",
        "name": "昌里花园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.400718,
            31.26885
        ],
        "address": "水泉路99弄",
        "name": "达安春之声花园二期",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.475685,
            31.213394
        ],
        "address": "马当路357弄之1-8号",
        "name": "马当小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.410589,
            31.216033
        ],
        "address": "中山西路360号",
        "name": "宁定大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.489247,
            31.298572
        ],
        "address": "纪念路289弄",
        "name": "三湘世纪花城",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.527627,
            31.261363
        ],
        "address": "江浦路666弄",
        "name": "星惠佳苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.448423,
            31.26279
        ],
        "address": "洛川中路1158号",
        "name": "上海名仕街",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.457156,
            31.393634
        ],
        "address": "友谊路1518弄",
        "name": "永景国际大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.412564,
            31.149226
        ],
        "address": "桂平路88弄、126弄",
        "name": "紫藤苑综合楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.425766,
            31.221883
        ],
        "address": "长宁路515号",
        "name": "兴联大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.759067,
            31.042001
        ],
        "address": "城南路555弄",
        "name": "鼎城丽景苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.528636,
            31.259876
        ],
        "address": "榆林路858弄",
        "name": "滨江晶典",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.402499,
            31.258037
        ],
        "address": "芝川路100弄",
        "name": "芝川新苑（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.523649,
            31.263287
        ],
        "address": "江浦路821弄",
        "name": "平盛苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.486785,
            31.211087
        ],
        "address": "西藏南路1109号",
        "name": "永明大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.436756,
            31.243862
        ],
        "address": "长寿路97号",
        "name": "世纪商务大厦",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.472059,
            31.222427
        ],
        "address": "淮海中路398号",
        "name": "博银国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.6092,
            31.279811
        ],
        "address": "巨峰路1058号",
        "name": "乐坊（晨达广场）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.517828,
            31.261017
        ],
        "address": "通北路589号",
        "name": "燕舞东方保利广场L楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.443748,
            31.280676
        ],
        "address": "万荣路777号",
        "name": "大宁音乐广场H座",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.395489,
            31.195415
        ],
        "address": "荣华东道119弄",
        "name": "巴黎经典",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.559836,
            31.2454
        ],
        "address": "博山东路20弄",
        "name": "锦绣河山小区",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.481948,
            31.210279
        ],
        "address": "徐家汇路1弄",
        "name": "新家坡园景苑",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.446125,
            31.204554
        ],
        "address": "衡山路20号",
        "name": "衡安大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.392487,
            31.235112
        ],
        "address": "中江路888号",
        "name": "五芳斋大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.260556,
            31.345663
        ],
        "address": " 阿克苏路1099号",
        "name": "宝龙城市广场_公寓楼",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.428726,
            31.203729
        ],
        "address": "番愚路390号",
        "name": "时代大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.387154,
            31.116246
        ],
        "address": "莘建东路58号",
        "name": "绿地科技岛",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.627655,
            31.219864
        ],
        "address": "丹桂路899号",
        "name": "张江国创中心一号楼",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.462743,
            31.249003
        ],
        "address": "共和新路340号",
        "name": "宝丰大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.434761,
            31.241672
        ],
        "address": "常德路1339号",
        "name": "金昌商务中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.298337,
            31.207817
        ],
        "address": "繁兴路46号",
        "name": "魔方公寓(国家会展中心店)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.305717,
            31.149733
        ],
        "address": "涞坊路1000号",
        "name": "新虹桥企业天地",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.505787,
            31.164901
        ],
        "address": "杨思路1121弄",
        "name": "东方悦居苑",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.51371,
            31.29469
        ],
        "address": "四平路2158号",
        "name": "富庆国定大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.306997,
            31.101973
        ],
        "address": "盛富路669号",
        "name": "科溢科创中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.497723,
            31.210828
        ],
        "address": "陆家浜路468弄28号",
        "name": "百汇公寓（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.429387,
            31.226958
        ],
        "address": "万航渡路858弄25-38号",
        "name": "静安丽舍",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.471077,
            31.258591
        ],
        "address": "通阁路150号",
        "name": "长信公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.524708,
            31.151032
        ],
        "address": "尚博路799弄",
        "name": "金橘新苑北区",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.446278,
            31.299565
        ],
        "address": "万荣一路15号",
        "name": "增美都市工业园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.388469,
            31.123057
        ],
        "address": "报春路399弄",
        "name": "新梅公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.456394,
            31.300823
        ],
        "address": "寿阳路555号",
        "name": "哈瑞中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.439958,
            31.228338
        ],
        "address": "延平路123弄1-16号",
        "name": "三和花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.446162,
            31.237732
        ],
        "address": "海防路387号",
        "name": "大闻丽都苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.422892,
            31.126446
        ],
        "address": "虹梅南路786号",
        "name": "上海雍辰商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.464443,
            31.229026
        ],
        "address": "青海路118号",
        "name": "云海苑商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.452044,
            31.288172
        ],
        "address": "共和新路2993号",
        "name": "中环企业广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.165632,
            31.183096
        ],
        "address": "崧复路1999号",
        "name": "奥帛科创园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.43377,
            31.189274
        ],
        "address": "南丹路118弄",
        "name": "光启公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.613729,
            31.25581
        ],
        "address": "金豫路50弄",
        "name": "禹洲国际大厦（二期）",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.391071,
            31.100662
        ],
        "address": "都市路4633弄",
        "name": "春申城四季苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.484859,
            31.30444
        ],
        "address": "仁德路333号",
        "name": "平溪商业广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.500178,
            30.919721
        ],
        "address": "南奉公路6899弄",
        "name": "金昊雅苑",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.435736,
            31.186479
        ],
        "address": "蒲汇塘路11号",
        "name": "博大商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.473194,
            31.318491
        ],
        "address": "高跃路77弄",
        "name": "三邻桥",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.486913,
            31.181377
        ],
        "address": "国耀路211号、209号",
        "name": "国家电网世博写字楼CD座",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.423841,
            31.023878
        ],
        "address": "沧源路1200号",
        "name": "思源创新园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.402285,
            31.205323
        ],
        "address": "娄山关路８５号",
        "name": "东方国际大厦B座",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.535107,
            31.224889
        ],
        "address": "世纪大道1589号",
        "name": "长泰国际金融大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.512926,
            31.260121
        ],
        "address": "昆明路518号A座",
        "name": "北美广场",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.391478,
            31.20978
        ],
        "address": "水城路468弄",
        "name": "五洲大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.518298,
            31.207376
        ],
        "address": "浦建路60弄",
        "name": "澳丽花苑",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.370031,
            31.178023
        ],
        "address": "虹井路288号",
        "name": "燎申虹桥国际中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.431738,
            31.240757
        ],
        "address": "胶州路1216弄",
        "name": "绿洲城市花园三期",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.45676,
            31.22496
        ],
        "address": "陕西北路66号",
        "name": "科恩国际中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.41107,
            31.23368
        ],
        "address": "中山北路3327弄",
        "name": "恒陇丽晶",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.511762,
            31.170349
        ],
        "address": "成山路668弄",
        "name": "恒大星级公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.38794,
            31.177199
        ],
        "address": "吴中路1029号",
        "name": "灿虹世纪广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.447707,
            31.240093
        ],
        "address": "江宁路838号",
        "name": "富容大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.591061,
            31.33413
        ],
        "address": "季景路333弄",
        "name": "阳明花园二期",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.468739,
            31.209235
        ],
        "address": "建国中路115弄",
        "name": "思南公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.185771,
            31.044395
        ],
        "address": "三新北路1333弄-1-90号",
        "name": "恒杰丁香花园",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.447865,
            31.191442
        ],
        "address": "宛平南路381号",
        "name": "沪港国际大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.484703,
            31.252772
        ],
        "address": "四川北路1350号",
        "name": "利通广场",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.353613,
            31.232225
        ],
        "address": "临虹路128弄6号",
        "name": "红蜻蜓品牌中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.383998,
            31.175912
        ],
        "address": "吴中路1189号",
        "name": "虹桥德必易园",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.470536,
            31.263986
        ],
        "address": "宝昌路738弄",
        "name": "广盛公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.439161,
            31.277675
        ],
        "address": "广中西路777弄2号楼",
        "name": "多媒体产业大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.486291,
            31.19947
        ],
        "address": "制造局路787号",
        "name": "黄浦区科技创业中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.513467,
            31.272375
        ],
        "address": "许昌路1560弄",
        "name": "伊东苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.556182,
            30.926972
        ],
        "address": "南奉公路4025号",
        "name": "上海铭基科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.491954,
            31.257722
        ],
        "address": "海伦路306弄",
        "name": "海昌苑(虹口)",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.433937,
            31.166167
        ],
        "address": "沪闵路9510号",
        "name": "泰成商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.459215,
            31.241446
        ],
        "address": "恒通路222号",
        "name": "地铁恒通大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.44832,
            31.233125
        ],
        "address": "西康路446号",
        "name": "伯龙公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.420567,
            31.192152
        ],
        "address": "中山西路1279弄6号",
        "name": "国峰科技大厦（上海）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.487041,
            31.211542
        ],
        "address": "陆家浜路1100号",
        "name": "新凌大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.52396,
            31.240314
        ],
        "address": "浦东大道688号",
        "name": "浦东大道688号基地",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.520281,
            31.288821
        ],
        "address": "黄兴路1675号",
        "name": "五角场科技大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.537304,
            31.131437
        ],
        "address": "秀沿西路68弄",
        "name": "保利林语溪",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.258738,
            31.300784
        ],
        "address": "嘉好路1888号",
        "name": "嘉好科技园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437323,
            31.236165
        ],
        "address": "安远路597弄",
        "name": "静安四季公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.422569,
            31.211245
        ],
        "address": "昭化路488号",
        "name": "金森大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.488064,
            31.223921
        ],
        "address": "河南南路368弄",
        "name": "太阳都市花园二期",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.271404,
            31.105484
        ],
        "address": "沪松公路3023号",
        "name": "九创文邑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.444743,
            31.230308
        ],
        "address": "武定路881号",
        "name": "881创意园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.381812,
            31.181353
        ],
        "address": "紫乐路8号",
        "name": "魔方公寓虹中路店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.433938,
            31.307277
        ],
        "address": "康宁路1021-1211号",
        "name": "秦辰创业商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.395829,
            31.046406
        ],
        "address": "元江路3699号",
        "name": "新光华创智园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.450882,
            31.247212
        ],
        "address": "恒丰路610号",
        "name": "金岸610",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.4743,
            31.212699
        ],
        "address": "淡水路361号",
        "name": "淡水公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.488581,
            31.347896
        ],
        "address": "长江路580号",
        "name": "宝地吴淞",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.447415,
            31.367857
        ],
        "address": "水产路2289号",
        "name": "壹间宝山花园城",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.48872,
            31.265502
        ],
        "address": "吉祥路38号",
        "name": "吉祥苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.423692,
            31.075352
        ],
        "address": "颛兴东路999弄",
        "name": "阳明创业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.373187,
            31.172009
        ],
        "address": "吴中路1439号",
        "name": "莱茵虹景中心",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.421298,
            31.176551
        ],
        "address": "宜山路515弄",
        "name": "环线广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.447236,
            31.174642
        ],
        "address": "天钥桥路1188号",
        "name": "创邑朵云轩",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.328315,
            31.475268
        ],
        "address": "长虹路718弄",
        "name": "海上御景苑三期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.271898,
            31.191755
        ],
        "address": "双联路88号",
        "name": "三银基金产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.451755,
            31.247066
        ],
        "address": "长安路1138号",
        "name": "中房华东大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.470287,
            31.203103
        ],
        "address": "打浦路88号",
        "name": "海丽大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.605299,
            31.309462
        ],
        "address": "富特西三路77号10幢",
        "name": "信泰融资大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.409575,
            31.144135
        ],
        "address": "虹梅路269号",
        "name": "宝城大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.542485,
            31.286665
        ],
        "address": "控江路568弄",
        "name": "大众苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.408292,
            31.216877
        ],
        "address": "长宁路1515号",
        "name": "星火大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.460188,
            31.242032
        ],
        "address": "梅园路77号",
        "name": "人才大厦(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.41697,
            31.290873
        ],
        "address": "沪太路1866号",
        "name": "诺诚M7创意园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.428683,
            31.228237
        ],
        "address": "万航渡路888号",
        "name": "开开广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.434748,
            30.961605
        ],
        "address": "肖塘路255弄",
        "name": "乐活青年公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.453177,
            31.268312
        ],
        "address": "老沪太路201弄1号",
        "name": "广视大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.366349,
            31.178254
        ],
        "address": "青杉路150弄",
        "name": "龙柏四季花园",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.464374,
            31.231598
        ],
        "address": "南京西路688号",
        "name": "688广场",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.252424,
            31.034092
        ],
        "address": "茸平路333弄",
        "name": "国乐广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.414574,
            31.057059
        ],
        "address": "都市路1800弄",
        "name": "金榜新苑",
        "count": 69,
        "style": 0
    },
    {
        "lnglat": [
            121.523566,
            31.277918
        ],
        "address": "控江路1555号",
        "name": "上海信息技术大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.435977,
            31.231694
        ],
        "address": "昌平路1009",
        "name": "昌平综合大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.452483,
            31.270177
        ],
        "address": "延长路162弄",
        "name": "爱甸苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.432872,
            31.251766
        ],
        "address": "光新路128弄",
        "name": "阳光大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.526427,
            31.206247
        ],
        "address": "东方路1663弄1669弄",
        "name": "贵龙园",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.379059,
            31.186765
        ],
        "address": "虹中路525号",
        "name": "黔香阁(虹桥店)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.422108,
            31.037315
        ],
        "address": "都市路431号",
        "name": "铂客公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.405684,
            31.020307
        ],
        "address": "金平路788弄",
        "name": "合生城邦四街坊",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.414535,
            31.26667
        ],
        "address": "新村路877号",
        "name": "大华齐成晟商务园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.358489,
            31.222757
        ],
        "address": "金钟路658弄1号楼",
        "name": "东华大学国家大学科技园1号楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.20504,
            31.416662
        ],
        "address": " 汇源路218号",
        "name": "中茂世纪财富广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.456191,
            31.258024
        ],
        "address": "普善路239弄，521弄",
        "name": "北美公寓",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.53131,
            31.233583
        ],
        "address": "松林路97弄",
        "name": "海怡别墅",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.370553,
            31.175014
        ],
        "address": "虹井路185号",
        "name": "虹淞大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.421507,
            31.333631
        ],
        "address": "大康路1079弄",
        "name": "中环国际公寓二期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.439086,
            31.218843
        ],
        "address": "延安西路358号",
        "name": "美丽园大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.416611,
            31.219131
        ],
        "address": "长宁路1018号",
        "name": "龙之梦商场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.444975,
            31.289709
        ],
        "address": "永和路318弄18号",
        "name": "东方环球企业中心18号",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.430731,
            31.166456
        ],
        "address": "钦州路428弄之1-9号",
        "name": "中虹汇之苑",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.53323,
            31.222847
        ],
        "address": "浦电路438号",
        "name": "双鸽大厦",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.524305,
            31.232823
        ],
        "address": "东方路573弄1号",
        "name": "市政大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.437311,
            31.219076
        ],
        "address": "镇宁路200号",
        "name": "欣安大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.515675,
            31.25076
        ],
        "address": "杨树浦路248号",
        "name": "瑞丰国际大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.432241,
            31.214631
        ],
        "address": "延安西路895号",
        "name": "申亚金融广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.434893,
            31.13117
        ],
        "address": "罗秀路717弄",
        "name": "舒乐公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.542055,
            31.215924
        ],
        "address": "锦延路329号",
        "name": "锦绣坊",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.526442,
            31.237424
        ],
        "address": "乳山路233号",
        "name": "梅园WE",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.163696,
            31.047687
        ],
        "address": "广富林路4855弄",
        "name": "星月大业领地",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.274189,
            31.042047
        ],
        "address": "中创路68号",
        "name": "上海启迪漕河泾(中山)科技园",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.428453,
            31.209197
        ],
        "address": "延安西路1228弄8号",
        "name": "嘉苑公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.524667,
            31.293935
        ],
        "address": "国顺东路800号",
        "name": "五角场800号艺术空间",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.439307,
            31.19214
        ],
        "address": "漕溪北路41号",
        "name": "汇嘉大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.235233,
            31.18952
        ],
        "address": "凤徐路85弄",
        "name": "新丰公寓",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.364716,
            31.35881
        ],
        "address": "韶山路245弄",
        "name": "馨佳园十街坊",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.376669,
            31.186174
        ],
        "address": "程家桥路388弄",
        "name": "古北金鹰府二期",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.39988,
            31.013214
        ],
        "address": "景谷路176弄1号",
        "name": "景谷大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.531053,
            31.268562
        ],
        "address": "长阳路1529弄",
        "name": "旺增公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.565674,
            31.257442
        ],
        "address": "栖山路1578弄",
        "name": "云山苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.451464,
            31.234373
        ],
        "address": "武定路458号",
        "name": "洪安大厦(上海)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.505531,
            31.233544
        ],
        "address": "银城中路501号",
        "name": "上海中心",
        "count": 281,
        "style": 0
    },
    {
        "lnglat": [
            121.428108,
            31.232021
        ],
        "address": "长寿路1076号",
        "name": "飞雕商务大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.399507,
            31.204864
        ],
        "address": "古北路678号",
        "name": "同诠大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.39427,
            31.248457
        ],
        "address": "北石路440弄",
        "name": "真西新驰苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.443176,
            31.187389
        ],
        "address": "斜土路2601号",
        "name": "嘉汇广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450774,
            31.194496
        ],
        "address": "斜土路1975弄、2099弄",
        "name": "阳光名苑二期(阳光巴黎二期)",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.519725,
            31.274115
        ],
        "address": "江浦路1500号",
        "name": "智慧树（智慧树创意产业园）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.606097,
            31.124858
        ],
        "address": "环桥路555弄",
        "name": "星月总部湾",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.496329,
            31.250094
        ],
        "address": "东长治路399号",
        "name": "双狮汇",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.391816,
            31.179161
        ],
        "address": "吴中路889号",
        "name": "君怡公寓",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.477067,
            31.210363
        ],
        "address": "徐家汇路268号",
        "name": "凯德晶萃广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.478852,
            31.342852
        ],
        "address": "郁江巷路129弄",
        "name": "三湘海尚",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.381268,
            31.306791
        ],
        "address": "祁连山路2233弄",
        "name": "中裕豪庭",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.598916,
            31.251536
        ],
        "address": "金桥经济技术开发区浙桥路99号",
        "name": "悦樘公寓(碧云店)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.470162,
            31.206833
        ],
        "address": "徐家汇路552弄1号",
        "name": "富源公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.405889,
            31.160577
        ],
        "address": "桂平路333号",
        "name": "上海桂林科技园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.522112,
            31.186137
        ],
        "address": "齐恒路177弄",
        "name": "凯德嘉博名邸",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.444716,
            31.299748
        ],
        "address": "万荣一路90号",
        "name": "国际青年创业社区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.439853,
            31.188076
        ],
        "address": "天钥桥路380弄",
        "name": "通汇公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.508358,
            30.971468
        ],
        "address": "金碧路1980弄",
        "name": "金碧汇虹苑",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.340224,
            31.085834
        ],
        "address": "明兴路528弄",
        "name": "新南路1（壹）号",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.499625,
            31.260588
        ],
        "address": "临平路133弄",
        "name": "瑞虹新城二期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.410624,
            31.180285
        ],
        "address": "钦州北路927弄",
        "name": "航天公寓1期",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.518789,
            31.220901
        ],
        "address": "浦东南路1525号",
        "name": "振环大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.41753,
            31.19561
        ],
        "address": "虹桥路1060弄",
        "name": "虹桥丽景苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.517917,
            31.303805
        ],
        "address": "政通路95弄",
        "name": "文轩佳苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.391103,
            31.253564
        ],
        "address": "真北路2167号",
        "name": "鸿海大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.516932,
            31.087553
        ],
        "address": "江凯路177号",
        "name": "鑫广科创园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.379039,
            31.110745
        ],
        "address": "七莘路50号",
        "name": "乾锦创业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.389694,
            31.102395
        ],
        "address": "富都路111弄",
        "name": "都市星城",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.549371,
            31.146152
        ],
        "address": "康桥路787号",
        "name": "中天科技商务园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426357,
            31.227985
        ],
        "address": "长宁支路125弄",
        "name": "长宁88金廷",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.43331,
            31.244188
        ],
        "address": "常德路1436号",
        "name": "德诚大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.511215,
            31.236295
        ],
        "address": "浦东南路528号",
        "name": "证券大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.408066,
            31.193011
        ],
        "address": "黄金城道258号",
        "name": "古北嘉年华庭",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.283007,
            31.149993
        ],
        "address": "九泾路959号",
        "name": "上海豪禺创业园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.479358,
            31.249668
        ],
        "address": "河南北路485号",
        "name": "银历大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.466525,
            31.228088
        ],
        "address": "成都北路333号",
        "name": "招商局广场",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.338273,
            31.48165
        ],
        "address": "潘泾路5777弄",
        "name": "雍和府",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.363639,
            31.252068
        ],
        "address": "新郁路846弄56号",
        "name": "兆地商务金座_B座",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.491901,
            31.207382
        ],
        "address": "南车站路318弄",
        "name": "豫景公寓",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.524673,
            31.176189
        ],
        "address": "成山路1339号",
        "name": "大华锦绣优嘉",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.454475,
            31.288973
        ],
        "address": "共和新路2999弄",
        "name": "明园森林都市一期森林都市滴翠苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.55048,
            31.30849
        ],
        "address": "翔殷路128号",
        "name": "上海理工科技园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.594842,
            31.337065
        ],
        "address": "外高桥富特西一路381号",
        "name": "汤臣工业园区",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.363803,
            31.209824
        ],
        "address": "仙霞西路500弄",
        "name": "虹康花苑一期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.356702,
            31.642738
        ],
        "address": "新闸路831弄",
        "name": "丽都新贵",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.431436,
            31.285696
        ],
        "address": "原平路383弄",
        "name": "永和丽园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.487236,
            31.283531
        ],
        "address": "东体育会路816号",
        "name": "置汇谷",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.396334,
            31.192776
        ],
        "address": "水城南路16弄",
        "name": "四季晶园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.509128,
            31.259956
        ],
        "address": "唐山路921号",
        "name": "木材大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.476298,
            31.19954
        ],
        "address": "瞿溪路694号",
        "name": "汇典商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.3653,
            31.342862
        ],
        "address": "宝菊路133弄",
        "name": "保利叶语",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.501782,
            31.071041
        ],
        "address": "浦锦街道联航路2165弄世博家园(近联航路)",
        "name": "世博家园十五街坊",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.454824,
            31.231618
        ],
        "address": "江宁路212号",
        "name": "凯迪克大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.334507,
            31.391252
        ],
        "address": "罗和路855弄",
        "name": "金丰苑三区",
        "count": 36,
        "style": 0
    },
    {
        "lnglat": [
            121.457141,
            31.259395
        ],
        "address": "中山北路828号",
        "name": "科普大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.505666,
            31.310641
        ],
        "address": "国霞路55号",
        "name": "君庭公寓",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.328398,
            31.269991
        ],
        "address": "海波路1000弄",
        "name": "水岸丽苑（一期）",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.439477,
            31.219202
        ],
        "address": "延安西路300号",
        "name": "静安大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.484658,
            31.294174
        ],
        "address": "广纪路838号",
        "name": "中图出版蓝桥创意产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.423763,
            31.328965
        ],
        "address": "花园宅路52、190弄",
        "name": "共康雅苑一期",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.504164,
            31.240987
        ],
        "address": "陆家嘴环路1233号",
        "name": "汇亚大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.278446,
            31.109203
        ],
        "address": "沪松公路2751号",
        "name": "新南丽都商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.408413,
            31.164417
        ],
        "address": "漕宝路401号",
        "name": "漕宝路园区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.741395,
            31.041382
        ],
        "address": "沪南公路9999号",
        "name": "沪南公路9999号办公楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437903,
            31.21664
        ],
        "address": "镇宁路90-98号",
        "name": "爱俪轩大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.451632,
            31.191123
        ],
        "address": "斜土路2096弄",
        "name": "锦蝶苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.457964,
            31.311957
        ],
        "address": "临汾路380弄之1-9号",
        "name": "星城花苑",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.500646,
            31.272549
        ],
        "address": "天宝路900号",
        "name": "天宝创业空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.511183,
            31.034282
        ],
        "address": "永跃路782弄",
        "name": "永康城佳兴苑",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.531924,
            31.243578
        ],
        "address": "浦东大道1097弄",
        "name": "珠江玫瑰花园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.516199,
            31.069369
        ],
        "address": "恒南路399号",
        "name": "茸锦浦江科技园",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.200118,
            31.413584
        ],
        "address": "汇源路518弄",
        "name": "首创旭辉城",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.39039,
            31.241451
        ],
        "address": "梅川路888弄",
        "name": "海上名庭（三期）",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.488877,
            31.21023
        ],
        "address": "丽园路68弄",
        "name": "海洲丽园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.393522,
            31.173869
        ],
        "address": "虹梅路2159弄",
        "name": "荣信虹桥世嘉",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.593134,
            31.347499
        ],
        "address": "富特北路33号",
        "name": "卓越金融大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.39137,
            31.212431
        ],
        "address": "水城路675号",
        "name": "怡乐公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.43042,
            31.189463
        ],
        "address": "宜山路187号",
        "name": "南山大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.25389,
            31.084401
        ],
        "address": "洞舟路459号",
        "name": "亿弘实业工业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437365,
            31.243242
        ],
        "address": "西康路1297号 ",
        "name": "云都商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.475281,
            31.259081
        ],
        "address": "陆丰路9号",
        "name": "宝通大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.53248,
            31.254183
        ],
        "address": "福宁路60号",
        "name": "VIP陪练办公楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.444438,
            31.224176
        ],
        "address": "愚园路168号",
        "name": "环球世界大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.247614,
            31.396286
        ],
        "address": "环城路762弄5号楼",
        "name": "信业未来中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.4311,
            31.14816
        ],
        "address": "石龙路951号",
        "name": "美通科创空间",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.346247,
            31.140792
        ],
        "address": "中春路7198号",
        "name": "凯斯国际商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.527975,
            31.224505
        ],
        "address": "东方路877号",
        "name": "嘉兴大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.415723,
            31.2438
        ],
        "address": "武宁路501号",
        "name": "鸿运大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.247177,
            31.339738
        ],
        "address": "云屏路1188弄",
        "name": "盘古天地二期（上海）",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.591441,
            31.344131
        ],
        "address": "奥纳路55号",
        "name": "金港大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.483538,
            31.209896
        ],
        "address": "丽园路333弄",
        "name": "黄浦新苑（上海）",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.427717,
            31.203669
        ],
        "address": "新华路272弄",
        "name": "畅翠苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.44295,
            31.067734
        ],
        "address": "虹梅南路4289号",
        "name": "绿亮科创园(虹梅南路)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.47593,
            31.296594
        ],
        "address": "水电路1412号",
        "name": "凉城地区中心办公楼(虹口图书馆)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.501053,
            31.222863
        ],
        "address": "中山南路200号",
        "name": "金外滩花园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.277724,
            31.213334
        ],
        "address": "联友路118号",
        "name": "虹桥成信中心",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.539396,
            31.044765
        ],
        "address": "闵驰二路58弄、59弄",
        "name": "欣佳宝邸",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.451281,
            31.039278
        ],
        "address": "尚义路91号",
        "name": "吴泾宝龙中心（二期）",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.430649,
            31.224549
        ],
        "address": "武定西路1438号",
        "name": "雅筑公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.397652,
            31.32749
        ],
        "address": "纬地路358弄",
        "name": "经纬城市绿洲观澜泓郡家园",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.485177,
            31.246769
        ],
        "address": "四川北路525号",
        "name": "宇航大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.36136,
            31.107106
        ],
        "address": "莘福路388号",
        "name": "莘东置业大厦",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.43866,
            31.278339
        ],
        "address": "广中西路777弄88号",
        "name": "华清大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.324759,
            31.256242
        ],
        "address": "靖远路1288弄",
        "name": "嘉旺苑",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.572289,
            31.161036
        ],
        "address": "御水路150弄",
        "name": "万科金色城市2期悦庭(地杰国际C街坊)",
        "count": 62,
        "style": 0
    },
    {
        "lnglat": [
            121.395285,
            31.193907
        ],
        "address": "荣华东道19弄",
        "name": "鹿特丹花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.375313,
            31.184778
        ],
        "address": "程家桥路258号",
        "name": "银洲国际商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.52023,
            31.261419
        ],
        "address": "吉林路60号",
        "name": "三九商务楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450958,
            31.194583
        ],
        "address": "斜土路2099弄",
        "name": "阳光名苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.278619,
            31.109317
        ],
        "address": "沪松公路2749弄1-2号",
        "name": "新南丽都",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.480124,
            31.223527
        ],
        "address": "柳林路150号",
        "name": "建发柳林大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.477035,
            31.203232
        ],
        "address": "斜土路500号",
        "name": "人才大厦（斜土路）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.810582,
            30.900749
        ],
        "address": "霞光路78弄",
        "name": "蓝色城邦",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.147706,
            31.019337
        ],
        "address": "昆港公路1088号",
        "name": "光塑科技园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.515861,
            31.288176
        ],
        "address": "国权路100号",
        "name": "国阳大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.484719,
            31.213522
        ],
        "address": "西藏南路900弄",
        "name": "开元坊",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.438366,
            31.362769
        ],
        "address": "梅林路97弄",
        "name": "康桥水都第四街区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.272967,
            31.115654
        ],
        "address": "鼓浪路550号",
        "name": "晶尚坊",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.277467,
            31.047133
        ],
        "address": "徐塘路58号",
        "name": "民丰科创园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.60682,
            31.132409
        ],
        "address": "秀浦路2555号",
        "name": "漕河泾康桥商务绿洲（临港康桥商务绿洲）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.486619,
            31.254395
        ],
        "address": "衡水路89弄1号",
        "name": "国际明佳城",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.483788,
            31.211184
        ],
        "address": "陆家浜路1332号",
        "name": "南开大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.600783,
            31.340986
        ],
        "address": "华申路180号",
        "name": "唯恩富勤大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.546412,
            31.26799
        ],
        "address": "杭州路895号",
        "name": "鼎隆公寓",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.499905,
            31.302428
        ],
        "address": "武东路28弄",
        "name": "同和国际小区二期",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.479348,
            31.229796
        ],
        "address": "延安东路700号",
        "name": "港泰广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.42297,
            31.215862
        ],
        "address": "定西路1310弄2号",
        "name": "南天大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.260508,
            31.194295
        ],
        "address": "明珠路1018号",
        "name": "e通世界商务园（双子楼）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.586999,
            31.275309
        ],
        "address": "利津路555弄",
        "name": "璞真园",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.507239,
            31.200873
        ],
        "address": "南码头路101号",
        "name": "海博大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.470966,
            31.243812
        ],
        "address": "西藏北路199号",
        "name": "农房总部大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.53053,
            31.208251
        ],
        "address": "浦建路727号",
        "name": "东方金座",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.536811,
            31.300906
        ],
        "address": "国顺东路皖沙三村70号",
        "name": "惠信苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.147706,
            31.019337
        ],
        "address": "昆港公路1088号",
        "name": "光塑科技园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.364366,
            31.143751
        ],
        "address": "荣谊路108弄",
        "name": "东方花园三期",
        "count": 35,
        "style": 0
    },
    {
        "lnglat": [
            121.534777,
            31.17714
        ],
        "address": "成山路2008弄",
        "name": "大华锦绣华城18街区",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.544773,
            31.205483
        ],
        "address": "牡丹路60号",
        "name": "东辰大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.181678,
            31.193582
        ],
        "address": "重固镇大街588号",
        "name": "新世纪商业广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.405071,
            31.211507
        ],
        "address": "天山路900号",
        "name": "汇金百货虹桥店",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.387421,
            31.235297
        ],
        "address": "怒江北路449弄8，9号（C区B区）",
        "name": "上海新曹杨高新技术工业园区二街坊(B区C区)",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.539065,
            31.282995
        ],
        "address": "控江路669弄",
        "name": "公园首府(上海)",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.489044,
            31.255215
        ],
        "address": "溧阳路735号",
        "name": "半岛湾时尚文化创意产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.381985,
            31.222909
        ],
        "address": "丹巴路98弄7号",
        "name": "龙裕财富中心",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.493669,
            31.268456
        ],
        "address": "曲阳路1号",
        "name": "华西证券大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.628652,
            31.209524
        ],
        "address": "盛夏路500弄",
        "name": "张江光大园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.60682,
            31.132409
        ],
        "address": "秀浦路2555号",
        "name": "漕河泾康桥商务绿洲（临港康桥商务绿洲）",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.525185,
            31.220676
        ],
        "address": "崂山路689号",
        "name": "潍坊综合楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.329138,
            31.243615
        ],
        "address": "华江路720号",
        "name": "歆翱商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.611545,
            31.201839
        ],
        "address": "高斯路965弄",
        "name": "丹芳苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.513014,
            31.128383
        ],
        "address": "和佳路105",
        "name": "东方康德家园北区",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.51456,
            31.0608
        ],
        "address": "沈杜公路3872弄",
        "name": "显贵商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.312892,
            31.236829
        ],
        "address": "金耀南路300弄",
        "name": "绿地新江桥城",
        "count": 50,
        "style": 0
    },
    {
        "lnglat": [
            121.212043,
            31.123996
        ],
        "address": "青城山路280弄",
        "name": "佘北家园富雅苑",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.251957,
            31.056122
        ],
        "address": "广富林路358弄",
        "name": "三迪曼哈顿第2期",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.347361,
            31.063517
        ],
        "address": "金都西路833号",
        "name": "松港商务园_金都西路",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.283451,
            31.100101
        ],
        "address": "泗砖路600号",
        "name": "松江钢材城南区园区",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.434954,
            31.288533
        ],
        "address": "汶水路480号",
        "name": "汇智印针园区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.491407,
            31.267561
        ],
        "address": "四达路58弄",
        "name": "世博花园",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.451953,
            31.234657
        ],
        "address": "江宁路445号",
        "name": "时美大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.133846,
            31.146119
        ],
        "address": "华青南路481-485号",
        "name": "芊岱大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450227,
            31.236456
        ],
        "address": "江宁路599弄",
        "name": "静安新格公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437115,
            31.191965
        ],
        "address": "祁连山南路588弄1号",
        "name": "康帅大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426422,
            31.245638
        ],
        "address": "中山北路2318号-2342号",
        "name": "中岚大楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.267438,
            31.101711
        ],
        "address": "沪松公路3128弄",
        "name": "永翔商务广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.589271,
            31.081555
        ],
        "address": "鹤沙路688弄",
        "name": "昱星家园西区",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.490903,
            31.265215
        ],
        "address": "四平路311号",
        "name": "恒城花苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.156805,
            31.15619
        ],
        "address": "秀禾路235弄",
        "name": "佳福雅苑A2",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.397916,
            31.291466
        ],
        "address": "华和路602弄",
        "name": "华和路600弄",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.20591,
            31.12682
        ],
        "address": "高登山路350弄",
        "name": "咏泽苑",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.362322,
            31.393918
        ],
        "address": "美艾路198弄",
        "name": "美兰湖颐景园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.386088,
            31.177319
        ],
        "address": "吴中路1100号",
        "name": "炫润国际大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.431006,
            31.227307
        ],
        "address": "万航渡路736号",
        "name": "金融街静安中心",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.48723,
            31.209332
        ],
        "address": "西藏南路1225号",
        "name": "城信大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.405138,
            31.204739
        ],
        "address": "兴义路8号",
        "name": "万都中心大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.277862,
            31.26206
        ],
        "address": "博园路1333号8号楼",
        "name": "北虹桥科创中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.518373,
            31.228384
        ],
        "address": "张杨路579号",
        "name": "三鑫世界商厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.4657,
            31.222762
        ],
        "address": "巨鹿路149号",
        "name": "紫勋雍邸",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.309317,
            31.248507
        ],
        "address": "金耀路555弄",
        "name": "金沙鼎苑",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.51884,
            31.26207
        ],
        "address": "长阳路758号",
        "name": "明德公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.559498,
            31.106143
        ],
        "address": "立跃路519号",
        "name": "乐乎城市青年社区周浦店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.396957,
            31.206025
        ],
        "address": "仙霞路369号",
        "name": "KB现代广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.248256,
            31.353901
        ],
        "address": "依玛路389弄",
        "name": "新城香溢璟庭",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.429684,
            31.395957
        ],
        "address": "杨泰路2158弄50-68号",
        "name": "远洋悦庭三期",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.450242,
            31.304781
        ],
        "address": "共和新路3699号、3737号",
        "name": "共和国际商务广场",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.270027,
            31.029565
        ],
        "address": "江田东路185号",
        "name": "智汇科创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.437962,
            30.933002
        ],
        "address": "张翁庙路525号",
        "name": "晨日科技创意园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.40922,
            31.177059
        ],
        "address": "虹漕路448号",
        "name": "现代物流大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.469093,
            31.038934
        ],
        "address": "龙吴路5688弄",
        "name": "万科花园小城(万科阳光苑)",
        "count": 62,
        "style": 0
    },
    {
        "lnglat": [
            121.43735,
            31.227144
        ],
        "address": "武定路1145弄",
        "name": "沪中新苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.223365,
            31.054648
        ],
        "address": "人民北路2908弄",
        "name": "龙湖好望山",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.465886,
            31.231407
        ],
        "address": "南京西路580号",
        "name": "仲益大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.440712,
            31.254997
        ],
        "address": "中山北路1482号",
        "name": "远景大厦B座",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.399982,
            31.26046
        ],
        "address": "桃浦路165弄",
        "name": "嘉发公寓",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.903998,
            30.902703
        ],
        "address": "竹柏路500弄",
        "name": "保利蔚蓝林语",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.461782,
            31.232643
        ],
        "address": "北京西路669号",
        "name": "东展商业大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.465284,
            31.206585
        ],
        "address": "建国西路91弄5号",
        "name": "瑞金花园商务中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.467167,
            31.243829
        ],
        "address": "天目中路428号",
        "name": "凯旋门大厦（上海）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.552483,
            31.220898
        ],
        "address": "锦绣路888弄",
        "name": "御景园",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.534531,
            31.294639
        ],
        "address": "营口路578号",
        "name": "海尚杰座",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.619735,
            31.096242
        ],
        "address": "青黛路508号",
        "name": "新菲尔生物科技园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.398795,
            31.159951
        ],
        "address": "古美路1471号",
        "name": "华城广场",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.463639,
            31.292314
        ],
        "address": "汶水东路918号",
        "name": "信南都市型产业园区5号楼信南商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.324572,
            31.289859
        ],
        "address": "众仁路399号",
        "name": "上海运通星财富广场",
        "count": 31,
        "style": 0
    },
    {
        "lnglat": [
            121.505386,
            31.316293
        ],
        "address": "国霞路399弄",
        "name": "三湘未来海岸商务楼",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.323609,
            31.239601
        ],
        "address": "金沙江西路1051号",
        "name": "孩子王(上海江桥万达店)",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.273016,
            31.328508
        ],
        "address": "阿克苏路63弄6号",
        "name": "十一街区",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.447739,
            31.188637
        ],
        "address": "零陵路583号",
        "name": "海洋石油大厦",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.485311,
            31.21197
        ],
        "address": "陆家浜路1235弄",
        "name": "雅庐苑(上海)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.388904,
            31.235683
        ],
        "address": "怒江北路427号",
        "name": "曹杨经贸大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.315875,
            31.020443
        ],
        "address": "车泾路99号",
        "name": "三宝园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.688464,
            31.237614
        ],
        "address": "新雅东路125弄",
        "name": "唐镇同福苑",
        "count": 15,
        "style": 1
    },
    {
        "lnglat": [
            121.380545,
            31.164183
        ],
        "address": "龙茗路2822弄18-35号",
        "name": "九歌茗园",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.43842,
            31.188651
        ],
        "address": "南丹东路300弄",
        "name": "亚都商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.428779,
            31.20472
        ],
        "address": "番禺路300弄7号",
        "name": "鑫汉森商务园区(汉森商务园区)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.465355,
            31.246887
        ],
        "address": "天目中路538弄1号",
        "name": "北苑大厦(538弄1号)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.396871,
            31.132521
        ],
        "address": "古美西路313弄70号",
        "name": "上艺艺园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.339709,
            31.388244
        ],
        "address": "美平路696弄",
        "name": "美罗家园宝欣苑一村",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.163037,
            31.319442
        ],
        "address": "彤闻路199弄",
        "name": "古北萃庭二期",
        "count": 19,
        "style": 1
    },
    {
        "lnglat": [
            121.58174,
            31.105389
        ],
        "address": "康沈路2039号",
        "name": "荻达公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.437183,
            31.24295
        ],
        "address": "西康路1277弄",
        "name": "云都苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.282919,
            31.149949
        ],
        "address": "九泾路898号",
        "name": "898国际商务中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.535069,
            31.198824
        ],
        "address": "东绣路1155弄",
        "name": "中福公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.464432,
            31.218693
        ],
        "address": "淮海中路755号",
        "name": "新华联大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.389175,
            31.168313
        ],
        "address": "宜山路1768号",
        "name": "福维克大厦(耀光虹桥中心)",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.190888,
            31.312978
        ],
        "address": "宝安公路4997号",
        "name": "上海安亭国际医疗产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.43752,
            31.185168
        ],
        "address": "漕溪北路737号",
        "name": "汇翠花园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.454105,
            30.93109
        ],
        "address": "国顺路668弄",
        "name": "万科南桥传奇(海尚华庭)",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.574312,
            31.333362
        ],
        "address": "高城路200弄",
        "name": "天鹅泉公寓",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.43331,
            31.244188
        ],
        "address": "常德路1436号",
        "name": "德诚大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.36265,
            31.408494
        ],
        "address": "抚远路1211弄",
        "name": "正荣国领(上海)",
        "count": 59,
        "style": 0
    },
    {
        "lnglat": [
            121.337576,
            31.39211
        ],
        "address": "美丹路1033弄",
        "name": "佳境苑（上海）",
        "count": 52,
        "style": 0
    },
    {
        "lnglat": [
            121.480999,
            31.201168
        ],
        "address": "瞿溪路811弄",
        "name": "大众家园",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.233078,
            31.152358
        ],
        "address": "沪青平公路2799弄60号",
        "name": "珠江国际中心悦公馆（商务楼）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.43842,
            31.188651
        ],
        "address": "南丹东路300弄",
        "name": "亚都国际名苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.510712,
            31.178701
        ],
        "address": "东明路511弄",
        "name": "昌里雅苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.430089,
            31.240225
        ],
        "address": "东新路99弄",
        "name": "新湖明珠城南区",
        "count": 43,
        "style": 0
    },
    {
        "lnglat": [
            121.585196,
            31.262367
        ],
        "address": "长岛路625弄",
        "name": "同方锦城B区",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.401226,
            31.22738
        ],
        "address": "枣阳路530弄",
        "name": "枣阳路530弄公寓楼",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.502693,
            31.320036
        ],
        "address": "国安路789弄",
        "name": "新江湾中凯城市之光名苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.402049,
            31.256066
        ],
        "address": "兰溪路900弄",
        "name": "天汇广场一期",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.575674,
            31.234623
        ],
        "address": "白桦路266弄",
        "name": "金色碧云",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.496829,
            31.264993
        ],
        "address": "虹关路323弄",
        "name": "瑞虹新城璟庭",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.430201,
            31.260435
        ],
        "address": "志丹路97弄",
        "name": "西部大楼",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.428095,
            31.196014
        ],
        "address": "番禺路888号",
        "name": "魔方公寓番禺路店",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.473953,
            31.258921
        ],
        "address": "中华新路288号",
        "name": "绿洲雅宾利花园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.482016,
            30.950949
        ],
        "address": "金海公路6055号（临港南桥科技城）",
        "name": "漕河泾开发区南桥园区（临港南桥园区）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.359881,
            31.131236
        ],
        "address": "顾戴路2568号",
        "name": "银石科技商务园区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.372668,
            31.186249
        ],
        "address": "程家桥路175弄",
        "name": "虹桥奕境文创园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.526994,
            31.203284
        ],
        "address": "环龙路263弄",
        "name": "怡东花园会所",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436634,
            31.168426
        ],
        "address": "龙漕路38弄",
        "name": "龙漕家园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.469026,
            31.208484
        ],
        "address": "泰康路210弄",
        "name": "田子坊5号楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.524798,
            31.239899
        ],
        "address": "浦东大道720号2B",
        "name": "上海国际航运大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.193238,
            31.292906
        ],
        "address": "于塘南路280弄",
        "name": "恒大名都(上海)",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.457832,
            31.246494
        ],
        "address": "天目西路111号",
        "name": "慧空间(长三角乡村振兴联合服务平台)",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.33981,
            31.384714
        ],
        "address": "上海市宝山区天家路116弄",
        "name": "美罗家园宝欣苑七村",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.458735,
            31.297623
        ],
        "address": "江场路1228弄",
        "name": "中环协信中心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.44513,
            31.367086
        ],
        "address": "水产路2399号",
        "name": "泰富商业广场（上海）",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.458537,
            31.255099
        ],
        "address": "大统路958弄1号",
        "name": "协诚中心大厦B座",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.473196,
            31.236304
        ],
        "address": "西藏中路525号",
        "name": "雅居乐国际广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.241997,
            31.181716
        ],
        "address": "乐天路318弄",
        "name": "海棠馨苑北区",
        "count": 24,
        "style": 1
    },
    {
        "lnglat": [
            121.473475,
            31.193014
        ],
        "address": "龙华东路810号",
        "name": "黄浦绿地缤纷城",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.542055,
            31.215924
        ],
        "address": "锦延路329号",
        "name": "锦绣坊",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.495364,
            31.309231
        ],
        "address": "国权北路6弄",
        "name": "国权北路6弄",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.412626,
            31.200446
        ],
        "address": "中山西路930号",
        "name": "云都虹桥大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.46251,
            30.930277
        ],
        "address": "航南公路5699号",
        "name": "奉贤宝龙城市广场(商务楼)",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.507716,
            31.251479
        ],
        "address": "东大名路1050号",
        "name": "绿地浦创商务大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.581849,
            31.196909
        ],
        "address": "晨晖路88号",
        "name": "金蝶软件园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.607023,
            31.336902
        ],
        "address": "泰谷路239号",
        "name": "天啸大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.45676,
            31.22496
        ],
        "address": "陕西北路66号",
        "name": "科恩国际中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.4144,
            31.267718
        ],
        "address": "大华一路239弄",
        "name": "大华虎城商务中心",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.470415,
            31.200033
        ],
        "address": "打浦路258号",
        "name": "扬子江家园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.33938,
            31.073479
        ],
        "address": "明华路1077弄",
        "name": "象屿上海年华",
        "count": 68,
        "style": 0
    },
    {
        "lnglat": [
            121.451149,
            31.239448
        ],
        "address": "淮安路717号",
        "name": "717工坊",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.203472,
            31.015098
        ],
        "address": "荣乐西路399号",
        "name": "海尚名都",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.228397,
            31.377595
        ],
        "address": "柳梁路55弄",
        "name": "悠活城酒店式公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.417104,
            31.217695
        ],
        "address": "长宁路1033号",
        "name": "联通大厦（上海）",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.432503,
            31.208777
        ],
        "address": "平武路168号",
        "name": "玉嘉大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.436756,
            31.243862
        ],
        "address": "长寿路97号",
        "name": "世纪商务大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.278619,
            31.109317
        ],
        "address": "沪松公路2749弄1-2号",
        "name": "新南丽都",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.456015,
            31.09253
        ],
        "address": "龙吴路3389号",
        "name": "滨江商务生活广场",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.536244,
            31.181118
        ],
        "address": "北艾路1077弄",
        "name": "大华锦绣华城11街区",
        "count": 67,
        "style": 0
    },
    {
        "lnglat": [
            121.517031,
            31.141481
        ],
        "address": "永泰路595弄1-41号",
        "name": "金谊河畔一期",
        "count": 58,
        "style": 0
    },
    {
        "lnglat": [
            121.353782,
            31.227125
        ],
        "address": "通协路288弄",
        "name": "旭辉虹桥国际广场",
        "count": 34,
        "style": 0
    },
    {
        "lnglat": [
            121.544852,
            31.292483
        ],
        "address": "延吉东路140弄",
        "name": "长华绿苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.312973,
            31.21229
        ],
        "address": "申长路1688弄3号",
        "name": "中骏广场一期3号楼",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.36121,
            31.266057
        ],
        "address": "绥德路889弄",
        "name": "3点3万小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.534531,
            31.294639
        ],
        "address": "营口路578号",
        "name": "海尚杰座",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.742263,
            30.87319
        ],
        "address": "江山路6899弄",
        "name": "保利玲玥公馆",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.57735,
            31.238108
        ],
        "address": "碧云路333弄",
        "name": "中天碧云苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.53167,
            31.25719
        ],
        "address": "齐齐哈尔路240弄",
        "name": "丹江新苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.486245,
            31.396281
        ],
        "address": "牡丹江路1288号",
        "name": "宝莲府邸",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.449643,
            31.284196
        ],
        "address": "灵石路695号",
        "name": "合金工厂商务园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.423366,
            31.291563
        ],
        "address": "沪太支路538号",
        "name": "飞马旅5iCENTER",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.428108,
            31.232021
        ],
        "address": "长寿路1076号",
        "name": "飞雕商务大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.41963,
            31.189113
        ],
        "address": "上海市吴中路8号",
        "name": "锦辉大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.459997,
            31.238145
        ],
        "address": "顺德路92号",
        "name": "顺德苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.465849,
            31.294234
        ],
        "address": "广粤支路1号",
        "name": "临港新业坊虹口智立方",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.748435,
            31.067424
        ],
        "address": "听康路181弄",
        "name": "文竹苑南苑",
        "count": 32,
        "style": 0
    },
    {
        "lnglat": [
            121.518789,
            31.220901
        ],
        "address": "浦东南路1525号",
        "name": "振环大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.442964,
            31.234189
        ],
        "address": "常德路812弄1-3号",
        "name": "德安大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.316945,
            31.187936
        ],
        "address": "申长路519号",
        "name": "上海富力环球中心",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.541543,
            31.258914
        ],
        "address": "杨树浦路1736弄",
        "name": "丰泰世纪公寓",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.417833,
            31.171691
        ],
        "address": "桂林路399弄",
        "name": "桂林花苑",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.430703,
            31.210304
        ],
        "address": "延安西路1146号",
        "name": "新先锋商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.42269,
            31.268757
        ],
        "address": "灵石路1509弄",
        "name": "水韵华庭东苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.44793,
            31.172932
        ],
        "address": "龙水北路998弄",
        "name": "龙缘公寓",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.242213,
            31.060975
        ],
        "address": "淡家浜街88弄",
        "name": "金色茸城苑(梦想派二期)",
        "count": 41,
        "style": 0
    },
    {
        "lnglat": [
            121.481428,
            31.239501
        ],
        "address": "山西南路350号(北京东路）",
        "name": "上海物资大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.4657,
            31.222762
        ],
        "address": "巨鹿路149号",
        "name": "紫勋雍邸",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.402642,
            31.267838
        ],
        "address": "水泉路88弄",
        "name": "达安春之声一期",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.58174,
            31.105389
        ],
        "address": "康沈路2039号",
        "name": "荻达公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.394555,
            31.235099
        ],
        "address": "怒江北路219弄1号",
        "name": "开开大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.510919,
            31.184586
        ],
        "address": "东明路355弄",
        "name": "博爱家园",
        "count": 20,
        "style": 1
    },
    {
        "lnglat": [
            121.440712,
            31.254997
        ],
        "address": "中山北路1482号",
        "name": "远景大厦B座",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.533133,
            31.260851
        ],
        "address": "平凉路1104号",
        "name": "银鹿大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.386088,
            31.177319
        ],
        "address": "吴中路1100号",
        "name": "炫润国际大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.410688,
            31.296854
        ],
        "address": "真大路551号",
        "name": "华生创谷文化创意产业园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.697991,
            31.201149
        ],
        "address": "华夏东路2345弄",
        "name": "水景豪园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.596763,
            31.346603
        ],
        "address": "奥纳路188号",
        "name": "诚信国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.229779,
            31.004551
        ],
        "address": "松汇中路758弄",
        "name": "醉白景苑",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.531972,
            31.224374
        ],
        "address": "福山路455号",
        "name": "全华信息大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.526994,
            31.203284
        ],
        "address": "环龙路263弄",
        "name": "怡东花园",
        "count": 48,
        "style": 0
    },
    {
        "lnglat": [
            121.399614,
            31.132782
        ],
        "address": "沪闵路7580弄111支弄",
        "name": "南方城(上海)",
        "count": 38,
        "style": 0
    },
    {
        "lnglat": [
            121.470392,
            31.23865
        ],
        "address": "新闸路166号",
        "name": "水景苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.856388,
            30.868631
        ],
        "address": "港辉路372号",
        "name": "海滨时代大厦",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.444213,
            31.398794
        ],
        "address": "江杨北路1599弄",
        "name": "四季都会晓风来",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.329681,
            31.144534
        ],
        "address": "沪松公路1177号",
        "name": "佳预信息科技大厦",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.362237,
            31.134848
        ],
        "address": "七莘路1839号",
        "name": "财富108广场",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.211701,
            31.221337
        ],
        "address": "华隆路1788号",
        "name": "境琦科创园",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.472673,
            31.226184
        ],
        "address": "延安东路1200号",
        "name": "电信世界",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.484881,
            31.295571
        ],
        "address": "纪念路488弄",
        "name": "荣振馨苑",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.485766,
            31.211417
        ],
        "address": "西藏南路1090弄",
        "name": "银南大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.447315,
            31.242317
        ],
        "address": "安远路84号",
        "name": "新天大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.428216,
            31.2054
        ],
        "address": "番禺路290弄28号",
        "name": "长发花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.419097,
            31.236418
        ],
        "address": "曹杨路505号",
        "name": "尚诚国际苑商务楼",
        "count": 17,
        "style": 1
    },
    {
        "lnglat": [
            121.36265,
            31.408494
        ],
        "address": "抚远路1211弄",
        "name": "正荣国领(上海)",
        "count": 60,
        "style": 0
    },
    {
        "lnglat": [
            121.520116,
            31.198895
        ],
        "address": "东方路1988号",
        "name": "华南大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.510577,
            31.196693
        ],
        "address": "浦三路12弄",
        "name": "海浦小区",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.39479,
            31.19533
        ],
        "address": "荣华东道119号",
        "name": "巴黎花园（上海）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.437994,
            31.262464
        ],
        "address": "宜川路299号",
        "name": "宜乐荟",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.506109,
            31.310695
        ],
        "address": "国安路55号",
        "name": "君庭广场",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.47887,
            31.263224
        ],
        "address": "横浜路158弄",
        "name": "宝虹新苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.392551,
            31.247331
        ],
        "address": "大渡河路1550弄200支弄",
        "name": "宁馨家园",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.439556,
            31.194388
        ],
        "address": "漕溪北路333号(徐家汇地铁站5号口步行70米)",
        "name": "中金国际广场B楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.605275,
            31.243427
        ],
        "address": "川桥路350号",
        "name": "华东资产产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.020431,
            30.8989
        ],
        "address": "枫湾路680号",
        "name": "正荣璟园",
        "count": 45,
        "style": 0
    },
    {
        "lnglat": [
            121.705304,
            31.192804
        ],
        "address": "城南路278弄",
        "name": "东方城市豪苑",
        "count": 11,
        "style": 1
    },
    {
        "lnglat": [
            121.530818,
            31.288293
        ],
        "address": "永吉路9号",
        "name": "永吉广场",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.502131,
            31.273654
        ],
        "address": "大连路1619号",
        "name": "骏丰国际财富广场",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.25609,
            31.033101
        ],
        "address": "沪松路999号",
        "name": "柴火空间(亚洲)青年创客中心",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.393733,
            31.179701
        ],
        "address": "虹梅路2838弄",
        "name": "虹桥晶典苑",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.485659,
            31.250843
        ],
        "address": "海宁路358号",
        "name": "国际商厦大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.350485,
            31.135178
        ],
        "address": "中春路6818弄10号",
        "name": "海琪大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.531061,
            31.28326
        ],
        "address": "双阳路502弄1号",
        "name": "万昌大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.542407,
            31.309895
        ],
        "address": "翔殷路258弄",
        "name": "星云苑",
        "count": 39,
        "style": 0
    },
    {
        "lnglat": [
            121.543174,
            31.275688
        ],
        "address": "隆昌路590-612号",
        "name": "复旦软件园裙房",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.448948,
            31.269769
        ],
        "address": "万荣路30弄",
        "name": "宁和公寓",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.603498,
            31.141829
        ],
        "address": "环桥路1488弄",
        "name": "文怡苑二期",
        "count": 37,
        "style": 0
    },
    {
        "lnglat": [
            121.370031,
            31.178023
        ],
        "address": "虹井路288号",
        "name": "燎申虹桥国际中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.450958,
            31.194583
        ],
        "address": "斜土路2099弄",
        "name": "阳光名苑",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.427382,
            31.335732
        ],
        "address": "南蕰藻路669号",
        "name": "庙行人才孵化园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.426441,
            31.076993
        ],
        "address": "颛兴东路745号",
        "name": "拉法叶园区",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.498522,
            31.296181
        ],
        "address": "邯郸路178弄",
        "name": "东方文苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.518914,
            31.243195
        ],
        "address": "东方路8号",
        "name": "良丰大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.114744,
            31.147221
        ],
        "address": "环城东路58号",
        "name": "南上海人才大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.435043,
            31.234955
        ],
        "address": "安远路777弄",
        "name": "静安阳光名都_上海",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.503978,
            31.222209
        ],
        "address": "复兴东路2号",
        "name": "豫园股份",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.501423,
            31.034366
        ],
        "address": "盐铁塘路565弄",
        "name": "永康城星华园",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.544871,
            31.201601
        ],
        "address": "锦安东路289弄",
        "name": "东城家园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.468739,
            31.209235
        ],
        "address": "建国中路115弄",
        "name": "思南公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.488875,
            31.260928
        ],
        "address": "溧阳路1088号",
        "name": "龙邸大厦",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.52979,
            31.129512
        ],
        "address": "秀沿西路258弄",
        "name": "中海御景熙岸",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.451881,
            31.368148
        ],
        "address": "松兰路198弄",
        "name": "春江美庐",
        "count": 22,
        "style": 1
    },
    {
        "lnglat": [
            121.43634,
            31.295137
        ],
        "address": "江场三路258号",
        "name": "上海新市北工业园区一期",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.541883,
            31.2701
        ],
        "address": "河间路688弄",
        "name": "水月坊",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.369142,
            31.092329
        ],
        "address": "沁春路717号",
        "name": "青春商务园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.491221,
            31.25516
        ],
        "address": "辽宁路244号",
        "name": "1930鑫鑫创意园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.487859,
            31.237713
        ],
        "address": "四川中路321号",
        "name": "中央大厦",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.402312,
            31.336141
        ],
        "address": "沪太路4290号",
        "name": "1876新视觉产业园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.492806,
            31.215713
        ],
        "address": "河南南路747号",
        "name": "申升公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.513341,
            31.291362
        ],
        "address": "国顺路280号",
        "name": "华丰大楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.266238,
            31.04769
        ],
        "address": "徐塘路519号",
        "name": "阡陌创意产业园",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.519943,
            31.292115
        ],
        "address": "黄兴路1818号",
        "name": "海上财智商务中心",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.442918,
            31.305037
        ],
        "address": "场中路2600弄6-8号",
        "name": "海运小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.454002,
            31.217299
        ],
        "address": "新乐路158号",
        "name": "东湖公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.318905,
            30.745233
        ],
        "address": "龙轩路1998弄15号",
        "name": "正荣御首府",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.508235,
            31.271472
        ],
        "address": "控江路2063号",
        "name": "五环大厦西座",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.443831,
            31.22221
        ],
        "address": "华山路2号",
        "name": "静安高和大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.532615,
            31.20163
        ],
        "address": "东建路228弄",
        "name": "东方龙苑",
        "count": 27,
        "style": 1
    },
    {
        "lnglat": [
            121.337875,
            31.26909
        ],
        "address": "嘉涌路88号",
        "name": "丽江佳苑（上海）",
        "count": 29,
        "style": 1
    },
    {
        "lnglat": [
            121.436866,
            31.235555
        ],
        "address": "延平路518弄",
        "name": "静安锦都公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.52983,
            31.257156
        ],
        "address": "龙江路289弄",
        "name": "浦江风景苑",
        "count": 57,
        "style": 0
    },
    {
        "lnglat": [
            121.430956,
            31.211582
        ],
        "address": "延安西路1088号",
        "name": "长峰中心",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.458812,
            31.212414
        ],
        "address": "复兴中路1199号",
        "name": "明园商务中心",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.358894,
            31.14097
        ],
        "address": "中谊路699号",
        "name": "华友大厦（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.2597,
            31.350394
        ],
        "address": "阿克苏路1358号",
        "name": "惟乐教育文化园（赢嘉商务楼）",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.49648,
            31.223162
        ],
        "address": "学院路32弄",
        "name": "圣莲大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.46889,
            31.200538
        ],
        "address": "瑞金南路185弄",
        "name": "瑞南新苑",
        "count": 16,
        "style": 1
    },
    {
        "lnglat": [
            121.437816,
            31.192755
        ],
        "address": "漕溪北路18号",
        "name": "实业大厦",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.561527,
            31.151713
        ],
        "address": "康杉路359弄",
        "name": "颐盛云锦苑",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.497938,
            31.211126
        ],
        "address": "陆家浜路456号",
        "name": "赛元大酒店",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.1601,
            31.158461
        ],
        "address": "崧润路800弄",
        "name": "逸泰雅苑二期",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.502951,
            31.22044
        ],
        "address": "中山南路398弄",
        "name": "海琪园",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.266592,
            31.216453
        ],
        "address": "纪潭路75弄1-19号",
        "name": "虹桥茗雅苑",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.565105,
            31.148704
        ],
        "address": "康桥路1029弄",
        "name": "建华铂中环",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.613026,
            31.30642
        ],
        "address": "富特南路301号",
        "name": "松港U库",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.416189,
            31.243069
        ],
        "address": "武宁路423号",
        "name": "五零智慧产业科技园",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.310176,
            31.103905
        ],
        "address": "盛富路490号",
        "name": "佳钢科创园_盛富路",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.10968,
            31.145174
        ],
        "address": "五厍浜路168弄",
        "name": "汇丰豪轩",
        "count": 28,
        "style": 1
    },
    {
        "lnglat": [
            121.463465,
            31.232809
        ],
        "address": "北京西路605弄57号",
        "name": "嘉发大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.500452,
            31.234036
        ],
        "address": "花园石桥路33号",
        "name": "花旗集团大厦",
        "count": 40,
        "style": 0
    },
    {
        "lnglat": [
            121.359793,
            31.408243
        ],
        "address": "抚远路1288弄",
        "name": "美兰湖中华园",
        "count": 76,
        "style": 0
    },
    {
        "lnglat": [
            121.431099,
            31.237411
        ],
        "address": "长寿路748弄2号",
        "name": "莘远大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.411235,
            31.219881
        ],
        "address": "中山西路179号，189弄",
        "name": "虹桥世家花园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.308828,
            31.14494
        ],
        "address": "九杜路505弄",
        "name": "摩卡小城",
        "count": 53,
        "style": 0
    },
    {
        "lnglat": [
            121.099561,
            31.169093
        ],
        "address": "竹盈路339弄",
        "name": "卓越E时代创业中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.268969,
            31.002257
        ],
        "address": "北松公路7099号",
        "name": "屺盛孵化园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.433193,
            31.306381
        ],
        "address": "康宁路1021弄",
        "name": "幸福创智园",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.605088,
            31.314228
        ],
        "address": "加枫路20号",
        "name": "盛大天地盛贸中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.476624,
            31.221347
        ],
        "address": "顺昌路10号",
        "name": "经纬公寓（上海）",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.441636,
            30.925383
        ],
        "address": "航南公路6666号",
        "name": "上海魏晋文化创意产业园",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.438296,
            31.239383
        ],
        "address": "常德路1211号",
        "name": "宝华大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.260556,
            31.345663
        ],
        "address": "阿克苏路1099号",
        "name": "宝龙城市广场_商务楼",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.482354,
            31.214388
        ],
        "address": "建国新路77弄",
        "name": "老西门公馆",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.364366,
            31.222599
        ],
        "address": "西陶浜路28弄 ",
        "name": "北平家园",
        "count": 30,
        "style": 1
    },
    {
        "lnglat": [
            121.51142,
            31.024924
        ],
        "address": "永跃路215弄",
        "name": "新城千禧公园",
        "count": 23,
        "style": 1
    },
    {
        "lnglat": [
            121.569474,
            31.249406
        ],
        "address": "张杨路3083弄",
        "name": "广洋苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.482378,
            31.226281
        ],
        "address": "淮海东路45号",
        "name": "东淮海国际大厦(东淮海壹号)",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.356699,
            31.21787
        ],
        "address": "天山西路567号",
        "name": "神州智慧天地",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.388421,
            31.168033
        ],
        "address": "宜山路1888号",
        "name": "瑞特国际大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.397728,
            31.268507
        ],
        "address": "新村路2080弄",
        "name": "万里晶品苑",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.414699,
            31.109886
        ],
        "address": "春申路2525号",
        "name": "欧银集心",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.459554,
            31.200414
        ],
        "address": "医学院路15号",
        "name": "嘉馨公寓",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.481499,
            31.230938
        ],
        "address": "延安东路550号",
        "name": "海洋大厦",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.514167,
            31.070599
        ],
        "address": "竹园路518号",
        "name": "德宏商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.445764,
            31.037486
        ],
        "address": "莲花南路3999弄",
        "name": "万乐城小区",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.407168,
            31.158499
        ],
        "address": "桂平路277弄",
        "name": "桂竹香小区",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.451808,
            31.182372
        ],
        "address": "宛平南路968号",
        "name": "腾王阁",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.85373,
            30.98018
        ],
        "address": "万松路88号",
        "name": "金盾产业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.411674,
            31.271535
        ],
        "address": "真华路928号",
        "name": "大华虎城第三空间",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.498069,
            31.272529
        ],
        "address": "虹口区四平路773号",
        "name": "金大地商务楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.128139,
            31.145344
        ],
        "address": "青湖路998-1002号",
        "name": "万福财富中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.336059,
            31.154357
        ],
        "address": "中春路8889弄",
        "name": "万科城花新园",
        "count": 51,
        "style": 0
    },
    {
        "lnglat": [
            121.493735,
            31.069614
        ],
        "address": "浦瑞路53弄、浦瑞路56弄",
        "name": "景舒苑十村",
        "count": 12,
        "style": 1
    },
    {
        "lnglat": [
            121.514093,
            31.181956
        ],
        "address": "南码头路1288弄",
        "name": "逸翠公馆",
        "count": 9,
        "style": 2
    },
    {
        "lnglat": [
            121.417556,
            31.195068
        ],
        "address": "中山西路1221号",
        "name": "锦绣花园（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.382938,
            31.250027
        ],
        "address": "金汤路155弄",
        "name": "时代星园",
        "count": 26,
        "style": 1
    },
    {
        "lnglat": [
            121.794851,
            30.912473
        ],
        "address": "秋兴路875号",
        "name": "中汽联（临港）全球汽车零部件创新中心",
        "count": 21,
        "style": 1
    },
    {
        "lnglat": [
            121.601813,
            31.252818
        ],
        "address": "浙桥路289弄2号",
        "name": "碧云公馆",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.452991,
            31.204305
        ],
        "address": "岳阳路217号",
        "name": "岳阳公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.358343,
            31.223123
        ],
        "address": "北翟路1019号",
        "name": "海天集团大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.424161,
            31.20737
        ],
        "address": "定西路720弄1号",
        "name": "华云大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.526855,
            31.073214
        ],
        "address": "三鲁公路2868弄151号",
        "name": "翱翔空间创新园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.486601,
            31.381908
        ],
        "address": "水产路1269号",
        "name": "吴淞口创业园",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.488506,
            31.222716
        ],
        "address": "河南南路398弄",
        "name": "太阳都市花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.532678,
            31.271058
        ],
        "address": "杨浦区黄兴路122号",
        "name": "光大信成大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.478474,
            31.269509
        ],
        "address": "花园路16号",
        "name": "嘉和国际大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.447084,
            31.190861
        ],
        "address": "宛平南路388弄1-6号",
        "name": "海螺花园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.39318,
            31.100234
        ],
        "address": "都市路4580弄",
        "name": "春申复地城二期",
        "count": 46,
        "style": 0
    },
    {
        "lnglat": [
            121.502988,
            31.180265
        ],
        "address": "齐河路257弄21号",
        "name": "上南花苑",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.396358,
            31.196
        ],
        "address": "荣华东道98号",
        "name": "维多利亚C座",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.478175,
            31.346262
        ],
        "address": "长江西路101号",
        "name": "上海节能环保园",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.429688,
            31.212598
        ],
        "address": "延安西路1033号",
        "name": "大众金融大厦",
        "count": 6,
        "style": 2
    },
    {
        "lnglat": [
            121.469105,
            31.234013
        ],
        "address": "凤阳路358弄",
        "name": "金瓯万国大厦",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.44014,
            31.188335
        ],
        "address": "天钥桥路380弄20-28号",
        "name": "天钥花苑",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.416247,
            31.136961
        ],
        "address": "梅陇路565弄",
        "name": "森陇家园",
        "count": 7,
        "style": 2
    },
    {
        "lnglat": [
            121.490346,
            31.215222
        ],
        "address": "尚文路198号",
        "name": "中华大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.478755,
            31.2567
        ],
        "address": "宝通路239弄",
        "name": "包运大厦",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.579584,
            31.335487
        ],
        "address": "春晖路628弄",
        "name": "风信景苑",
        "count": 14,
        "style": 1
    },
    {
        "lnglat": [
            121.497202,
            31.276522
        ],
        "address": "大连西路40弄",
        "name": "大连西路40弄小区",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.349402,
            31.31851
        ],
        "address": "市台路555弄",
        "name": "金地宝山艺境城",
        "count": 71,
        "style": 0
    },
    {
        "lnglat": [
            121.633433,
            31.160098
        ],
        "address": "康桥东路1159弄105号",
        "name": "松港产业园_康桥东路",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.314433,
            31.11853
        ],
        "address": "九新公路800号",
        "name": "临港电姆产业园",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.436321,
            31.217144
        ],
        "address": "延安西路500号",
        "name": "嘉宁国际大厦",
        "count": 25,
        "style": 1
    },
    {
        "lnglat": [
            121.442437,
            31.330967
        ],
        "address": "长江西路2036弄1、2号",
        "name": "汇秀公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.398014,
            31.061689
        ],
        "address": "联农路179号",
        "name": "福克斯连锁商务大厦（联农）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.50279,
            31.353445
        ],
        "address": "逸仙路3901号",
        "name": "东海航运大楼",
        "count": 13,
        "style": 1
    },
    {
        "lnglat": [
            121.438475,
            31.355536
        ],
        "address": "泰和路2038号",
        "name": "北外环信息产业园(北上海创意港）",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.61649,
            31.204608
        ],
        "address": "张江路665号",
        "name": "德宏大厦",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.606631,
            31.307547
        ],
        "address": "德堡路38号",
        "name": "沐远国际中心",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.455502,
            31.383588
        ],
        "address": "宝杨路2121号",
        "name": "创意公寓_宝杨路",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.55048,
            31.30849
        ],
        "address": "翔殷路128号",
        "name": "上海理工科技园二期",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.467957,
            31.24527
        ],
        "address": "天目中路363号",
        "name": "万佳商务楼",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.258109,
            31.4023
        ],
        "address": "永靖路501弄",
        "name": "嘉华居",
        "count": 18,
        "style": 1
    },
    {
        "lnglat": [
            121.491549,
            31.272133
        ],
        "address": "曲阳路299号",
        "name": "宝莲大厦",
        "count": 5,
        "style": 2
    },
    {
        "lnglat": [
            121.477035,
            31.203232
        ],
        "address": "斜土路500号",
        "name": "人才大厦（斜土路）",
        "count": 3,
        "style": 2
    },
    {
        "lnglat": [
            121.442111,
            31.175849
        ],
        "address": "龙华西路525号",
        "name": "明安馨苑",
        "count": 10,
        "style": 2
    },
    {
        "lnglat": [
            121.390536,
            31.023714
        ],
        "address": "华宁路1399弄",
        "name": "华银坊",
        "count": 8,
        "style": 2
    },
    {
        "lnglat": [
            121.359863,
            31.151644
        ],
        "address": "宝南路58号",
        "name": "宝南商务中心",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.42073,
            31.12538
        ],
        "address": "罗锦路55号",
        "name": "锦宏产业园",
        "count": 4,
        "style": 2
    },
    {
        "lnglat": [
            121.582951,
            31.349864
        ],
        "address": "学后街28号",
        "name": "银桥商务大楼",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.507619,
            31.270861
        ],
        "address": "控江路2075号",
        "name": "贵人大厦（上海）",
        "count": 1,
        "style": 2
    },
    {
        "lnglat": [
            121.431394,
            31.204541
        ],
        "address": "幸福路88号",
        "name": "浙海公寓",
        "count": 2,
        "style": 2
    },
    {
        "lnglat": [
            121.419253,
            31.217612
        ],
        "address": "长宁路969号",
        "name": "兆丰花园",
        "count": 8,
        "style": 2
    }
]