var addresses = [
    {
        "address": " 阿克苏路1099号",
        "name": "宝龙城市广场_公寓楼",
        "lnglat": "121.260556,31.345663",
        "count": 44
    },
    {
        "address": " 草高支路938弄",
        "name": "名扬佳园(上海)",
        "lnglat": "121.566722,31.351376",
        "count": 108
    },
    {
        "address": " 海防路429弄8号",
        "name": "领航静安艺庭",
        "lnglat": "121.445173,31.237719",
        "count": 7
    },
    {
        "address": " 汇源路218号",
        "name": "中茂世纪财富广场",
        "lnglat": "121.205040,31.416662",
        "count": 26
    },
    {
        "address": " 闵城路199弄",
        "name": "好世鹿鸣苑",
        "lnglat": "121.385118,31.106187",
        "count": 176
    },
    {
        "address": " 颛兴东路745号",
        "name": "拉法叶园区B楼墨空间",
        "lnglat": "121.426441,31.076993",
        "count": 8
    },
    {
        "address": "阿克苏路1099号",
        "name": "宝龙城市广场_商务楼",
        "lnglat": "121.260556,31.345663",
        "count": 31
    },
    {
        "address": "阿克苏路1358号",
        "name": "惟乐教育文化园（赢嘉商务楼）",
        "lnglat": "121.259700,31.350394",
        "count": 6
    },
    {
        "address": "阿克苏路63弄6号",
        "name": "十一街区",
        "lnglat": "121.273016,31.328508",
        "count": 55
    },
    {
        "address": "爱特路855号",
        "name": "歆翱国际商务园A栋",
        "lnglat": "121.303161,31.231535",
        "count": 2
    },
    {
        "address": "爱特路866号",
        "name": "歆翱国际商务园",
        "lnglat": "121.302596,31.232595",
        "count": 1
    },
    {
        "address": "安波路533弄1-3号，安波路569号",
        "name": "海上硕和国际办公楼",
        "lnglat": "121.528515,31.301608",
        "count": 4
    },
    {
        "address": "安波路567号",
        "name": "海上硕和国际城",
        "lnglat": "121.528792,31.300593",
        "count": 154
    },
    {
        "address": "安驰路509弄",
        "name": "尚都国际大厦",
        "lnglat": "121.174306,31.284086",
        "count": 30
    },
    {
        "address": "安国路28弄",
        "name": "荣胜公寓",
        "lnglat": "112.859035,34.164549",
        "count": 2
    },
    {
        "address": "安化路492号",
        "name": "长宁德必易园",
        "lnglat": "121.420300,31.215341",
        "count": 56
    },
    {
        "address": "安顺路158弄",
        "name": "金电大厦",
        "lnglat": "104.206203,31.335102",
        "count": 14
    },
    {
        "address": "安顺路158弄3-15号",
        "name": "新安公寓",
        "lnglat": "104.206203,31.335102",
        "count": 13
    },
    {
        "address": "安顺路251号",
        "name": "虹桥银都大楼",
        "lnglat": "121.414617,31.200083",
        "count": 5
    },
    {
        "address": "安顺路255弄",
        "name": "虹桥府邸",
        "lnglat": "104.204953,31.332408",
        "count": 10
    },
    {
        "address": "安顺路358弄",
        "name": "联鑫虹桥苑",
        "lnglat": "121.409708,31.200978",
        "count": 28
    },
    {
        "address": "安顺路89弄8号",
        "name": "浦江大厦",
        "lnglat": "108.444033,30.764307",
        "count": 41
    },
    {
        "address": "安亭镇和静路986号",
        "name": "世康大厦",
        "lnglat": "121.164400,31.301473",
        "count": 7
    },
    {
        "address": "安亭镇墨玉路151号",
        "name": "墨玉商务楼",
        "lnglat": "121.163724,31.296361",
        "count": 3
    },
    {
        "address": "安谐路99弄",
        "name": "新城尚上城",
        "lnglat": "121.180909,31.285752",
        "count": 132
    },
    {
        "address": "安远路16弄",
        "name": "宗鑫公寓",
        "lnglat": "121.449111,31.243356",
        "count": 27
    },
    {
        "address": "安远路501弄2-5号梅山大楼",
        "name": "梅山大楼",
        "lnglat": "121.440959,31.237770",
        "count": 4
    },
    {
        "address": "安远路518号",
        "name": "宝华名邸（晶典）",
        "lnglat": "121.437412,31.236959",
        "count": 3
    },
    {
        "address": "安远路531号",
        "name": "阳光商务广场",
        "lnglat": "121.439410,31.237521",
        "count": 3
    },
    {
        "address": "安远路597弄",
        "name": "静安四季公寓",
        "lnglat": "121.437323,31.236165",
        "count": 6
    },
    {
        "address": "安远路710号",
        "name": "大昌商务楼",
        "lnglat": "121.433973,31.235328",
        "count": 5
    },
    {
        "address": "安远路777弄",
        "name": "静安阳光名都_上海",
        "lnglat": "121.435043,31.234955",
        "count": 78
    },
    {
        "address": "安远路84号",
        "name": "新天大厦",
        "lnglat": "121.447315,31.242317",
        "count": 9
    },
    {
        "address": "安悦路100弄",
        "name": "新城尚上城二期",
        "lnglat": "121.179268,31.286295",
        "count": 60
    },
    {
        "address": "安智路155号",
        "name": "万创坊",
        "lnglat": "121.172090,31.268718",
        "count": 26
    },
    {
        "address": "鞍山路160弄",
        "name": "申安公寓",
        "lnglat": "120.362573,36.093711",
        "count": 20
    },
    {
        "address": "鞍山路5号",
        "name": "杨浦商城（上海）",
        "lnglat": "109.661612,23.602955",
        "count": 4
    },
    {
        "address": "奥纳路188号",
        "name": "诚信国际大厦",
        "lnglat": "121.596763,31.346603",
        "count": 8
    },
    {
        "address": "奥纳路55号",
        "name": "金港大厦（上海）",
        "lnglat": "121.591441,31.344131",
        "count": 14
    },
    {
        "address": "奥纳路79号2幢",
        "name": "交能国际大厦",
        "lnglat": "121.592520,31.344357",
        "count": 8
    },
    {
        "address": "澳门路330弄",
        "name": "浅水湾恺悦名城",
        "lnglat": "121.441318,31.248462",
        "count": 22
    },
    {
        "address": "澳门路356号",
        "name": "三维大厦（上海）",
        "lnglat": "119.794320,33.771868",
        "count": 5
    },
    {
        "address": "澳门路477号",
        "name": "中华1912创意园",
        "lnglat": "120.023150,36.255388",
        "count": 23
    },
    {
        "address": "澳门路519弄",
        "name": "华生大厦",
        "lnglat": "119.797865,33.770890",
        "count": 4
    },
    {
        "address": "澳门路58弄",
        "name": "圣骊澳门苑",
        "lnglat": "114.297190,30.600820",
        "count": 109
    },
    {
        "address": "澳门路715号",
        "name": "715创意园",
        "lnglat": "106.938368,27.702801",
        "count": 3
    },
    {
        "address": "澳门路756弄",
        "name": "澳门公寓",
        "lnglat": "119.804164,33.766565",
        "count": 2
    },
    {
        "address": "澳门路872弄3号",
        "name": "绿洲尧舜公寓",
        "lnglat": "121.434643,31.240682",
        "count": 9
    },
    {
        "address": "巴圣路160号",
        "name": "自贸壹号",
        "lnglat": "121.613460,31.310258",
        "count": 200
    },
    {
        "address": "白渡路188弄",
        "name": "申江新苑",
        "lnglat": "121.501739,31.219942",
        "count": 16
    },
    {
        "address": "白渡路258弄",
        "name": "福鑫大楼",
        "lnglat": "121.501190,31.219729",
        "count": 4
    },
    {
        "address": "白桦路266弄",
        "name": "金色碧云",
        "lnglat": "121.575674,31.234623",
        "count": 74
    },
    {
        "address": "白荆路389号",
        "name": "万科金领澜湾鹭语墅",
        "lnglat": "121.923707,30.920526",
        "count": 147
    },
    {
        "address": "白兰路169弄",
        "name": "沙田新苑",
        "lnglat": "121.413533,31.237559",
        "count": 9
    },
    {
        "address": "白兰路5弄15支弄（白玉路）",
        "name": "上海长发白玉公寓",
        "lnglat": "121.415353,31.233517",
        "count": 48
    },
    {
        "address": "白丽路185弄",
        "name": "联星丽景苑",
        "lnglat": "121.347285,31.281085",
        "count": 72
    },
    {
        "address": "白沙园路333弄",
        "name": "四季都会（荣万宝邸）",
        "lnglat": "121.429076,31.391743",
        "count": 190
    },
    {
        "address": "白杨路199弄",
        "name": "大唐盛世花园一期",
        "lnglat": "121.556013,31.208099",
        "count": 189
    },
    {
        "address": "白杨路360弄",
        "name": "环龙新纪园",
        "lnglat": "121.555057,31.205717",
        "count": 32
    },
    {
        "address": "白银路399号",
        "name": "晶鼎大厦",
        "lnglat": "121.259407,31.351741",
        "count": 16
    },
    {
        "address": "白玉路669弄",
        "name": "创世纪滨河花园",
        "lnglat": "121.421080,31.228113",
        "count": 125
    },
    {
        "address": "白樟路99弄",
        "name": "中祥龙柏苑",
        "lnglat": "121.367132,31.174162",
        "count": 27
    },
    {
        "address": "百安公路2699弄",
        "name": "路劲海尚苑三期",
        "lnglat": "121.176001,31.347655",
        "count": 155
    },
    {
        "address": "百安公路2999弄",
        "name": "兰郡名苑",
        "lnglat": "121.173180,31.354420",
        "count": 66
    },
    {
        "address": "百色路451弄",
        "name": "园南二村",
        "lnglat": "121.443009,31.141954",
        "count": 25
    },
    {
        "address": "百团路198弄",
        "name": "海尚盛苑",
        "lnglat": "121.516549,30.955826",
        "count": 34
    },
    {
        "address": "百业路167弄31号",
        "name": "泊寓翡翠公园店",
        "lnglat": "121.609318,31.179568",
        "count": 18
    },
    {
        "address": "板泉路1555弄",
        "name": "尚东国际名园一期",
        "lnglat": "121.510362,31.163538",
        "count": 168
    },
    {
        "address": "半淞园路20号",
        "name": "世发大厦",
        "lnglat": "121.501038,31.205956",
        "count": 6
    },
    {
        "address": "半淞园路388号",
        "name": "越界世博园",
        "lnglat": "121.496522,31.201355",
        "count": 7
    },
    {
        "address": "半淞园路585弄",
        "name": "欣安基",
        "lnglat": "121.494143,31.200199",
        "count": 18
    },
    {
        "address": "伴亭路855弄",
        "name": "象屿虹桥悦府",
        "lnglat": "121.317873,31.131095",
        "count": 19
    },
    {
        "address": "伴亭路888弄",
        "name": "象屿名城",
        "lnglat": "121.316343,31.131316",
        "count": 28
    },
    {
        "address": "包头路1150弄",
        "name": "城市名园",
        "lnglat": "121.538313,31.330716",
        "count": 52
    },
    {
        "address": "包头路国和路交叉口",
        "name": "市光四村",
        "lnglat": "121.539167,31.318312",
        "count": 24
    },
    {
        "address": "包头南路628弄",
        "name": "杨浦欣园二期",
        "lnglat": "121.540140,31.301278",
        "count": 8
    },
    {
        "address": "包头南路629弄",
        "name": "杨浦欣园",
        "lnglat": "121.539110,31.299792",
        "count": 64
    },
    {
        "address": "宝安公路2999弄",
        "name": "东方慧谷",
        "lnglat": "121.292253,31.330736",
        "count": 28
    },
    {
        "address": "宝安公路3136号",
        "name": "清水湾上海",
        "lnglat": "121.287278,31.333018",
        "count": 56
    },
    {
        "address": "宝安公路3386号",
        "name": "孩子王(上海大融城店)",
        "lnglat": "121.279840,31.330568",
        "count": 12
    },
    {
        "address": "宝安公路4997号",
        "name": "上海安亭国际医疗产业园",
        "lnglat": "121.190888,31.312978",
        "count": 25
    },
    {
        "address": "宝安公路7弄1号",
        "name": "上坤极客公寓宝安公路店",
        "lnglat": "121.429491,31.372677",
        "count": 24
    },
    {
        "address": "宝昌路399弄",
        "name": "绿景晓园",
        "lnglat": "121.474032,31.259488",
        "count": 10
    },
    {
        "address": "宝昌路738弄",
        "name": "广盛公寓",
        "lnglat": "121.470536,31.263986",
        "count": 24
    },
    {
        "address": "宝城路155弄",
        "name": "名都新城一二期",
        "lnglat": "117.333091,23.952898",
        "count": 122
    },
    {
        "address": "宝城路158弄",
        "name": "莘城公寓_上海",
        "lnglat": "105.592580,29.406569",
        "count": 160
    },
    {
        "address": "宝城路500弄",
        "name": "利景花苑",
        "lnglat": "121.391518,31.110909",
        "count": 135
    },
    {
        "address": "宝东路888弄",
        "name": "中艺花园",
        "lnglat": "121.498845,31.399854",
        "count": 116
    },
    {
        "address": "宝菊路133弄",
        "name": "保利叶语",
        "lnglat": "121.365300,31.342862",
        "count": 345
    },
    {
        "address": "宝联路88弄",
        "name": "枫荷兰庭",
        "lnglat": "121.353642,31.146324",
        "count": 6
    },
    {
        "address": "宝林路458号",
        "name": "云派PARK",
        "lnglat": "121.483434,31.400133",
        "count": 5
    },
    {
        "address": "宝绿路99号",
        "name": "环绿国际",
        "lnglat": "121.384236,31.356498",
        "count": 54
    },
    {
        "address": "宝南路55弄",
        "name": "九星家园",
        "lnglat": "114.254522,22.703279",
        "count": 64
    },
    {
        "address": "宝南路58号",
        "name": "宝南商务中心",
        "lnglat": "114.255995,22.703939",
        "count": 3
    },
    {
        "address": "宝山路268弄",
        "name": "复地新都国际",
        "lnglat": "87.588657,43.799683",
        "count": 47
    },
    {
        "address": "宝山路625号",
        "name": "上海金宝大厦",
        "lnglat": "87.586080,43.792368",
        "count": 29
    },
    {
        "address": "宝山路748号",
        "name": "鑫成大厦",
        "lnglat": "121.479307,31.261419",
        "count": 4
    },
    {
        "address": "宝山路778号",
        "name": "海伦国际",
        "lnglat": "121.479493,31.262092",
        "count": 36
    },
    {
        "address": "宝山路888弄",
        "name": "虹祺花苑",
        "lnglat": "87.585052,43.786328",
        "count": 9
    },
    {
        "address": "宝胜路18号",
        "name": "宝胜国际财富中心",
        "lnglat": "121.267880,31.022824",
        "count": 44
    },
    {
        "address": "宝通路157弄",
        "name": "和馨苑",
        "lnglat": "121.479059,31.256168",
        "count": 38
    },
    {
        "address": "宝通路239弄",
        "name": "包运大厦",
        "lnglat": "121.478755,31.256700",
        "count": 4
    },
    {
        "address": "宝通路425弄",
        "name": "宝通公寓",
        "lnglat": "121.475795,31.259360",
        "count": 20
    },
    {
        "address": "宝翔路158弄",
        "name": "旭辉U天地",
        "lnglat": "121.326121,31.302651",
        "count": 52
    },
    {
        "address": "宝翔路888弄",
        "name": "上海绿色家园(朗诗绿色街区)",
        "lnglat": "121.318635,31.312832",
        "count": 140
    },
    {
        "address": "宝杨路2000号",
        "name": "宝杨慧照商务楼",
        "lnglat": "121.471200,31.391113",
        "count": 4
    },
    {
        "address": "宝杨路2033号",
        "name": "华泰大厦(上海)",
        "lnglat": "121.463627,31.388115",
        "count": 20
    },
    {
        "address": "宝杨路2121号",
        "name": "创意公寓_宝杨路",
        "lnglat": "121.455502,31.383588",
        "count": 8
    },
    {
        "address": "宝杨路3003号",
        "name": "闿和阳光广场",
        "lnglat": "121.445343,31.378005",
        "count": 25
    },
    {
        "address": "宝杨路3288弄",
        "name": "宝启花园",
        "lnglat": "121.436307,31.374545",
        "count": 4
    },
    {
        "address": "宝源路301弄",
        "name": "申桂公寓",
        "lnglat": "121.479982,31.258249",
        "count": 12
    },
    {
        "address": "保德路831弄",
        "name": "保平小区",
        "lnglat": "121.451568,31.314729",
        "count": 45
    },
    {
        "address": "保定路20弄10-40号",
        "name": "云舫小区",
        "lnglat": "121.511033,31.257076",
        "count": 36
    },
    {
        "address": "保屯路129弄",
        "name": "北方花苑",
        "lnglat": "121.490516,31.205831",
        "count": 7
    },
    {
        "address": "报春路128弄",
        "name": "东苑绿世界花园",
        "lnglat": "121.393523,31.126208",
        "count": 20
    },
    {
        "address": "报春路399弄",
        "name": "新梅公寓",
        "lnglat": "121.388469,31.123057",
        "count": 4
    },
    {
        "address": "报春路558弄",
        "name": "绿茵苑",
        "lnglat": "121.384125,31.123830",
        "count": 40
    },
    {
        "address": "北艾路1077弄",
        "name": "大华锦绣华城11街区",
        "lnglat": "121.536244,31.181118",
        "count": 256
    },
    {
        "address": "北艾路1200弄",
        "name": "大华锦绣华城9街区",
        "lnglat": "121.532807,31.183609",
        "count": 76
    },
    {
        "address": "北艾路1500号",
        "name": "大华锦绣华城2街区",
        "lnglat": "121.526937,31.181315",
        "count": 10
    },
    {
        "address": "北艾路1660弄1-26号",
        "name": "大华锦绣华城2_2街坊（1_华绣路）",
        "lnglat": "121.523477,31.181230",
        "count": 40
    },
    {
        "address": "北艾路1765弄",
        "name": "大华锦绣华城4街区",
        "lnglat": "121.523338,31.177993",
        "count": 145
    },
    {
        "address": "北艾路1766号",
        "name": "大华锦绣国际写字楼",
        "lnglat": "121.522642,31.179966",
        "count": 31
    },
    {
        "address": "北宝兴路158号",
        "name": "嘉利明珠商务楼",
        "lnglat": "121.465633,31.272753",
        "count": 1
    },
    {
        "address": "北陈路382号",
        "name": "希望屺盛孵化基地",
        "lnglat": "121.324293,31.332525",
        "count": 4
    },
    {
        "address": "北翠路1000弄",
        "name": "地中海小区",
        "lnglat": "121.219492,31.037766",
        "count": 24
    },
    {
        "address": "北翟路1019号",
        "name": "海天集团大厦",
        "lnglat": "121.358343,31.223123",
        "count": 8
    },
    {
        "address": "北翟路1444弄155号",
        "name": "南虹科创中心",
        "lnglat": "121.341717,31.229239",
        "count": 4
    },
    {
        "address": "北翟路980弄",
        "name": "通协小区",
        "lnglat": "121.358503,31.224823",
        "count": 19
    },
    {
        "address": "北海路8号",
        "name": "福申大厦",
        "lnglat": "103.908899,30.614848",
        "count": 11
    },
    {
        "address": "北华路168弄",
        "name": "万博家园",
        "lnglat": "121.329908,31.228199",
        "count": 140
    },
    {
        "address": "北华路18号",
        "name": "虹桥乐贤居二期",
        "lnglat": "115.040844,37.676235",
        "count": 43
    },
    {
        "address": "北华路22弄",
        "name": "虹桥乐贤居",
        "lnglat": "113.073617,22.894213",
        "count": 78
    },
    {
        "address": "北江榉路588弄",
        "name": "万科早城",
        "lnglat": "121.486898,31.104716",
        "count": 40
    },
    {
        "address": "北江燕路228弄(近江月路)",
        "name": "世博家园五街坊",
        "lnglat": "121.509518,31.083301",
        "count": 24
    },
    {
        "address": "北江燕路338弄浦江世博家园6街坊(近浦池路)",
        "name": "世博家园六街坊",
        "lnglat": "121.494923,31.097724",
        "count": 24
    },
    {
        "address": "北京东路431号",
        "name": "松柏公寓(上海)",
        "lnglat": "121.482329,31.239307",
        "count": 20
    },
    {
        "address": "北京东路668号",
        "name": "科技京城",
        "lnglat": "121.485281,31.232814",
        "count": 106
    },
    {
        "address": "北京西路1068号",
        "name": "银发大厦",
        "lnglat": "121.454339,31.230282",
        "count": 3
    },
    {
        "address": "北京西路1399号",
        "name": "信达大厦（上海）",
        "lnglat": "121.448589,31.227404",
        "count": 6
    },
    {
        "address": "北京西路1465号",
        "name": "国立大厦",
        "lnglat": "121.447959,31.227171",
        "count": 2
    },
    {
        "address": "北京西路1701号",
        "name": "静安中华大厦",
        "lnglat": "121.444310,31.225474",
        "count": 6
    },
    {
        "address": "北京西路1号",
        "name": "新金桥广场",
        "lnglat": "79.929037,37.111584",
        "count": 2
    },
    {
        "address": "北京西路355弄",
        "name": "华盛大公馆",
        "lnglat": "79.906130,37.112238",
        "count": 15
    },
    {
        "address": "北京西路605弄57号",
        "name": "嘉发大厦",
        "lnglat": "121.463465,31.232809",
        "count": 17
    },
    {
        "address": "北京西路669号",
        "name": "东展商业大厦",
        "lnglat": "106.625921,26.600335",
        "count": 1
    },
    {
        "address": "北京西路758弄",
        "name": "国际丽都城",
        "lnglat": "121.459426,31.233412",
        "count": 139
    },
    {
        "address": "北京西路819号",
        "name": "北泰电信大楼",
        "lnglat": "106.088790,38.485480",
        "count": 2
    },
    {
        "address": "北京西路833号",
        "name": "京泰大楼",
        "lnglat": "106.088614,38.485512",
        "count": 9
    },
    {
        "address": "北欧新镇罗芬路1199弄 ",
        "name": "朗诗绿岛",
        "lnglat": "121.349089,31.405277",
        "count": 135
    },
    {
        "address": "北青公路9399号",
        "name": "德力西园区",
        "lnglat": "121.129025,31.184944",
        "count": 3
    },
    {
        "address": "北沈路288弄",
        "name": "万博欣园",
        "lnglat": "121.335118,31.230969",
        "count": 84
    },
    {
        "address": "北石路440弄",
        "name": "真西新驰苑",
        "lnglat": "121.394270,31.248457",
        "count": 16
    },
    {
        "address": "北石路500弄30号",
        "name": "舒庭苑",
        "lnglat": "121.393769,31.247788",
        "count": 5
    },
    {
        "address": "北松公路7099号",
        "name": "屺盛孵化园",
        "lnglat": "121.268969,31.002257",
        "count": 6
    },
    {
        "address": "北松路489号",
        "name": "沫谷文创园",
        "lnglat": "104.261675,31.958097",
        "count": 6
    },
    {
        "address": "北苏州河路668号",
        "name": "河滨豪园",
        "lnglat": "120.629409,31.127244",
        "count": 20
    },
    {
        "address": "北苏州路1040号",
        "name": "JK1933",
        "lnglat": "121.472802,31.241196",
        "count": 1
    },
    {
        "address": "北行路555弄",
        "name": "朗诗未来街区",
        "lnglat": "121.507515,30.970989",
        "count": 94
    },
    {
        "address": "北园路258弄",
        "name": "东方汇景苑",
        "lnglat": "118.318986,35.082264",
        "count": 240
    },
    {
        "address": "北张家浜路28弄",
        "name": "嘉德公寓",
        "lnglat": "121.520046,31.215974",
        "count": 18
    },
    {
        "address": "北张家浜路88弄",
        "name": "左岸88",
        "lnglat": "121.522256,31.215950",
        "count": 28
    },
    {
        "address": "北中路187弄",
        "name": "北蔡休闲广场",
        "lnglat": "121.555972,31.183785",
        "count": 19
    },
    {
        "address": "本溪路149弄",
        "name": "九州公寓",
        "lnglat": "121.515628,31.275971",
        "count": 4
    },
    {
        "address": "本溪路152-222号",
        "name": "中通雅苑_华元豪庭",
        "lnglat": "121.515492,31.276197",
        "count": 42
    },
    {
        "address": "本溪路181号",
        "name": "同和凤凰园",
        "lnglat": "121.514011,31.275452",
        "count": 5
    },
    {
        "address": "本溪路61号",
        "name": "新凤城商务中心",
        "lnglat": "121.521950,31.277708",
        "count": 1
    },
    {
        "address": "毕升路299弄",
        "name": "富海商务苑",
        "lnglat": "121.587434,31.184195",
        "count": 15
    },
    {
        "address": "碧波路177号",
        "name": "华虹科技园办公楼",
        "lnglat": "121.584462,31.207335",
        "count": 4
    },
    {
        "address": "碧波路573弄1-18号",
        "name": "创业公寓(碧波路)",
        "lnglat": "121.583608,31.202231",
        "count": 8
    },
    {
        "address": "碧泉路36弄1号",
        "name": "银霄大厦",
        "lnglat": "121.382632,31.111717",
        "count": 17
    },
    {
        "address": "碧云路199弄",
        "name": "金桥爱建园",
        "lnglat": "121.560450,31.227231",
        "count": 219
    },
    {
        "address": "碧云路333弄",
        "name": "中天碧云苑",
        "lnglat": "121.577350,31.238108",
        "count": 39
    },
    {
        "address": "碧云路580号",
        "name": "S8碧云花园",
        "lnglat": "121.582943,31.237005",
        "count": 57
    },
    {
        "address": "碧云路777号",
        "name": "S4碧云花园",
        "lnglat": "121.584938,31.241569",
        "count": 10
    },
    {
        "address": "碧云路86弄",
        "name": "金洋十方庭",
        "lnglat": "104.704419,31.528776",
        "count": 52
    },
    {
        "address": "宾阳路28弄",
        "name": "保利星苑",
        "lnglat": "106.598724,26.839742",
        "count": 26
    },
    {
        "address": "宾阳路62弄",
        "name": "乾骏大厦",
        "lnglat": "121.438135,31.164760",
        "count": 4
    },
    {
        "address": "宾阳路9弄",
        "name": "宾阳苑",
        "lnglat": "106.600044,26.839605",
        "count": 12
    },
    {
        "address": "滨江大道1588号",
        "name": "滨江道",
        "lnglat": "121.524542,31.243769",
        "count": 4
    },
    {
        "address": "博安路377号",
        "name": "立同国际商务广场",
        "lnglat": "121.308021,31.142500",
        "count": 7
    },
    {
        "address": "博丰路158弄",
        "name": "金水和璟园北区",
        "lnglat": "121.496261,30.964235",
        "count": 115
    },
    {
        "address": "博航路68号",
        "name": "招商局上海中心",
        "lnglat": "121.486216,31.182202",
        "count": 15
    },
    {
        "address": "博山东路112弄",
        "name": "海德苑",
        "lnglat": "121.563366,31.249208",
        "count": 52
    },
    {
        "address": "博山东路188弄1-24号",
        "name": "通联苑北区",
        "lnglat": "121.565458,31.250597",
        "count": 60
    },
    {
        "address": "博山东路20弄",
        "name": "锦绣河山小区",
        "lnglat": "121.559836,31.245400",
        "count": 56
    },
    {
        "address": "博山路200弄",
        "name": "名门河滨花园",
        "lnglat": "125.652685,43.522684",
        "count": 87
    },
    {
        "address": "博园路1333号1号楼",
        "name": "北虹桥新能源产业园",
        "lnglat": "121.277862,31.262060",
        "count": 9
    },
    {
        "address": "博园路1333号8号楼",
        "name": "北虹桥科创中心",
        "lnglat": "120.859072,40.724503",
        "count": 11
    },
    {
        "address": "博园路6666弄",
        "name": "万科西郊都会",
        "lnglat": "121.194321,31.272055",
        "count": 15
    },
    {
        "address": "彩云路357弄",
        "name": "云松翠庭",
        "lnglat": "121.811066,30.897629",
        "count": 63
    },
    {
        "address": "彩云路567弄",
        "name": "云松景庭",
        "lnglat": "121.807228,30.897688",
        "count": 62
    },
    {
        "address": "彩云路568弄",
        "name": "云松华庭",
        "lnglat": "121.807369,30.899604",
        "count": 56
    },
    {
        "address": "彩云路717弄",
        "name": "云树欣居",
        "lnglat": "121.803576,30.897618",
        "count": 64
    },
    {
        "address": "彩云路718弄",
        "name": "云树雅居",
        "lnglat": "121.803301,30.898852",
        "count": 56
    },
    {
        "address": "彩云路843弄",
        "name": "云树仁居",
        "lnglat": "121.801261,30.898190",
        "count": 20
    },
    {
        "address": "蔡伦路1690号",
        "name": "张江创业工坊蔡伦1690(张江高科技园区蔡伦路)",
        "lnglat": "121.587323,31.190668",
        "count": 4
    },
    {
        "address": "蔡伦路255号",
        "name": "佳宝",
        "lnglat": "121.617993,31.194695",
        "count": 3
    },
    {
        "address": "蔡伦路720弄",
        "name": "张江科技园",
        "lnglat": "121.606281,31.194938",
        "count": 4
    },
    {
        "address": "蔡伦路780号",
        "name": "推广大楼",
        "lnglat": "121.606941,31.193808",
        "count": 8
    },
    {
        "address": "蔡伦路987号",
        "name": "引创空间",
        "lnglat": "121.604034,31.192578",
        "count": 3
    },
    {
        "address": "苍梧路519号",
        "name": "漕河泾光启园4期",
        "lnglat": "121.409774,31.179447",
        "count": 4
    },
    {
        "address": "沧源路1200号",
        "name": "思源创新园",
        "lnglat": "121.423841,31.023878",
        "count": 5
    },
    {
        "address": "曹安公路1509号",
        "name": "福瑞大厦",
        "lnglat": "121.371214,31.251152",
        "count": 9
    },
    {
        "address": "曹安公路1718号",
        "name": "威隆大厦",
        "lnglat": "121.364620,31.253917",
        "count": 14
    },
    {
        "address": "曹安公路1930弄",
        "name": "曹安商办楼",
        "lnglat": "121.361235,31.255646",
        "count": 27
    },
    {
        "address": "曹安公路2038号",
        "name": "华拓大厦",
        "lnglat": "121.348561,31.258963",
        "count": 24
    },
    {
        "address": "曹安公路3918号",
        "name": "协通大厦",
        "lnglat": "121.274339,31.271710",
        "count": 8
    },
    {
        "address": "曹安公路4671号",
        "name": "北虹桥协通科技大厦",
        "lnglat": "121.217779,31.275807",
        "count": 8
    },
    {
        "address": "曹安公路4908弄",
        "name": "曹安景林",
        "lnglat": "121.203668,31.287111",
        "count": 137
    },
    {
        "address": "曹安公路5588号、5616号",
        "name": "安亭财富广场",
        "lnglat": "121.162040,31.290107",
        "count": 51
    },
    {
        "address": "曹安路1775号",
        "name": "上海国际鞋城",
        "lnglat": "121.363585,31.252809",
        "count": 14
    },
    {
        "address": "曹安路295，323号",
        "name": "振光大厦",
        "lnglat": "121.382438,31.247827",
        "count": 20
    },
    {
        "address": "曹安路4671号",
        "name": "上海北虹桥协通产业园",
        "lnglat": "103.703916,30.398117",
        "count": 13
    },
    {
        "address": "曹家塘路220弄-1-35号",
        "name": "塘泾南苑",
        "lnglat": "121.446225,31.041799",
        "count": 112
    },
    {
        "address": "曹家塘路229弄",
        "name": "永德宝邸南区",
        "lnglat": "121.445866,31.041750",
        "count": 14
    },
    {
        "address": "曹家塘路390弄",
        "name": "塘泾北苑",
        "lnglat": "121.443367,31.043678",
        "count": 250
    },
    {
        "address": "曹家塘路399弄",
        "name": "永德宝邸",
        "lnglat": "121.442195,31.042864",
        "count": 68
    },
    {
        "address": "曹农路538号",
        "name": "上海娃娃谷工业园(上海宏隆包装制品有限公司)",
        "lnglat": "121.282077,31.042837",
        "count": 19
    },
    {
        "address": "曹穗北路135弄",
        "name": "忆华里",
        "lnglat": "113.292515,23.256822",
        "count": 76
    },
    {
        "address": "曹杨路1040弄1号",
        "name": "中友大厦",
        "lnglat": "121.409444,31.245213",
        "count": 16
    },
    {
        "address": "曹杨路1040弄2号",
        "name": "中谊大厦",
        "lnglat": "121.410207,31.245240",
        "count": 19
    },
    {
        "address": "曹杨路1222弄1-16号",
        "name": "颐宁苑(上海)",
        "lnglat": "121.408661,31.246975",
        "count": 55
    },
    {
        "address": "曹杨路2168弄",
        "name": "金纺苑",
        "lnglat": "121.405775,31.258760",
        "count": 30
    },
    {
        "address": "曹杨路2170弄",
        "name": "恒力锦沧花园",
        "lnglat": "121.406281,31.259652",
        "count": 120
    },
    {
        "address": "曹杨路2288弄",
        "name": "曹杨新苑",
        "lnglat": "121.405500,31.260582",
        "count": 24
    },
    {
        "address": "曹杨路272号",
        "name": "曹杨路272号商务楼",
        "lnglat": "121.421769,31.233671",
        "count": 1
    },
    {
        "address": "曹杨路303弄",
        "name": "锦绿新城二期",
        "lnglat": "121.420681,31.233619",
        "count": 35
    },
    {
        "address": "曹杨路450号",
        "name": "绿地和创大厦",
        "lnglat": "121.418219,31.237843",
        "count": 42
    },
    {
        "address": "曹杨路455弄",
        "name": "尚诚国际苑",
        "lnglat": "121.418741,31.236007",
        "count": 8
    },
    {
        "address": "曹杨路500号",
        "name": "普陀科技馆",
        "lnglat": "121.418711,31.237587",
        "count": 2
    },
    {
        "address": "曹杨路505号",
        "name": "尚诚国际苑商务楼",
        "lnglat": "121.419097,31.236418",
        "count": 19
    },
    {
        "address": "曹杨路540号",
        "name": "中联大厦",
        "lnglat": "121.418149,31.237916",
        "count": 18
    },
    {
        "address": "曹杨路609弄",
        "name": "曹杨汽车公寓",
        "lnglat": "121.416987,31.237435",
        "count": 8
    },
    {
        "address": "曹杨路619号",
        "name": "近铁云中心",
        "lnglat": "121.416673,31.237868",
        "count": 7
    },
    {
        "address": "曹杨路710弄",
        "name": "中关村公寓_上海",
        "lnglat": "121.415385,31.240225",
        "count": 130
    },
    {
        "address": "曹杨路859弄",
        "name": "联农大厦",
        "lnglat": "121.411911,31.240913",
        "count": 2
    },
    {
        "address": "曹杨路903弄",
        "name": "中桥大楼",
        "lnglat": "121.410741,31.241536",
        "count": 24
    },
    {
        "address": "曹杨路922弄",
        "name": "枫桥苑",
        "lnglat": "121.411007,31.242864",
        "count": 41
    },
    {
        "address": "曹杨路930号",
        "name": "汇尚商务楼",
        "lnglat": "121.410336,31.242903",
        "count": 7
    },
    {
        "address": "漕宝路1011号",
        "name": "漕河泾印象城",
        "lnglat": "121.399499,31.161667",
        "count": 28
    },
    {
        "address": "漕宝路1108号",
        "name": "燎申漕宝大厦",
        "lnglat": "121.397859,31.160144",
        "count": 5
    },
    {
        "address": "漕宝路1555弄",
        "name": "大上海国际花园",
        "lnglat": "121.377362,31.164460",
        "count": 175
    },
    {
        "address": "漕宝路400号",
        "name": "明申商务广场",
        "lnglat": "121.411650,31.163684",
        "count": 15
    },
    {
        "address": "漕宝路401号",
        "name": "漕宝路园区",
        "lnglat": "121.408413,31.164417",
        "count": 16
    },
    {
        "address": "漕宝路650号",
        "name": "知汇大厦",
        "lnglat": "121.404991,31.162518",
        "count": 11
    },
    {
        "address": "漕宝路70-86号",
        "name": "光大会展中心",
        "lnglat": "121.428628,31.167713",
        "count": 60
    },
    {
        "address": "漕宝路77弄",
        "name": "万科华尔兹花园",
        "lnglat": "121.428188,31.169299",
        "count": 75
    },
    {
        "address": "漕溪北路18号",
        "name": "实业大厦",
        "lnglat": "121.437816,31.192755",
        "count": 27
    },
    {
        "address": "漕溪北路28-38号",
        "name": "实业公寓(上海)",
        "lnglat": "121.438667,31.191903",
        "count": 22
    },
    {
        "address": "漕溪北路333号(徐家汇地铁站5号口步行70米)",
        "name": "中金国际广场B楼",
        "lnglat": "121.439556,31.194388",
        "count": 22
    },
    {
        "address": "漕溪北路375号",
        "name": "中金国际广场",
        "lnglat": "121.438445,31.190551",
        "count": 9
    },
    {
        "address": "漕溪北路398号",
        "name": "汇智大厦",
        "lnglat": "121.436503,31.187901",
        "count": 32
    },
    {
        "address": "漕溪北路41号",
        "name": "汇嘉大厦",
        "lnglat": "121.439307,31.192140",
        "count": 2
    },
    {
        "address": "漕溪北路45号",
        "name": "航空科技大厦",
        "lnglat": "121.439900,31.191910",
        "count": 43
    },
    {
        "address": "漕溪北路595号",
        "name": "上影广场",
        "lnglat": "121.438290,31.186160",
        "count": 19
    },
    {
        "address": "漕溪北路737号",
        "name": "汇翠花园",
        "lnglat": "121.437520,31.185168",
        "count": 35
    },
    {
        "address": "漕溪北路88号",
        "name": "圣爱大厦",
        "lnglat": "121.437115,31.191965",
        "count": 40
    },
    {
        "address": "漕溪北路99弄",
        "name": "尊园",
        "lnglat": "121.439246,31.191747",
        "count": 6
    },
    {
        "address": "漕溪路135号",
        "name": "上海金浦大楼",
        "lnglat": "121.436001,31.175786",
        "count": 7
    },
    {
        "address": "漕溪路167弄",
        "name": "铭源大楼（上海）",
        "lnglat": "121.436278,31.174917",
        "count": 7
    },
    {
        "address": "漕溪路169号",
        "name": "东宇商务楼",
        "lnglat": "121.435884,31.174594",
        "count": 3
    },
    {
        "address": "漕溪路190号",
        "name": "华林大楼",
        "lnglat": "121.434832,31.174209",
        "count": 3
    },
    {
        "address": "漕溪路222号",
        "name": "航天大厦（南楼）",
        "lnglat": "121.434408,31.171125",
        "count": 2
    },
    {
        "address": "漕溪路250号",
        "name": "银海大楼",
        "lnglat": "121.434092,31.170354",
        "count": 20
    },
    {
        "address": "漕溪路280号",
        "name": "汇腾广场",
        "lnglat": "121.434029,31.168865",
        "count": 13
    },
    {
        "address": "漕溪四村70号",
        "name": "兆嘉园",
        "lnglat": "121.439155,31.171697",
        "count": 7
    },
    {
        "address": "漕盈路3535号",
        "name": "大亨科技园",
        "lnglat": "121.093147,31.192795",
        "count": 2
    },
    {
        "address": "草高支路766弄",
        "name": "和祥佳园",
        "lnglat": "121.570248,31.351563",
        "count": 88
    },
    {
        "address": "茶陵北路20号",
        "name": "X2创意空间",
        "lnglat": "121.464971,31.198622",
        "count": 8
    },
    {
        "address": "茶陵路1号",
        "name": "紫汇苑",
        "lnglat": "121.468372,31.194468",
        "count": 8
    },
    {
        "address": "槎溪路222弄",
        "name": "万城银座",
        "lnglat": "121.327768,31.283078",
        "count": 86
    },
    {
        "address": "昌吉路168号",
        "name": "龙安佳苑",
        "lnglat": "121.165825,31.295788",
        "count": 24
    },
    {
        "address": "昌平路1009",
        "name": "昌平综合大楼",
        "lnglat": "121.435977,31.231694",
        "count": 2
    },
    {
        "address": "昌平路399号",
        "name": "良清公寓",
        "lnglat": "121.448024,31.236048",
        "count": 8
    },
    {
        "address": "昌平路418弄",
        "name": "贤居天下苑",
        "lnglat": "113.535890,22.226280",
        "count": 9
    },
    {
        "address": "昌平路428弄",
        "name": "静安兴海城",
        "lnglat": "113.535944,22.226241",
        "count": 4
    },
    {
        "address": "昌平路556号",
        "name": "金昌大厦",
        "lnglat": "121.443730,31.235167",
        "count": 1
    },
    {
        "address": "昌平路658弄",
        "name": "丽致公寓",
        "lnglat": "121.443996,31.234838",
        "count": 6
    },
    {
        "address": "昌平路68号",
        "name": "静安现代大厦",
        "lnglat": "121.666754,29.484378",
        "count": 6
    },
    {
        "address": "昌平路777弄",
        "name": "静安凤凰苑",
        "lnglat": "121.441584,31.233745",
        "count": 28
    },
    {
        "address": "昌平路935号",
        "name": "昌平大楼",
        "lnglat": "121.438562,31.232867",
        "count": 9
    },
    {
        "address": "昌平路958号",
        "name": "自然美大楼",
        "lnglat": "121.437579,31.233205",
        "count": 2
    },
    {
        "address": "昌平路988弄999弄",
        "name": "长丰公寓",
        "lnglat": "121.291420,31.168953",
        "count": 19
    },
    {
        "address": "昌平路990号",
        "name": "航创990",
        "lnglat": "121.436498,31.233204",
        "count": 5
    },
    {
        "address": "昌平路994号",
        "name": "传媒文化园",
        "lnglat": "121.436573,31.232560",
        "count": 7
    },
    {
        "address": "昌邑路538弄5号",
        "name": "裕景国际商务广场",
        "lnglat": "121.520602,31.241276",
        "count": 8
    },
    {
        "address": "昌邑路555弄",
        "name": "滨江茗园",
        "lnglat": "121.519799,31.242168",
        "count": 58
    },
    {
        "address": "昌邑路55弄",
        "name": "浦江茗园(艺术传家堡)",
        "lnglat": "121.512735,31.240435",
        "count": 87
    },
    {
        "address": "昌邑路600号",
        "name": "万源晶典公寓",
        "lnglat": "121.522271,31.241137",
        "count": 23
    },
    {
        "address": "常德路1158弄",
        "name": "同德公寓",
        "lnglat": "121.439933,31.239332",
        "count": 19
    },
    {
        "address": "常德路1211号",
        "name": "宝华大厦",
        "lnglat": "121.438296,31.239383",
        "count": 3
    },
    {
        "address": "常德路1239号",
        "name": "常德大厦",
        "lnglat": "121.436437,31.240773",
        "count": 16
    },
    {
        "address": "常德路1258弄",
        "name": "上青佳园",
        "lnglat": "121.437120,31.241639",
        "count": 113
    },
    {
        "address": "常德路1265号",
        "name": "兴运大厦",
        "lnglat": "121.435882,31.241151",
        "count": 12
    },
    {
        "address": "常德路1339号",
        "name": "金昌商务中心",
        "lnglat": "121.434761,31.241672",
        "count": 10
    },
    {
        "address": "常德路1436号",
        "name": "德诚大厦",
        "lnglat": "121.433310,31.244188",
        "count": 11
    },
    {
        "address": "常德路175",
        "name": "轻工机械大厦",
        "lnglat": "121.447638,31.224436",
        "count": 14
    },
    {
        "address": "常德路319号",
        "name": "京德大楼",
        "lnglat": "121.446724,31.226631",
        "count": 2
    },
    {
        "address": "常德路812弄1-3号",
        "name": "德安大厦",
        "lnglat": "121.442964,31.234189",
        "count": 3
    },
    {
        "address": "常德路818弄",
        "name": "德安商务楼",
        "lnglat": "121.442337,31.233706",
        "count": 14
    },
    {
        "address": "常德路977弄1-12号",
        "name": "静安南洋家园",
        "lnglat": "121.441127,31.235161",
        "count": 13
    },
    {
        "address": "常熟路100弄10号",
        "name": "宝立大厦",
        "lnglat": "121.445626,31.216963",
        "count": 9
    },
    {
        "address": "常熟路113弄",
        "name": "创艺大厦",
        "lnglat": "121.449034,31.217366",
        "count": 2
    },
    {
        "address": "常熟路85弄",
        "name": "神州商务大楼",
        "lnglat": "121.447736,31.217450",
        "count": 9
    },
    {
        "address": "常熟路8号",
        "name": "静安广场",
        "lnglat": "121.446791,31.217718",
        "count": 2
    },
    {
        "address": "场北路399弄",
        "name": "新梅绿岛苑",
        "lnglat": "121.430622,31.334516",
        "count": 116
    },
    {
        "address": "场北路39弄",
        "name": "和欣国际花园",
        "lnglat": "121.436868,31.335393",
        "count": 296
    },
    {
        "address": "场北路550弄",
        "name": "恒泰家园",
        "lnglat": "121.427918,31.330749",
        "count": 110
    },
    {
        "address": "场北路551弄",
        "name": "中环国际公寓一期",
        "lnglat": "121.427317,31.333887",
        "count": 86
    },
    {
        "address": "场北路669弄",
        "name": "中环国际公寓三期",
        "lnglat": "121.423996,31.333670",
        "count": 32
    },
    {
        "address": "场中路2018号",
        "name": "中建幸福空间",
        "lnglat": "121.452181,31.304738",
        "count": 17
    },
    {
        "address": "场中路201号",
        "name": "元博商务楼",
        "lnglat": "121.480267,31.308173",
        "count": 2
    },
    {
        "address": "场中路28弄1-10号",
        "name": "场中公寓",
        "lnglat": "121.478927,31.307099",
        "count": 10
    },
    {
        "address": "场中路3386弄",
        "name": "龙馨嘉园",
        "lnglat": "121.428592,31.303052",
        "count": 80
    },
    {
        "address": "场中路4098号",
        "name": "大华老镇嘉年华",
        "lnglat": "121.415263,31.301291",
        "count": 9
    },
    {
        "address": "潮州路508号",
        "name": "仁杰众创空间产业园",
        "lnglat": "121.408523,31.259753",
        "count": 7
    },
    {
        "address": "潮州路536号",
        "name": "太安堂广场",
        "lnglat": "121.407308,31.259071",
        "count": 6
    },
    {
        "address": "车墩镇车阳路177弄",
        "name": "松南城尚雅苑",
        "lnglat": "121.276467,30.990098",
        "count": 30
    },
    {
        "address": "车墩镇车阳路77弄",
        "name": "松南城舒雅苑",
        "lnglat": "121.279085,30.989955",
        "count": 48
    },
    {
        "address": "车嘉路180号",
        "name": "路东科技产业园",
        "lnglat": "121.300818,31.011419",
        "count": 15
    },
    {
        "address": "车泾路99号",
        "name": "三宝园区",
        "lnglat": "121.315875,31.020443",
        "count": 12
    },
    {
        "address": "车亭公路3489弄",
        "name": "长三角物流园",
        "lnglat": "121.327377,30.895499",
        "count": 3
    },
    {
        "address": "车阳路116号",
        "name": "文昌企业园二期",
        "lnglat": "121.290690,30.987799",
        "count": 36
    },
    {
        "address": "车阳路50号",
        "name": "文昌企业园一期",
        "lnglat": "121.292636,30.987358",
        "count": 27
    },
    {
        "address": "车站北路177弄",
        "name": "虹口玫瑰苑",
        "lnglat": "113.010162,28.202027",
        "count": 7
    },
    {
        "address": "车站南路198弄",
        "name": "虹口嘉苑",
        "lnglat": "112.123962,26.776005",
        "count": 48
    },
    {
        "address": "辰塔路2155弄",
        "name": "云间传奇（金色云中苑）",
        "lnglat": "121.179787,31.039231",
        "count": 111
    },
    {
        "address": "陈春东路88弄",
        "name": "德圣苑",
        "lnglat": "121.559609,31.175139",
        "count": 25
    },
    {
        "address": "陈春东路99弄",
        "name": "德铭苑",
        "lnglat": "121.559350,31.176260",
        "count": 29
    },
    {
        "address": "陈家宅路56",
        "name": "上海古林都市工业大厦",
        "lnglat": "121.464893,31.264188",
        "count": 5
    },
    {
        "address": "陈桥路299弄",
        "name": "同盛南桥花园",
        "lnglat": "121.458339,30.928488",
        "count": 78
    },
    {
        "address": "陈行公路2168号",
        "name": "浦江智慧广场",
        "lnglat": "121.512122,31.100961",
        "count": 43
    },
    {
        "address": "陈行公路2388号",
        "name": "漕河泾浦江科技广场",
        "lnglat": "121.507393,31.097195",
        "count": 147
    },
    {
        "address": "陈行公路3702号",
        "name": "前滩大厦",
        "lnglat": "121.488142,31.089704",
        "count": 8
    },
    {
        "address": "晨晖路377弄",
        "name": "张江汤臣豪园一期",
        "lnglat": "121.588356,31.200492",
        "count": 44
    },
    {
        "address": "晨晖路828弄",
        "name": "张江汤臣豪园三期",
        "lnglat": "121.597598,31.199284",
        "count": 221
    },
    {
        "address": "晨晖路88号",
        "name": "金蝶软件园",
        "lnglat": "121.581849,31.196909",
        "count": 8
    },
    {
        "address": "成都北路199号",
        "name": "恒利国际大厦",
        "lnglat": "121.466677,31.227009",
        "count": 9
    },
    {
        "address": "成都北路333号",
        "name": "招商局广场",
        "lnglat": "121.466525,31.228088",
        "count": 20
    },
    {
        "address": "成都北路500号",
        "name": "峻岭广场",
        "lnglat": "121.467163,31.232134",
        "count": 65
    },
    {
        "address": "成都北路600号",
        "name": "中华保险华盛大厦",
        "lnglat": "121.466867,31.234070",
        "count": 10
    },
    {
        "address": "成山路1339号",
        "name": "大华锦绣优嘉",
        "lnglat": "121.524673,31.176189",
        "count": 11
    },
    {
        "address": "成山路1488弄",
        "name": "大华锦绣华城15街区二期",
        "lnglat": "121.528660,31.175248",
        "count": 96
    },
    {
        "address": "成山路1728弄",
        "name": "大华锦绣华城16街区",
        "lnglat": "121.531776,31.176813",
        "count": 302
    },
    {
        "address": "成山路1850弄",
        "name": "大华锦绣华城17街区",
        "lnglat": "121.532478,31.176872",
        "count": 24
    },
    {
        "address": "成山路2008弄",
        "name": "大华锦绣华城18街区",
        "lnglat": "121.534777,31.177140",
        "count": 162
    },
    {
        "address": "成山路220号",
        "name": "上海城建大厦",
        "lnglat": "121.495648,31.170883",
        "count": 9
    },
    {
        "address": "成山路2388号",
        "name": "海尚郡领",
        "lnglat": "121.546069,31.178958",
        "count": 80
    },
    {
        "address": "成山路2399弄",
        "name": "海上国际花园",
        "lnglat": "121.544780,31.181175",
        "count": 124
    },
    {
        "address": "成山路588号",
        "name": "展峰大楼",
        "lnglat": "121.509731,31.171329",
        "count": 9
    },
    {
        "address": "成山路668弄",
        "name": "恒大星级公寓",
        "lnglat": "121.511762,31.170349",
        "count": 30
    },
    {
        "address": "成山路800号",
        "name": "云顶国际广场",
        "lnglat": "121.513710,31.172206",
        "count": 4
    },
    {
        "address": "成泽路386弄",
        "name": "新城馥华里",
        "lnglat": "121.277207,31.373346",
        "count": 174
    },
    {
        "address": "诚礼路298号",
        "name": "紫金九号二期",
        "lnglat": "121.667209,31.224865",
        "count": 2
    },
    {
        "address": "城北路1355号",
        "name": "上海大学国家大学科技园嘉定基地",
        "lnglat": "120.730865,30.784009",
        "count": 63
    },
    {
        "address": "城东路96弄",
        "name": "惠城大厦",
        "lnglat": "100.466943,38.949902",
        "count": 9
    },
    {
        "address": "城丰路599弄",
        "name": "东方城市绿洲",
        "lnglat": "121.680275,31.186276",
        "count": 56
    },
    {
        "address": "城隆路629弄",
        "name": "珠江假日广场",
        "lnglat": "121.232015,31.084486",
        "count": 10
    },
    {
        "address": "城南路278弄",
        "name": "东方城市豪苑",
        "lnglat": "121.156501,27.818660",
        "count": 55
    },
    {
        "address": "城南路555弄",
        "name": "鼎城丽景苑",
        "lnglat": "108.779600,29.508124",
        "count": 32
    },
    {
        "address": "城乡路188号",
        "name": "亿星大厦(上海)",
        "lnglat": "114.005247,23.022546",
        "count": 23
    },
    {
        "address": "城中北路588弄",
        "name": "城中公园",
        "lnglat": "121.113934,31.157162",
        "count": 47
    },
    {
        "address": "城中北路866弄",
        "name": "贺桥公寓",
        "lnglat": "121.114321,31.161473",
        "count": 192
    },
    {
        "address": "城中北路876弄",
        "name": "上善水樾",
        "lnglat": "120.089947,29.326724",
        "count": 11
    },
    {
        "address": "城中路200号",
        "name": "冠寓_嘉定城中路店",
        "lnglat": "104.921286,28.581401",
        "count": 5
    },
    {
        "address": "城中路285号",
        "name": "桃园公寓",
        "lnglat": "109.982692,24.190399",
        "count": 6
    },
    {
        "address": "程家桥路168弄39号",
        "name": "大树下新媒体创意产业园区",
        "lnglat": "121.372045,31.185655",
        "count": 7
    },
    {
        "address": "程家桥路175弄",
        "name": "虹桥奕境文创园",
        "lnglat": "121.372668,31.186249",
        "count": 11
    },
    {
        "address": "程家桥路258号",
        "name": "银洲国际商务大厦",
        "lnglat": "121.375313,31.184778",
        "count": 6
    },
    {
        "address": "程家桥路388弄",
        "name": "古北金鹰府二期",
        "lnglat": "121.376669,31.186174",
        "count": 36
    },
    {
        "address": "澄浏中路2500弄",
        "name": "沧海绿苑",
        "lnglat": "121.279979,31.382661",
        "count": 102
    },
    {
        "address": "澄浏中路2539弄",
        "name": "嘉乐东润广场",
        "lnglat": "121.279743,31.380814",
        "count": 2
    },
    {
        "address": "池月路333弄",
        "name": "丽都华庭",
        "lnglat": "121.808834,30.901376",
        "count": 144
    },
    {
        "address": "赤峰路301-303号",
        "name": "峰茂大楼",
        "lnglat": "121.495029,31.284226",
        "count": 6
    },
    {
        "address": "赤峰路525号",
        "name": "赤峰路525号小区",
        "lnglat": "121.484479,31.282246",
        "count": 7
    },
    {
        "address": "赤峰路59弄",
        "name": "书香公寓",
        "lnglat": "121.502021,31.278676",
        "count": 108
    },
    {
        "address": "赤峰路626弄",
        "name": "天峰公寓",
        "lnglat": "121.485461,31.284628",
        "count": 3
    },
    {
        "address": "赤峰路95、97号",
        "name": "赤峰冶金公寓",
        "lnglat": "121.496661,31.281557",
        "count": 10
    },
    {
        "address": "崇南公路599弄",
        "name": "山水华庭(佘山院子)",
        "lnglat": "121.140471,31.026325",
        "count": 36
    },
    {
        "address": "褚家路368弄",
        "name": "四季锦苑",
        "lnglat": "121.518294,30.923782",
        "count": 37
    },
    {
        "address": "川和路55弄",
        "name": "张江人工智能岛",
        "lnglat": "121.609719,31.185610",
        "count": 8
    },
    {
        "address": "川和路中科路",
        "name": "万科翡翠公园六期",
        "lnglat": "121.610869,31.181136",
        "count": 26
    },
    {
        "address": "川宏路365号",
        "name": "圣御工业总部园",
        "lnglat": "121.706617,31.158803",
        "count": 16
    },
    {
        "address": "川宏路508号",
        "name": "贺海科技孵化器",
        "lnglat": "121.711445,31.159220",
        "count": 10
    },
    {
        "address": "川六公路1159弄",
        "name": "龙馨公寓",
        "lnglat": "121.717712,31.157904",
        "count": 28
    },
    {
        "address": "川桥路350号",
        "name": "华东资产产业园",
        "lnglat": "121.605275,31.243427",
        "count": 4
    },
    {
        "address": "川桥路401号",
        "name": "由度工坊",
        "lnglat": "121.608288,31.245091",
        "count": 14
    },
    {
        "address": "川沙路1666弄",
        "name": "天歌华庭（金领国际）",
        "lnglat": "121.679216,31.253842",
        "count": 114
    },
    {
        "address": "川沙路4000号",
        "name": "新馨白领公寓川沙路店",
        "lnglat": "121.691582,31.209454",
        "count": 10
    },
    {
        "address": "川沙路4198号",
        "name": "爱情谷",
        "lnglat": "121.693167,31.205810",
        "count": 9
    },
    {
        "address": "川沙路5558弄",
        "name": "绿地东海岸国际广场",
        "lnglat": "121.698638,31.183657",
        "count": 30
    },
    {
        "address": "川沙路688号",
        "name": "浦江智汇创业园",
        "lnglat": "121.669749,31.273241",
        "count": 15
    },
    {
        "address": "川沙路718号",
        "name": "曹路创新产业园",
        "lnglat": "121.695049,31.200298",
        "count": 62
    },
    {
        "address": "川沙路809号",
        "name": "超煜809文创园",
        "lnglat": "121.673980,31.270854",
        "count": 22
    },
    {
        "address": "川周公路2880号",
        "name": "旭辉亚瑟郡",
        "lnglat": "121.614465,31.144176",
        "count": 76
    },
    {
        "address": "川周公路2928弄",
        "name": "康庭苑",
        "lnglat": "121.614117,31.142531",
        "count": 32
    },
    {
        "address": "川周公路4011弄",
        "name": "汇丽苑",
        "lnglat": "121.587459,31.125428",
        "count": 12
    },
    {
        "address": "川周公路8288弄",
        "name": "浦发馨汇佳苑",
        "lnglat": "121.709631,31.178402",
        "count": 310
    },
    {
        "address": "川周公路8682弄",
        "name": "鼎鑫名流苑",
        "lnglat": "121.580335,31.120413",
        "count": 192
    },
    {
        "address": "船厂路36号",
        "name": "徐汇正大乐城",
        "lnglat": "114.440649,30.654662",
        "count": 13
    },
    {
        "address": "船山街49弄",
        "name": "禹洲城市广场东区",
        "lnglat": "121.867685,30.976503",
        "count": 18
    },
    {
        "address": "创新西路333弄",
        "name": "唐丰苑",
        "lnglat": "121.651631,31.201304",
        "count": 156
    },
    {
        "address": "春常路142号",
        "name": "抱家燕汇谷智慧产业园",
        "lnglat": "121.359776,31.066014",
        "count": 21
    },
    {
        "address": "春常路66号",
        "name": "君茂科创",
        "lnglat": "121.361468,31.064430",
        "count": 6
    },
    {
        "address": "春东路508号",
        "name": "如果创意产业园",
        "lnglat": "121.389413,31.086388",
        "count": 36
    },
    {
        "address": "春都路358弄1-35号",
        "name": "君莲宏润丽苑",
        "lnglat": "121.414312,31.083838",
        "count": 37
    },
    {
        "address": "春都路75弄",
        "name": "君莲新城中城苑",
        "lnglat": "112.453903,34.687712",
        "count": 274
    },
    {
        "address": "春光路99弄55号",
        "name": "广陆创客佳园",
        "lnglat": "103.661527,25.034159",
        "count": 15
    },
    {
        "address": "春晖路148弄",
        "name": "运银公寓",
        "lnglat": "102.677386,25.050180",
        "count": 20
    },
    {
        "address": "春晖路446弄",
        "name": "浦发春晖苑",
        "lnglat": "102.677266,25.049415",
        "count": 103
    },
    {
        "address": "春晖路628弄",
        "name": "风信景苑",
        "lnglat": "102.677192,25.048947",
        "count": 56
    },
    {
        "address": "春雷路288弄",
        "name": "新月雅苑",
        "lnglat": "121.433599,31.407407",
        "count": 24
    },
    {
        "address": "春泉路45弄",
        "name": "张江名流豪庭",
        "lnglat": "121.646226,31.216407",
        "count": 192
    },
    {
        "address": "春申路1955号",
        "name": "陇盛大厦",
        "lnglat": "121.424414,31.112058",
        "count": 12
    },
    {
        "address": "春申路2328弄12幢",
        "name": "M创客空间",
        "lnglat": "121.417750,31.113389",
        "count": 3
    },
    {
        "address": "春申路2525号",
        "name": "欧银集心",
        "lnglat": "121.414699,31.109886",
        "count": 17
    },
    {
        "address": "春申路3355弄",
        "name": "春申复地城一期",
        "lnglat": "121.395227,31.103612",
        "count": 141
    },
    {
        "address": "春申路3455弄",
        "name": "华丽家园",
        "lnglat": "121.394163,31.101458",
        "count": 56
    },
    {
        "address": "春申路3755号",
        "name": "春申路3755号商务楼",
        "lnglat": "121.388348,31.100548",
        "count": 8
    },
    {
        "address": "春申路3758弄",
        "name": "凯利大楼（上海）",
        "lnglat": "121.387504,31.101253",
        "count": 10
    },
    {
        "address": "春晓路289号",
        "name": "张江大厦",
        "lnglat": "121.584450,31.205629",
        "count": 14
    },
    {
        "address": "慈竹路836弄",
        "name": "同盛园",
        "lnglat": "121.212666,31.380381",
        "count": 112
    },
    {
        "address": "萃浦路200弄",
        "name": "上海派嘉悦澜庭",
        "lnglat": "121.198101,31.298467",
        "count": 60
    },
    {
        "address": "翠波路201号",
        "name": "浦东新经济蓝宝石园",
        "lnglat": "121.790342,30.913856",
        "count": 7
    },
    {
        "address": "达尔文路88号",
        "name": "新希望半岛科技园",
        "lnglat": "121.583867,31.193452",
        "count": 70
    },
    {
        "address": "打浦路1号",
        "name": "金玉兰广场",
        "lnglat": "121.470892,31.204966",
        "count": 5
    },
    {
        "address": "打浦路258号",
        "name": "扬子江家园",
        "lnglat": "121.470415,31.200033",
        "count": 44
    },
    {
        "address": "打浦路38弄",
        "name": "海华花园",
        "lnglat": "121.469035,31.204653",
        "count": 35
    },
    {
        "address": "打浦路398弄",
        "name": "东晖花苑",
        "lnglat": "121.472446,31.197484",
        "count": 23
    },
    {
        "address": "打浦路398弄4号-2临",
        "name": "衡辰商务楼",
        "lnglat": "121.472336,31.197802",
        "count": 8
    },
    {
        "address": "打浦路443号",
        "name": "荣科大厦（上海）",
        "lnglat": "121.473328,31.197637",
        "count": 5
    },
    {
        "address": "打浦路585弄1-4号",
        "name": "中辉新苑",
        "lnglat": "121.474225,31.195411",
        "count": 36
    },
    {
        "address": "打浦路603号",
        "name": "金地威新8号桥滨江园",
        "lnglat": "121.475959,31.194928",
        "count": 4
    },
    {
        "address": "打浦路88号",
        "name": "海丽大厦",
        "lnglat": "121.470287,31.203103",
        "count": 12
    },
    {
        "address": "大道站路94弄",
        "name": "三林世博家园B区",
        "lnglat": "121.539192,31.159292",
        "count": 92
    },
    {
        "address": "大渡河路1142号",
        "name": "长风大楼",
        "lnglat": "121.395542,31.235318",
        "count": 6
    },
    {
        "address": "大渡河路1516弄",
        "name": "真西驰骋苑",
        "lnglat": "121.396470,31.246349",
        "count": 10
    },
    {
        "address": "大渡河路1550弄200支弄",
        "name": "宁馨家园",
        "lnglat": "121.392551,31.247331",
        "count": 32
    },
    {
        "address": "大渡河路168弄6号",
        "name": "北岸长风",
        "lnglat": "121.395738,31.220684",
        "count": 16
    },
    {
        "address": "大渡河路196号",
        "name": "长风大悦城",
        "lnglat": "121.395275,31.222693",
        "count": 49
    },
    {
        "address": "大沽路186弄",
        "name": "宏泰公寓",
        "lnglat": "121.471134,31.226548",
        "count": 10
    },
    {
        "address": "大沽路398弄23号",
        "name": "中凯诚仕会",
        "lnglat": "121.466877,31.225747",
        "count": 3
    },
    {
        "address": "大官塘路180弄",
        "name": "松南城善德苑",
        "lnglat": "121.256316,30.981397",
        "count": 106
    },
    {
        "address": "大华路988弄",
        "name": "滨江雅苑",
        "lnglat": "121.413178,31.278536",
        "count": 132
    },
    {
        "address": "大华三路81号",
        "name": "美隆大厦",
        "lnglat": "121.418663,31.275793",
        "count": 10
    },
    {
        "address": "大华一路210号",
        "name": "大华虎城嘉年华",
        "lnglat": "121.413321,31.270408",
        "count": 40
    },
    {
        "address": "大华一路239弄",
        "name": "大华虎城商务中心",
        "lnglat": "121.414400,31.267718",
        "count": 55
    },
    {
        "address": "大吉路135弄",
        "name": "实华公寓",
        "lnglat": "121.484553,31.214583",
        "count": 4
    },
    {
        "address": "大康路1079弄",
        "name": "中环国际公寓二期",
        "lnglat": "121.421507,31.333631",
        "count": 108
    },
    {
        "address": "大康路891弄",
        "name": "共康雅苑",
        "lnglat": "121.422552,31.329999",
        "count": 195
    },
    {
        "address": "大康路896弄",
        "name": "恒达家园",
        "lnglat": "121.423352,31.330812",
        "count": 208
    },
    {
        "address": "大连路1548号",
        "name": "莱克大厦",
        "lnglat": "121.503615,31.273500",
        "count": 17
    },
    {
        "address": "大连路1619号",
        "name": "骏丰国际财富广场",
        "lnglat": "121.502131,31.273654",
        "count": 9
    },
    {
        "address": "大连路265号",
        "name": "振天商务楼",
        "lnglat": "119.486320,35.401260",
        "count": 4
    },
    {
        "address": "大连路839号",
        "name": "合生财富广场",
        "lnglat": "121.507161,31.263593",
        "count": 28
    },
    {
        "address": "大连路990号",
        "name": "海上海新城",
        "lnglat": "121.507413,31.266500",
        "count": 58
    },
    {
        "address": "大连西路257弄1-2号",
        "name": "文宇公寓",
        "lnglat": "121.487970,31.276014",
        "count": 4
    },
    {
        "address": "大林路10弄",
        "name": "兴林公寓二期",
        "lnglat": "111.506860,23.423478",
        "count": 2
    },
    {
        "address": "大林路10弄1号",
        "name": "兴林公寓一期",
        "lnglat": "111.506860,23.423478",
        "count": 1
    },
    {
        "address": "大林路10弄2号",
        "name": "兴林办公楼",
        "lnglat": "111.506860,23.423478",
        "count": 2
    },
    {
        "address": "大木桥路100号",
        "name": "祥和公寓",
        "lnglat": "121.461107,31.200774",
        "count": 6
    },
    {
        "address": "大木桥路158弄",
        "name": "金色港湾公寓",
        "lnglat": "121.080355,31.593556",
        "count": 149
    },
    {
        "address": "大木桥路340弄2号",
        "name": "银海苑",
        "lnglat": "121.461683,31.196401",
        "count": 4
    },
    {
        "address": "大木桥路451号",
        "name": "协合徐汇公寓",
        "lnglat": "121.462945,31.196074",
        "count": 1
    },
    {
        "address": "大木桥路65号",
        "name": "新路大楼",
        "lnglat": "121.461383,31.201210",
        "count": 6
    },
    {
        "address": "大宁路535弄",
        "name": "绿色丽园",
        "lnglat": "121.449232,31.274818",
        "count": 217
    },
    {
        "address": "大宁路701号",
        "name": "歌林汇",
        "lnglat": "121.445571,31.271821",
        "count": 6
    },
    {
        "address": "大统路1038号",
        "name": "博苑公寓",
        "lnglat": "121.459037,31.256037",
        "count": 9
    },
    {
        "address": "大统路938弄",
        "name": "越秀苑",
        "lnglat": "121.458814,31.255455",
        "count": 40
    },
    {
        "address": "大统路958弄1号",
        "name": "协诚中心大厦B座",
        "lnglat": "121.458537,31.255099",
        "count": 2
    },
    {
        "address": "大团镇南芦公路989弄",
        "name": "同润蓝美俊庭",
        "lnglat": "121.746877,30.963237",
        "count": 26
    },
    {
        "address": "大学路63弄",
        "name": "创智坊SOHO公寓楼",
        "lnglat": "102.791515,24.977926",
        "count": 362
    },
    {
        "address": "大叶公路6288弄",
        "name": "天和锦园",
        "lnglat": "121.554832,30.976556",
        "count": 36
    },
    {
        "address": "大盈浦路1755弄",
        "name": "首创禧悦璟庭",
        "lnglat": "121.078056,31.133173",
        "count": 93
    },
    {
        "address": "大盈浦路1800弄",
        "name": "中南君悦府",
        "lnglat": "121.077053,31.134141",
        "count": 117
    },
    {
        "address": "丹巴路28弄",
        "name": "旭辉世纪广场",
        "lnglat": "121.380938,31.222410",
        "count": 48
    },
    {
        "address": "丹巴路98弄7号",
        "name": "龙裕财富中心",
        "lnglat": "121.381985,31.222909",
        "count": 15
    },
    {
        "address": "丹徒路405号",
        "name": "景泰大楼",
        "lnglat": "119.530753,32.194738",
        "count": 10
    },
    {
        "address": "丹霞山路257弄",
        "name": "馨佳园八街坊",
        "lnglat": "121.362875,31.361916",
        "count": 55
    },
    {
        "address": "丹霞山路50弄",
        "name": "龙湖北城天街南区",
        "lnglat": "121.362206,31.359091",
        "count": 36
    },
    {
        "address": "淡家浜街88弄",
        "name": "金色茸城苑(梦想派二期)",
        "lnglat": "121.242213,31.060975",
        "count": 217
    },
    {
        "address": "淡家浜街99弄",
        "name": "信达蓝爵",
        "lnglat": "121.242607,31.060151",
        "count": 164
    },
    {
        "address": "淡水路361号",
        "name": "淡水公寓",
        "lnglat": "121.474300,31.212699",
        "count": 16
    },
    {
        "address": "德爱路450弄",
        "name": "阳光城MODO自由区（上海MODO自由区）",
        "lnglat": "121.588683,31.300729",
        "count": 19
    },
    {
        "address": "德堡路38号",
        "name": "沐远国际中心",
        "lnglat": "121.606631,31.307547",
        "count": 28
    },
    {
        "address": "德都路35弄",
        "name": "新月翡翠园",
        "lnglat": "121.429911,31.403231",
        "count": 76
    },
    {
        "address": "德都路50弄",
        "name": "嘉城国际花园",
        "lnglat": "121.426922,31.404648",
        "count": 56
    },
    {
        "address": "德都路58弄",
        "name": "恒德苑",
        "lnglat": "121.426870,31.404778",
        "count": 32
    },
    {
        "address": "德富路1198号",
        "name": "太湖世家国际大厦（世家双塔）",
        "lnglat": "121.258604,31.347608",
        "count": 9
    },
    {
        "address": "德富路1199号",
        "name": "太湖世家环球大厦（世家双塔）",
        "lnglat": "121.257768,31.347217",
        "count": 8
    },
    {
        "address": "德富路1388弄",
        "name": "阳光城新界(上海新界）",
        "lnglat": "121.255982,31.352404",
        "count": 29
    },
    {
        "address": "德华路80弄",
        "name": "威廉公馆二期（清猗园北区）",
        "lnglat": "113.094830,22.957267",
        "count": 78
    },
    {
        "address": "德平路1060号",
        "name": "天虹苑",
        "lnglat": "121.566648,31.242748",
        "count": 27
    },
    {
        "address": "德平路12弄10号",
        "name": "沪东船厂大楼",
        "lnglat": "121.556173,31.254447",
        "count": 7
    },
    {
        "address": "德平路58弄",
        "name": "金云苑",
        "lnglat": "120.325964,36.077243",
        "count": 21
    },
    {
        "address": "德泉路305弄",
        "name": "贤青雅苑",
        "lnglat": "121.522636,30.918850",
        "count": 27
    },
    {
        "address": "德泉路336弄",
        "name": "贤德名苑",
        "lnglat": "121.520359,30.916969",
        "count": 17
    },
    {
        "address": "德友路77号",
        "name": "旭辉公元（上海）",
        "lnglat": "121.166874,31.318544",
        "count": 20
    },
    {
        "address": "德园路1055弄",
        "name": "海谊苑",
        "lnglat": "121.303309,31.306018",
        "count": 61
    },
    {
        "address": "德园路1259弄",
        "name": "溪岸澜庭",
        "lnglat": "121.300485,31.308056",
        "count": 199
    },
    {
        "address": "德悦路375弄",
        "name": "登云苑",
        "lnglat": "121.255839,31.101271",
        "count": 48
    },
    {
        "address": "德州路382弄",
        "name": "德馨公寓",
        "lnglat": "121.485591,31.166559",
        "count": 30
    },
    {
        "address": "德州路60弄",
        "name": "中星云庭（上海）",
        "lnglat": "118.603511,37.514116",
        "count": 68
    },
    {
        "address": "灯辉路555弄",
        "name": "银春小区（枫泽苑）",
        "lnglat": "121.421564,31.030474",
        "count": 19
    },
    {
        "address": "登云路38号",
        "name": "塘和家园君康苑",
        "lnglat": "112.179843,23.920422",
        "count": 14
    },
    {
        "address": "淀山湖大道1079弄",
        "name": "青浦万达茂商务楼",
        "lnglat": "121.080666,31.132748",
        "count": 86
    },
    {
        "address": "淀山湖大道851号(淀山湖大道地铁站2号口步行180米)",
        "name": "青浦万达茂",
        "lnglat": "106.437855,29.825210",
        "count": 44
    },
    {
        "address": "淀园路269弄",
        "name": "境秋悦庭",
        "lnglat": "121.029812,31.181640",
        "count": 59
    },
    {
        "address": "淀园路288弄",
        "name": "境秋华庭",
        "lnglat": "121.059474,31.128429",
        "count": 66
    },
    {
        "address": "丁香路1089弄",
        "name": "联洋花园三期",
        "lnglat": "121.554584,31.228890",
        "count": 143
    },
    {
        "address": "丁香路1399弄",
        "name": "仁恒河滨城",
        "lnglat": "121.564242,31.229547",
        "count": 77
    },
    {
        "address": "丁香路1399弄30号",
        "name": "仁恒邻里之家",
        "lnglat": "121.564196,31.229408",
        "count": 13
    },
    {
        "address": "丁香路425号",
        "name": "东方艺术中心",
        "lnglat": "121.541278,31.222743",
        "count": 5
    },
    {
        "address": "丁香路901弄",
        "name": "联洋花园一期",
        "lnglat": "121.554093,31.227637",
        "count": 50
    },
    {
        "address": "丁香路999弄",
        "name": "联洋花园二期",
        "lnglat": "121.554012,31.227039",
        "count": 101
    },
    {
        "address": "鼎源路618弄",
        "name": "时尚谷创意园",
        "lnglat": "121.167274,31.030735",
        "count": 107
    },
    {
        "address": "定边路35号",
        "name": "东方汽配城",
        "lnglat": "121.361631,31.256665",
        "count": 15
    },
    {
        "address": "定边路377弄 ",
        "name": "阳光建华城二期",
        "lnglat": "121.363105,31.260803",
        "count": 136
    },
    {
        "address": "定边路629号",
        "name": "智谷S06园区",
        "lnglat": "121.365358,31.264664",
        "count": 24
    },
    {
        "address": "定边路99弄",
        "name": "东珠苑",
        "lnglat": "121.363804,31.257097",
        "count": 16
    },
    {
        "address": "定西路1100号",
        "name": "辽油大厦",
        "lnglat": "121.423511,31.211777",
        "count": 1
    },
    {
        "address": "定西路1118号",
        "name": "武夷坊文化创意园",
        "lnglat": "121.423440,31.212441",
        "count": 6
    },
    {
        "address": "定西路1232号",
        "name": "大盈商务中心",
        "lnglat": "121.423084,31.214304",
        "count": 14
    },
    {
        "address": "定西路1277-1279号",
        "name": "长峰大厦",
        "lnglat": "103.870288,36.041450",
        "count": 5
    },
    {
        "address": "定西路1279号",
        "name": "名光大厦",
        "lnglat": "121.421388,31.215878",
        "count": 3
    },
    {
        "address": "定西路1310弄",
        "name": "金都苑",
        "lnglat": "121.423214,31.216151",
        "count": 5
    },
    {
        "address": "定西路1310弄10号",
        "name": "建宁大厦",
        "lnglat": "121.423473,31.216383",
        "count": 8
    },
    {
        "address": "定西路1310弄2号",
        "name": "南天大厦",
        "lnglat": "121.422970,31.215862",
        "count": 8
    },
    {
        "address": "定西路1310弄4号",
        "name": "国泰大厦(上海)",
        "lnglat": "121.422498,31.216279",
        "count": 9
    },
    {
        "address": "定西路1310弄8号",
        "name": "长乐大厦(长宁)",
        "lnglat": "121.423223,31.216508",
        "count": 8
    },
    {
        "address": "定西路1507号",
        "name": "中山大楼(定西路)",
        "lnglat": "121.421540,31.217402",
        "count": 9
    },
    {
        "address": "定西路657号",
        "name": "大吉地世贸大厦",
        "lnglat": "121.423760,31.206433",
        "count": 7
    },
    {
        "address": "定西路710弄59-67号",
        "name": "云阳花苑",
        "lnglat": "121.424669,31.206723",
        "count": 23
    },
    {
        "address": "定西路710弄83号",
        "name": "达安长宁公寓",
        "lnglat": "121.426146,31.207500",
        "count": 44
    },
    {
        "address": "定西路717弄",
        "name": "上海映巷创意园",
        "lnglat": "121.423604,31.207451",
        "count": 6
    },
    {
        "address": "定西路720弄1号",
        "name": "华云大厦",
        "lnglat": "121.424161,31.207370",
        "count": 9
    },
    {
        "address": "定西路768号",
        "name": "东方金门花园",
        "lnglat": "121.424596,31.208090",
        "count": 27
    },
    {
        "address": "定西路778号",
        "name": "凯阳大厦",
        "lnglat": "103.869146,36.041866",
        "count": 1
    },
    {
        "address": "定西路988号",
        "name": "银统大厦",
        "lnglat": "121.423900,31.210401",
        "count": 12
    },
    {
        "address": "东安路149弄",
        "name": "四季园（上海）",
        "lnglat": "105.295683,27.311274",
        "count": 80
    },
    {
        "address": "东安路271弄",
        "name": "广汇花苑",
        "lnglat": "105.294674,27.311399",
        "count": 3
    },
    {
        "address": "东安路338弄1号",
        "name": "东安小区",
        "lnglat": "113.948974,22.977455",
        "count": 9
    },
    {
        "address": "东安路562号",
        "name": "绿地国际广场",
        "lnglat": "121.456586,31.183567",
        "count": 5
    },
    {
        "address": "东宝兴路118号",
        "name": "谊华大厦",
        "lnglat": "121.484169,31.256864",
        "count": 7
    },
    {
        "address": "东宝兴路157号",
        "name": "精武大厦",
        "lnglat": "121.483846,31.257618",
        "count": 2
    },
    {
        "address": "东昌路600号",
        "name": "东昌大楼",
        "lnglat": "121.513506,31.232675",
        "count": 6
    },
    {
        "address": "东晨南路1号",
        "name": "启示望远数字科技园",
        "lnglat": "121.531342,31.027528",
        "count": 1
    },
    {
        "address": "东城二路1号",
        "name": "中国留学人才创新港",
        "lnglat": "118.407084,24.964564",
        "count": 25
    },
    {
        "address": "东川公路5237号",
        "name": "日角大厦",
        "lnglat": "121.715015,31.248032",
        "count": 5
    },
    {
        "address": "东川路1779号",
        "name": "新闵创意园",
        "lnglat": "121.422954,31.014407",
        "count": 16
    },
    {
        "address": "东川路3533号",
        "name": "上海天星苑",
        "lnglat": "121.371488,31.000232",
        "count": 15
    },
    {
        "address": "东川路3966号",
        "name": "金地威新达闼人工智能创新产业基地",
        "lnglat": "121.360265,30.998984",
        "count": 32
    },
    {
        "address": "东大名路1050号",
        "name": "绿地浦创商务大厦",
        "lnglat": "121.507716,31.251479",
        "count": 16
    },
    {
        "address": "东大名路1089号",
        "name": "北外滩来福士办公楼东塔",
        "lnglat": "121.508043,31.252593",
        "count": 116
    },
    {
        "address": "东大名路1096号",
        "name": "长江大楼",
        "lnglat": "121.508673,31.251807",
        "count": 3
    },
    {
        "address": "东大名路1158号",
        "name": "浦江国际金融广场",
        "lnglat": "121.509885,31.251324",
        "count": 17
    },
    {
        "address": "东大名路501号",
        "name": "上海白玉兰广场",
        "lnglat": "121.498084,31.249030",
        "count": 176
    },
    {
        "address": "东大名路888弄19号",
        "name": "新外滩花苑综合楼",
        "lnglat": "121.505689,31.249982",
        "count": 3
    },
    {
        "address": "东大名路908号",
        "name": "金岸大厦",
        "lnglat": "121.505359,31.250643",
        "count": 2
    },
    {
        "address": "东大名路948号",
        "name": "白金湾广场",
        "lnglat": "121.506166,31.250778",
        "count": 15
    },
    {
        "address": "东大名路999号",
        "name": "北外滩来福士广场",
        "lnglat": "121.513622,31.254452",
        "count": 23
    },
    {
        "address": "东方路135号",
        "name": "海东大楼",
        "lnglat": "120.660695,27.956118",
        "count": 8
    },
    {
        "address": "东方路1381号、1383号",
        "name": "base(蓝村路)",
        "lnglat": "121.528491,31.211263",
        "count": 4
    },
    {
        "address": "东方路286号",
        "name": "IC_PARK",
        "lnglat": "121.521292,31.236500",
        "count": 7
    },
    {
        "address": "东方路3261号B座",
        "name": "振华企业广场B座",
        "lnglat": "112.509591,23.094526",
        "count": 64
    },
    {
        "address": "东方路428号",
        "name": "宏声商务中心",
        "lnglat": "120.973572,30.973075",
        "count": 5
    },
    {
        "address": "东方路573弄1号",
        "name": "市政大楼",
        "lnglat": "121.524899,31.231944",
        "count": 2
    },
    {
        "address": "东方路710号",
        "name": "汤臣金融大厦",
        "lnglat": "121.524226,31.229065",
        "count": 21
    },
    {
        "address": "东方路738号",
        "name": "裕安大厦",
        "lnglat": "120.966555,30.973040",
        "count": 60
    },
    {
        "address": "东方路778号",
        "name": "上海紫金山大酒店（江苏大厦）",
        "lnglat": "121.523474,31.227776",
        "count": 2
    },
    {
        "address": "东方路796号",
        "name": "陆家嘴96广场",
        "lnglat": "120.577056,30.627565",
        "count": 18
    },
    {
        "address": "东方路800号",
        "name": "宝安大厦",
        "lnglat": "120.576069,30.628516",
        "count": 10
    },
    {
        "address": "东方路818号",
        "name": "众城大厦",
        "lnglat": "120.577014,30.627861",
        "count": 2
    },
    {
        "address": "东方路838号",
        "name": "齐鲁大厦",
        "lnglat": "120.576989,30.628250",
        "count": 4
    },
    {
        "address": "东方路877号",
        "name": "嘉兴大厦",
        "lnglat": "121.527975,31.224505",
        "count": 18
    },
    {
        "address": "东方路971号",
        "name": "钱江大厦",
        "lnglat": "121.529958,31.222815",
        "count": 5
    },
    {
        "address": "东方路985号",
        "name": "一百大厦",
        "lnglat": "119.167596,36.712816",
        "count": 10
    },
    {
        "address": "东方路989号",
        "name": "中达广场",
        "lnglat": "120.957495,30.973939",
        "count": 3
    },
    {
        "address": "东汉阳路309弄",
        "name": "名江七星城",
        "lnglat": "121.494385,31.251952",
        "count": 140
    },
    {
        "address": "东汉阳路338弄",
        "name": "宇泰公寓",
        "lnglat": "121.496484,31.251371",
        "count": 24
    },
    {
        "address": "东湖路20号",
        "name": "东湖WE",
        "lnglat": "102.492349,24.923877",
        "count": 4
    },
    {
        "address": "东环龙路181弄",
        "name": "欣晟家园",
        "lnglat": "121.527807,31.201332",
        "count": 1
    },
    {
        "address": "东建路228弄",
        "name": "东方龙苑",
        "lnglat": "121.532615,31.201630",
        "count": 91
    },
    {
        "address": "东江湾路151号",
        "name": "绿地创客",
        "lnglat": "121.479736,31.266645",
        "count": 25
    },
    {
        "address": "东江湾路188号",
        "name": "空间188创意园",
        "lnglat": "121.480505,31.267053",
        "count": 21
    },
    {
        "address": "东江湾路444号",
        "name": "虹口足球场(商务区)",
        "lnglat": "121.480438,31.270880",
        "count": 39
    },
    {
        "address": "东靖路1831号",
        "name": "先行国际综合商务楼（上海）",
        "lnglat": "121.607843,31.293072",
        "count": 3
    },
    {
        "address": "东兰路1111号",
        "name": "欧风花都",
        "lnglat": "121.385306,31.153007",
        "count": 24
    },
    {
        "address": "东兰路238号",
        "name": "古美创智中心",
        "lnglat": "121.401729,31.157986",
        "count": 7
    },
    {
        "address": "东明路2000号",
        "name": "2049五玠坊",
        "lnglat": "121.516308,31.156981",
        "count": 40
    },
    {
        "address": "东明路355弄",
        "name": "博爱家园",
        "lnglat": "121.510919,31.184586",
        "count": 64
    },
    {
        "address": "东明路511弄",
        "name": "昌里雅苑",
        "lnglat": "121.510712,31.178701",
        "count": 45
    },
    {
        "address": "东明路660弄",
        "name": "住友昌盛新苑",
        "lnglat": "121.509070,31.177952",
        "count": 49
    },
    {
        "address": "东三街30号",
        "name": "东三街大楼",
        "lnglat": "111.001834,22.913266",
        "count": 8
    },
    {
        "address": "东三里桥路211弄",
        "name": "爱嘉苑",
        "lnglat": "121.513874,31.200284",
        "count": 8
    },
    {
        "address": "东体育会路100弄2号",
        "name": "兴华小区",
        "lnglat": "121.481719,31.274209",
        "count": 10
    },
    {
        "address": "东体育会路1071弄",
        "name": "商建大楼",
        "lnglat": "121.489669,31.288476",
        "count": 6
    },
    {
        "address": "东体育会路390号",
        "name": "上海外国语大学贤达经济人文学院",
        "lnglat": "121.484065,31.278468",
        "count": 2
    },
    {
        "address": "东体育会路816号",
        "name": "置汇谷",
        "lnglat": "121.487236,31.283531",
        "count": 18
    },
    {
        "address": "东体育会路880弄",
        "name": "银联花园",
        "lnglat": "121.486075,31.285126",
        "count": 21
    },
    {
        "address": "东新路355弄",
        "name": "地方天园",
        "lnglat": "108.628936,34.104970",
        "count": 48
    },
    {
        "address": "东新路88弄",
        "name": "新湖明珠城北区",
        "lnglat": "109.950669,33.861336",
        "count": 188
    },
    {
        "address": "东新路99弄",
        "name": "新湖明珠城南区",
        "lnglat": "103.494845,29.597763",
        "count": 174
    },
    {
        "address": "东新支路90弄8号",
        "name": "东新苑",
        "lnglat": "121.425833,31.243014",
        "count": 9
    },
    {
        "address": "东绣路1155弄",
        "name": "中福公寓",
        "lnglat": "121.535069,31.198824",
        "count": 23
    },
    {
        "address": "东绣路1389弄",
        "name": "涵合园",
        "lnglat": "121.532071,31.199580",
        "count": 77
    },
    {
        "address": "东绣路99弄",
        "name": "陆家嘴中央公寓",
        "lnglat": "121.541140,31.214810",
        "count": 216
    },
    {
        "address": "东余杭路1320、1350号",
        "name": "唐山新苑",
        "lnglat": "121.508293,31.260715",
        "count": 14
    },
    {
        "address": "东育路195号",
        "name": "陆悦汇",
        "lnglat": "121.481586,31.158945",
        "count": 6
    },
    {
        "address": "东园路18号",
        "name": "中国金融信息中心",
        "lnglat": "109.696734,23.964702",
        "count": 31
    },
    {
        "address": "东园三村331号、335号",
        "name": "东泰大楼",
        "lnglat": "116.685161,23.631968",
        "count": 14
    },
    {
        "address": "东长治路399号",
        "name": "双狮汇",
        "lnglat": "121.496329,31.250094",
        "count": 32
    },
    {
        "address": "东诸安浜路180弄1-23号",
        "name": "东浜小区",
        "lnglat": "121.432933,31.218590",
        "count": 5
    },
    {
        "address": "洞泾镇同乐路699号",
        "name": "智象中心",
        "lnglat": "121.269744,31.092015",
        "count": 6
    },
    {
        "address": "洞宁路655弄",
        "name": "润景苑",
        "lnglat": "121.278321,31.076286",
        "count": 243
    },
    {
        "address": "洞塔路500弄",
        "name": "樾山璟里",
        "lnglat": "121.240162,31.096412",
        "count": 51
    },
    {
        "address": "洞伟路650弄",
        "name": "泗泾海康苑",
        "lnglat": "121.264926,31.103814",
        "count": 20
    },
    {
        "address": "洞伟路655弄1-13号",
        "name": "塘和家园文康苑",
        "lnglat": "121.262559,31.103951",
        "count": 12
    },
    {
        "address": "洞舟路459号",
        "name": "亿弘实业工业园",
        "lnglat": "121.253890,31.084401",
        "count": 2
    },
    {
        "address": "都会路1555号",
        "name": "乐城公寓",
        "lnglat": "121.421736,31.056740",
        "count": 4
    },
    {
        "address": "都会路1699号",
        "name": "全方位科技园",
        "lnglat": "121.420167,31.059297",
        "count": 139
    },
    {
        "address": "都会路1999-2059号",
        "name": "上海晶碧科技园",
        "lnglat": "104.063756,30.599491",
        "count": 33
    },
    {
        "address": "都会路2626弄",
        "name": "众秀新家园",
        "lnglat": "121.415321,31.077715",
        "count": 64
    },
    {
        "address": "都市路1800弄",
        "name": "金榜新苑",
        "lnglat": "121.414574,31.057059",
        "count": 69
    },
    {
        "address": "都市路2501弄",
        "name": "金铭文博水景苑",
        "lnglat": "121.404530,31.068807",
        "count": 128
    },
    {
        "address": "都市路2888弄",
        "name": "都市府邸",
        "lnglat": "121.403830,31.073603",
        "count": 20
    },
    {
        "address": "都市路384号",
        "name": "铂晶商务楼",
        "lnglat": "121.423028,31.035303",
        "count": 5
    },
    {
        "address": "都市路388弄",
        "name": "复地北桥城三期",
        "lnglat": "121.424544,31.036426",
        "count": 115
    },
    {
        "address": "都市路399弄",
        "name": "复地北桥城一二期",
        "lnglat": "121.422167,31.035581",
        "count": 70
    },
    {
        "address": "都市路431号",
        "name": "铂客公寓",
        "lnglat": "121.422108,31.037315",
        "count": 9
    },
    {
        "address": "都市路4418号",
        "name": "金铭大厦",
        "lnglat": "121.394071,31.098022",
        "count": 1
    },
    {
        "address": "都市路4580弄",
        "name": "春申复地城二期",
        "lnglat": "121.393180,31.100234",
        "count": 118
    },
    {
        "address": "都市路4633弄",
        "name": "春申城四季苑",
        "lnglat": "121.391071,31.100662",
        "count": 40
    },
    {
        "address": "都市路4855号",
        "name": "解放日报大厦（莘庄总部）",
        "lnglat": "121.389973,31.104037",
        "count": 4
    },
    {
        "address": "都市路778号",
        "name": "都市富苑",
        "lnglat": "121.419630,31.043051",
        "count": 120
    },
    {
        "address": "都园路4288号",
        "name": "都园创意园",
        "lnglat": "121.401625,31.097818",
        "count": 25
    },
    {
        "address": "杜鹃路188弄",
        "name": "上海市浦东新区花木星晨苑小区",
        "lnglat": "103.903200,30.797228",
        "count": 12
    },
    {
        "address": "杜鹃路192号",
        "name": "晖霖广场",
        "lnglat": "121.549770,31.202643",
        "count": 13
    },
    {
        "address": "杜鹃路58弄",
        "name": "锦绣前程阳光苑",
        "lnglat": "121.547542,31.201593",
        "count": 27
    },
    {
        "address": "渡桥路288弄",
        "name": "保利首创颂",
        "lnglat": "121.548076,31.113821",
        "count": 185
    },
    {
        "address": "渡桥路78弄",
        "name": "中骏柏景湾(上海)",
        "lnglat": "121.547011,31.118046",
        "count": 96
    },
    {
        "address": "峨眉路299弄",
        "name": "耀江国际公寓",
        "lnglat": "121.490341,31.249539",
        "count": 10
    },
    {
        "address": "峨山路485弄",
        "name": "山泉花苑",
        "lnglat": "121.525113,31.215156",
        "count": 28
    },
    {
        "address": "峨山路613号",
        "name": "尚街loft上海双创产业园",
        "lnglat": "121.521397,31.214402",
        "count": 1
    },
    {
        "address": "峨山路679弄",
        "name": "浦江映象",
        "lnglat": "121.520223,31.214081",
        "count": 30
    },
    {
        "address": "峨山路681弄",
        "name": "越富豪庭",
        "lnglat": "121.519436,31.213734",
        "count": 24
    },
    {
        "address": "峨山路91弄101号5号楼",
        "name": "陆家嘴科技园区",
        "lnglat": "121.531605,31.217184",
        "count": 5
    },
    {
        "address": "峨山路91弄200号",
        "name": "新鹏大厦",
        "lnglat": "121.532003,31.219022",
        "count": 13
    },
    {
        "address": "峨山路91弄48号",
        "name": "开伦鑫座",
        "lnglat": "121.532983,31.216250",
        "count": 12
    },
    {
        "address": "鄂尔多斯路67弄",
        "name": "祁秀雅苑",
        "lnglat": "121.390915,31.295417",
        "count": 46
    },
    {
        "address": "鄂尔多斯路98弄",
        "name": "南秀雅苑",
        "lnglat": "121.391066,31.295380",
        "count": 138
    },
    {
        "address": "洱海路99弄",
        "name": "春申玫瑰苑",
        "lnglat": "121.399261,31.105894",
        "count": 160
    },
    {
        "address": "法华镇路123弄",
        "name": "法华苑",
        "lnglat": "121.432050,31.203200",
        "count": 4
    },
    {
        "address": "法华镇路129号",
        "name": "上海新华豪庭",
        "lnglat": "121.431603,31.203151",
        "count": 18
    },
    {
        "address": "法华镇路310号",
        "name": "晶采名人大厦",
        "lnglat": "121.429240,31.203427",
        "count": 1
    },
    {
        "address": "法华镇路457弄/483弄",
        "name": "海富公寓",
        "lnglat": "121.426687,31.204997",
        "count": 25
    },
    {
        "address": "法华镇路525号",
        "name": "法华525",
        "lnglat": "121.425560,31.205039",
        "count": 16
    },
    {
        "address": "法华镇路555号",
        "name": "法华门大厦",
        "lnglat": "121.424197,31.205607",
        "count": 3
    },
    {
        "address": "法华镇路881弄",
        "name": "东湖名苑",
        "lnglat": "121.419830,31.207718",
        "count": 37
    },
    {
        "address": "番禺路1028号",
        "name": "番禺路1028号(上海数娱大厦)",
        "lnglat": "121.427794,31.194467",
        "count": 15
    },
    {
        "address": "番禺路290弄28号",
        "name": "长发花园",
        "lnglat": "121.428216,31.205400",
        "count": 8
    },
    {
        "address": "番禺路300弄7号",
        "name": "鑫汉森商务园区(汉森商务园区)",
        "lnglat": "121.428779,31.204720",
        "count": 2
    },
    {
        "address": "番禺路5号",
        "name": "盛源大厦",
        "lnglat": "121.430050,31.209980",
        "count": 5
    },
    {
        "address": "番禺路617弄1号",
        "name": "淮新大楼",
        "lnglat": "121.429918,31.200495",
        "count": 3
    },
    {
        "address": "番禺路801弄",
        "name": "番禺路801弄",
        "lnglat": "121.429355,31.197834",
        "count": 10
    },
    {
        "address": "番禺路888号",
        "name": "魔方公寓番禺路店",
        "lnglat": "121.428095,31.196014",
        "count": 3
    },
    {
        "address": "番禺路900号",
        "name": "番禺大楼（上海）",
        "lnglat": "121.428085,31.195698",
        "count": 6
    },
    {
        "address": "番愚路1099弄",
        "name": "东方时空公寓",
        "lnglat": "121.425458,31.193736",
        "count": 18
    },
    {
        "address": "番愚路390号",
        "name": "时代大厦",
        "lnglat": "121.428726,31.203729",
        "count": 8
    },
    {
        "address": "繁锦路1288弄",
        "name": "新城碧翠园",
        "lnglat": "121.584624,31.306133",
        "count": 34
    },
    {
        "address": "繁锦路688弄",
        "name": "中冶尚城",
        "lnglat": "121.586163,31.314350",
        "count": 45
    },
    {
        "address": "繁兴路1000弄",
        "name": "景平苑",
        "lnglat": "121.290155,31.220081",
        "count": 155
    },
    {
        "address": "繁兴路300弄",
        "name": "西郊九韵城",
        "lnglat": "121.294378,31.211080",
        "count": 44
    },
    {
        "address": "繁兴路333号",
        "name": "虹桥晶邸",
        "lnglat": "121.293208,31.211035",
        "count": 14
    },
    {
        "address": "繁兴路399弄1号",
        "name": "华漕生活馆",
        "lnglat": "121.291885,31.209930",
        "count": 8
    },
    {
        "address": "繁兴路46号",
        "name": "魔方公寓(国家会展中心店)",
        "lnglat": "121.298337,31.207817",
        "count": 7
    },
    {
        "address": "繁兴路99-1临",
        "name": "泊寓（虹桥繁星店）",
        "lnglat": "121.297351,31.207358",
        "count": 4
    },
    {
        "address": "方塔北路605号",
        "name": "企德天地",
        "lnglat": "121.247505,31.021022",
        "count": 9
    },
    {
        "address": "方斜路525号",
        "name": "明华大厦",
        "lnglat": "121.483004,31.212548",
        "count": 4
    },
    {
        "address": "方竹路166弄1-158号",
        "name": "滴水湖馨苑北区",
        "lnglat": "121.910791,30.894518",
        "count": 40
    },
    {
        "address": "方竹路333弄1-153号",
        "name": "滴水湖馨苑南区",
        "lnglat": "121.908463,30.892150",
        "count": 14
    },
    {
        "address": "方竹路423弄",
        "name": "馨雅铭苑",
        "lnglat": "121.904608,30.893824",
        "count": 19
    },
    {
        "address": "方竹路789号",
        "name": "馨香铂舍（滴水湖馨苑悦湾）",
        "lnglat": "121.900495,30.892926",
        "count": 35
    },
    {
        "address": "芳甸路199弄",
        "name": "大拇指广场",
        "lnglat": "121.559664,31.226837",
        "count": 7
    },
    {
        "address": "芳甸路333号",
        "name": "水清木华国际公寓",
        "lnglat": "121.561181,31.225120",
        "count": 165
    },
    {
        "address": "芳华路139号",
        "name": "芳华德必运动LOFT",
        "lnglat": "112.409297,34.676936",
        "count": 8
    },
    {
        "address": "芳亭路566弄1-17号",
        "name": "虹桥舒雅苑",
        "lnglat": "119.392337,25.718431",
        "count": 92
    },
    {
        "address": "放鹤路2323号",
        "name": "万顺苑小区",
        "lnglat": "121.423510,31.045076",
        "count": 85
    },
    {
        "address": "飞虹路238弄、258弄",
        "name": "金鑫怡苑",
        "lnglat": "121.502246,31.263000",
        "count": 5
    },
    {
        "address": "飞虹路288弄",
        "name": "宇泰景苑",
        "lnglat": "121.503620,31.265001",
        "count": 39
    },
    {
        "address": "菲拉路45号",
        "name": "众上文化大厦",
        "lnglat": "121.589967,31.347311",
        "count": 13
    },
    {
        "address": "汾西路88弄",
        "name": "临汾名城二期",
        "lnglat": "121.467863,31.315321",
        "count": 135
    },
    {
        "address": "汾阳路138号",
        "name": "轻科大厦",
        "lnglat": "121.452930,31.210004",
        "count": 14
    },
    {
        "address": "汾阳路77号",
        "name": "安盛商务楼",
        "lnglat": "121.454309,31.210790",
        "count": 20
    },
    {
        "address": "丰皓路138弄",
        "name": "乾皓苑",
        "lnglat": "121.394732,31.305305",
        "count": 136
    },
    {
        "address": "丰皓路658弄1-14号",
        "name": "丰皓苑",
        "lnglat": "121.389015,31.306328",
        "count": 104
    },
    {
        "address": "丰虹路199号星月虹桥中心",
        "name": "德必虹桥国际WE",
        "lnglat": "121.323576,31.205163",
        "count": 68
    },
    {
        "address": "丰华路1200号",
        "name": "富锋科技园",
        "lnglat": "119.212280,36.771731",
        "count": 14
    },
    {
        "address": "丰镇路828号",
        "name": "绿亮科创园(丰镇路)",
        "lnglat": "121.468287,31.304558",
        "count": 7
    },
    {
        "address": "丰庄北路5弄",
        "name": "住嘉佳园",
        "lnglat": "121.355177,31.249762",
        "count": 52
    },
    {
        "address": "丰庄路99弄",
        "name": "金沙丽晶苑一期",
        "lnglat": "121.360765,31.244026",
        "count": 72
    },
    {
        "address": "丰庄西路460弄",
        "name": "绿地新丰苑",
        "lnglat": "121.355385,31.245564",
        "count": 24
    },
    {
        "address": "枫兰路999弄",
        "name": "华发招商依云四季",
        "lnglat": "121.020831,30.911066",
        "count": 75
    },
    {
        "address": "枫林路380号",
        "name": "枫林国际中心一期",
        "lnglat": "121.457743,31.191108",
        "count": 13
    },
    {
        "address": "枫林路420号",
        "name": "枫林国际中心二期",
        "lnglat": "121.458501,31.190303",
        "count": 6
    },
    {
        "address": "枫林路485号",
        "name": "枫林Link",
        "lnglat": "121.459733,31.190289",
        "count": 5
    },
    {
        "address": "枫湾路680号",
        "name": "正荣璟园",
        "lnglat": "121.020431,30.898900",
        "count": 180
    },
    {
        "address": "凤城路1号",
        "name": "同和凤城园（凤城巷）",
        "lnglat": "116.759629,33.967774",
        "count": 3
    },
    {
        "address": "凤城路5号",
        "name": "凤城巷二期",
        "lnglat": "116.756223,33.968076",
        "count": 12
    },
    {
        "address": "凤坚塘路65弄",
        "name": "欣乐苑东苑",
        "lnglat": "121.238351,31.185482",
        "count": 130
    },
    {
        "address": "凤马塘路200弄",
        "name": "瑞和锦庭东区",
        "lnglat": "121.229550,31.180953",
        "count": 136
    },
    {
        "address": "凤马塘路205弄",
        "name": "瑞和锦庭西区",
        "lnglat": "121.228626,31.180532",
        "count": 158
    },
    {
        "address": "凤强塘路1000弄",
        "name": "春江三月一期",
        "lnglat": "121.229696,31.187185",
        "count": 112
    },
    {
        "address": "凤强塘路1120弄",
        "name": "春江三月二期",
        "lnglat": "121.229646,31.186975",
        "count": 16
    },
    {
        "address": "凤塘强路1218弄",
        "name": "春江三月三期",
        "lnglat": "115.469001,37.036940",
        "count": 54
    },
    {
        "address": "凤徐路85弄",
        "name": "新丰公寓",
        "lnglat": "121.235233,31.189520",
        "count": 50
    },
    {
        "address": "凤阳路288号",
        "name": "黄浦大楼",
        "lnglat": "120.719010,31.488060",
        "count": 7
    },
    {
        "address": "凤阳路358弄",
        "name": "金瓯万国大厦",
        "lnglat": "120.706736,31.489104",
        "count": 16
    },
    {
        "address": "凤阳路588弄",
        "name": "静安华庭一街区",
        "lnglat": "121.465289,31.233363",
        "count": 16
    },
    {
        "address": "奉炮公路1368号",
        "name": "阿莱德科技园",
        "lnglat": "121.515377,30.848391",
        "count": 3
    },
    {
        "address": "奉浦大道518号",
        "name": "海业大厦",
        "lnglat": "121.451580,30.941561",
        "count": 11
    },
    {
        "address": "扶兰路9弄",
        "name": "南渡新苑",
        "lnglat": "121.441191,30.987401",
        "count": 28
    },
    {
        "address": "芙蓉江路276弄1号",
        "name": "天华公寓",
        "lnglat": "121.395275,31.211953",
        "count": 12
    },
    {
        "address": "芙蓉江路388弄",
        "name": "仁恒河滨花园会所",
        "lnglat": "121.394447,31.215203",
        "count": 31
    },
    {
        "address": "芙蓉江路555号",
        "name": "新天地河滨花园",
        "lnglat": "121.397899,31.216078",
        "count": 78
    },
    {
        "address": "福定路289弄59号",
        "name": "万科尚景苑",
        "lnglat": "121.185956,31.201545",
        "count": 141
    },
    {
        "address": "福光路160弄",
        "name": "贤浦名苑",
        "lnglat": "119.358792,26.079216",
        "count": 22
    },
    {
        "address": "福海路777号",
        "name": "嘉福汇商务广场",
        "lnglat": "121.241955,31.363872",
        "count": 31
    },
    {
        "address": "福建中路205号",
        "name": "中怡公寓",
        "lnglat": "121.481357,31.233984",
        "count": 7
    },
    {
        "address": "福宁路60号",
        "name": "VIP陪练办公楼",
        "lnglat": "121.532480,31.254183",
        "count": 5
    },
    {
        "address": "福泉路111号",
        "name": "神州数码（上海）科技园",
        "lnglat": "121.357807,31.217571",
        "count": 6
    },
    {
        "address": "福泉路123弄",
        "name": "世纪之春花园",
        "lnglat": "121.357420,31.215750",
        "count": 144
    },
    {
        "address": "福泉路550弄",
        "name": "樱源晶舍",
        "lnglat": "121.360355,31.202492",
        "count": 71
    },
    {
        "address": "福山路309号",
        "name": "竹园商务公寓",
        "lnglat": "121.529511,31.229532",
        "count": 8
    },
    {
        "address": "福山路388号",
        "name": "越秀大厦",
        "lnglat": "121.530674,31.224768",
        "count": 72
    },
    {
        "address": "福山路450号",
        "name": "新天国际大厦",
        "lnglat": "121.530955,31.223817",
        "count": 6
    },
    {
        "address": "福山路455号",
        "name": "全华信息大厦",
        "lnglat": "121.531972,31.224374",
        "count": 31
    },
    {
        "address": "福山路458号",
        "name": "同盛大厦",
        "lnglat": "121.531382,31.223165",
        "count": 14
    },
    {
        "address": "福山路500号",
        "name": "城建国际中心",
        "lnglat": "121.531696,31.222502",
        "count": 62
    },
    {
        "address": "福佑路333号",
        "name": "时代城隍广场",
        "lnglat": "121.489412,31.228192",
        "count": 3
    },
    {
        "address": "福州路318号",
        "name": "华设大厦(浦汇大厦)",
        "lnglat": "118.772808,34.123951",
        "count": 22
    },
    {
        "address": "福州路465号",
        "name": "德必上海书城WE",
        "lnglat": "121.481408,31.233120",
        "count": 50
    },
    {
        "address": "福州路655号",
        "name": "黄浦图书馆大厦",
        "lnglat": "121.478719,31.232071",
        "count": 2
    },
    {
        "address": "福州路666号",
        "name": "华鑫海欣大厦",
        "lnglat": "120.570682,27.930221",
        "count": 3
    },
    {
        "address": "抚远路1211弄",
        "name": "正荣国领(上海)",
        "lnglat": "121.362650,31.408494",
        "count": 179
    },
    {
        "address": "抚远路1288弄",
        "name": "美兰湖中华园",
        "lnglat": "121.359793,31.408243",
        "count": 528
    },
    {
        "address": "抚远路538弄",
        "name": "万科琥珀臻园",
        "lnglat": "121.365503,31.396489",
        "count": 167
    },
    {
        "address": "抚远路699弄",
        "name": "远洋博悦花园中心",
        "lnglat": "121.367098,31.397693",
        "count": 4
    },
    {
        "address": "阜康路19弄",
        "name": "玉兰一村商住楼",
        "lnglat": "111.567472,22.768948",
        "count": 8
    },
    {
        "address": "复兴东路248号",
        "name": "中复大楼",
        "lnglat": "121.499528,31.220501",
        "count": 3
    },
    {
        "address": "复兴东路2号",
        "name": "豫园股份",
        "lnglat": "117.342306,23.955662",
        "count": 2
    },
    {
        "address": "复兴中路1199号",
        "name": "明园商务中心",
        "lnglat": "121.458812,31.212414",
        "count": 7
    },
    {
        "address": "复兴中路1号",
        "name": "申能国际大厦",
        "lnglat": "107.894695,28.092799",
        "count": 5
    },
    {
        "address": "复兴中路369号",
        "name": "大同商务大厦",
        "lnglat": "121.475470,31.216116",
        "count": 1
    },
    {
        "address": "富城路99号",
        "name": "震旦国际大楼",
        "lnglat": "120.934578,31.422563",
        "count": 2
    },
    {
        "address": "富都路111弄",
        "name": "都市星城",
        "lnglat": "121.389694,31.102395",
        "count": 128
    },
    {
        "address": "富贵东路229弄 ",
        "name": "古北国际广场",
        "lnglat": "112.331071,22.196367",
        "count": 54
    },
    {
        "address": "富国路199弄(富国路银春路交汇处)",
        "name": "禹洲府",
        "lnglat": "113.826787,23.296058",
        "count": 96
    },
    {
        "address": "富联二路99号（富联二路177弄1号等）",
        "name": "保集e智谷",
        "lnglat": "121.409230,31.371416",
        "count": 4
    },
    {
        "address": "富民路291号",
        "name": "悟锦世纪大楼",
        "lnglat": "107.794551,26.198318",
        "count": 1
    },
    {
        "address": "富民路83号",
        "name": "巨富大厦",
        "lnglat": "113.640677,22.929085",
        "count": 1
    },
    {
        "address": "富民路89号",
        "name": "巨富大厦(上海)",
        "lnglat": "104.898999,25.075555",
        "count": 2
    },
    {
        "address": "富平路399弄",
        "name": "中环家园二期",
        "lnglat": "121.413951,31.262810",
        "count": 103
    },
    {
        "address": "富平路889弄",
        "name": "万里雅筑",
        "lnglat": "121.403842,31.265339",
        "count": 140
    },
    {
        "address": "富特北路258号",
        "name": "高华大楼",
        "lnglat": "121.595903,31.341466",
        "count": 1
    },
    {
        "address": "富特北路33号",
        "name": "卓越金融大厦",
        "lnglat": "121.593134,31.347499",
        "count": 9
    },
    {
        "address": "富特北路353号",
        "name": "凯邦大楼",
        "lnglat": "121.601210,31.336042",
        "count": 13
    },
    {
        "address": "富特北路399号",
        "name": "华三实业",
        "lnglat": "121.602178,31.335148",
        "count": 4
    },
    {
        "address": "富特北路432号",
        "name": "万荣大厦",
        "lnglat": "121.599943,31.336090",
        "count": 9
    },
    {
        "address": "富特北路500号",
        "name": "京贸大厦",
        "lnglat": "121.601867,31.334083",
        "count": 9
    },
    {
        "address": "富特东三路526号",
        "name": "外高桥国际智能制造服务产业园",
        "lnglat": "121.628670,31.299507",
        "count": 27
    },
    {
        "address": "富特东一路200号",
        "name": "嘉利斯大楼",
        "lnglat": "121.600818,31.343848",
        "count": 4
    },
    {
        "address": "富特南路301号",
        "name": "松港U库",
        "lnglat": "121.613026,31.306420",
        "count": 10
    },
    {
        "address": "富特西三路77号",
        "name": "北八道集团大厦",
        "lnglat": "121.605707,31.309009",
        "count": 22
    },
    {
        "address": "富特西三路77号10幢",
        "name": "信泰融资大厦",
        "lnglat": "121.605299,31.309462",
        "count": 22
    },
    {
        "address": "富特西一路135号",
        "name": "东上海石化商务楼",
        "lnglat": "121.591020,31.341942",
        "count": 10
    },
    {
        "address": "富特西一路139号",
        "name": "中国石化物资大厦",
        "lnglat": "121.591082,31.342340",
        "count": 10
    },
    {
        "address": "富特西一路355号",
        "name": "高翔大厦",
        "lnglat": "121.594140,31.339206",
        "count": 11
    },
    {
        "address": "富岩路60号",
        "name": "卓越维港",
        "lnglat": "121.375690,31.020829",
        "count": 18
    },
    {
        "address": "富蕴路555弄",
        "name": "景河名苑",
        "lnglat": "121.246694,31.370522",
        "count": 148
    },
    {
        "address": "富竹路39弄",
        "name": "秋月朗庭",
        "lnglat": "121.461823,30.929119",
        "count": 228
    },
    {
        "address": "富卓路789号65栋-79栋",
        "name": "马桥景城品雅苑三期",
        "lnglat": "121.380541,31.025126",
        "count": 54
    },
    {
        "address": "港辉路372号",
        "name": "海滨时代大厦",
        "lnglat": "121.856388,30.868631",
        "count": 22
    },
    {
        "address": "高安路30号",
        "name": "华绮公寓",
        "lnglat": "121.445344,31.203461",
        "count": 7
    },
    {
        "address": "高安路61弄",
        "name": "汇成花园",
        "lnglat": "121.446433,31.202951",
        "count": 3
    },
    {
        "address": "高潮路215号",
        "name": "北虹桥松日中心",
        "lnglat": "121.334767,31.238744",
        "count": 21
    },
    {
        "address": "高城路200弄",
        "name": "天鹅泉公寓",
        "lnglat": "113.448996,31.949044",
        "count": 63
    },
    {
        "address": "高登山路350弄",
        "name": "咏泽苑",
        "lnglat": "121.205910,31.126820",
        "count": 120
    },
    {
        "address": "高光路215弄99号",
        "name": "中国北斗产业技术创新西虹桥基地高光路园区",
        "lnglat": "121.311696,31.160493",
        "count": 16
    },
    {
        "address": "高技路205弄",
        "name": "5G产业基地",
        "lnglat": "121.293664,31.097138",
        "count": 40
    },
    {
        "address": "高技路655号",
        "name": "绿亮科创园(高技路)",
        "lnglat": "121.292864,31.104923",
        "count": 27
    },
    {
        "address": "高泾路599号",
        "name": "中国北斗产业基地",
        "lnglat": "121.293589,31.164192",
        "count": 35
    },
    {
        "address": "高泾路999弄",
        "name": "高景花园",
        "lnglat": "121.291084,31.168778",
        "count": 140
    },
    {
        "address": "高科东路500弄",
        "name": "联明一番空间",
        "lnglat": "121.653128,31.210740",
        "count": 34
    },
    {
        "address": "高科东路与庆利路交界口东北角",
        "name": "绿地海岸城",
        "lnglat": "121.727952,31.225688",
        "count": 4
    },
    {
        "address": "高科西路1862号",
        "name": "浦东外贸大楼",
        "lnglat": "121.530464,31.186894",
        "count": 5
    },
    {
        "address": "高科中路1976号",
        "name": "衡谷1976",
        "lnglat": "121.619578,31.198314",
        "count": 16
    },
    {
        "address": "高平路598弄",
        "name": "阳城美景",
        "lnglat": "115.471339,35.245429",
        "count": 66
    },
    {
        "address": "高青路2861弄",
        "name": "金色里程",
        "lnglat": "121.528549,31.161482",
        "count": 192
    },
    {
        "address": "高青路2878号",
        "name": "万科新里程一期",
        "lnglat": "121.527402,31.159957",
        "count": 276
    },
    {
        "address": "高斯路965弄",
        "name": "丹芳苑",
        "lnglat": "121.611545,31.201839",
        "count": 30
    },
    {
        "address": "高台路1333弄",
        "name": "旭辉华庭",
        "lnglat": "121.245350,31.348173",
        "count": 42
    },
    {
        "address": "高雄路189号",
        "name": "望江苑",
        "lnglat": "114.282299,30.604093",
        "count": 3
    },
    {
        "address": "高逸路111号",
        "name": "宝锦国际大厦",
        "lnglat": "121.487960,31.324432",
        "count": 14
    },
    {
        "address": "高逸路29号",
        "name": "复客北翼创想中心",
        "lnglat": "121.486577,31.321081",
        "count": 16
    },
    {
        "address": "高邮路1号、3号",
        "name": "兴盛公寓",
        "lnglat": "121.439325,31.210554",
        "count": 6
    },
    {
        "address": "高跃路176号，殷高西路608号，殷高西路638号",
        "name": "景瑞生活广场",
        "lnglat": "121.471431,31.319770",
        "count": 21
    },
    {
        "address": "高跃路77弄",
        "name": "三邻桥",
        "lnglat": "121.473194,31.318491",
        "count": 7
    },
    {
        "address": "高州路100弄",
        "name": "金辉天鹅湾",
        "lnglat": "121.472684,30.925523",
        "count": 92
    },
    {
        "address": "公平路168号",
        "name": "北外滩来福士办公楼西塔",
        "lnglat": "121.504554,31.254834",
        "count": 128
    },
    {
        "address": "公平路761号",
        "name": "虹业大楼",
        "lnglat": "121.499736,31.259403",
        "count": 1
    },
    {
        "address": "公平路768弄",
        "name": "东方都市景苑",
        "lnglat": "125.373899,43.871308",
        "count": 37
    },
    {
        "address": "公园路348号",
        "name": "青浦科技园商务中心",
        "lnglat": "121.119407,31.149547",
        "count": 5
    },
    {
        "address": "公园路700号",
        "name": "东方商厦青浦店",
        "lnglat": "121.112380,31.148440",
        "count": 3
    },
    {
        "address": "拱北路289弄29支弄1-28号",
        "name": "华钜御庭二期",
        "lnglat": "121.774748,31.055864",
        "count": 198
    },
    {
        "address": "拱北路313弄",
        "name": "汇港国际商务广场",
        "lnglat": "121.772793,31.055729",
        "count": 23
    },
    {
        "address": "拱北路336弄",
        "name": "东原逸墅",
        "lnglat": "121.774549,31.057741",
        "count": 146
    },
    {
        "address": "拱北路398弄",
        "name": "海曲雅苑",
        "lnglat": "121.770896,31.056653",
        "count": 192
    },
    {
        "address": "拱川路411弄",
        "name": "荣春苑北苑",
        "lnglat": "121.743618,31.064468",
        "count": 173
    },
    {
        "address": "拱海路240弄",
        "name": "民乐城惠康苑(东苑)",
        "lnglat": "121.740003,31.069278",
        "count": 37
    },
    {
        "address": "拱海路459",
        "name": "兰丽苑西苑",
        "lnglat": "121.745577,31.071301",
        "count": 143
    },
    {
        "address": "拱海路595弄",
        "name": "兰丽苑东苑",
        "lnglat": "121.747610,31.071668",
        "count": 148
    },
    {
        "address": "拱海路755弄",
        "name": "民乐汇雅苑",
        "lnglat": "121.751177,31.072337",
        "count": 110
    },
    {
        "address": "拱海路78弄",
        "name": "民乐城惠康苑(西苑)",
        "lnglat": "121.736829,31.068665",
        "count": 91
    },
    {
        "address": "拱海路79弄",
        "name": "民乐城惠康苑",
        "lnglat": "121.736569,31.069595",
        "count": 364
    },
    {
        "address": "拱极路2368弄29支弄",
        "name": "华钜御庭一期",
        "lnglat": "121.777030,31.053932",
        "count": 110
    },
    {
        "address": "拱极路2626弄",
        "name": "新凤凰城",
        "lnglat": "121.771385,31.053285",
        "count": 116
    },
    {
        "address": "拱乐路2400弄",
        "name": "荣春苑南苑",
        "lnglat": "121.743113,31.062713",
        "count": 113
    },
    {
        "address": "拱鸣路60弄",
        "name": "丽冬苑",
        "lnglat": "121.744681,31.059798",
        "count": 159
    },
    {
        "address": "拱荣路115弄",
        "name": "玉秀苑西苑",
        "lnglat": "121.761688,31.072502",
        "count": 20
    },
    {
        "address": "拱荣路175弄",
        "name": "玉秀苑东苑",
        "lnglat": "121.761688,31.072502",
        "count": 22
    },
    {
        "address": "拱优路79弄",
        "name": "汇雅苑南苑",
        "lnglat": "121.750943,31.070489",
        "count": 36
    },
    {
        "address": "共富路228弄",
        "name": "共富花园",
        "lnglat": "121.428866,31.349401",
        "count": 15
    },
    {
        "address": "共富路476弄",
        "name": "富隆苑",
        "lnglat": "121.425678,31.345343",
        "count": 10
    },
    {
        "address": "共和新路111弄",
        "name": "永盛苑(上海）",
        "lnglat": "121.462971,31.243721",
        "count": 33
    },
    {
        "address": "共和新路1158号",
        "name": "达誉商务楼",
        "lnglat": "121.460276,31.261468",
        "count": 4
    },
    {
        "address": "共和新路1301号",
        "name": "蓝天绿地商务广场",
        "lnglat": "121.460319,31.263889",
        "count": 2
    },
    {
        "address": "共和新路1301号-1",
        "name": "现代交通商务区",
        "lnglat": "121.461826,31.260830",
        "count": 10
    },
    {
        "address": "共和新路1346号",
        "name": "通用大厦",
        "lnglat": "121.458513,31.264604",
        "count": 2
    },
    {
        "address": "共和新路1453弄",
        "name": "新柳公寓",
        "lnglat": "121.459348,31.266544",
        "count": 32
    },
    {
        "address": "共和新路1481号",
        "name": "红墙创意园",
        "lnglat": "121.458900,31.267180",
        "count": 7
    },
    {
        "address": "共和新路1988号",
        "name": "大宁国际商业广场办公楼",
        "lnglat": "121.452286,31.274063",
        "count": 4
    },
    {
        "address": "共和新路2399弄",
        "name": "宝华现代城",
        "lnglat": "121.454166,31.280606",
        "count": 180
    },
    {
        "address": "共和新路2449弄",
        "name": "宝华现代大厦",
        "lnglat": "121.453809,31.280145",
        "count": 17
    },
    {
        "address": "共和新路2623号",
        "name": "企联大厦（上海）",
        "lnglat": "121.452232,31.282745",
        "count": 12
    },
    {
        "address": "共和新路2802号",
        "name": "智苑文创空间",
        "lnglat": "121.450626,31.284753",
        "count": 7
    },
    {
        "address": "共和新路2993号",
        "name": "中环企业广场",
        "lnglat": "121.452044,31.288172",
        "count": 8
    },
    {
        "address": "共和新路2999弄",
        "name": "明园森林都市一期森林都市滴翠苑",
        "lnglat": "121.454475,31.288973",
        "count": 127
    },
    {
        "address": "共和新路3088弄",
        "name": "祥腾财富广场",
        "lnglat": "121.447691,31.294667",
        "count": 56
    },
    {
        "address": "共和新路318弄",
        "name": "凯成苑",
        "lnglat": "121.462478,31.248369",
        "count": 18
    },
    {
        "address": "共和新路340号",
        "name": "宝丰大厦",
        "lnglat": "121.462743,31.249003",
        "count": 4
    },
    {
        "address": "共和新路3699号、3737号",
        "name": "共和国际商务广场",
        "lnglat": "121.450242,31.304781",
        "count": 42
    },
    {
        "address": "共和新路4703弄100号",
        "name": "民主花苑",
        "lnglat": "121.448249,31.318855",
        "count": 6
    },
    {
        "address": "共和新路4727号",
        "name": "新陆国际大厦",
        "lnglat": "121.447653,31.319201",
        "count": 7
    },
    {
        "address": "共和新路5000号",
        "name": "绿地新都会（风尚天地）",
        "lnglat": "121.444090,31.322059",
        "count": 11
    },
    {
        "address": "共和新路5199号",
        "name": "骏利财富大厦",
        "lnglat": "121.445371,31.325546",
        "count": 10
    },
    {
        "address": "共和新路5308弄32号",
        "name": "上海共康创意设计园区",
        "lnglat": "121.441925,31.327783",
        "count": 8
    },
    {
        "address": "共和新路5895号",
        "name": "开伦智汇园",
        "lnglat": "121.437472,31.342764",
        "count": 7
    },
    {
        "address": "共和新路638号",
        "name": "博隆商务楼",
        "lnglat": "121.463278,31.254082",
        "count": 2
    },
    {
        "address": "共和新路688弄",
        "name": "广兴广隆公寓",
        "lnglat": "121.462859,31.254842",
        "count": 18
    },
    {
        "address": "共和新路708弄",
        "name": "天道俪晶大厦",
        "lnglat": "121.463215,31.255246",
        "count": 8
    },
    {
        "address": "共和新路736弄1号",
        "name": "灵广花园",
        "lnglat": "121.463249,31.256255",
        "count": 7
    },
    {
        "address": "共和新路912号",
        "name": "云华科技大厦",
        "lnglat": "121.462403,31.258628",
        "count": 34
    },
    {
        "address": "共和新路938号",
        "name": "共和大厦",
        "lnglat": "121.462158,31.259110",
        "count": 2
    },
    {
        "address": "贡嘎山路525弄",
        "name": "佘北家园凤尾苑",
        "lnglat": "121.206005,31.128492",
        "count": 22
    },
    {
        "address": "古北路1699号",
        "name": "古北1699",
        "lnglat": "121.402770,31.188321",
        "count": 44
    },
    {
        "address": "古北路1700弄",
        "name": "名都古北",
        "lnglat": "121.400240,31.187233",
        "count": 46
    },
    {
        "address": "古北路458号",
        "name": "佰威商务楼",
        "lnglat": "121.400424,31.209419",
        "count": 1
    },
    {
        "address": "古北路505号",
        "name": "古北路505号",
        "lnglat": "121.400848,31.209052",
        "count": 5
    },
    {
        "address": "古北路507号（仙霞路）",
        "name": "申菱大厦",
        "lnglat": "121.401037,31.208827",
        "count": 1
    },
    {
        "address": "古北路585号",
        "name": "古北公寓",
        "lnglat": "121.400714,31.207104",
        "count": 16
    },
    {
        "address": "古北路666号",
        "name": "嘉麒大厦",
        "lnglat": "121.399720,31.205350",
        "count": 5
    },
    {
        "address": "古北路678号",
        "name": "同诠大厦",
        "lnglat": "121.399507,31.204864",
        "count": 3
    },
    {
        "address": "古北路686号",
        "name": "长福公寓(上海)",
        "lnglat": "121.399586,31.204322",
        "count": 4
    },
    {
        "address": "古北路69弄",
        "name": "虹桥万博花园",
        "lnglat": "121.400005,31.217870",
        "count": 59
    },
    {
        "address": "古方路18号",
        "name": "南方休闲广场商务大厦",
        "lnglat": "119.968044,31.722048",
        "count": 22
    },
    {
        "address": "古方路76号",
        "name": "南方休闲广场",
        "lnglat": "119.966040,31.724030",
        "count": 16
    },
    {
        "address": "古井路165号",
        "name": "锦馨公寓",
        "lnglat": "121.417829,31.190104",
        "count": 9
    },
    {
        "address": "古浪路183弄",
        "name": "祥和星宇二期",
        "lnglat": "121.395934,31.281235",
        "count": 133
    },
    {
        "address": "古浪路288弄",
        "name": "中环名品公馆",
        "lnglat": "121.393470,31.283551",
        "count": 117
    },
    {
        "address": "古浪路55弄",
        "name": "祥和星宇",
        "lnglat": "121.398116,31.280799",
        "count": 93
    },
    {
        "address": "古龙路1065弄",
        "name": "新时代富嘉花园",
        "lnglat": "121.385309,31.145346",
        "count": 212
    },
    {
        "address": "古龙路287弄",
        "name": "新时代景庭",
        "lnglat": "121.401546,31.150140",
        "count": 139
    },
    {
        "address": "古楼公路1198弄",
        "name": "同润山河小城",
        "lnglat": "121.250332,31.105770",
        "count": 326
    },
    {
        "address": "古楼公路1458弄",
        "name": "清泉警苑",
        "lnglat": "121.240783,31.105197",
        "count": 22
    },
    {
        "address": "古美路1458弄",
        "name": "中友嘉园",
        "lnglat": "121.400693,31.160528",
        "count": 95
    },
    {
        "address": "古美路1471号",
        "name": "华城广场",
        "lnglat": "121.398795,31.159951",
        "count": 11
    },
    {
        "address": "古美路1515号",
        "name": "凤凰楼",
        "lnglat": "121.397353,31.161991",
        "count": 55
    },
    {
        "address": "古美路1528号",
        "name": "漕河泾现代服务业园区二期",
        "lnglat": "121.398603,31.164405",
        "count": 82
    },
    {
        "address": "古美路1595号",
        "name": "宝石园",
        "lnglat": "121.395212,31.164490",
        "count": 38
    },
    {
        "address": "古美路377弄、莲花路288弄",
        "name": "阳光美景城_西区",
        "lnglat": "121.404567,31.140629",
        "count": 199
    },
    {
        "address": "古美路675弄",
        "name": "望族新城",
        "lnglat": "121.401407,31.146844",
        "count": 102
    },
    {
        "address": "古美西路313弄70号",
        "name": "上艺艺园",
        "lnglat": "121.396871,31.132521",
        "count": 3
    },
    {
        "address": "古羊路158号",
        "name": "虹三产业园",
        "lnglat": "121.416160,31.191036",
        "count": 11
    },
    {
        "address": "古猗园路88弄",
        "name": "骏丰嘉骊花园",
        "lnglat": "121.318291,31.288298",
        "count": 60
    },
    {
        "address": "古宜路181号",
        "name": "西岸才谷",
        "lnglat": "121.424018,31.187727",
        "count": 8
    },
    {
        "address": "古宜路99弄",
        "name": "天杰徐汇宜德苑",
        "lnglat": "121.426147,31.185262",
        "count": 60
    },
    {
        "address": "古棕路168弄1-190号",
        "name": "绿地东岸涟城",
        "lnglat": "121.918005,30.884084",
        "count": 88
    },
    {
        "address": "谷阳北路1250弄",
        "name": "建设花园",
        "lnglat": "121.236860,31.030392",
        "count": 40
    },
    {
        "address": "谷阳北路1500号",
        "name": "永翔大厦",
        "lnglat": "121.230902,31.031127",
        "count": 10
    },
    {
        "address": "谷阳北路2399弄",
        "name": "御上海",
        "lnglat": "121.235617,31.049092",
        "count": 136
    },
    {
        "address": "谷阳北路2501弄",
        "name": "御上海MC街",
        "lnglat": "121.233218,31.051474",
        "count": 88
    },
    {
        "address": "谷阳北路2558弄",
        "name": "龙湖新壹城",
        "lnglat": "121.237076,31.053570",
        "count": 108
    },
    {
        "address": "鼓浪路550号",
        "name": "晶尚坊",
        "lnglat": "121.272967,31.115654",
        "count": 30
    },
    {
        "address": "鼓浪路801弄",
        "name": "润和苑",
        "lnglat": "121.268257,31.111929",
        "count": 56
    },
    {
        "address": "顾北东路39弄",
        "name": "和家欣苑D区",
        "lnglat": "121.415243,31.362507",
        "count": 54
    },
    {
        "address": "顾北路666弄",
        "name": "旭辉依云湾",
        "lnglat": "121.390495,31.348650",
        "count": 117
    },
    {
        "address": "顾北路689弄",
        "name": "东方帕提欧",
        "lnglat": "121.386379,31.351976",
        "count": 120
    },
    {
        "address": "顾戴路1199弄96号",
        "name": "江南星城1期96号楼",
        "lnglat": "121.388719,31.136978",
        "count": 2
    },
    {
        "address": "顾戴路2337号",
        "name": "维璟中心A座",
        "lnglat": "121.361124,31.129959",
        "count": 28
    },
    {
        "address": "顾戴路251弄",
        "name": "成亿家园",
        "lnglat": "121.403054,31.143937",
        "count": 6
    },
    {
        "address": "顾戴路2568号",
        "name": "银石科技商务园区",
        "lnglat": "121.359881,31.131236",
        "count": 10
    },
    {
        "address": "顾戴路2582号",
        "name": "闵行市政园",
        "lnglat": "121.358537,31.131215",
        "count": 6
    },
    {
        "address": "顾戴路2959号",
        "name": "中展大厦",
        "lnglat": "121.354513,31.127551",
        "count": 12
    },
    {
        "address": "顾戴路645弄",
        "name": "风荷云墅",
        "lnglat": "121.396986,31.141319",
        "count": 20
    },
    {
        "address": "顾荻路161弄",
        "name": "韶光花园",
        "lnglat": "121.389545,31.352894",
        "count": 52
    },
    {
        "address": "顾唐路138弄",
        "name": "美地芳邻",
        "lnglat": "121.656482,31.263360",
        "count": 84
    },
    {
        "address": "顾唐路3281号",
        "name": "齐友佳苑",
        "lnglat": "121.671376,31.204956",
        "count": 99
    },
    {
        "address": "崮山路322弄",
        "name": "名门世家",
        "lnglat": "121.554843,31.244461",
        "count": 72
    },
    {
        "address": "崮山路538号",
        "name": "浦东中港汇大厦",
        "lnglat": "121.557267,31.242127",
        "count": 2
    },
    {
        "address": "关岳路338弄1-49号",
        "name": "申雅苑",
        "lnglat": "121.590327,31.119795",
        "count": 33
    },
    {
        "address": "观海路1118号",
        "name": "鹏润伊顿公馆（鹏润嘉苑）",
        "lnglat": "121.784498,31.057850",
        "count": 132
    },
    {
        "address": "观云路177弄1-12号",
        "name": "禧悦丽苑",
        "lnglat": "109.028116,25.992053",
        "count": 60
    },
    {
        "address": "冠生园路20号",
        "name": "科苑新村",
        "lnglat": "121.433238,31.163991",
        "count": 16
    },
    {
        "address": "冠生园路223-227号",
        "name": "智慧线创意园冠生园路分园",
        "lnglat": "121.427417,31.162923",
        "count": 5
    },
    {
        "address": "冠生园路231号",
        "name": "徐汇创意阁",
        "lnglat": "121.426950,31.163014",
        "count": 10
    },
    {
        "address": "冠生园路393号",
        "name": "云景德必易园",
        "lnglat": "121.425379,31.162937",
        "count": 10
    },
    {
        "address": "冠生园路403号",
        "name": "康沁苑",
        "lnglat": "121.423764,31.162979",
        "count": 12
    },
    {
        "address": "光复路195号",
        "name": "创意仓库",
        "lnglat": "121.468392,31.240093",
        "count": 11
    },
    {
        "address": "光复西路1003号",
        "name": "开伦江南场",
        "lnglat": "121.424337,31.230819",
        "count": 11
    },
    {
        "address": "光复西路1107号",
        "name": "苏河汇",
        "lnglat": "121.422813,31.228309",
        "count": 9
    },
    {
        "address": "光复西路2899弄",
        "name": "赢华国际广场",
        "lnglat": "121.385231,31.220981",
        "count": 39
    },
    {
        "address": "光复西路777弄",
        "name": "燕宁苑",
        "lnglat": "130.354570,46.804815",
        "count": 84
    },
    {
        "address": "光华路18号",
        "name": "晶森商务大厦",
        "lnglat": "87.625850,43.799692",
        "count": 9
    },
    {
        "address": "光华路598号",
        "name": "598创业园",
        "lnglat": "121.386428,31.069879",
        "count": 7
    },
    {
        "address": "光华路728号",
        "name": "728space",
        "lnglat": "121.384745,31.068338",
        "count": 4
    },
    {
        "address": "光泰路1151号",
        "name": "奥帛弘汇科创园",
        "lnglat": "121.597730,30.978234",
        "count": 13
    },
    {
        "address": "光新路128弄",
        "name": "阳光大厦（上海）",
        "lnglat": "121.432872,31.251766",
        "count": 5
    },
    {
        "address": "光新路182弄",
        "name": "一品国际",
        "lnglat": "121.433858,31.252870",
        "count": 10
    },
    {
        "address": "光新路256弄",
        "name": "城公大厦",
        "lnglat": "121.431852,31.253919",
        "count": 1
    },
    {
        "address": "光新路428弄",
        "name": "万千公寓",
        "lnglat": "121.430935,31.256415",
        "count": 7
    },
    {
        "address": "光新路88号",
        "name": "中一国际商务大厦",
        "lnglat": "121.432978,31.251204",
        "count": 71
    },
    {
        "address": "光星路1599号",
        "name": "马利来广场",
        "lnglat": "121.241475,31.058858",
        "count": 63
    },
    {
        "address": "光中路133弄118号",
        "name": "茸桥科创园_光中路133弄118号园区",
        "lnglat": "121.394362,31.072571",
        "count": 9
    },
    {
        "address": "光中路133弄19号",
        "name": "沪升E谷科创园",
        "lnglat": "121.394339,31.073594",
        "count": 8
    },
    {
        "address": "光中路133弄99号5栋",
        "name": "海创汇诺旋智能孵化基地",
        "lnglat": "121.394822,31.072944",
        "count": 5
    },
    {
        "address": "广东路339号",
        "name": "中福现代城",
        "lnglat": "94.354794,29.655474",
        "count": 3
    },
    {
        "address": "广东路429号",
        "name": "天赐公寓",
        "lnglat": "121.483252,31.232241",
        "count": 2
    },
    {
        "address": "广东路500号",
        "name": "上海世界贸易大厦",
        "lnglat": "121.481805,31.232589",
        "count": 51
    },
    {
        "address": "广东路689号",
        "name": "海通证券大厦",
        "lnglat": "121.478848,31.230715",
        "count": 6
    },
    {
        "address": "广丰路100弄",
        "name": "金水佳苑",
        "lnglat": "110.347472,22.694455",
        "count": 170
    },
    {
        "address": "广富林东路199号",
        "name": "启迪漕河泾（中山）科技园水木园",
        "lnglat": "121.272968,31.049998",
        "count": 60
    },
    {
        "address": "广富林路1188弄",
        "name": "保利西子湾",
        "lnglat": "121.235256,31.062889",
        "count": 400
    },
    {
        "address": "广富林路1238号",
        "name": "上海律必尊酒店式公寓",
        "lnglat": "121.233250,31.058464",
        "count": 4
    },
    {
        "address": "广富林路1502弄",
        "name": "绿地蔷薇九里",
        "lnglat": "121.229670,31.059030",
        "count": 245
    },
    {
        "address": "广富林路358弄",
        "name": "三迪曼哈顿第2期",
        "lnglat": "121.251957,31.056122",
        "count": 49
    },
    {
        "address": "广富林路4855弄",
        "name": "星月大业领地",
        "lnglat": "121.163696,31.047687",
        "count": 30
    },
    {
        "address": "广富林路600号",
        "name": "三迪曼哈顿",
        "lnglat": "121.246703,31.057503",
        "count": 25
    },
    {
        "address": "广富林路658号",
        "name": "孩子王(上海松江万达店)",
        "lnglat": "121.243277,31.058027",
        "count": 59
    },
    {
        "address": "广富林路799弄22-26号",
        "name": "中展瑞景",
        "lnglat": "121.242270,31.055706",
        "count": 10
    },
    {
        "address": "广纪路173弄",
        "name": "香杉商务中心",
        "lnglat": "121.482275,31.284152",
        "count": 11
    },
    {
        "address": "广纪路19号",
        "name": "翰林苑",
        "lnglat": "121.481789,31.280576",
        "count": 10
    },
    {
        "address": "广纪路65弄1号",
        "name": "合虹公寓",
        "lnglat": "121.481937,31.281635",
        "count": 25
    },
    {
        "address": "广纪路738号",
        "name": "上海明珠创意产业园",
        "lnglat": "121.483965,31.292638",
        "count": 13
    },
    {
        "address": "广纪路838号",
        "name": "中国出版蓝桥创意产业园A楼",
        "lnglat": "121.484658,31.294174",
        "count": 22
    },
    {
        "address": "广灵二路298弄",
        "name": "典雅公寓",
        "lnglat": "121.472354,31.284834",
        "count": 36
    },
    {
        "address": "广灵四路116号",
        "name": "智慧桥创意产业园二期",
        "lnglat": "121.480079,31.286604",
        "count": 11
    },
    {
        "address": "广灵四路24号",
        "name": "上海开隆大厦",
        "lnglat": "121.482320,31.286153",
        "count": 4
    },
    {
        "address": "广灵四路561弄",
        "name": "中虹翡翠苑",
        "lnglat": "121.467304,31.285590",
        "count": 84
    },
    {
        "address": "广灵四路881弄",
        "name": "万峰梦湖苑",
        "lnglat": "121.462145,31.281022",
        "count": 33
    },
    {
        "address": "广西北路228弄",
        "name": "中福城二期",
        "lnglat": "121.478711,31.233353",
        "count": 66
    },
    {
        "address": "广西北路528号",
        "name": "地王中心",
        "lnglat": "121.476424,31.238142",
        "count": 3
    },
    {
        "address": "广延路1188弄",
        "name": "明园森林都市涵翠苑",
        "lnglat": "121.455026,31.291183",
        "count": 40
    },
    {
        "address": "广延路1199弄",
        "name": "明园森林都市叠翠苑",
        "lnglat": "121.456787,31.291393",
        "count": 45
    },
    {
        "address": "广延路415号",
        "name": "广延路415号小区",
        "lnglat": "121.455560,31.278569",
        "count": 5
    },
    {
        "address": "广元西路303号",
        "name": "丰业广元公寓",
        "lnglat": "121.433119,31.195256",
        "count": 2
    },
    {
        "address": "广元西路315号",
        "name": "联峰汇",
        "lnglat": "121.432226,31.194953",
        "count": 2
    },
    {
        "address": "广元西路333弄",
        "name": "紫元大厦",
        "lnglat": "121.432841,31.195163",
        "count": 1
    },
    {
        "address": "广粤路150弄",
        "name": "虹韵家园",
        "lnglat": "121.467970,31.286408",
        "count": 94
    },
    {
        "address": "广粤路501号",
        "name": "上海信南实业大楼",
        "lnglat": "121.466511,31.292246",
        "count": 2
    },
    {
        "address": "广粤支路1号",
        "name": "临港新业坊虹口智立方",
        "lnglat": "121.465849,31.294234",
        "count": 8
    },
    {
        "address": "广中路208号",
        "name": "吉联大厦裙房",
        "lnglat": "121.475509,31.276985",
        "count": 4
    },
    {
        "address": "广中路657号",
        "name": "ID657创意园",
        "lnglat": "121.462652,31.280169",
        "count": 20
    },
    {
        "address": "广中西路1207号",
        "name": "大宁创业大厦",
        "lnglat": "121.453796,31.274658",
        "count": 8
    },
    {
        "address": "广中西路777弄2号楼",
        "name": "多媒体产业大厦",
        "lnglat": "121.439161,31.277675",
        "count": 6
    },
    {
        "address": "广中西路777弄55号",
        "name": "启迪大厦",
        "lnglat": "121.439497,31.278480",
        "count": 19
    },
    {
        "address": "广中西路777弄88号",
        "name": "华清大厦",
        "lnglat": "121.438660,31.278339",
        "count": 19
    },
    {
        "address": "广中西路777弄99号",
        "name": "江裕大厦",
        "lnglat": "121.438777,31.278901",
        "count": 6
    },
    {
        "address": "广中西路883弄",
        "name": "景星苑",
        "lnglat": "121.438230,31.276830",
        "count": 28
    },
    {
        "address": "贵都路209弄",
        "name": "今天花园",
        "lnglat": "121.403096,31.076622",
        "count": 14
    },
    {
        "address": "贵阳路398号",
        "name": "文通国际广场",
        "lnglat": "121.549883,31.274730",
        "count": 15
    },
    {
        "address": "桂林东街28弄",
        "name": "海上名邸",
        "lnglat": "121.423510,31.154582",
        "count": 76
    },
    {
        "address": "桂林路399弄",
        "name": "桂林花苑",
        "lnglat": "117.427474,25.283269",
        "count": 8
    },
    {
        "address": "桂林路406号",
        "name": "华鑫中心",
        "lnglat": "121.413952,31.173168",
        "count": 27
    },
    {
        "address": "桂林路418号",
        "name": "中电科华鑫创享园",
        "lnglat": "121.414345,31.177845",
        "count": 2
    },
    {
        "address": "桂林路565号",
        "name": "明佳公寓",
        "lnglat": "117.430244,25.281500",
        "count": 8
    },
    {
        "address": "桂平路277弄",
        "name": "桂竹香小区",
        "lnglat": "121.407168,31.158499",
        "count": 15
    },
    {
        "address": "桂平路333号",
        "name": "桂林聚科商务园",
        "lnglat": "121.405889,31.160577",
        "count": 57
    },
    {
        "address": "桂平路353号",
        "name": "越界睿园",
        "lnglat": "121.405175,31.161809",
        "count": 6
    },
    {
        "address": "桂平路391号",
        "name": "漕河泾国际商务中心",
        "lnglat": "121.403661,31.164373",
        "count": 37
    },
    {
        "address": "桂平路410号",
        "name": "科技广场及科技广场裙楼",
        "lnglat": "121.405364,31.164308",
        "count": 33
    },
    {
        "address": "桂平路88弄",
        "name": "紫藤苑",
        "lnglat": "121.412564,31.149226",
        "count": 60
    },
    {
        "address": "桂平路88弄、126弄",
        "name": "紫藤苑综合楼",
        "lnglat": "121.412564,31.149226",
        "count": 8
    },
    {
        "address": "桂桥路25号",
        "name": "上海保利N加金桥青年社区",
        "lnglat": "121.603950,31.241088",
        "count": 2
    },
    {
        "address": "郭守敬路277号",
        "name": "凯顿酒店",
        "lnglat": "121.593997,31.210422",
        "count": 11
    },
    {
        "address": "郭守敬路498号",
        "name": "浦东软件园郭守敬园及祖冲之园",
        "lnglat": "121.598197,31.208729",
        "count": 47
    },
    {
        "address": "国安路259弄",
        "name": "上和园一期（世嘉园）",
        "lnglat": "121.503859,31.312978",
        "count": 60
    },
    {
        "address": "国安路355弄",
        "name": "上和园二期",
        "lnglat": "121.503913,31.313979",
        "count": 27
    },
    {
        "address": "国安路558弄",
        "name": "建发新江湾华苑",
        "lnglat": "121.505218,31.317605",
        "count": 8
    },
    {
        "address": "国安路55号",
        "name": "君庭广场",
        "lnglat": "121.506109,31.310695",
        "count": 43
    },
    {
        "address": "国安路789弄",
        "name": "新江湾中凯城市之光名苑",
        "lnglat": "121.502693,31.320036",
        "count": 55
    },
    {
        "address": "国宾路36号",
        "name": "五角场万达广场",
        "lnglat": "121.513286,31.300720",
        "count": 31
    },
    {
        "address": "国定东路233号、国定东路275-8号",
        "name": "绿地汇创国际大厦",
        "lnglat": "121.521098,31.298837",
        "count": 69
    },
    {
        "address": "国定路101弄",
        "name": "兴平昌苑",
        "lnglat": "121.514687,31.293677",
        "count": 5
    },
    {
        "address": "国定路335号",
        "name": "杨浦科技创业中心",
        "lnglat": "121.508518,31.297191",
        "count": 21
    },
    {
        "address": "国和路777号(近民庆路)",
        "name": "孩子王(上海中原店)",
        "lnglat": "121.521980,31.315568",
        "count": 16
    },
    {
        "address": "国泓路818弄",
        "name": "绿地海珀璞晖",
        "lnglat": "121.505464,31.324288",
        "count": 32
    },
    {
        "address": "国货路236弄",
        "name": "东物公寓",
        "lnglat": "118.369252,31.326393",
        "count": 6
    },
    {
        "address": "国货路288号",
        "name": "南国大厦（上海）",
        "lnglat": "121.494040,31.208871",
        "count": 11
    },
    {
        "address": "国货路333弄",
        "name": "海洲国际华园",
        "lnglat": "121.493677,31.210445",
        "count": 10
    },
    {
        "address": "国货路370弄",
        "name": "惠国公寓",
        "lnglat": "121.492912,31.208653",
        "count": 18
    },
    {
        "address": "国京路50弄",
        "name": "平安佳苑",
        "lnglat": "121.513208,31.308595",
        "count": 49
    },
    {
        "address": "国康路100号",
        "name": "上海国际设计中心",
        "lnglat": "121.501827,31.286965",
        "count": 33
    },
    {
        "address": "国科路29弄",
        "name": "黄兴雅苑",
        "lnglat": "121.519350,31.286414",
        "count": 4
    },
    {
        "address": "国科路39弄",
        "name": "贵仁绿苑",
        "lnglat": "121.519858,31.287247",
        "count": 6
    },
    {
        "address": "国权北路1688弄",
        "name": "湾谷科技园",
        "lnglat": "121.503381,31.341161",
        "count": 135
    },
    {
        "address": "国权北路1688弄52号",
        "name": "湾谷科技园C6座（新湾财智中心）",
        "lnglat": "121.502421,31.340536",
        "count": 8
    },
    {
        "address": "国权北路6弄",
        "name": "国权北路6弄",
        "lnglat": "121.495364,31.309231",
        "count": 12
    },
    {
        "address": "国权北路828弄",
        "name": "美岸栖庭",
        "lnglat": "121.491984,31.329446",
        "count": 82
    },
    {
        "address": "国权东路99弄",
        "name": "文化佳园",
        "lnglat": "121.525027,31.289839",
        "count": 187
    },
    {
        "address": "国权后路15弄",
        "name": "复旦书馨公寓",
        "lnglat": "121.505008,31.289164",
        "count": 18
    },
    {
        "address": "国权路100号",
        "name": "国阳大厦",
        "lnglat": "121.515861,31.288176",
        "count": 6
    },
    {
        "address": "国权路85弄",
        "name": "市益小区",
        "lnglat": "121.517349,31.287993",
        "count": 9
    },
    {
        "address": "国顺东路19号",
        "name": "首东大厦",
        "lnglat": "121.541836,31.304127",
        "count": 2
    },
    {
        "address": "国顺东路800号",
        "name": "五角场800号艺术空间",
        "lnglat": "121.524667,31.293935",
        "count": 22
    },
    {
        "address": "国顺东路皖沙三村70号",
        "name": "惠信苑",
        "lnglat": "113.381855,40.685031",
        "count": 32
    },
    {
        "address": "国顺路128弄",
        "name": "上海东方家园",
        "lnglat": "121.514655,31.291328",
        "count": 24
    },
    {
        "address": "国顺路131弄10号",
        "name": "复华商业大厦",
        "lnglat": "121.515269,31.290046",
        "count": 20
    },
    {
        "address": "国顺路280号",
        "name": "华丰大楼",
        "lnglat": "121.513341,31.291362",
        "count": 2
    },
    {
        "address": "国顺路668弄",
        "name": "万科南桥传奇(海尚华庭)",
        "lnglat": "121.454105,30.931090",
        "count": 72
    },
    {
        "address": "国顺路66弄",
        "name": "怡福苑",
        "lnglat": "121.517903,31.291893",
        "count": 20
    },
    {
        "address": "国泰路11号",
        "name": "上海复旦科技园大厦",
        "lnglat": "105.614949,29.417902",
        "count": 18
    },
    {
        "address": "国伟路300号",
        "name": "爱久家园",
        "lnglat": "121.533364,31.331774",
        "count": 68
    },
    {
        "address": "国伟路800号",
        "name": "新江湾城雍景苑",
        "lnglat": "121.525755,31.332901",
        "count": 163
    },
    {
        "address": "国霞路258、259号",
        "name": "复旦绿地科创中心",
        "lnglat": "121.506048,31.314298",
        "count": 39
    },
    {
        "address": "国霞路399弄",
        "name": "三湘未来海岸商务楼",
        "lnglat": "121.505386,31.316293",
        "count": 45
    },
    {
        "address": "国霞路458弄",
        "name": "星汇广场二期",
        "lnglat": "121.505803,31.317729",
        "count": 91
    },
    {
        "address": "国霞路55号",
        "name": "君庭公寓",
        "lnglat": "121.505666,31.310641",
        "count": 12
    },
    {
        "address": "国霞路60号",
        "name": "君庭广场7号楼",
        "lnglat": "121.506532,31.310789",
        "count": 11
    },
    {
        "address": "国耀路211号、209号",
        "name": "国家电网世博写字楼CD座",
        "lnglat": "121.486913,31.181377",
        "count": 87
    },
    {
        "address": "哈尔滨路160号",
        "name": "老洋行1913",
        "lnglat": "121.489804,31.255417",
        "count": 22
    },
    {
        "address": "哈雷路866弄",
        "name": "张江科技园研发B区",
        "lnglat": "121.604081,31.207034",
        "count": 4
    },
    {
        "address": "哈雷路998号",
        "name": "悦颂生命科学园",
        "lnglat": "121.604296,31.195003",
        "count": 9
    },
    {
        "address": "哈密路1945弄",
        "name": "虹桥中园",
        "lnglat": "121.368255,31.194855",
        "count": 76
    },
    {
        "address": "海波路1000弄",
        "name": "水岸丽苑（一期）",
        "lnglat": "121.328398,31.269991",
        "count": 124
    },
    {
        "address": "海波路118弄",
        "name": "雅颂湾",
        "lnglat": "121.345751,31.267729",
        "count": 60
    },
    {
        "address": "海波路127弄",
        "name": "嘉城爱琴海",
        "lnglat": "121.345155,31.266867",
        "count": 26
    },
    {
        "address": "海波路333号",
        "name": "华江景城",
        "lnglat": "121.341015,31.266444",
        "count": 72
    },
    {
        "address": "海潮路222弄",
        "name": "雅士公寓",
        "lnglat": "121.496979,31.208154",
        "count": 21
    },
    {
        "address": "海潮路23号",
        "name": "中福花苑",
        "lnglat": "121.498444,31.210585",
        "count": 91
    },
    {
        "address": "海川路58弄",
        "name": "嘉城新航域二期",
        "lnglat": "103.518683,30.198395",
        "count": 287
    },
    {
        "address": "海川路77弄",
        "name": "香馥湾",
        "lnglat": "103.519346,30.198983",
        "count": 131
    },
    {
        "address": "海防路198号",
        "name": "海防商务楼",
        "lnglat": "121.448897,31.239771",
        "count": 3
    },
    {
        "address": "海防路228号",
        "name": "福安大厦",
        "lnglat": "121.448269,31.239604",
        "count": 11
    },
    {
        "address": "海防路387号",
        "name": "大闻丽都苑",
        "lnglat": "121.446162,31.237732",
        "count": 34
    },
    {
        "address": "海防路421号",
        "name": "静工园",
        "lnglat": "121.445497,31.237629",
        "count": 10
    },
    {
        "address": "海防路538弄",
        "name": "达安锦园小区",
        "lnglat": "121.443181,31.237160",
        "count": 25
    },
    {
        "address": "海防路555号",
        "name": "同乐坊",
        "lnglat": "121.443567,31.236753",
        "count": 22
    },
    {
        "address": "海防路58弄1-14号",
        "name": "静安康鑫家园",
        "lnglat": "121.448708,31.240601",
        "count": 39
    },
    {
        "address": "海芙路186弄",
        "name": "金山悦立方商业广场",
        "lnglat": "121.347784,30.750705",
        "count": 36
    },
    {
        "address": "海蓝路398弄",
        "name": "嘉城馥邸",
        "lnglat": "121.341873,31.263942",
        "count": 26
    },
    {
        "address": "海伦路178号",
        "name": "宏伦大厦",
        "lnglat": "121.494252,31.257101",
        "count": 10
    },
    {
        "address": "海伦路188弄",
        "name": "海伦都市佳苑",
        "lnglat": "121.493535,31.257558",
        "count": 32
    },
    {
        "address": "海伦路306弄",
        "name": "海昌苑(虹口)",
        "lnglat": "121.491954,31.257722",
        "count": 47
    },
    {
        "address": "海伦路555弄",
        "name": "国贸花园(上海)",
        "lnglat": "121.486871,31.258401",
        "count": 17
    },
    {
        "address": "海伦路75号",
        "name": "海伦大厦",
        "lnglat": "120.376478,36.104203",
        "count": 1
    },
    {
        "address": "海伦路88号",
        "name": "浦江名邸",
        "lnglat": "120.981359,31.832290",
        "count": 88
    },
    {
        "address": "海马路2155弄(近海佳路)",
        "name": "嘉业海悦苑",
        "lnglat": "121.533954,30.824452",
        "count": 13
    },
    {
        "address": "海门路609号",
        "name": "远虹大厦",
        "lnglat": "121.499966,31.257321",
        "count": 22
    },
    {
        "address": "海鸣路98弄",
        "name": "中虹家园",
        "lnglat": "121.672473,31.282740",
        "count": 90
    },
    {
        "address": "海宁路307号",
        "name": "爱思大厦",
        "lnglat": "121.487248,31.250734",
        "count": 31
    },
    {
        "address": "海宁路358号",
        "name": "国际商厦大厦",
        "lnglat": "121.485659,31.250843",
        "count": 2
    },
    {
        "address": "海宁路899号",
        "name": "长泰企业天地广场",
        "lnglat": "121.477204,31.245982",
        "count": 17
    },
    {
        "address": "海趣路236号",
        "name": "绿地Mtown",
        "lnglat": "121.603180,31.178137",
        "count": 24
    },
    {
        "address": "海拓路3号",
        "name": "风溪文化创意产业园",
        "lnglat": "121.520586,30.849418",
        "count": 1
    },
    {
        "address": "海桐路336弄",
        "name": "建华钻石公寓",
        "lnglat": "121.551734,31.210098",
        "count": 14
    },
    {
        "address": "海兴路1881弄",
        "name": "绿地香溢",
        "lnglat": "121.571372,30.853602",
        "count": 61
    },
    {
        "address": "海阳路1333弄",
        "name": "尚东国际名园二期",
        "lnglat": "121.511866,31.162293",
        "count": 114
    },
    {
        "address": "海阳路654弄、612弄",
        "name": "日月新殿",
        "lnglat": "121.842844,29.908175",
        "count": 12
    },
    {
        "address": "海洋二路88弄1-38号",
        "name": "智英科技中心创新魔坊二期",
        "lnglat": "121.912252,30.865176",
        "count": 28
    },
    {
        "address": "海洋一路399号",
        "name": "海科广场",
        "lnglat": "121.915695,30.874378",
        "count": 26
    },
    {
        "address": "邯郸路159号",
        "name": "上豪大厦",
        "lnglat": "121.497808,31.294476",
        "count": 4
    },
    {
        "address": "邯郸路173号",
        "name": "冠寓_复旦大学二店",
        "lnglat": "121.499719,31.293898",
        "count": 4
    },
    {
        "address": "邯郸路178弄",
        "name": "东方文苑",
        "lnglat": "121.498522,31.296181",
        "count": 40
    },
    {
        "address": "邯郸路43号",
        "name": "中观产业园（中观大厦）",
        "lnglat": "121.493243,31.293377",
        "count": 15
    },
    {
        "address": "邯郸路98号",
        "name": "上海无锡大厦",
        "lnglat": "121.494745,31.294620",
        "count": 8
    },
    {
        "address": "涵青路100弄",
        "name": "经纬城市绿洲学府阳光家园",
        "lnglat": "121.402541,31.332844",
        "count": 332
    },
    {
        "address": "涵青路398弄",
        "name": "经纬城市绿洲学府涵青家园",
        "lnglat": "121.396720,31.332758",
        "count": 514
    },
    {
        "address": "汉口路400号",
        "name": "华盛大厦（上海）",
        "lnglat": "111.680727,32.365292",
        "count": 21
    },
    {
        "address": "汉口路515号",
        "name": "汇金大厦（上海）",
        "lnglat": "121.480642,31.234136",
        "count": 2
    },
    {
        "address": "汉口路650号",
        "name": "亚洲大厦",
        "lnglat": "121.478058,31.233902",
        "count": 22
    },
    {
        "address": "汉口路689弄",
        "name": "中福城三期",
        "lnglat": "121.477367,31.233247",
        "count": 12
    },
    {
        "address": "汉中路158号",
        "name": "汉中广场",
        "lnglat": "114.269470,30.566510",
        "count": 5
    },
    {
        "address": "汉中路188号",
        "name": "青年文化活动中心",
        "lnglat": "114.270711,30.566393",
        "count": 2
    },
    {
        "address": "汉中路333弄",
        "name": "河滨花园",
        "lnglat": "121.455261,31.240847",
        "count": 54
    },
    {
        "address": "杭桂路1118号",
        "name": "中波研发中心商务大楼",
        "lnglat": "121.210184,31.277927",
        "count": 6
    },
    {
        "address": "杭州路895号",
        "name": "鼎隆公寓",
        "lnglat": "121.546412,31.267990",
        "count": 37
    },
    {
        "address": "航北路669弄",
        "name": "小桥里",
        "lnglat": "121.348575,31.170494",
        "count": 8
    },
    {
        "address": "航城三路288弄",
        "name": "同悦湾华庭北区",
        "lnglat": "121.749953,31.151138",
        "count": 40
    },
    {
        "address": "航东路528弄45支弄",
        "name": "新明星花园三期",
        "lnglat": "121.354881,31.176699",
        "count": 48
    },
    {
        "address": "航鹤路78弄",
        "name": "长泰东郊御园",
        "lnglat": "121.588550,31.025187",
        "count": 108
    },
    {
        "address": "航南公路1981弄8号",
        "name": "申亚花满庭",
        "lnglat": "121.554808,30.983900",
        "count": 33
    },
    {
        "address": "航南公路5088号",
        "name": "绿庭国际大厦",
        "lnglat": "121.468137,30.932722",
        "count": 42
    },
    {
        "address": "航南公路5699号",
        "name": "奉贤宝龙城市广场(商务楼)",
        "lnglat": "121.462510,30.930277",
        "count": 34
    },
    {
        "address": "航南公路6161号",
        "name": "奉贤农机综合大楼",
        "lnglat": "121.444550,30.925415",
        "count": 14
    },
    {
        "address": "航南公路6666号",
        "name": "上海魏晋文化创意产业园",
        "lnglat": "121.441636,30.925383",
        "count": 42
    },
    {
        "address": "航瑞路175弄-1-119号",
        "name": "鹤沙航城汇康锦苑",
        "lnglat": "121.592388,31.070879",
        "count": 60
    },
    {
        "address": "航头路118号",
        "name": "宏澜商务楼",
        "lnglat": "121.609393,31.036703",
        "count": 3
    },
    {
        "address": "航新路260弄",
        "name": "横泾苑",
        "lnglat": "121.349430,31.168480",
        "count": 6
    },
    {
        "address": "航谊路8号",
        "name": "宏普信息园",
        "lnglat": "121.462023,30.947043",
        "count": 8
    },
    {
        "address": "航中路99弄",
        "name": "七韵美地苑",
        "lnglat": "121.354562,31.167369",
        "count": 184
    },
    {
        "address": "合川路3051号",
        "name": "莱茵虹桥中心",
        "lnglat": "121.379135,31.180220",
        "count": 10
    },
    {
        "address": "合川路3089号",
        "name": "富群商务大厦",
        "lnglat": "121.379580,31.178467",
        "count": 13
    },
    {
        "address": "合川路3111号",
        "name": "近铁虹桥中心",
        "lnglat": "121.375973,31.185154",
        "count": 16
    },
    {
        "address": "合肥路215号",
        "name": "精益商务楼",
        "lnglat": "121.476261,31.214727",
        "count": 2
    },
    {
        "address": "合肥路289弄（淡水路）",
        "name": "复兴苑",
        "lnglat": "106.644676,26.605925",
        "count": 18
    },
    {
        "address": "合肥路315号",
        "name": "海文商务楼(合肥路)",
        "lnglat": "121.474002,31.213842",
        "count": 3
    },
    {
        "address": "合作路1000弄",
        "name": "天悦嘉都_创融嘉天地",
        "lnglat": "121.253907,31.342520",
        "count": 28
    },
    {
        "address": "合作路719弄",
        "name": "领峰华庭一期",
        "lnglat": "121.254842,31.335733",
        "count": 45
    },
    {
        "address": "何家湾路111弄",
        "name": "美岸栖庭三期",
        "lnglat": "121.492801,31.330870",
        "count": 6
    },
    {
        "address": "和佳路105",
        "name": "东方康德家园北区",
        "lnglat": "121.513014,31.128383",
        "count": 16
    },
    {
        "address": "和田路229弄",
        "name": "紫薇阁",
        "lnglat": "80.174947,37.073073",
        "count": 40
    },
    {
        "address": "河间路555弄",
        "name": "明月坊",
        "lnglat": "121.539585,31.268912",
        "count": 36
    },
    {
        "address": "河间路688弄",
        "name": "水月坊",
        "lnglat": "121.541883,31.270100",
        "count": 7
    },
    {
        "address": "河南北路233号",
        "name": "圣和圣广场",
        "lnglat": "121.481025,31.246750",
        "count": 6
    },
    {
        "address": "河南北路485号",
        "name": "银历大厦",
        "lnglat": "121.479358,31.249668",
        "count": 2
    },
    {
        "address": "河南南路1009弄",
        "name": "明日星城",
        "lnglat": "121.494120,31.213578",
        "count": 137
    },
    {
        "address": "河南南路16号",
        "name": "中汇大厦",
        "lnglat": "121.486510,31.230400",
        "count": 4
    },
    {
        "address": "河南南路1号",
        "name": "星腾大厦",
        "lnglat": "121.487152,31.230541",
        "count": 16
    },
    {
        "address": "河南南路33号",
        "name": "新上海城市广场",
        "lnglat": "121.487424,31.229794",
        "count": 4
    },
    {
        "address": "河南南路368弄",
        "name": "太阳都市花园二期",
        "lnglat": "121.488064,31.223921",
        "count": 15
    },
    {
        "address": "河南南路398弄",
        "name": "太阳都市花园",
        "lnglat": "121.488506,31.222716",
        "count": 23
    },
    {
        "address": "河南南路555弄",
        "name": "士林华苑",
        "lnglat": "121.490962,31.220704",
        "count": 112
    },
    {
        "address": "河南南路747号",
        "name": "申升公寓",
        "lnglat": "121.492806,31.215713",
        "count": 8
    },
    {
        "address": "鹤坡南路169弄",
        "name": "闵浦新苑三村",
        "lnglat": "121.528875,31.061445",
        "count": 54
    },
    {
        "address": "鹤坡南路55弄56弄",
        "name": "闵浦新苑二村",
        "lnglat": "121.529355,31.059188",
        "count": 89
    },
    {
        "address": "鹤庆路358弄",
        "name": "金铭城市之光",
        "lnglat": "121.413790,31.009857",
        "count": 36
    },
    {
        "address": "鹤沙路588弄",
        "name": "昱星家园东区",
        "lnglat": "121.593318,31.081866",
        "count": 120
    },
    {
        "address": "鹤沙路688弄",
        "name": "昱星家园西区",
        "lnglat": "121.589271,31.081555",
        "count": 232
    },
    {
        "address": "鹤沙路699弄",
        "name": "昱丽家园",
        "lnglat": "121.590902,31.081406",
        "count": 88
    },
    {
        "address": "鹤望路679弄",
        "name": "亿达北虹桥创业城",
        "lnglat": "121.319886,31.243661",
        "count": 24
    },
    {
        "address": "鹤旋路500弄",
        "name": "水岸秀苑",
        "lnglat": "121.308612,31.238935",
        "count": 29
    },
    {
        "address": "鹤永路600弄",
        "name": "鹤沙航城东茗苑(上海)",
        "lnglat": "121.602830,31.074415",
        "count": 60
    },
    {
        "address": "鹤友路336弄",
        "name": "万达城市公寓（上海）",
        "lnglat": "121.325788,31.238310",
        "count": 240
    },
    {
        "address": "恒丰北路100号",
        "name": "林顿大厦",
        "lnglat": "121.451411,31.255275",
        "count": 15
    },
    {
        "address": "恒丰路218号",
        "name": "现代交通商务大厦",
        "lnglat": "121.456664,31.241250",
        "count": 11
    },
    {
        "address": "恒丰路318弄",
        "name": "苏河融景",
        "lnglat": "121.454059,31.242210",
        "count": 16
    },
    {
        "address": "恒丰路31号",
        "name": "金峰大厦(上海)",
        "lnglat": "121.458560,31.239926",
        "count": 14
    },
    {
        "address": "恒丰路436-410号 ",
        "name": "环智国际大厦",
        "lnglat": "113.836634,34.069035",
        "count": 32
    },
    {
        "address": "恒丰路568号",
        "name": "恒汇国际大厦",
        "lnglat": "121.452506,31.246126",
        "count": 16
    },
    {
        "address": "恒丰路610号",
        "name": "金岸610",
        "lnglat": "121.450882,31.247212",
        "count": 11
    },
    {
        "address": "恒丰路638号",
        "name": "苏河1号",
        "lnglat": "121.451706,31.247674",
        "count": 25
    },
    {
        "address": "恒江路8号",
        "name": "elife生活社区",
        "lnglat": "121.312108,31.121456",
        "count": 25
    },
    {
        "address": "恒南路1325号",
        "name": "闿鑫商务园",
        "lnglat": "121.513042,31.084614",
        "count": 14
    },
    {
        "address": "恒南路1355号",
        "name": "禾谷文创园",
        "lnglat": "121.512588,31.086882",
        "count": 7
    },
    {
        "address": "恒南路399号",
        "name": "茸锦浦江科技园",
        "lnglat": "121.516199,31.069369",
        "count": 10
    },
    {
        "address": "恒南路851号、899号",
        "name": "浦江国际",
        "lnglat": "121.514901,31.077692",
        "count": 57
    },
    {
        "address": "恒荣路589号",
        "name": "恒荣府邸",
        "lnglat": "121.173680,31.350544",
        "count": 39
    },
    {
        "address": "恒通路222号",
        "name": "地铁恒通大厦",
        "lnglat": "121.459215,31.241446",
        "count": 9
    },
    {
        "address": "恒通路360号",
        "name": "一天下大厦",
        "lnglat": "121.457140,31.240441",
        "count": 24
    },
    {
        "address": "恒西路18号",
        "name": "优麦文创园",
        "lnglat": "121.512280,31.084211",
        "count": 7
    },
    {
        "address": "恒业路129弄",
        "name": "德华苑",
        "lnglat": "121.475664,31.268395",
        "count": 28
    },
    {
        "address": "恒永路328号",
        "name": "联东U谷上海嘉定国际企业港",
        "lnglat": "121.185221,31.345272",
        "count": 30
    },
    {
        "address": "横浜路123弄",
        "name": "金机大厦",
        "lnglat": "121.478803,31.264092",
        "count": 5
    },
    {
        "address": "横浜路158弄",
        "name": "宝虹新苑",
        "lnglat": "121.478870,31.263224",
        "count": 3
    },
    {
        "address": "衡山路20号",
        "name": "衡安大楼",
        "lnglat": "116.731998,23.371459",
        "count": 5
    },
    {
        "address": "衡山路922号",
        "name": "建汇大厦",
        "lnglat": "121.439481,31.194916",
        "count": 1
    },
    {
        "address": "衡水路89弄1号",
        "name": "国际明佳城",
        "lnglat": "121.486619,31.254395",
        "count": 28
    },
    {
        "address": "红宝石路19弄11、12号",
        "name": "古北长乐苑",
        "lnglat": "121.407725,31.195238",
        "count": 10
    },
    {
        "address": "红宝石路500号",
        "name": "东银中心",
        "lnglat": "121.399403,31.198041",
        "count": 63
    },
    {
        "address": "红枫路108弄",
        "name": "金桥酒店公寓",
        "lnglat": "121.587904,31.243796",
        "count": 54
    },
    {
        "address": "红枫路300弄，碧云路1188,1202,1218号",
        "name": "碧云东方公寓",
        "lnglat": "121.589315,31.242488",
        "count": 45
    },
    {
        "address": "红林路58弄、158弄",
        "name": "飘鹰锦和花园",
        "lnglat": "121.426664,31.366816",
        "count": 141
    },
    {
        "address": "红松东路321弄",
        "name": "古北大成公馆",
        "lnglat": "121.403762,31.188791",
        "count": 81
    },
    {
        "address": "红松路175弄",
        "name": "金汇名人苑",
        "lnglat": "121.372320,31.180358",
        "count": 39
    },
    {
        "address": "红松路333弄",
        "name": "汇金公寓",
        "lnglat": "121.367510,31.180725",
        "count": 45
    },
    {
        "address": "红松路81弄169支弄",
        "name": "龙柏识庐",
        "lnglat": "121.377387,31.180108",
        "count": 4
    },
    {
        "address": "虹漕路39号",
        "name": "华鑫科技园",
        "lnglat": "121.409594,31.170604",
        "count": 22
    },
    {
        "address": "虹漕路421号",
        "name": "虹漕工业园区(虹漕园)",
        "lnglat": "121.408280,31.176730",
        "count": 71
    },
    {
        "address": "虹漕路448号",
        "name": "现代物流大厦",
        "lnglat": "121.409220,31.177059",
        "count": 18
    },
    {
        "address": "虹漕路456号",
        "name": "光启园",
        "lnglat": "121.409520,31.178445",
        "count": 23
    },
    {
        "address": "虹漕路461号",
        "name": "钦州工业园区（虹钦园）",
        "lnglat": "121.407067,31.178474",
        "count": 10
    },
    {
        "address": "虹漕路77号",
        "name": "华鑫慧享城",
        "lnglat": "121.409487,31.171469",
        "count": 12
    },
    {
        "address": "虹漕南路718弄之1-2号",
        "name": "迎春园(虹漕南路)",
        "lnglat": "121.417665,31.147202",
        "count": 2
    },
    {
        "address": "虹漕南路99弄",
        "name": "金桂苑",
        "lnglat": "121.413399,31.162447",
        "count": 36
    },
    {
        "address": "虹古路11弄",
        "name": "虹景花苑",
        "lnglat": "121.398621,31.202715",
        "count": 36
    },
    {
        "address": "虹古路8弄之1-11号",
        "name": "虹景家苑",
        "lnglat": "121.398691,31.203573",
        "count": 5
    },
    {
        "address": "虹关路323弄",
        "name": "瑞虹新城璟庭",
        "lnglat": "121.496829,31.264993",
        "count": 28
    },
    {
        "address": "虹江路1368弄1号",
        "name": "长城苑",
        "lnglat": "120.004981,32.041556",
        "count": 20
    },
    {
        "address": "虹井路120号",
        "name": "新华红星国际广场",
        "lnglat": "121.372550,31.175091",
        "count": 10
    },
    {
        "address": "虹井路185号",
        "name": "虹淞大厦",
        "lnglat": "121.370553,31.175014",
        "count": 19
    },
    {
        "address": "虹井路280弄",
        "name": "虹桥晶座",
        "lnglat": "121.372351,31.176779",
        "count": 3
    },
    {
        "address": "虹井路280弄1号",
        "name": "瑞都大厦",
        "lnglat": "121.372411,31.176764",
        "count": 4
    },
    {
        "address": "虹井路288号",
        "name": "燎申虹桥国际中心",
        "lnglat": "121.370031,31.178023",
        "count": 19
    },
    {
        "address": "虹井路482弄",
        "name": "金汇鸿锦苑",
        "lnglat": "121.370318,31.179024",
        "count": 13
    },
    {
        "address": "虹井路888号",
        "name": "嘉利豪园",
        "lnglat": "121.368229,31.188818",
        "count": 59
    },
    {
        "address": "虹口江场路1067弄、江场路1099弄",
        "name": "海虹欣苑",
        "lnglat": "121.462410,31.297167",
        "count": 71
    },
    {
        "address": "虹口区曲阳路930号",
        "name": "大柏树930科技创意园",
        "lnglat": "121.491429,31.291293",
        "count": 6
    },
    {
        "address": "虹口区四平路773号",
        "name": "金大地商务楼",
        "lnglat": "121.498069,31.272529",
        "count": 7
    },
    {
        "address": "虹梅路1123号 ",
        "name": "上企置业广场",
        "lnglat": "121.402833,31.159960",
        "count": 1
    },
    {
        "address": "虹梅路1535号 ",
        "name": "星联科技园",
        "lnglat": "121.400254,31.164203",
        "count": 45
    },
    {
        "address": "虹梅路1801号",
        "name": "宏业大厦(上海)",
        "lnglat": "121.397865,31.168404",
        "count": 17
    },
    {
        "address": "虹梅路1801号A区",
        "name": "凯科国际大厦",
        "lnglat": "121.397865,31.168404",
        "count": 18
    },
    {
        "address": "虹梅路1905号",
        "name": "远中科研楼",
        "lnglat": "121.397716,31.169072",
        "count": 2
    },
    {
        "address": "虹梅路2007号",
        "name": "远中产业园6号楼",
        "lnglat": "121.393846,31.171877",
        "count": 5
    },
    {
        "address": "虹梅路2008号",
        "name": "虹梅大楼",
        "lnglat": "121.398910,31.169272",
        "count": 6
    },
    {
        "address": "虹梅路2071号",
        "name": "远中产业园三四期",
        "lnglat": "121.391961,31.172604",
        "count": 15
    },
    {
        "address": "虹梅路2125、2588弄",
        "name": "永兆豪庭",
        "lnglat": "121.395044,31.173676",
        "count": 12
    },
    {
        "address": "虹梅路2159弄",
        "name": "荣信虹桥世嘉",
        "lnglat": "121.393522,31.173869",
        "count": 52
    },
    {
        "address": "虹梅路263号",
        "name": "金梅公寓",
        "lnglat": "121.409850,31.143521",
        "count": 1
    },
    {
        "address": "虹梅路269号",
        "name": "宝城大厦（上海）",
        "lnglat": "121.409575,31.144135",
        "count": 1
    },
    {
        "address": "虹梅路2838弄",
        "name": "虹桥晶典苑",
        "lnglat": "121.393733,31.179701",
        "count": 40
    },
    {
        "address": "虹梅路3200弄",
        "name": "虹桥花苑",
        "lnglat": "121.387983,31.187550",
        "count": 90
    },
    {
        "address": "虹梅路3201弄",
        "name": "虹桥紫京苑",
        "lnglat": "121.387878,31.185727",
        "count": 12
    },
    {
        "address": "虹梅路3213号",
        "name": "红春大厦",
        "lnglat": "121.386287,31.186100",
        "count": 4
    },
    {
        "address": "虹梅路3215弄201号",
        "name": "圣伦兰商务大厦",
        "lnglat": "121.384802,31.184459",
        "count": 4
    },
    {
        "address": "虹梅路3219号",
        "name": "九洲生活广场",
        "lnglat": "121.387313,31.187695",
        "count": 1
    },
    {
        "address": "虹梅路3297弄",
        "name": "华光花园",
        "lnglat": "121.386096,31.188440",
        "count": 103
    },
    {
        "address": "虹梅路3325弄",
        "name": "金泉苑二期",
        "lnglat": "121.385389,31.189583",
        "count": 18
    },
    {
        "address": "虹梅路3721号",
        "name": "森晟世洋国际广场",
        "lnglat": "121.384062,31.191309",
        "count": 2
    },
    {
        "address": "虹梅路3887弄",
        "name": "虹梅君悦花园",
        "lnglat": "121.382416,31.193214",
        "count": 21
    },
    {
        "address": "虹梅路3990弄",
        "name": "晨韵公寓",
        "lnglat": "121.383151,31.194531",
        "count": 4
    },
    {
        "address": "虹梅南路2588号",
        "name": "绿亮科创园总部",
        "lnglat": "121.434942,31.097011",
        "count": 14
    },
    {
        "address": "虹梅南路3966号",
        "name": "上海时代汽车商务大厦",
        "lnglat": "121.442380,31.076243",
        "count": 3
    },
    {
        "address": "虹梅南路4289号",
        "name": "绿亮科创园(虹梅南路)",
        "lnglat": "121.442950,31.067734",
        "count": 7
    },
    {
        "address": "虹梅南路4999弄",
        "name": "燎申智城",
        "lnglat": "121.449351,31.051265",
        "count": 66
    },
    {
        "address": "虹梅南路698号",
        "name": "秀水苑",
        "lnglat": "121.421540,31.127868",
        "count": 15
    },
    {
        "address": "虹梅南路786号",
        "name": "上海雍辰商务中心",
        "lnglat": "121.422892,31.126446",
        "count": 5
    },
    {
        "address": "虹梅南路833号",
        "name": "国民新能源环保孵化园",
        "lnglat": "121.421907,31.125115",
        "count": 11
    },
    {
        "address": "虹桥路1060弄",
        "name": "虹桥丽景苑",
        "lnglat": "112.707041,22.368699",
        "count": 4
    },
    {
        "address": "虹桥路1163弄",
        "name": "长发虹桥公寓",
        "lnglat": "121.408439,31.197794",
        "count": 24
    },
    {
        "address": "虹桥路1380-7、1386号",
        "name": "文广大厦(虹桥路)",
        "lnglat": "121.406762,31.197050",
        "count": 14
    },
    {
        "address": "虹桥路1438号",
        "name": "古北国际财富中心",
        "lnglat": "112.707260,22.368793",
        "count": 72
    },
    {
        "address": "虹桥路178弄",
        "name": "青之杰花园",
        "lnglat": "113.493443,33.852561",
        "count": 4
    },
    {
        "address": "虹桥路188号",
        "name": "元福大厦",
        "lnglat": "113.493515,33.852792",
        "count": 12
    },
    {
        "address": "虹桥路2222弄33号",
        "name": "王子公寓",
        "lnglat": "112.707715,22.368987",
        "count": 28
    },
    {
        "address": "虹桥路2222弄55号",
        "name": "爱都公寓",
        "lnglat": "112.707715,22.368987",
        "count": 12
    },
    {
        "address": "虹桥路2272号",
        "name": "虹桥商务大厦",
        "lnglat": "121.376466,31.191264",
        "count": 27
    },
    {
        "address": "虹桥路2328弄",
        "name": "西郊家园",
        "lnglat": "112.707777,22.369013",
        "count": 21
    },
    {
        "address": "虹桥路355号",
        "name": "城开国际大厦",
        "lnglat": "121.431161,31.193191",
        "count": 12
    },
    {
        "address": "虹桥路400弄",
        "name": "南丹小区",
        "lnglat": "105.384789,30.874592",
        "count": 28
    },
    {
        "address": "虹桥路500号",
        "name": "中城国际大厦",
        "lnglat": "121.082768,30.822868",
        "count": 12
    },
    {
        "address": "虹桥路591弄",
        "name": "虹桥丽园（上海）",
        "lnglat": "105.382999,30.875139",
        "count": 10
    },
    {
        "address": "虹桥路666弄",
        "name": "虹桥乐庭",
        "lnglat": "105.387693,30.874608",
        "count": 80
    },
    {
        "address": "虹桥路808号",
        "name": "加华广场(汇宜众创空间)",
        "lnglat": "112.706895,22.368637",
        "count": 22
    },
    {
        "address": "虹桥路888号",
        "name": "阳光名邸",
        "lnglat": "121.013093,31.542016",
        "count": 12
    },
    {
        "address": "虹桥路953弄",
        "name": "南洋虹桥公寓",
        "lnglat": "112.706979,22.368673",
        "count": 7
    },
    {
        "address": "虹桥路977号",
        "name": "中山广场",
        "lnglat": "121.417786,31.197828",
        "count": 24
    },
    {
        "address": "虹泉路1000号",
        "name": "井亭大厦",
        "lnglat": "121.374883,31.170356",
        "count": 13
    },
    {
        "address": "虹莘路1200弄",
        "name": "新梅商住楼",
        "lnglat": "121.387866,31.124305",
        "count": 9
    },
    {
        "address": "虹莘路1518弄28支弄",
        "name": "春意苑",
        "lnglat": "121.385312,31.127777",
        "count": 85
    },
    {
        "address": "虹莘路3333弄",
        "name": "天安豪园",
        "lnglat": "121.374893,31.161827",
        "count": 149
    },
    {
        "address": "虹莘路3800弄",
        "name": "风度国际",
        "lnglat": "121.373298,31.168144",
        "count": 33
    },
    {
        "address": "虹湾路86弄",
        "name": "蔷薇里",
        "lnglat": "121.474309,31.313658",
        "count": 42
    },
    {
        "address": "虹许路731号",
        "name": "老外街国际文创生活园",
        "lnglat": "121.388453,31.190821",
        "count": 19
    },
    {
        "address": "虹许路788号",
        "name": "名都城",
        "lnglat": "121.394112,31.190392",
        "count": 107
    },
    {
        "address": "虹中路335弄32号",
        "name": "虹桥集富大厦",
        "lnglat": "121.382368,31.181848",
        "count": 9
    },
    {
        "address": "虹中路525号",
        "name": "黔香阁(虹桥店)",
        "lnglat": "121.379059,31.186765",
        "count": 3
    },
    {
        "address": "虹中路786弄3-6号",
        "name": "奥森公寓",
        "lnglat": "121.378331,31.189056",
        "count": 24
    },
    {
        "address": "虹中路796弄1-6号",
        "name": "延虹公寓",
        "lnglat": "121.377746,31.188992",
        "count": 24
    },
    {
        "address": "洪德路1125弄",
        "name": "新城香溢澜庭",
        "lnglat": "121.243429,31.350500",
        "count": 119
    },
    {
        "address": "洪德路1500弄",
        "name": "嘉德豪庭",
        "lnglat": "121.237046,31.348757",
        "count": 36
    },
    {
        "address": "呼兰路201弄",
        "name": "智慧大厦",
        "lnglat": "121.458130,31.348667",
        "count": 5
    },
    {
        "address": "呼兰路799号",
        "name": "智汇园",
        "lnglat": "121.442660,31.342861",
        "count": 12
    },
    {
        "address": "呼兰路799号9号楼",
        "name": "乐活家时尚公寓",
        "lnglat": "121.442660,31.342861",
        "count": 7
    },
    {
        "address": "呼兰路911弄11号",
        "name": "博济上海智汇园",
        "lnglat": "121.439956,31.343787",
        "count": 18
    },
    {
        "address": "呼兰西路100号",
        "name": "永谊大厦",
        "lnglat": "121.433078,31.338658",
        "count": 80
    },
    {
        "address": "呼兰西路123号",
        "name": "龙盛活力小镇",
        "lnglat": "121.432529,31.339794",
        "count": 37
    },
    {
        "address": "呼兰西路129号",
        "name": "魔方公寓呼兰路地铁站店",
        "lnglat": "121.430100,31.340743",
        "count": 14
    },
    {
        "address": "呼兰西路60号",
        "name": "卓越时代广场公寓楼",
        "lnglat": "121.435503,31.338185",
        "count": 83
    },
    {
        "address": "呼青路158号",
        "name": "上海交运智慧湾科创园",
        "lnglat": "121.439147,31.343837",
        "count": 29
    },
    {
        "address": "湖北路20号",
        "name": "中信福申大楼",
        "lnglat": "109.156895,21.476941",
        "count": 8
    },
    {
        "address": "湖堤路199弄",
        "name": "万景峰二期",
        "lnglat": "121.493402,30.935309",
        "count": 61
    },
    {
        "address": "虎林路159弄 ",
        "name": "丽雅花园",
        "lnglat": "121.460681,31.330777",
        "count": 4
    },
    {
        "address": "虎林路58号",
        "name": "新星商务楼",
        "lnglat": "120.542487,31.346492",
        "count": 1
    },
    {
        "address": "沪光东路89号",
        "name": "福克斯连锁商务大厦（千奥园区）",
        "lnglat": "121.422985,31.082712",
        "count": 20
    },
    {
        "address": "沪光路425弄",
        "name": "君莲闵都雅苑",
        "lnglat": "121.410394,31.075078",
        "count": 307
    },
    {
        "address": "沪光路555弄",
        "name": "招商雍华府（招商雍华苑）",
        "lnglat": "121.406813,31.074728",
        "count": 48
    },
    {
        "address": "沪杭公路1588号",
        "name": "凤创谷园区",
        "lnglat": "121.445402,30.949219",
        "count": 7
    },
    {
        "address": "沪闵路1391号",
        "name": "华宜万创新所",
        "lnglat": "121.418691,31.023220",
        "count": 31
    },
    {
        "address": "沪闵路269号",
        "name": "香樟时尚广场",
        "lnglat": "121.422827,31.008301",
        "count": 7
    },
    {
        "address": "沪闵路277号",
        "name": "冠寓_闵行公园店",
        "lnglat": "121.422830,31.008754",
        "count": 10
    },
    {
        "address": "沪闵路5366弄",
        "name": "春申府邸",
        "lnglat": "121.385518,31.096399",
        "count": 60
    },
    {
        "address": "沪闵路5600弄88支弄",
        "name": "邻里苑",
        "lnglat": "121.380911,31.102900",
        "count": 111
    },
    {
        "address": "沪闵路6088号",
        "name": "凯德龙之梦莘庄写字楼（凯德闵行商业中心（办公楼））",
        "lnglat": "121.400887,31.133262",
        "count": 39
    },
    {
        "address": "沪闵路6988弄",
        "name": "莲浦花苑",
        "lnglat": "121.394361,31.126304",
        "count": 44
    },
    {
        "address": "沪闵路7580弄111支弄",
        "name": "南方城(上海)",
        "lnglat": "120.699368,27.994837",
        "count": 152
    },
    {
        "address": "沪闵路7866弄",
        "name": "莲花国际广场",
        "lnglat": "121.402538,31.133711",
        "count": 42
    },
    {
        "address": "沪闵路7940号",
        "name": "宁谷（国际）商务大厦",
        "lnglat": "121.406827,31.136940",
        "count": 9
    },
    {
        "address": "沪闵路8075号",
        "name": "虹梅商务大厦",
        "lnglat": "121.414361,31.142558",
        "count": 8
    },
    {
        "address": "沪闵路8390弄",
        "name": "迎春园",
        "lnglat": "121.411504,31.139805",
        "count": 3
    },
    {
        "address": "沪闵路9260号",
        "name": "徐汇公寓",
        "lnglat": "121.432774,31.161938",
        "count": 32
    },
    {
        "address": "沪闵路9450号",
        "name": "农资大楼",
        "lnglat": "121.433545,31.163545",
        "count": 4
    },
    {
        "address": "沪闵路9510号",
        "name": "泰成商务楼",
        "lnglat": "121.433937,31.166167",
        "count": 2
    },
    {
        "address": "沪闵路9512弄",
        "name": "泰成花苑",
        "lnglat": "121.432279,31.168040",
        "count": 48
    },
    {
        "address": "沪南公路2633弄",
        "name": "汇宝中心",
        "lnglat": "121.567707,31.147745",
        "count": 6
    },
    {
        "address": "沪南公路3665号",
        "name": "上海金盾大厦",
        "lnglat": "121.570528,31.104846",
        "count": 8
    },
    {
        "address": "沪南公路5268号",
        "name": "宏澜智慧谷",
        "lnglat": "121.590737,31.046052",
        "count": 3
    },
    {
        "address": "沪南公路9875号",
        "name": "润业大厦",
        "lnglat": "121.739583,31.041050",
        "count": 2
    },
    {
        "address": "沪南公路9999号",
        "name": "沪南公路9999号办公楼",
        "lnglat": "121.741395,31.041382",
        "count": 1
    },
    {
        "address": "沪南路2199号",
        "name": "万科海上传奇(御桥芳澜苑)",
        "lnglat": "121.565302,31.159413",
        "count": 50
    },
    {
        "address": "沪南路2419弄",
        "name": "地杰商业大厦",
        "lnglat": "121.565075,31.155984",
        "count": 49
    },
    {
        "address": "沪南路2518弄",
        "name": "百舸馨苑",
        "lnglat": "121.565677,31.150429",
        "count": 24
    },
    {
        "address": "沪南路2688弄",
        "name": "绿地康桥新苑（上海）",
        "lnglat": "121.563881,31.138023",
        "count": 1
    },
    {
        "address": "沪南路3736弄5号",
        "name": "蒋蒋商务园",
        "lnglat": "121.568623,31.099192",
        "count": 3
    },
    {
        "address": "沪青平公路2799弄",
        "name": "珠江国际中心悦公馆",
        "lnglat": "121.232218,31.151771",
        "count": 21
    },
    {
        "address": "沪青平公路2799弄60号",
        "name": "珠江国际中心悦公馆（商务楼）",
        "lnglat": "121.233078,31.152358",
        "count": 8
    },
    {
        "address": "沪青平公路3908号",
        "name": "松港智创天地",
        "lnglat": "121.175768,31.147519",
        "count": 40
    },
    {
        "address": "沪青平公路3938弄",
        "name": "移动智地青浦",
        "lnglat": "121.174064,31.147685",
        "count": 2
    },
    {
        "address": "沪青平公路5599弄",
        "name": "金地格林郡",
        "lnglat": "121.102790,31.134603",
        "count": 20
    },
    {
        "address": "沪松公路1177号",
        "name": "佳预信息科技大厦",
        "lnglat": "121.329681,31.144534",
        "count": 43
    },
    {
        "address": "沪松公路1197号",
        "name": "星汇大厦(上海)",
        "lnglat": "121.328751,31.143944",
        "count": 3
    },
    {
        "address": "沪松公路1221号",
        "name": "星晨商务大厦",
        "lnglat": "121.327845,31.142867",
        "count": 7
    },
    {
        "address": "沪松公路1251号",
        "name": "云端电商家园",
        "lnglat": "121.326633,31.142776",
        "count": 4
    },
    {
        "address": "沪松公路1399弄",
        "name": "九久青年城",
        "lnglat": "121.320464,31.136748",
        "count": 95
    },
    {
        "address": "沪松公路1658号",
        "name": "九润商务大厦(九亭)",
        "lnglat": "121.306990,31.134414",
        "count": 11
    },
    {
        "address": "沪松公路2517弄",
        "name": "丽水豪庭",
        "lnglat": "121.284907,31.113939",
        "count": 93
    },
    {
        "address": "沪松公路2749弄1-2号",
        "name": "新南丽都",
        "lnglat": "121.278619,31.109317",
        "count": 9
    },
    {
        "address": "沪松公路2751号",
        "name": "新南丽都商务大楼",
        "lnglat": "121.278446,31.109203",
        "count": 9
    },
    {
        "address": "沪松公路2972弄22号",
        "name": "绿波景园",
        "lnglat": "121.274167,31.108927",
        "count": 100
    },
    {
        "address": "沪松公路3023号",
        "name": "九创文邑",
        "lnglat": "121.271404,31.105484",
        "count": 2
    },
    {
        "address": "沪松公路3128弄",
        "name": "永翔商务广场",
        "lnglat": "121.267438,31.101711",
        "count": 18
    },
    {
        "address": "沪松路999号",
        "name": "柴火空间(亚洲)青年创客中心",
        "lnglat": "121.256090,31.033101",
        "count": 6
    },
    {
        "address": "沪淞公路565弄",
        "name": "水清年华花园",
        "lnglat": "121.337714,31.149609",
        "count": 139
    },
    {
        "address": "沪太路1108号",
        "name": "五冶广场",
        "lnglat": "121.426695,31.280133",
        "count": 15
    },
    {
        "address": "沪太路1111号",
        "name": "孩子王(上海静安大融城店)",
        "lnglat": "121.427154,31.279751",
        "count": 2
    },
    {
        "address": "沪太路1111弄",
        "name": "静安大融城",
        "lnglat": "121.426760,31.280139",
        "count": 40
    },
    {
        "address": "沪太路1228号",
        "name": "魔方公寓行知路店",
        "lnglat": "121.425077,31.278463",
        "count": 2
    },
    {
        "address": "沪太路140弄",
        "name": "展望大厦",
        "lnglat": "121.456540,31.253409",
        "count": 8
    },
    {
        "address": "沪太路1618号",
        "name": "向阳900不夜城",
        "lnglat": "121.422253,31.282911",
        "count": 4
    },
    {
        "address": "沪太路1861弄39号",
        "name": "岛里创新园",
        "lnglat": "121.420801,31.290460",
        "count": 14
    },
    {
        "address": "沪太路1866号",
        "name": "诺诚M7创意园",
        "lnglat": "121.416970,31.290873",
        "count": 20
    },
    {
        "address": "沪太路2899弄",
        "name": "绿地科技中心",
        "lnglat": "121.410009,31.314624",
        "count": 12
    },
    {
        "address": "沪太路315弄2号",
        "name": "华舟公寓",
        "lnglat": "121.453117,31.255129",
        "count": 7
    },
    {
        "address": "沪太路4290号",
        "name": "1876新视觉产业园",
        "lnglat": "121.402312,31.336141",
        "count": 3
    },
    {
        "address": "沪太路4361号",
        "name": "海宝示范园",
        "lnglat": "121.397145,31.344933",
        "count": 6
    },
    {
        "address": "沪太路453弄88号",
        "name": "兴联公寓",
        "lnglat": "121.452147,31.256504",
        "count": 8
    },
    {
        "address": "沪太路555弄",
        "name": "和泰花园",
        "lnglat": "121.451006,31.257235",
        "count": 48
    },
    {
        "address": "沪太路655弄2号，3号",
        "name": "金纺大厦",
        "lnglat": "121.447889,31.261846",
        "count": 18
    },
    {
        "address": "沪太路6598号",
        "name": "金岷大厦",
        "lnglat": "121.326912,31.452983",
        "count": 5
    },
    {
        "address": "沪太路799号",
        "name": "上海新慧谷科技产业园",
        "lnglat": "121.443847,31.266486",
        "count": 10
    },
    {
        "address": "沪太路903弄",
        "name": "佳宁花园",
        "lnglat": "121.436493,31.273448",
        "count": 125
    },
    {
        "address": "沪太路941弄1-12号",
        "name": "绿柳苑",
        "lnglat": "121.431363,31.274360",
        "count": 16
    },
    {
        "address": "沪太支路538号",
        "name": "飞马旅5iCENTER",
        "lnglat": "121.423366,31.291563",
        "count": 16
    },
    {
        "address": "沪亭北路1080弄",
        "name": "金丰蓝庭一期",
        "lnglat": "121.312314,31.155797",
        "count": 216
    },
    {
        "address": "沪亭北路199弄",
        "name": "九亭中心",
        "lnglat": "121.318250,31.141282",
        "count": 95
    },
    {
        "address": "沪亭北路199弄10号楼",
        "name": "宝龙公寓(九亭中心)",
        "lnglat": "121.316418,31.141570",
        "count": 18
    },
    {
        "address": "沪亭北路618弄",
        "name": "九城湖滨国际公寓",
        "lnglat": "121.318706,31.149384",
        "count": 432
    },
    {
        "address": "沪亭北路900弄",
        "name": "金丰蓝庭二期",
        "lnglat": "121.312751,31.153314",
        "count": 92
    },
    {
        "address": "沪亭北路901弄",
        "name": "金丰蓝庭三期",
        "lnglat": "121.312751,31.153314",
        "count": 110
    },
    {
        "address": "沪亭路240弄",
        "name": "美丽星城",
        "lnglat": "121.325795,31.133542",
        "count": 180
    },
    {
        "address": "沪亭路880号",
        "name": "云亭德必易园",
        "lnglat": "121.324291,31.136663",
        "count": 20
    },
    {
        "address": "沪亭南路208弄",
        "name": "紫金花园",
        "lnglat": "121.328051,31.124839",
        "count": 33
    },
    {
        "address": "沪宜公路1158号",
        "name": "南翔印象城",
        "lnglat": "121.303437,31.295427",
        "count": 39
    },
    {
        "address": "沪宜公路2641号",
        "name": "远香湖1号商务楼",
        "lnglat": "121.275378,31.346172",
        "count": 9
    },
    {
        "address": "沪宜公路2857号",
        "name": "明发嘉定商业广场",
        "lnglat": "121.267506,31.356967",
        "count": 11
    },
    {
        "address": "沪宜公路3066弄",
        "name": "南北周嘉苑",
        "lnglat": "121.262060,31.366047",
        "count": 26
    },
    {
        "address": "沪宜公路3099号",
        "name": "绿地嘉创国际商务广场",
        "lnglat": "121.257641,31.368380",
        "count": 7
    },
    {
        "address": "沪宜公路3128号",
        "name": "嘉尚国际广场",
        "lnglat": "121.260246,31.367921",
        "count": 16
    },
    {
        "address": "沪宜路1101号",
        "name": "越界南翔智地产业园（ 南翔智地三期越界产业园）",
        "lnglat": "120.114884,31.548863",
        "count": 16
    },
    {
        "address": "花木路1983号",
        "name": "四季雅苑",
        "lnglat": "121.569014,31.218067",
        "count": 34
    },
    {
        "address": "花木路500弄",
        "name": "花木苑",
        "lnglat": "121.543330,31.210106",
        "count": 39
    },
    {
        "address": "花木路718弄",
        "name": "绿缘公寓",
        "lnglat": "121.548309,31.209647",
        "count": 54
    },
    {
        "address": "花木路838号",
        "name": "影城小筑",
        "lnglat": "121.552163,31.210854",
        "count": 4
    },
    {
        "address": "花木路908号",
        "name": "雍景台（上海）",
        "lnglat": "121.553180,31.211117",
        "count": 21
    },
    {
        "address": "花木路916弄",
        "name": "四季全景台",
        "lnglat": "121.553822,31.211030",
        "count": 31
    },
    {
        "address": "花山路333弄",
        "name": "宝厦雅苑",
        "lnglat": "121.569305,31.346236",
        "count": 14
    },
    {
        "address": "花山路796弄",
        "name": "花山锦地苑",
        "lnglat": "121.578287,31.348201",
        "count": 28
    },
    {
        "address": "花园路16号",
        "name": "嘉和国际大厦",
        "lnglat": "109.762297,32.743204",
        "count": 9
    },
    {
        "address": "花园路88号",
        "name": "华博科技大厦",
        "lnglat": "113.760942,23.051386",
        "count": 3
    },
    {
        "address": "花园石桥路33号",
        "name": "花旗集团大厦",
        "lnglat": "121.500452,31.234036",
        "count": 40
    },
    {
        "address": "花园石桥路66号",
        "name": "东亚银行金融大厦",
        "lnglat": "121.502346,31.234057",
        "count": 59
    },
    {
        "address": "花园宅路52、190弄",
        "name": "共康雅苑一期",
        "lnglat": "121.423763,31.328965",
        "count": 72
    },
    {
        "address": "华蔡路655",
        "name": "集池宇智造创新园",
        "lnglat": "121.199363,31.242032",
        "count": 6
    },
    {
        "address": "华昌路183弄",
        "name": "华清名苑",
        "lnglat": "114.000642,22.675632",
        "count": 47
    },
    {
        "address": "华昌路79号",
        "name": "华昌公寓(上海)",
        "lnglat": "102.705101,25.020277",
        "count": 5
    },
    {
        "address": "华昌路9号",
        "name": "金象大厦",
        "lnglat": "113.998326,22.679254",
        "count": 12
    },
    {
        "address": "华戴路599弄 ",
        "name": "凯佳公寓二期",
        "lnglat": "121.700093,31.175652",
        "count": 73
    },
    {
        "address": "华发路258号",
        "name": "东阔生活广场",
        "lnglat": "121.450018,31.127170",
        "count": 10
    },
    {
        "address": "华发路99弄",
        "name": "明丰新纪苑",
        "lnglat": "121.453731,31.125658",
        "count": 108
    },
    {
        "address": "华光路300弄",
        "name": "凯迪华光公寓",
        "lnglat": "118.112480,24.509070",
        "count": 43
    },
    {
        "address": "华和路602弄",
        "name": "华和路600弄",
        "lnglat": "121.397916,31.291466",
        "count": 16
    },
    {
        "address": "华江路1260弄12号",
        "name": "上海禾智谷科创园",
        "lnglat": "121.324182,31.227961",
        "count": 7
    },
    {
        "address": "华江路129弄",
        "name": "华江路129弄园区",
        "lnglat": "121.342550,31.253450",
        "count": 7
    },
    {
        "address": "华江路720号",
        "name": "歆翱商务大厦",
        "lnglat": "121.329138,31.243615",
        "count": 7
    },
    {
        "address": "华江支路328弄",
        "name": "天际蓝桥",
        "lnglat": "121.340646,31.259804",
        "count": 180
    },
    {
        "address": "华泾路599弄",
        "name": "漓江花园（上海漓江山水）",
        "lnglat": "121.452582,31.118486",
        "count": 91
    },
    {
        "address": "华科东路218号",
        "name": "新城盛景",
        "lnglat": "121.145968,31.160243",
        "count": 448
    },
    {
        "address": "华科路399弄",
        "name": "青水湾公寓",
        "lnglat": "121.137019,31.157897",
        "count": 10
    },
    {
        "address": "华灵路1681弄、1781弄",
        "name": "康华苑",
        "lnglat": "121.409615,31.281269",
        "count": 64
    },
    {
        "address": "华灵路81弄",
        "name": "南华苑东座",
        "lnglat": "121.424073,31.271766",
        "count": 15
    },
    {
        "address": "华隆路1758号",
        "name": "增洲大厦",
        "lnglat": "121.213242,31.220698",
        "count": 19
    },
    {
        "address": "华隆路1777号",
        "name": "e通世界科技园(华新园）",
        "lnglat": "121.212759,31.219055",
        "count": 88
    },
    {
        "address": "华隆路1788号",
        "name": "境琦科创园",
        "lnglat": "121.211701,31.221337",
        "count": 35
    },
    {
        "address": "华南路555号",
        "name": "顺丰上海产业园",
        "lnglat": "113.172786,27.845708",
        "count": 6
    },
    {
        "address": "华南路680号",
        "name": "梁杭电商U库",
        "lnglat": "121.201266,31.229284",
        "count": 5
    },
    {
        "address": "华宁路1399弄",
        "name": "华银坊",
        "lnglat": "121.390536,31.023714",
        "count": 32
    },
    {
        "address": "华宁路3333号",
        "name": "海联智谷",
        "lnglat": "121.381848,31.055937",
        "count": 44
    },
    {
        "address": "华鹏路300弄",
        "name": "大华锦绣华城14街区",
        "lnglat": "121.525872,31.174872",
        "count": 185
    },
    {
        "address": "华坪路100号",
        "name": "上海帝景园",
        "lnglat": "121.420695,31.000436",
        "count": 10
    },
    {
        "address": "华青路995弄",
        "name": "亿燕人才公寓",
        "lnglat": "121.129697,31.178536",
        "count": 5
    },
    {
        "address": "华青南路481-485号",
        "name": "芊岱大厦",
        "lnglat": "121.133846,31.146119",
        "count": 12
    },
    {
        "address": "华青南路99弄",
        "name": "仁恒运杰河滨花园",
        "lnglat": "121.133421,31.140312",
        "count": 141
    },
    {
        "address": "华秋路349弄",
        "name": "保利叶之林",
        "lnglat": "121.379297,31.325796",
        "count": 103
    },
    {
        "address": "华山路1520弄",
        "name": "恒力公寓（上海）",
        "lnglat": "103.706362,36.538125",
        "count": 6
    },
    {
        "address": "华山路1520弄25号",
        "name": "华山嘉苑",
        "lnglat": "103.706362,36.538125",
        "count": 12
    },
    {
        "address": "华山路1520弄55号",
        "name": "正力公寓",
        "lnglat": "103.706362,36.538125",
        "count": 9
    },
    {
        "address": "华山路1643弄",
        "name": "华山花苑",
        "lnglat": "103.705653,36.540357",
        "count": 55
    },
    {
        "address": "华山路1765弄",
        "name": "海斯大厦（裙楼）",
        "lnglat": "103.705131,36.542993",
        "count": 1
    },
    {
        "address": "华山路1765弄2号",
        "name": "海斯大厦",
        "lnglat": "103.705131,36.542993",
        "count": 17
    },
    {
        "address": "华山路2088号",
        "name": "汇银广场",
        "lnglat": "103.703857,36.550232",
        "count": 2
    },
    {
        "address": "华山路2号",
        "name": "静安高和大厦",
        "lnglat": "113.473900,22.963825",
        "count": 3
    },
    {
        "address": "华山路301号",
        "name": "上海静安商楼",
        "lnglat": "114.285697,35.753047",
        "count": 8
    },
    {
        "address": "华山路868弄",
        "name": "总统公寓",
        "lnglat": "103.705253,36.518497",
        "count": 24
    },
    {
        "address": "华申路150号",
        "name": "华申路150号",
        "lnglat": "121.599135,31.340473",
        "count": 3
    },
    {
        "address": "华申路180号",
        "name": "唯恩富勤大楼",
        "lnglat": "121.600783,31.340986",
        "count": 4
    },
    {
        "address": "华申路198号",
        "name": "六宁大厦",
        "lnglat": "121.601136,31.341503",
        "count": 20
    },
    {
        "address": "华申路215号",
        "name": "自贸壹号simbaypark（二期）",
        "lnglat": "121.600358,31.340201",
        "count": 26
    },
    {
        "address": "华申路221号",
        "name": "诺至未（中航兰田）",
        "lnglat": "121.601576,31.340679",
        "count": 24
    },
    {
        "address": "华佗路678号",
        "name": "高科苑",
        "lnglat": "113.813066,34.029704",
        "count": 84
    },
    {
        "address": "华西路600号",
        "name": "优大科技园",
        "lnglat": "121.365522,31.067926",
        "count": 19
    },
    {
        "address": "华夏东路2345弄",
        "name": "水景豪园",
        "lnglat": "121.697991,31.201149",
        "count": 92
    },
    {
        "address": "华新镇华强街203弄",
        "name": "三友星墅",
        "lnglat": "121.233932,31.241845",
        "count": 10
    },
    {
        "address": "华绣路179弄255弄",
        "name": "艾南花苑",
        "lnglat": "121.526321,31.186083",
        "count": 73
    },
    {
        "address": "华徐公路1199号",
        "name": "碧家国际社区(国家会展中心店)",
        "lnglat": "121.262756,31.201928",
        "count": 9
    },
    {
        "address": "华徐公路3029弄5号",
        "name": "MeGa美格文创园",
        "lnglat": "121.253798,31.212515",
        "count": 36
    },
    {
        "address": "华徐公路569号",
        "name": "麦迪睿医械e港",
        "lnglat": "121.267670,31.190950",
        "count": 21
    },
    {
        "address": "华徐公路605号",
        "name": "西虹桥德必易园",
        "lnglat": "121.266721,31.195201",
        "count": 36
    },
    {
        "address": "华徐公路628号",
        "name": "虹桥奇点科创园",
        "lnglat": "121.268242,31.195866",
        "count": 21
    },
    {
        "address": "华徐公路685号",
        "name": "e通世界",
        "lnglat": "121.265139,31.196553",
        "count": 27
    },
    {
        "address": "华徐公路966号",
        "name": "法姬娜大厦",
        "lnglat": "121.265668,31.201155",
        "count": 22
    },
    {
        "address": "华莹山路300弄",
        "name": "惠泽苑",
        "lnglat": "121.215979,31.130636",
        "count": 96
    },
    {
        "address": "华莹山路450弄",
        "name": "莘泽苑",
        "lnglat": "121.214978,31.133383",
        "count": 288
    },
    {
        "address": "华友路260弄",
        "name": "碧林湾南苑",
        "lnglat": "121.356285,31.136564",
        "count": 30
    },
    {
        "address": "华友路550弄",
        "name": "碧林湾二期",
        "lnglat": "121.356722,31.136820",
        "count": 160
    },
    {
        "address": "华展路168弄",
        "name": "景华新苑",
        "lnglat": "121.448985,31.112173",
        "count": 200
    },
    {
        "address": "华志路1258号-1",
        "name": "华志科创园",
        "lnglat": "121.213956,31.230592",
        "count": 10
    },
    {
        "address": "华志路859、903弄",
        "name": "绿地逸湾",
        "lnglat": "121.223606,31.230572",
        "count": 128
    },
    {
        "address": "华中路6号",
        "name": "七宝德必易园",
        "lnglat": "113.221844,22.669254",
        "count": 38
    },
    {
        "address": "化成路366弄-8",
        "name": "三水国际广场",
        "lnglat": "121.499711,31.379464",
        "count": 14
    },
    {
        "address": "怀德路366弄",
        "name": "保利香槟花园二期保利香槟花园",
        "lnglat": "121.526300,31.256380",
        "count": 52
    },
    {
        "address": "怀德路383弄",
        "name": "保利香槟苑一期",
        "lnglat": "121.526454,31.255528",
        "count": 16
    },
    {
        "address": "淮安路717号",
        "name": "717工坊",
        "lnglat": "121.451149,31.239448",
        "count": 5
    },
    {
        "address": "淮海东路45号",
        "name": "东淮海国际大厦(东淮海壹号)",
        "lnglat": "119.034154,33.598211",
        "count": 19
    },
    {
        "address": "淮海东路85号",
        "name": "淮海商业大厦",
        "lnglat": "121.481510,31.225891",
        "count": 5
    },
    {
        "address": "淮海东路99号",
        "name": "恒积大厦",
        "lnglat": "116.949393,34.184917",
        "count": 25
    },
    {
        "address": "淮海西路343号",
        "name": "淮海鑫城苑",
        "lnglat": "121.425103,31.197029",
        "count": 51
    },
    {
        "address": "淮海西路358弄",
        "name": "淮海世纪花苑",
        "lnglat": "121.426859,31.199579",
        "count": 33
    },
    {
        "address": "淮海西路442弄124支弄86-88号",
        "name": "爱迪公寓",
        "lnglat": "121.424120,31.201407",
        "count": 10
    },
    {
        "address": "淮海西路55号",
        "name": "申通信息广场",
        "lnglat": "116.926153,34.181578",
        "count": 7
    },
    {
        "address": "淮海西路666号",
        "name": "中山万博国际中心",
        "lnglat": "120.110662,32.514974",
        "count": 12
    },
    {
        "address": "淮海中路1010号",
        "name": "嘉华中心（上海）",
        "lnglat": "121.456013,31.216069",
        "count": 35
    },
    {
        "address": "淮海中路1045号",
        "name": "淮海国际广场",
        "lnglat": "121.456413,31.215104",
        "count": 70
    },
    {
        "address": "淮海中路138号",
        "name": "上海广场",
        "lnglat": "116.981567,33.635402",
        "count": 1
    },
    {
        "address": "淮海中路1500号",
        "name": "鸿艺豪苑",
        "lnglat": "121.445719,31.209395",
        "count": 6
    },
    {
        "address": "淮海中路1950弄2号",
        "name": "兴国大厦",
        "lnglat": "121.437532,31.204122",
        "count": 3
    },
    {
        "address": "淮海中路1号",
        "name": "柳林大厦",
        "lnglat": "116.981145,33.651313",
        "count": 3
    },
    {
        "address": "淮海中路282号",
        "name": "香港广场",
        "lnglat": "116.981303,33.639171",
        "count": 16
    },
    {
        "address": "淮海中路2--8号",
        "name": "兰生大厦",
        "lnglat": "116.980450,33.642110",
        "count": 28
    },
    {
        "address": "淮海中路300号",
        "name": "香港新世界大厦(写字楼)",
        "lnglat": "116.981355,33.640268",
        "count": 89
    },
    {
        "address": "淮海中路398号",
        "name": "博银国际大厦",
        "lnglat": "116.981028,33.641853",
        "count": 2
    },
    {
        "address": "淮海中路438号",
        "name": "兴城商厦",
        "lnglat": "116.980864,33.643430",
        "count": 3
    },
    {
        "address": "淮海中路527号",
        "name": "上海锦江国际购物中心",
        "lnglat": "121.468946,31.220483",
        "count": 3
    },
    {
        "address": "淮海中路755号",
        "name": "新华联大厦",
        "lnglat": "116.980194,33.654938",
        "count": 11
    },
    {
        "address": "淮海中路887号",
        "name": "永新大厦",
        "lnglat": "121.461115,31.217353",
        "count": 22
    },
    {
        "address": "淮海中路918号",
        "name": "久事复兴大厦",
        "lnglat": "121.459144,31.217605",
        "count": 39
    },
    {
        "address": "淮海中路93号",
        "name": "大上海时代广场",
        "lnglat": "116.980286,33.653462",
        "count": 2
    },
    {
        "address": "淮海中路98号",
        "name": "金钟广场",
        "lnglat": "116.980734,33.638683",
        "count": 6
    },
    {
        "address": "环城东路58号",
        "name": "南上海人才大厦",
        "lnglat": "101.475793,35.034170",
        "count": 8
    },
    {
        "address": "环城东路68号",
        "name": "综星大厦",
        "lnglat": "103.764805,24.524755",
        "count": 11
    },
    {
        "address": "环城路200号",
        "name": "徐行大厦",
        "lnglat": "115.898593,24.574890",
        "count": 4
    },
    {
        "address": "环城路2222号",
        "name": "嘉乐园商务大厦",
        "lnglat": "112.900546,23.157598",
        "count": 24
    },
    {
        "address": "环城路2390号",
        "name": "嘉加德必易园",
        "lnglat": "121.238275,31.382689",
        "count": 8
    },
    {
        "address": "环城路762弄5号楼",
        "name": "信业未来中心",
        "lnglat": "106.856417,37.633060",
        "count": 6
    },
    {
        "address": "环城路886弄",
        "name": "同济城市雅筑",
        "lnglat": "112.901607,23.157507",
        "count": 78
    },
    {
        "address": "环城西路2511号1栋",
        "name": "菱光大厦",
        "lnglat": "115.416469,25.953009",
        "count": 18
    },
    {
        "address": "环城西路2511号2栋",
        "name": "上海现代服务业南桥科创园",
        "lnglat": "107.592071,23.313150",
        "count": 26
    },
    {
        "address": "环湖西路588号",
        "name": "广昊世纪大厦",
        "lnglat": "103.830963,30.046876",
        "count": 30
    },
    {
        "address": "环科路515号",
        "name": "绿地智创商务中心",
        "lnglat": "121.603101,31.176800",
        "count": 62
    },
    {
        "address": "环科路999弄",
        "name": "浦东国际人才港",
        "lnglat": "121.614245,31.181818",
        "count": 6
    },
    {
        "address": "环林东路270弄",
        "name": "樱桃苑",
        "lnglat": "121.524368,31.148196",
        "count": 320
    },
    {
        "address": "环林东路875弄",
        "name": "杉林新月三期",
        "lnglat": "121.530225,31.140498",
        "count": 198
    },
    {
        "address": "环林东路879弄",
        "name": "杉林新月一期",
        "lnglat": "121.529765,31.139706",
        "count": 20
    },
    {
        "address": "环龙路263弄",
        "name": "怡东花园",
        "lnglat": "121.526994,31.203284",
        "count": 149
    },
    {
        "address": "环桥路1488弄",
        "name": "文怡苑二期",
        "lnglat": "121.603498,31.141829",
        "count": 37
    },
    {
        "address": "环桥路555弄",
        "name": "星月总部湾",
        "lnglat": "121.606097,31.124858",
        "count": 10
    },
    {
        "address": "环庆南路239",
        "name": "庆利苑",
        "lnglat": "121.724786,31.229014",
        "count": 219
    },
    {
        "address": "环镇北路1118弄",
        "name": "同瓴佳苑",
        "lnglat": "121.390792,31.307338",
        "count": 104
    },
    {
        "address": "环镇北路699弄",
        "name": "上大阳光乾泽园",
        "lnglat": "121.402149,31.309589",
        "count": 45
    },
    {
        "address": "环镇南路1506弄",
        "name": "汇秀雅苑",
        "lnglat": "121.389679,31.174092",
        "count": 28
    },
    {
        "address": "环镇南路200弄",
        "name": "万源新城四期",
        "lnglat": "121.364058,30.236441",
        "count": 152
    },
    {
        "address": "环镇南路858-888号",
        "name": "中环天地",
        "lnglat": "121.450189,28.531395",
        "count": 22
    },
    {
        "address": "环镇南路88弄58号",
        "name": "苹果园",
        "lnglat": "119.876378,29.174342",
        "count": 14
    },
    {
        "address": "黄陂北路227号",
        "name": "中区广场",
        "lnglat": "121.470383,31.229261",
        "count": 17
    },
    {
        "address": "黄陂南路700号",
        "name": "卓维700西区",
        "lnglat": "121.476765,31.214126",
        "count": 6
    },
    {
        "address": "黄河路21号",
        "name": "鸿祥大厦",
        "lnglat": "106.702567,26.521221",
        "count": 16
    },
    {
        "address": "黄河路288号",
        "name": "福海公寓",
        "lnglat": "106.700223,26.514774",
        "count": 9
    },
    {
        "address": "黄桦路247号",
        "name": "俊领国际_黄桦路247号",
        "lnglat": "121.364539,31.180123",
        "count": 3
    },
    {
        "address": "黄桦路369弄",
        "name": "嘉富丽苑",
        "lnglat": "121.363663,31.183461",
        "count": 171
    },
    {
        "address": "黄家花园路998弄28楼",
        "name": "嘉璞汇",
        "lnglat": "121.324707,31.271024",
        "count": 3
    },
    {
        "address": "黄家撅路92号",
        "name": "海文商务楼黄家厥路",
        "lnglat": "114.943544,27.062867",
        "count": 1
    },
    {
        "address": "黄家路18号",
        "name": "南门大厦",
        "lnglat": "114.055193,29.532713",
        "count": 8
    },
    {
        "address": "黄家路88弄",
        "name": "浩城华苑",
        "lnglat": "121.777148,31.025745",
        "count": 33
    },
    {
        "address": "黄家阙路65-69号",
        "name": "惠德大厦",
        "lnglat": "121.487413,31.214838",
        "count": 7
    },
    {
        "address": "黄家阙路99号",
        "name": "惠德公寓",
        "lnglat": "121.487996,31.214931",
        "count": 15
    },
    {
        "address": "黄金城道258号",
        "name": "古北嘉年华庭",
        "lnglat": "121.408066,31.193011",
        "count": 106
    },
    {
        "address": "黄金城道500弄",
        "name": "古北瑞仕花园",
        "lnglat": "121.403317,31.195192",
        "count": 16
    },
    {
        "address": "黄金城道555弄",
        "name": "华丽家族",
        "lnglat": "121.403744,31.194351",
        "count": 82
    },
    {
        "address": "黄金城道688弄9号",
        "name": "御翠豪庭",
        "lnglat": "121.398981,31.197217",
        "count": 33
    },
    {
        "address": "黄金城道777号",
        "name": "黄金豪园",
        "lnglat": "121.397609,31.195204",
        "count": 27
    },
    {
        "address": "黄泥娄路108号",
        "name": "首创禧悦铭庭",
        "lnglat": "121.088593,31.132830",
        "count": 24
    },
    {
        "address": "黄泥娄路287号",
        "name": "禧悦佳苑",
        "lnglat": "121.085306,31.132530",
        "count": 75
    },
    {
        "address": "黄浦路53号",
        "name": "海湾大厦",
        "lnglat": "121.491652,31.244506",
        "count": 11
    },
    {
        "address": "黄浦路99号",
        "name": "上海滩国际大厦",
        "lnglat": "121.483462,31.247648",
        "count": 13
    },
    {
        "address": "黄山路77 99 131号",
        "name": "黄山坊",
        "lnglat": "116.746742,23.378250",
        "count": 6
    },
    {
        "address": "黄石路80弄",
        "name": "龙龙家园",
        "lnglat": "121.452937,31.156816",
        "count": 6
    },
    {
        "address": "黄兴路156号",
        "name": "五星大厦",
        "lnglat": "121.532186,31.271784",
        "count": 5
    },
    {
        "address": "黄兴路1599弄",
        "name": "新纪元国际广场",
        "lnglat": "114.298887,30.590028",
        "count": 17
    },
    {
        "address": "黄兴路1675号",
        "name": "五角场科技大楼",
        "lnglat": "121.520281,31.288821",
        "count": 1
    },
    {
        "address": "黄兴路1725号",
        "name": "怡富商务广场",
        "lnglat": "121.519329,31.290477",
        "count": 8
    },
    {
        "address": "黄兴路1728号2号楼",
        "name": "东方蓝海国际广场写字楼",
        "lnglat": "121.521080,31.290132",
        "count": 20
    },
    {
        "address": "黄兴路1778号1号楼",
        "name": "东方蓝海国际广场公寓",
        "lnglat": "121.520846,31.290397",
        "count": 14
    },
    {
        "address": "黄兴路1818号",
        "name": "海上财智商务中心",
        "lnglat": "121.519943,31.292115",
        "count": 17
    },
    {
        "address": "黄兴路1999弄",
        "name": "皇朝新城",
        "lnglat": "121.518141,31.292564",
        "count": 26
    },
    {
        "address": "黄兴路1号",
        "name": "中通大厦",
        "lnglat": "103.961215,22.507149",
        "count": 9
    },
    {
        "address": "黄兴路2005弄2号",
        "name": "杨浦科技大厦",
        "lnglat": "121.517828,31.293762",
        "count": 11
    },
    {
        "address": "黄兴路2030弄",
        "name": "蓝天小区1号院",
        "lnglat": "114.299024,30.589630",
        "count": 15
    },
    {
        "address": "黄兴路2053弄",
        "name": "蓝天小区2号院",
        "lnglat": "121.516984,31.296185",
        "count": 83
    },
    {
        "address": "黄兴路2077号",
        "name": "上海蓝天大厦",
        "lnglat": "121.516181,31.297777",
        "count": 3
    },
    {
        "address": "黄兴路2218号",
        "name": "合生国际中心",
        "lnglat": "121.517431,31.299654",
        "count": 48
    },
    {
        "address": "黄杨路69弄",
        "name": "信和花园",
        "lnglat": "121.589422,31.241622",
        "count": 48
    },
    {
        "address": "辉河路100号",
        "name": "复旦科技园_创业基地",
        "lnglat": "121.498938,31.290429",
        "count": 7
    },
    {
        "address": "辉河路118号",
        "name": "辉华大楼",
        "lnglat": "121.498563,31.290792",
        "count": 9
    },
    {
        "address": "回城南路930弄",
        "name": "香溢都荟",
        "lnglat": "121.260427,31.364461",
        "count": 144
    },
    {
        "address": "汇滨路1689号",
        "name": "力康科创园(上海意称液压系统有限公司)",
        "lnglat": "121.160036,31.173311",
        "count": 9
    },
    {
        "address": "汇川路99弄",
        "name": "新时空国际商务广场",
        "lnglat": "121.417032,31.216922",
        "count": 42
    },
    {
        "address": "汇丰北路1515弄",
        "name": "德国科创中心",
        "lnglat": "121.462320,30.967937",
        "count": 63
    },
    {
        "address": "汇丰西路1399号",
        "name": "汇丰名都",
        "lnglat": "121.467229,30.955808",
        "count": 62
    },
    {
        "address": "汇金路590号",
        "name": "青浦宝龙广场",
        "lnglat": "121.152885,31.162206",
        "count": 48
    },
    {
        "address": "汇庆路366号",
        "name": "怡新生命科技园",
        "lnglat": "121.706545,31.246095",
        "count": 7
    },
    {
        "address": "汇秋路16弄",
        "name": "浦江瑞和城陆街区(南区)",
        "lnglat": "121.522227,31.030811",
        "count": 175
    },
    {
        "address": "汇舒路54弄",
        "name": "浦江瑞和城柒街区",
        "lnglat": "121.518393,31.029449",
        "count": 138
    },
    {
        "address": "汇延路199弄",
        "name": "瑞和城壹街区",
        "lnglat": "121.516531,31.023916",
        "count": 224
    },
    {
        "address": "汇延路59弄",
        "name": "瑞和城",
        "lnglat": "121.516224,31.021249",
        "count": 178
    },
    {
        "address": "汇源路518弄",
        "name": "首创旭辉城",
        "lnglat": "121.200118,31.413584",
        "count": 200
    },
    {
        "address": "汇源路778弄",
        "name": "首创旭辉城2期",
        "lnglat": "121.198409,31.410886",
        "count": 24
    },
    {
        "address": "会恒路200弄：会恒路666弄",
        "name": "中建锦绣名都",
        "lnglat": "121.284768,31.182970",
        "count": 93
    },
    {
        "address": "会文路50号",
        "name": "永会大厦",
        "lnglat": "121.472835,31.252476",
        "count": 7
    },
    {
        "address": "惠民路1018弄",
        "name": "尚发华苑",
        "lnglat": "113.008414,22.603533",
        "count": 48
    },
    {
        "address": "惠南镇城南路918弄",
        "name": "人生港湾南欧城",
        "lnglat": "121.692081,31.188728",
        "count": 152
    },
    {
        "address": "霍山路340号",
        "name": "霍山大楼",
        "lnglat": "121.514158,31.256203",
        "count": 2
    },
    {
        "address": "霍山路398号",
        "name": "光大安石中心",
        "lnglat": "121.515873,31.257222",
        "count": 14
    },
    {
        "address": "霍山路777号",
        "name": "上海海鸥科创大厦",
        "lnglat": "121.519463,31.260367",
        "count": 39
    },
    {
        "address": "基隆路89号",
        "name": "振丰大厦",
        "lnglat": "121.590284,31.350331",
        "count": 25
    },
    {
        "address": "吉林路60号",
        "name": "三九商务楼",
        "lnglat": "122.067482,37.519268",
        "count": 9
    },
    {
        "address": "吉浦路355号",
        "name": "财大公寓",
        "lnglat": "121.491369,31.306135",
        "count": 42
    },
    {
        "address": "吉浦路395弄",
        "name": "吉浦路395弄小区",
        "lnglat": "121.490930,31.308715",
        "count": 14
    },
    {
        "address": "吉祥路38号",
        "name": "吉祥苑",
        "lnglat": "108.929600,34.222565",
        "count": 18
    },
    {
        "address": "纪翟路256号",
        "name": "华漕U天地",
        "lnglat": "121.292129,31.207821",
        "count": 27
    },
    {
        "address": "纪念路289弄",
        "name": "三湘世纪花城",
        "lnglat": "121.489247,31.298572",
        "count": 68
    },
    {
        "address": "纪念路335弄8号",
        "name": "凯阳新寓",
        "lnglat": "121.485913,31.297890",
        "count": 7
    },
    {
        "address": "纪念路486弄",
        "name": "荣振大厦",
        "lnglat": "121.484916,31.295598",
        "count": 8
    },
    {
        "address": "纪念路488弄",
        "name": "荣振馨苑",
        "lnglat": "121.484881,31.295571",
        "count": 30
    },
    {
        "address": "纪潭路75弄1-19号",
        "name": "虹桥茗雅苑",
        "lnglat": "121.266592,31.216453",
        "count": 92
    },
    {
        "address": "纪蕰路588号",
        "name": "智力产业园",
        "lnglat": "121.436690,31.339262",
        "count": 15
    },
    {
        "address": "季景路259弄",
        "name": "永久城市花园",
        "lnglat": "121.731451,29.933833",
        "count": 120
    },
    {
        "address": "季景路333弄",
        "name": "阳明花园二期",
        "lnglat": "121.591061,31.334130",
        "count": 46
    },
    {
        "address": "季景路555弄",
        "name": "仁恒家园",
        "lnglat": "121.593547,31.332674",
        "count": 108
    },
    {
        "address": "济阳路333弄",
        "name": "金色公馆(济阳苑)",
        "lnglat": "121.483413,31.161458",
        "count": 43
    },
    {
        "address": "加枫路20号",
        "name": "盛大天地盛贸中心",
        "lnglat": "121.605088,31.314228",
        "count": 7
    },
    {
        "address": "加枫路26号",
        "name": "科技楼",
        "lnglat": "121.605051,31.313300",
        "count": 17
    },
    {
        "address": "加枫路28号",
        "name": "新康楼",
        "lnglat": "121.605622,31.312963",
        "count": 4
    },
    {
        "address": "加太路29号",
        "name": "柴火空间",
        "lnglat": "121.604911,31.333265",
        "count": 5
    },
    {
        "address": "加太路29号2幢",
        "name": "兰宝大厦",
        "lnglat": "121.604911,31.333265",
        "count": 39
    },
    {
        "address": "佳乐路77弄",
        "name": "阳光国际公寓",
        "lnglat": "121.612298,31.269104",
        "count": 69
    },
    {
        "address": "佳木斯路353号",
        "name": "白玉兰环保广场",
        "lnglat": "121.535388,31.293711",
        "count": 11
    },
    {
        "address": "嘉安公路200弄1-30号",
        "name": "绿洲丰怡园",
        "lnglat": "121.232195,31.368393",
        "count": 192
    },
    {
        "address": "嘉川路225弄",
        "name": "嘉川公寓",
        "lnglat": "121.429542,31.139253",
        "count": 8
    },
    {
        "address": "嘉川路245号",
        "name": "华东理工科技园嘉川路园区",
        "lnglat": "121.429362,31.138582",
        "count": 14
    },
    {
        "address": "嘉好路1888号",
        "name": "嘉好科技园",
        "lnglat": "121.258738,31.300784",
        "count": 6
    },
    {
        "address": "嘉戬公路301弄",
        "name": "保利梧桐语（上海）",
        "lnglat": "121.275763,31.377086",
        "count": 65
    },
    {
        "address": "嘉罗公路336号",
        "name": "嘉定科创大厦",
        "lnglat": "121.262795,31.379302",
        "count": 16
    },
    {
        "address": "嘉美路269弄",
        "name": "云湖漫城",
        "lnglat": "121.292315,31.306511",
        "count": 44
    },
    {
        "address": "嘉美路777号",
        "name": "瑞华文化科技创意园",
        "lnglat": "121.283392,31.303325",
        "count": 7
    },
    {
        "address": "嘉善路251弄",
        "name": "嘉善公寓",
        "lnglat": "121.460470,31.207810",
        "count": 8
    },
    {
        "address": "嘉善路508号",
        "name": "尚街LOFT",
        "lnglat": "121.459783,31.204538",
        "count": 16
    },
    {
        "address": "嘉松北路6130弄176-183号、187-188、195-196号",
        "name": "上城名都南区",
        "lnglat": "121.220472,31.286926",
        "count": 24
    },
    {
        "address": "嘉松中路1299弄88号",
        "name": "兴悦智汇园",
        "lnglat": "121.216823,31.238909",
        "count": 2
    },
    {
        "address": "嘉松中路4528号",
        "name": "8090青年创业基地华新园",
        "lnglat": "121.222384,31.185076",
        "count": 27
    },
    {
        "address": "嘉松中路5888号",
        "name": "熊猫广场",
        "lnglat": "121.225864,31.151849",
        "count": 46
    },
    {
        "address": "嘉松中路6688弄",
        "name": "龙湖滟澜山二期",
        "lnglat": "121.227999,31.134040",
        "count": 251
    },
    {
        "address": "嘉松中路6788弄",
        "name": "龙湖滟澜山一期",
        "lnglat": "121.226411,31.130763",
        "count": 253
    },
    {
        "address": "嘉唐公路88弄",
        "name": "御江金都1期",
        "lnglat": "121.243780,31.397536",
        "count": 12
    },
    {
        "address": "嘉怡路296号",
        "name": "雯婕商务楼",
        "lnglat": "121.348417,31.264360",
        "count": 9
    },
    {
        "address": "嘉涌路88号",
        "name": "丽江佳苑（上海）",
        "lnglat": "121.337875,31.269090",
        "count": 29
    },
    {
        "address": "嘉涌路99号",
        "name": "MAX未来广场",
        "lnglat": "121.335838,31.269387",
        "count": 8
    },
    {
        "address": "嘉涌路99弄",
        "name": "Max未来",
        "lnglat": "121.335382,31.270316",
        "count": 56
    },
    {
        "address": "嘉园路361弄",
        "name": "金水丽苑",
        "lnglat": "121.493706,30.959599",
        "count": 178
    },
    {
        "address": "建德路1号",
        "name": "瑞建小区",
        "lnglat": "104.105112,30.671206",
        "count": 5
    },
    {
        "address": "建国西路285号",
        "name": "科投大厦",
        "lnglat": "121.458923,31.205062",
        "count": 15
    },
    {
        "address": "建国西路287弄",
        "name": "阳光四季公寓",
        "lnglat": "117.159987,34.259131",
        "count": 8
    },
    {
        "address": "建国西路91弄",
        "name": "瑞金花园",
        "lnglat": "87.293611,44.003475",
        "count": 12
    },
    {
        "address": "建国西路91弄5号",
        "name": "瑞金花园商务中心",
        "lnglat": "121.465284,31.206585",
        "count": 8
    },
    {
        "address": "建国新路28弄",
        "name": "建新公寓",
        "lnglat": "121.483809,31.214975",
        "count": 12
    },
    {
        "address": "建国新路77弄",
        "name": "老西门公馆",
        "lnglat": "121.482354,31.214388",
        "count": 5
    },
    {
        "address": "建国新路91号",
        "name": "南鼎建国大厦",
        "lnglat": "121.481529,31.213838",
        "count": 10
    },
    {
        "address": "建国中路115弄",
        "name": "思南公寓",
        "lnglat": "121.468739,31.209235",
        "count": 10
    },
    {
        "address": "建国中路115弄之1-4号",
        "name": "吉大公寓",
        "lnglat": "121.468739,31.209235",
        "count": 10
    },
    {
        "address": "建国中路1号",
        "name": "建国大厦",
        "lnglat": "120.179875,30.251831",
        "count": 15
    },
    {
        "address": "建国中路25号",
        "name": "8号桥建国园南区",
        "lnglat": "121.471262,31.210299",
        "count": 4
    },
    {
        "address": "建国中路29号",
        "name": "国信商务大厦",
        "lnglat": "120.179767,30.251199",
        "count": 8
    },
    {
        "address": "建国中路8-10号",
        "name": "八号桥（8号桥建国园北区）",
        "lnglat": "121.470641,31.210664",
        "count": 6
    },
    {
        "address": "建豪路91-99号",
        "name": "圣太科技园",
        "lnglat": "121.572300,31.094832",
        "count": 12
    },
    {
        "address": "建韵路399号",
        "name": "澄天伟业",
        "lnglat": "121.568685,31.098162",
        "count": 7
    },
    {
        "address": "建韵路618号",
        "name": "建韵路618号园区",
        "lnglat": "121.568709,31.092272",
        "count": 2
    },
    {
        "address": "建泽路260弄",
        "name": "新元畅想苑",
        "lnglat": "119.617755,29.049118",
        "count": 28
    },
    {
        "address": "剑川路953弄322",
        "name": "沪升e谷交大科创园",
        "lnglat": "121.422604,31.021820",
        "count": 3
    },
    {
        "address": "江场二路99号",
        "name": "莱赛现代生活港",
        "lnglat": "121.443808,31.298530",
        "count": 13
    },
    {
        "address": "江场路1228弄",
        "name": "中环协信中心",
        "lnglat": "121.458735,31.297623",
        "count": 17
    },
    {
        "address": "江场路1228弄33号",
        "name": "东贤大厦",
        "lnglat": "121.457626,31.298031",
        "count": 20
    },
    {
        "address": "江场路1313号",
        "name": "金谷中环大厦",
        "lnglat": "121.455500,31.299029",
        "count": 12
    },
    {
        "address": "江场三路258号",
        "name": "上海新市北工业园区一期",
        "lnglat": "121.436340,31.295137",
        "count": 21
    },
    {
        "address": "江场三路305号",
        "name": "上海新市北工业园区二期",
        "lnglat": "121.438056,31.296138",
        "count": 32
    },
    {
        "address": "江场西路1366弄",
        "name": "中星馨恒苑",
        "lnglat": "121.424016,31.296267",
        "count": 146
    },
    {
        "address": "江场西路160号",
        "name": "美邦大楼",
        "lnglat": "121.446933,31.298651",
        "count": 12
    },
    {
        "address": "江场西路180号",
        "name": "和典创意园",
        "lnglat": "121.445915,31.298600",
        "count": 5
    },
    {
        "address": "江场西路299弄",
        "name": "中铁中环时代广场",
        "lnglat": "121.441629,31.296312",
        "count": 34
    },
    {
        "address": "江场西路299弄1号楼",
        "name": "海棠大厦",
        "lnglat": "121.442014,31.297354",
        "count": 8
    },
    {
        "address": "江场西路395号",
        "name": "上海新市北工业园区",
        "lnglat": "121.439072,31.297111",
        "count": 4
    },
    {
        "address": "江场一路18号",
        "name": "华瑞大厦（上海）",
        "lnglat": "121.447568,31.298618",
        "count": 25
    },
    {
        "address": "江场一路28号",
        "name": "电信发展公司大楼",
        "lnglat": "121.447355,31.298876",
        "count": 1
    },
    {
        "address": "江川路1551号",
        "name": "美惠全商业广场",
        "lnglat": "121.373642,30.994191",
        "count": 16
    },
    {
        "address": "江川路291弄20号",
        "name": "上企创业园",
        "lnglat": "121.417562,31.002326",
        "count": 5
    },
    {
        "address": "江川路680弄",
        "name": "友好佳苑",
        "lnglat": "121.401661,31.001136",
        "count": 16
    },
    {
        "address": "江航路378弄",
        "name": "浦江丽都二期",
        "lnglat": "121.537004,31.052185",
        "count": 98
    },
    {
        "address": "江航路60弄",
        "name": "瑞和新苑",
        "lnglat": "121.539560,31.046977",
        "count": 16
    },
    {
        "address": "江航南路801弄-1-15号",
        "name": "瑞和华苑（上海）",
        "lnglat": "121.539134,31.039784",
        "count": 22
    },
    {
        "address": "江桦路199弄、200弄、399弄、400弄、600弄，江柳路200弄、400弄",
        "name": "华侨城一二期（新浦江城一期）",
        "lnglat": "121.499371,31.102970",
        "count": 238
    },
    {
        "address": "江凯路177号",
        "name": "鑫广科创园",
        "lnglat": "121.516932,31.087553",
        "count": 34
    },
    {
        "address": "江凯路199号1号楼",
        "name": "蕾特商务中心一期",
        "lnglat": "121.514234,31.087801",
        "count": 23
    },
    {
        "address": "江凯路98号",
        "name": "海宏科创园",
        "lnglat": "121.518453,31.088945",
        "count": 30
    },
    {
        "address": "江宁路1078号",
        "name": "玉佛城",
        "lnglat": "121.445333,31.242970",
        "count": 30
    },
    {
        "address": "江宁路1145弄",
        "name": "圣天地公寓",
        "lnglat": "121.443546,31.242919",
        "count": 15
    },
    {
        "address": "江宁路1158号",
        "name": "友力国际大厦",
        "lnglat": "121.444391,31.243799",
        "count": 17
    },
    {
        "address": "江宁路1165号",
        "name": "圣天地商务大厦",
        "lnglat": "121.443440,31.243597",
        "count": 6
    },
    {
        "address": "江宁路1220弄",
        "name": "音乐广场",
        "lnglat": "121.442669,31.245206",
        "count": 58
    },
    {
        "address": "江宁路1306弄10、12号",
        "name": "燕兴大厦",
        "lnglat": "121.441955,31.246461",
        "count": 18
    },
    {
        "address": "江宁路1306弄17号",
        "name": "富丽花苑",
        "lnglat": "121.441969,31.246525",
        "count": 10
    },
    {
        "address": "江宁路1306弄7号",
        "name": "富丽大厦",
        "lnglat": "121.442355,31.246054",
        "count": 20
    },
    {
        "address": "江宁路1400号",
        "name": "红豆公寓江宁路",
        "lnglat": "121.441272,31.247356",
        "count": 9
    },
    {
        "address": "江宁路1415弄",
        "name": "世纪之门",
        "lnglat": "121.439378,31.247480",
        "count": 57
    },
    {
        "address": "江宁路1600号",
        "name": "浅水湾1600",
        "lnglat": "121.440212,31.248312",
        "count": 37
    },
    {
        "address": "江宁路167号",
        "name": "新城大厦",
        "lnglat": "118.793970,32.012190",
        "count": 2
    },
    {
        "address": "江宁路188号",
        "name": "亚盛大厦",
        "lnglat": "121.409704,29.712925",
        "count": 4
    },
    {
        "address": "江宁路212号",
        "name": "凯迪克大厦",
        "lnglat": "121.410277,29.708166",
        "count": 7
    },
    {
        "address": "江宁路356弄5号",
        "name": "静安紫苑",
        "lnglat": "121.453309,31.233915",
        "count": 4
    },
    {
        "address": "江宁路420号",
        "name": "和一大厦",
        "lnglat": "121.453777,31.234944",
        "count": 12
    },
    {
        "address": "江宁路445号",
        "name": "时美大厦",
        "lnglat": "121.451953,31.234657",
        "count": 12
    },
    {
        "address": "江宁路495号",
        "name": "博鸿大厦",
        "lnglat": "121.451549,31.235054",
        "count": 59
    },
    {
        "address": "江宁路565、575号",
        "name": "康宁雅庭",
        "lnglat": "121.450347,31.235997",
        "count": 13
    },
    {
        "address": "江宁路599弄",
        "name": "静安新格公寓",
        "lnglat": "121.450227,31.236456",
        "count": 12
    },
    {
        "address": "江宁路631号",
        "name": "新建大厦",
        "lnglat": "121.449850,31.236774",
        "count": 9
    },
    {
        "address": "江宁路699号",
        "name": "MOHO商场",
        "lnglat": "121.448666,31.237571",
        "count": 12
    },
    {
        "address": "江宁路777号",
        "name": "内外联公寓",
        "lnglat": "121.411728,29.709291",
        "count": 8
    },
    {
        "address": "江宁路826弄",
        "name": "天香公寓",
        "lnglat": "121.448256,31.240493",
        "count": 18
    },
    {
        "address": "江宁路838号",
        "name": "富容大厦",
        "lnglat": "121.447707,31.240093",
        "count": 20
    },
    {
        "address": "江浦路1178弄",
        "name": "阳明苑",
        "lnglat": "121.521998,31.269387",
        "count": 20
    },
    {
        "address": "江浦路1424弄",
        "name": "江浦汽车公寓",
        "lnglat": "121.520467,31.273735",
        "count": 4
    },
    {
        "address": "江浦路1500号",
        "name": "智慧树（智慧树创意产业园）",
        "lnglat": "121.519725,31.274115",
        "count": 14
    },
    {
        "address": "江浦路1508号",
        "name": "东方星座酒店公寓",
        "lnglat": "121.519479,31.274098",
        "count": 8
    },
    {
        "address": "江浦路2089弄",
        "name": "恒联新天地",
        "lnglat": "121.515549,31.281673",
        "count": 69
    },
    {
        "address": "江浦路666弄",
        "name": "星惠佳苑",
        "lnglat": "121.527627,31.261363",
        "count": 32
    },
    {
        "address": "江浦路821弄",
        "name": "平盛苑",
        "lnglat": "121.523649,31.263287",
        "count": 1
    },
    {
        "address": "江山路6819弄    ",
        "name": "泷悦蓝湾城",
        "lnglat": "121.742263,30.873190",
        "count": 18
    },
    {
        "address": "江山路6899弄",
        "name": "保利玲玥公馆",
        "lnglat": "112.244023,31.030436",
        "count": 29
    },
    {
        "address": "江松路501弄",
        "name": "江锦南苑",
        "lnglat": "121.484146,31.118639",
        "count": 176
    },
    {
        "address": "江苏北路100号",
        "name": "银鑫大楼",
        "lnglat": "121.426010,31.225895",
        "count": 16
    },
    {
        "address": "江苏北路125号",
        "name": "华联创意广场",
        "lnglat": "121.424503,31.226971",
        "count": 5
    },
    {
        "address": "江苏北路30号",
        "name": "荣兆园区",
        "lnglat": "121.426656,31.225078",
        "count": 3
    },
    {
        "address": "江苏北路89号",
        "name": "新亚药业大厦",
        "lnglat": "121.426316,31.224688",
        "count": 14
    },
    {
        "address": "江苏路369号",
        "name": "兆丰世贸大厦",
        "lnglat": "121.431592,31.218984",
        "count": 60
    },
    {
        "address": "江苏路470号",
        "name": "香樟公寓",
        "lnglat": "121.430890,31.217603",
        "count": 10
    },
    {
        "address": "江苏路502弄",
        "name": "公信绿地大楼",
        "lnglat": "121.431833,31.216205",
        "count": 3
    },
    {
        "address": "江苏路813号",
        "name": "华山花园上海",
        "lnglat": "121.434315,31.211825",
        "count": 2
    },
    {
        "address": "江苏路876号",
        "name": "贵冠商务中心",
        "lnglat": "121.433721,31.211507",
        "count": 3
    },
    {
        "address": "江田东路185号",
        "name": "智汇科创园",
        "lnglat": "121.270027,31.029565",
        "count": 9
    },
    {
        "address": "江玮路450弄",
        "name": "闵浦新苑五村",
        "lnglat": "121.535874,31.062823",
        "count": 110
    },
    {
        "address": "江文路125弄",
        "name": "浦江宝邸三期",
        "lnglat": "121.542789,31.061712",
        "count": 161
    },
    {
        "address": "江文路688弄",
        "name": "闵浦新苑四村",
        "lnglat": "121.533011,31.061200",
        "count": 98
    },
    {
        "address": "江西中路181号",
        "name": "工投大楼",
        "lnglat": "121.487211,31.234625",
        "count": 9
    },
    {
        "address": "江协路51弄",
        "name": "金硕河畔景园西区",
        "lnglat": "121.535669,31.054791",
        "count": 52
    },
    {
        "address": "江学路558弄",
        "name": "湖畔天地",
        "lnglat": "121.214564,31.034083",
        "count": 72
    },
    {
        "address": "江杨北路1599弄",
        "name": "四季都会晓风来",
        "lnglat": "121.444213,31.398794",
        "count": 16
    },
    {
        "address": "江杨南路880号",
        "name": "新杨湾科创园",
        "lnglat": "121.466782,31.321316",
        "count": 15
    },
    {
        "address": "江月路1059号",
        "name": "旭和环保产业园",
        "lnglat": "121.520866,31.085854",
        "count": 13
    },
    {
        "address": "江月路1188号 ",
        "name": "久升科技大楼",
        "lnglat": "121.517120,31.085935",
        "count": 12
    },
    {
        "address": "江月路1188弄9号",
        "name": "新外贸本地化服务中心",
        "lnglat": "121.517927,31.085931",
        "count": 5
    },
    {
        "address": "交暨路207弄5号",
        "name": "齐成创业园",
        "lnglat": "121.420410,31.263990",
        "count": 11
    },
    {
        "address": "交通路2107弄",
        "name": "工汇花苑_上海",
        "lnglat": "108.768065,29.526061",
        "count": 16
    },
    {
        "address": "交通路2447号",
        "name": "甘泉德必易园",
        "lnglat": "121.425266,31.259317",
        "count": 12
    },
    {
        "address": "交通路4703弄",
        "name": "李子园商务区",
        "lnglat": "112.897864,29.831204",
        "count": 14
    },
    {
        "address": "交通路4711号",
        "name": "李子园大厦",
        "lnglat": "112.897854,29.831252",
        "count": 7
    },
    {
        "address": "交通西路108弄、188弄",
        "name": "平江盛世家园",
        "lnglat": "121.712402,31.012924",
        "count": 63
    },
    {
        "address": "交通西路129弄",
        "name": "智荟苑",
        "lnglat": "102.625049,29.495635",
        "count": 96
    },
    {
        "address": "交通西路48弄",
        "name": "嘉华苑（上海）",
        "lnglat": "112.947502,27.086088",
        "count": 3
    },
    {
        "address": "胶东路266弄",
        "name": "金燕家苑",
        "lnglat": "121.594223,31.254220",
        "count": 20
    },
    {
        "address": "胶州路1077弄",
        "name": "宝华雅苑",
        "lnglat": "121.434380,31.239375",
        "count": 30
    },
    {
        "address": "胶州路1118弄1-19号",
        "name": "绿洲城市花园一期",
        "lnglat": "121.433798,31.240407",
        "count": 17
    },
    {
        "address": "胶州路1155弄1-19号",
        "name": "绿洲城市花园2期",
        "lnglat": "121.432378,31.240276",
        "count": 48
    },
    {
        "address": "胶州路1216弄",
        "name": "绿洲城市花园三期",
        "lnglat": "121.431738,31.240757",
        "count": 80
    },
    {
        "address": "胶州路343号",
        "name": "诺安1919",
        "lnglat": "118.668440,37.419030",
        "count": 4
    },
    {
        "address": "胶州路397号",
        "name": "阳光科技广场",
        "lnglat": "121.441902,31.230218",
        "count": 15
    },
    {
        "address": "胶州路58号",
        "name": "胶州大厦",
        "lnglat": "121.445177,31.225428",
        "count": 5
    },
    {
        "address": "胶州路699号",
        "name": "恒森广场",
        "lnglat": "121.439708,31.234802",
        "count": 3
    },
    {
        "address": "胶州路941号",
        "name": "长久商务楼",
        "lnglat": "121.436544,31.237540",
        "count": 10
    },
    {
        "address": "胶州路959弄1号",
        "name": "长久大厦",
        "lnglat": "121.436264,31.237379",
        "count": 3
    },
    {
        "address": "解放路115弄",
        "name": "金力时代广场",
        "lnglat": "109.435162,35.766194",
        "count": 6
    },
    {
        "address": "金碧路1980弄",
        "name": "金碧汇虹苑",
        "lnglat": "121.508358,30.971468",
        "count": 144
    },
    {
        "address": "金藏路51号",
        "name": "森晟世洋国际大厦",
        "lnglat": "121.596892,31.250550",
        "count": 4
    },
    {
        "address": "金鼎路2388弄",
        "name": "金鼎香樟苑2388弄",
        "lnglat": "121.362866,31.259270",
        "count": 20
    },
    {
        "address": "金鼎路2588弄",
        "name": "金鼎香樟苑2588弄",
        "lnglat": "121.360438,31.260646",
        "count": 52
    },
    {
        "address": "金鼎路298弄",
        "name": "上海家园",
        "lnglat": "121.390583,31.258346",
        "count": 42
    },
    {
        "address": "金都路1128号",
        "name": "屹创中心(梅陇)创意园",
        "lnglat": "121.429236,31.091463",
        "count": 20
    },
    {
        "address": "金都路1199号",
        "name": "越界1199",
        "lnglat": "121.428911,31.089875",
        "count": 6
    },
    {
        "address": "金都路618号",
        "name": "大量科创园",
        "lnglat": "120.077714,28.894205",
        "count": 9
    },
    {
        "address": "金都西路1000号",
        "name": "松港闵新创意园",
        "lnglat": "121.344602,31.064454",
        "count": 18
    },
    {
        "address": "金都西路688号",
        "name": "上海喜乐嘉工业园",
        "lnglat": "121.350467,31.066282",
        "count": 49
    },
    {
        "address": "金都西路833号",
        "name": "松港商务园_金都西路",
        "lnglat": "121.347361,31.063517",
        "count": 39
    },
    {
        "address": "金都西路999号",
        "name": "上海乐港电器园区",
        "lnglat": "121.344844,31.063556",
        "count": 16
    },
    {
        "address": "金丰路55号",
        "name": "林茵湖畔（东区）",
        "lnglat": "116.859596,24.044574",
        "count": 30
    },
    {
        "address": "金港路199弄",
        "name": "禹洲蓝爵",
        "lnglat": "98.346245,39.799750",
        "count": 67
    },
    {
        "address": "金港路211号",
        "name": "中新传媒大厦",
        "lnglat": "121.616781,28.351835",
        "count": 49
    },
    {
        "address": "金港路299号",
        "name": "禹洲广场",
        "lnglat": "121.612031,31.255299",
        "count": 2
    },
    {
        "address": "金港路333号",
        "name": "禹洲国际大厦(一期)",
        "lnglat": "115.887313,28.752107",
        "count": 33
    },
    {
        "address": "金港路501号",
        "name": "北大资源科技园",
        "lnglat": "121.614123,31.252192",
        "count": 8
    },
    {
        "address": "金高路1925号",
        "name": "金高里创意街区",
        "lnglat": "121.609086,31.266021",
        "count": 1
    },
    {
        "address": "金高路2216弄",
        "name": "金桥谷创意园区",
        "lnglat": "121.605142,31.262123",
        "count": 19
    },
    {
        "address": "金高路2330号",
        "name": "金桥炜业",
        "lnglat": "121.605644,31.260298",
        "count": 10
    },
    {
        "address": "金高路2366号",
        "name": "金海商业广场",
        "lnglat": "121.605490,31.259402",
        "count": 48
    },
    {
        "address": "金工路133弄",
        "name": "金桥新家园",
        "lnglat": "121.587554,31.256139",
        "count": 26
    },
    {
        "address": "金海公路3199号",
        "name": "上海杨王高新技术产业园",
        "lnglat": "121.497245,30.901299",
        "count": 42
    },
    {
        "address": "金海公路4808号",
        "name": "万景峰一期",
        "lnglat": "121.491346,30.935506",
        "count": 57
    },
    {
        "address": "金海公路6055号（临港南桥科技城）",
        "name": "漕河泾开发区南桥园区（临港南桥园区）",
        "lnglat": "121.482016,30.950949",
        "count": 64
    },
    {
        "address": "金汇路460弄",
        "name": "韵动时代（金汇丽舍）",
        "lnglat": "121.376064,31.178084",
        "count": 132
    },
    {
        "address": "金汇路465-1临",
        "name": "星发大厦",
        "lnglat": "121.374353,31.178440",
        "count": 4
    },
    {
        "address": "金汇路588弄",
        "name": "金汇华光城",
        "lnglat": "121.374491,31.183531",
        "count": 194
    },
    {
        "address": "金汇南路60弄",
        "name": "锦绣江南一期",
        "lnglat": "121.379286,31.171370",
        "count": 82
    },
    {
        "address": "金汇南路91弄",
        "name": "锦绣江南家园二期",
        "lnglat": "121.376602,31.170912",
        "count": 55
    },
    {
        "address": "金吉路778号",
        "name": "中国浦发囯机园区",
        "lnglat": "121.630611,31.265211",
        "count": 8
    },
    {
        "address": "金科路2727,2829号",
        "name": "金科中心",
        "lnglat": "121.600627,31.209528",
        "count": 18
    },
    {
        "address": "金科路2889弄",
        "name": "长泰广场",
        "lnglat": "121.602154,31.205943",
        "count": 102
    },
    {
        "address": "金科路2966号",
        "name": "创智空间_张江信息园",
        "lnglat": "121.599228,31.205160",
        "count": 11
    },
    {
        "address": "金科路3728号",
        "name": "复旦三期",
        "lnglat": "121.600195,31.186869",
        "count": 2
    },
    {
        "address": "金科路4560号",
        "name": "金创大厦(金科路)",
        "lnglat": "121.600947,31.177545",
        "count": 15
    },
    {
        "address": "金葵路1315弄",
        "name": "金葵佳苑",
        "lnglat": "121.635223,31.240326",
        "count": 68
    },
    {
        "address": "金兰路333号",
        "name": "全通上海金融谷",
        "lnglat": "107.469270,31.213460",
        "count": 21
    },
    {
        "address": "金陵东路368号",
        "name": "金陵商厦（兴业证券）",
        "lnglat": "120.799750,31.361598",
        "count": 5
    },
    {
        "address": "金陵东路500号",
        "name": "亚龙国际广场",
        "lnglat": "121.480132,31.227123",
        "count": 16
    },
    {
        "address": "金陵东路569号",
        "name": "汇通大厦",
        "lnglat": "119.633279,31.997221",
        "count": 12
    },
    {
        "address": "金陵西路28号",
        "name": "金陵大厦",
        "lnglat": "113.866740,27.640160",
        "count": 4
    },
    {
        "address": "金流路1438号",
        "name": "金准园",
        "lnglat": "121.338167,30.821984",
        "count": 2
    },
    {
        "address": "金马路159号",
        "name": "春乐投资商务园",
        "lnglat": "121.314094,31.119776",
        "count": 9
    },
    {
        "address": "金马路59号",
        "name": "松港商务园_金马路",
        "lnglat": "103.527466,30.201809",
        "count": 29
    },
    {
        "address": "金平路328弄",
        "name": "丽都城假日景苑",
        "lnglat": "121.408226,31.013094",
        "count": 224
    },
    {
        "address": "金平路788弄",
        "name": "合生城邦四街坊",
        "lnglat": "121.405684,31.020307",
        "count": 60
    },
    {
        "address": "金桥经济技术开发区宁桥路825号",
        "name": "9号楼公寓",
        "lnglat": "121.620090,31.253819",
        "count": 6
    },
    {
        "address": "金桥经济技术开发区浙桥路99号",
        "name": "悦樘公寓(碧云店)",
        "lnglat": "121.598916,31.251536",
        "count": 8
    },
    {
        "address": "金桥路1221弄",
        "name": "融都金桥园",
        "lnglat": "87.409174,43.842427",
        "count": 36
    },
    {
        "address": "金桥路1389号",
        "name": "上海金桥大厦",
        "lnglat": "121.587659,31.253858",
        "count": 10
    },
    {
        "address": "金桥路1398号",
        "name": "金台大厦(上海)",
        "lnglat": "121.587806,31.252176",
        "count": 16
    },
    {
        "address": "金桥路1480号",
        "name": "馨住公寓",
        "lnglat": "121.588321,31.250982",
        "count": 11
    },
    {
        "address": "金桥路939号",
        "name": "宏南投资大厦",
        "lnglat": "121.580087,31.257725",
        "count": 14
    },
    {
        "address": "金桥路989弄",
        "name": "今达花园",
        "lnglat": "87.408402,43.839276",
        "count": 84
    },
    {
        "address": "金沙江路1340弄",
        "name": "新曹杨中南大厦",
        "lnglat": "121.387345,31.233615",
        "count": 10
    },
    {
        "address": "金沙江路1340弄172支弄A区",
        "name": "上海新曹杨高新技术工业园区一街坊（A区）",
        "lnglat": "121.387855,31.232302",
        "count": 44
    },
    {
        "address": "金沙江路1340弄57号",
        "name": "上海新曹杨高新技术工业园区一街坊三期(D区)",
        "lnglat": "121.386626,31.234282",
        "count": 10
    },
    {
        "address": "金沙江路1518弄",
        "name": "近铁城市广场",
        "lnglat": "121.382072,31.232897",
        "count": 22
    },
    {
        "address": "金沙江路1688弄",
        "name": "绿洲商业中心",
        "lnglat": "121.380747,31.234937",
        "count": 207
    },
    {
        "address": "金沙江路1698弄",
        "name": "绿洲湖畔花园",
        "lnglat": "121.379659,31.234860",
        "count": 36
    },
    {
        "address": "金沙江路1959号",
        "name": "金环商务花园",
        "lnglat": "121.373252,31.233684",
        "count": 38
    },
    {
        "address": "金沙江路1989号",
        "name": "金沙商务广场",
        "lnglat": "121.372405,31.234687",
        "count": 58
    },
    {
        "address": "金沙江路2145弄",
        "name": "普罗娜商务广场",
        "lnglat": "121.368246,31.236367",
        "count": 8
    },
    {
        "address": "金沙江路2299弄",
        "name": "金沙雅苑未来街区ABC区",
        "lnglat": "121.364860,31.235657",
        "count": 452
    },
    {
        "address": "金沙江路2348弄",
        "name": "金沙雅苑一期",
        "lnglat": "121.366934,31.239787",
        "count": 20
    },
    {
        "address": "金沙江路2890弄",
        "name": "金沙丽晶苑二期",
        "lnglat": "121.359579,31.241935",
        "count": 42
    },
    {
        "address": "金沙江路65弄",
        "name": "金沙江小区",
        "lnglat": "120.749110,31.653089",
        "count": 6
    },
    {
        "address": "金沙江路788号",
        "name": "788PLAZA",
        "lnglat": "121.398749,31.232513",
        "count": 16
    },
    {
        "address": "金沙江西路1051号",
        "name": "孩子王(上海江桥万达店)",
        "lnglat": "121.323609,31.239601",
        "count": 126
    },
    {
        "address": "金沙路75、77号",
        "name": "泰宸汇金商务楼",
        "lnglat": "113.726865,40.797111",
        "count": 13
    },
    {
        "address": "金勺路1688号",
        "name": "卓维园区",
        "lnglat": "121.339175,31.449144",
        "count": 16
    },
    {
        "address": "金苏路200号",
        "name": "金桥万创中心",
        "lnglat": "121.629097,31.257083",
        "count": 68
    },
    {
        "address": "金穗路1501号",
        "name": "金穗园区",
        "lnglat": "121.635823,31.266299",
        "count": 4
    },
    {
        "address": "金汤路155弄",
        "name": "时代星园",
        "lnglat": "121.382938,31.250027",
        "count": 65
    },
    {
        "address": "金通路1118号",
        "name": "同进理想城",
        "lnglat": "121.333553,31.291394",
        "count": 86
    },
    {
        "address": "金通路1968弄",
        "name": "同济城市融景雅苑",
        "lnglat": "121.318550,31.284800",
        "count": 69
    },
    {
        "address": "金皖路389号",
        "name": "金门广场",
        "lnglat": "121.619730,31.255466",
        "count": 6
    },
    {
        "address": "金皖路501号",
        "name": "金皖路501号园区",
        "lnglat": "121.621467,31.254073",
        "count": 25
    },
    {
        "address": "金湘路201弄15号",
        "name": "禹洲燕海国际大厦(三期)",
        "lnglat": "121.612440,31.255838",
        "count": 61
    },
    {
        "address": "金湘路268号",
        "name": "中新传媒广场",
        "lnglat": "121.611428,31.255671",
        "count": 4
    },
    {
        "address": "金湘路333号",
        "name": "爱立诚大厦",
        "lnglat": "121.610439,31.254634",
        "count": 2
    },
    {
        "address": "金湘路345号",
        "name": "同华大厦",
        "lnglat": "121.610237,31.254079",
        "count": 11
    },
    {
        "address": "金湘路399弄",
        "name": "中惠广场",
        "lnglat": "121.609463,31.253408",
        "count": 29
    },
    {
        "address": "金新路58号",
        "name": "银桥大厦",
        "lnglat": "103.798844,30.688035",
        "count": 15
    },
    {
        "address": "金耀路333弄",
        "name": "中房公寓",
        "lnglat": "121.308331,31.243179",
        "count": 363
    },
    {
        "address": "金耀路555弄",
        "name": "金沙鼎苑",
        "lnglat": "121.309317,31.248507",
        "count": 101
    },
    {
        "address": "金耀南路299弄",
        "name": "绿地新江桥城(陈)",
        "lnglat": "121.309060,31.235880",
        "count": 68
    },
    {
        "address": "金耀南路300弄",
        "name": "绿地新江桥城",
        "lnglat": "121.312892,31.236829",
        "count": 50
    },
    {
        "address": "金耀南路80弄",
        "name": "绿地新江桥城80弄",
        "lnglat": "121.311486,31.234345",
        "count": 52
    },
    {
        "address": "金豫路50弄",
        "name": "禹洲国际大厦（二期）",
        "lnglat": "121.613729,31.255810",
        "count": 71
    },
    {
        "address": "金园五路208号",
        "name": "梁杭文化创意园",
        "lnglat": "121.306814,31.260087",
        "count": 10
    },
    {
        "address": "金园五路333号",
        "name": "领兆创客空间",
        "lnglat": "121.308834,31.258891",
        "count": 13
    },
    {
        "address": "金园五路366号",
        "name": "梁杭科创商务园",
        "lnglat": "121.307640,31.257987",
        "count": 23
    },
    {
        "address": "金园一路1118弄",
        "name": "双佳翠庭",
        "lnglat": "121.314305,31.247777",
        "count": 240
    },
    {
        "address": "金园一路588号",
        "name": "588创意园",
        "lnglat": "121.315816,31.255790",
        "count": 2
    },
    {
        "address": "金园一路766号",
        "name": "歆翱创意园",
        "lnglat": "121.315134,31.252296",
        "count": 1
    },
    {
        "address": "金闸公路225弄",
        "name": "汇中苑",
        "lnglat": "121.502361,30.981997",
        "count": 10
    },
    {
        "address": "金闸公路959弄58号",
        "name": "奥帛金汇科创园",
        "lnglat": "121.501855,30.994017",
        "count": 2
    },
    {
        "address": "金钟路340弄之1-85号",
        "name": "新泾六村",
        "lnglat": "121.366467,31.220792",
        "count": 25
    },
    {
        "address": "金钟路633号",
        "name": "晨讯科技大楼",
        "lnglat": "121.359518,31.220042",
        "count": 31
    },
    {
        "address": "金钟路658弄",
        "name": "东华大学国家大学科技园",
        "lnglat": "121.359072,31.222344",
        "count": 8
    },
    {
        "address": "金钟路658弄11号楼",
        "name": "东华大学国家大学科技园11号楼",
        "lnglat": "121.358489,31.222757",
        "count": 6
    },
    {
        "address": "金钟路658弄1号楼",
        "name": "东华大学国家大学科技园1号楼",
        "lnglat": "121.358489,31.222757",
        "count": 6
    },
    {
        "address": "金钟路968号",
        "name": "天会商务广场(原凌空SOHO)",
        "lnglat": "121.352205,31.221836",
        "count": 122
    },
    {
        "address": "金钟路999号D栋",
        "name": "虹桥国际科技广场",
        "lnglat": "114.247720,30.610102",
        "count": 5
    },
    {
        "address": "锦安东路289弄",
        "name": "东城家园",
        "lnglat": "121.544871,31.201601",
        "count": 17
    },
    {
        "address": "锦安东路511弄",
        "name": "凤凰家园",
        "lnglat": "121.541511,31.198618",
        "count": 21
    },
    {
        "address": "锦安东路567弄",
        "name": "锦绣一方名苑",
        "lnglat": "121.539809,31.198395",
        "count": 44
    },
    {
        "address": "锦安东路88弄",
        "name": "锦绣满堂花园",
        "lnglat": "121.540261,31.204001",
        "count": 218
    },
    {
        "address": "锦和路289弄",
        "name": "锦绣天第",
        "lnglat": "121.537248,31.204610",
        "count": 138
    },
    {
        "address": "锦梅路1500弄",
        "name": "锦梅馨苑",
        "lnglat": "121.408111,31.111196",
        "count": 18
    },
    {
        "address": "锦秋路1588弄",
        "name": "丰宝苑",
        "lnglat": "121.375192,31.316667",
        "count": 296
    },
    {
        "address": "锦昔路626号",
        "name": "佳才天地",
        "lnglat": "121.277251,31.039338",
        "count": 10
    },
    {
        "address": "锦绣东路1999号",
        "name": "麦腾智慧天地",
        "lnglat": "121.606546,31.239455",
        "count": 13
    },
    {
        "address": "锦绣东路2777弄",
        "name": "锦绣申江（金桥华虹创新园）",
        "lnglat": "121.623337,31.242366",
        "count": 66
    },
    {
        "address": "锦绣路1650弄",
        "name": "香梅花园一期",
        "lnglat": "113.243539,22.846799",
        "count": 179
    },
    {
        "address": "锦绣路2580弄",
        "name": "浦东星河湾",
        "lnglat": "120.440741,30.537926",
        "count": 59
    },
    {
        "address": "锦绣路300弄",
        "name": "浦东虹桥花园",
        "lnglat": "105.420068,28.894278",
        "count": 238
    },
    {
        "address": "锦绣路3088弄",
        "name": "大华锦绣华城12街区",
        "lnglat": "120.440998,30.535730",
        "count": 169
    },
    {
        "address": "锦绣路3336弄",
        "name": "大华锦绣华城19街区",
        "lnglat": "120.441124,30.534658",
        "count": 100
    },
    {
        "address": "锦绣路333号",
        "name": "金樽花园",
        "lnglat": "120.441016,30.536461",
        "count": 60
    },
    {
        "address": "锦绣路3891号",
        "name": "中环锦绣商务",
        "lnglat": "121.547126,31.166407",
        "count": 11
    },
    {
        "address": "锦绣路4899弄55号",
        "name": "天成科创园",
        "lnglat": "121.548009,31.150462",
        "count": 4
    },
    {
        "address": "锦绣路666弄",
        "name": "华丽家族花园",
        "lnglat": "104.312371,30.617246",
        "count": 149
    },
    {
        "address": "锦绣路800弄",
        "name": "天安花园",
        "lnglat": "113.244159,22.847187",
        "count": 207
    },
    {
        "address": "锦绣路888弄",
        "name": "御景园",
        "lnglat": "113.244094,22.847147",
        "count": 110
    },
    {
        "address": "锦延路329号",
        "name": "锦绣坊",
        "lnglat": "121.542055,31.215924",
        "count": 11
    },
    {
        "address": "锦州湾路27弄",
        "name": "和瑞雅苑",
        "lnglat": "121.536939,31.266085",
        "count": 18
    },
    {
        "address": "晋城路663弄",
        "name": "阳城世家",
        "lnglat": "121.428249,31.281252",
        "count": 134
    },
    {
        "address": "晋元路228弄",
        "name": "华祺苑",
        "lnglat": "121.468911,31.243490",
        "count": 113
    },
    {
        "address": "京江路299号",
        "name": "宝丰大厦南楼",
        "lnglat": "121.462678,31.248845",
        "count": 9
    },
    {
        "address": "泾惠路91弄",
        "name": "洛川公寓_上海",
        "lnglat": "121.436333,31.258807",
        "count": 16
    },
    {
        "address": "泾茉路118弄",
        "name": "招商虹桥公馆",
        "lnglat": "121.252064,31.181837",
        "count": 8
    },
    {
        "address": "荆州路198号",
        "name": "万硕大厦",
        "lnglat": "121.515907,31.258248",
        "count": 32
    },
    {
        "address": "荆州路334弄108号",
        "name": "荣广商务中心",
        "lnglat": "121.514140,31.260720",
        "count": 3
    },
    {
        "address": "景谷路176弄1号",
        "name": "景谷大厦",
        "lnglat": "121.399880,31.013214",
        "count": 3
    },
    {
        "address": "景联路257号",
        "name": "绿亮科创园(景联路)",
        "lnglat": "121.448847,31.100321",
        "count": 11
    },
    {
        "address": "景联路389号",
        "name": "华东理工大学国家大学科技园（梅陇基地）",
        "lnglat": "121.446285,31.099610",
        "count": 19
    },
    {
        "address": "景联路439号",
        "name": "上海电子物联产业园",
        "lnglat": "121.443491,31.099209",
        "count": 20
    },
    {
        "address": "靖宇东路55弄",
        "name": "靖宇家园",
        "lnglat": "121.542992,31.292563",
        "count": 106
    },
    {
        "address": "靖宇南路118弄",
        "name": "金宇名邸",
        "lnglat": "121.524427,31.282951",
        "count": 88
    },
    {
        "address": "靖宇南路99弄",
        "name": "九州花苑",
        "lnglat": "121.525474,31.282785",
        "count": 4
    },
    {
        "address": "靖远路1288弄",
        "name": "嘉旺苑",
        "lnglat": "121.324759,31.256242",
        "count": 24
    },
    {
        "address": "靖远路923号",
        "name": "高潮新苑",
        "lnglat": "117.164416,26.889395",
        "count": 46
    },
    {
        "address": "九杜路349号",
        "name": "立同商务大厦",
        "lnglat": "121.310333,31.142466",
        "count": 7
    },
    {
        "address": "九杜路477号",
        "name": "九杜生活广场",
        "lnglat": "121.309498,31.143502",
        "count": 8
    },
    {
        "address": "九杜路505弄",
        "name": "摩卡小城",
        "lnglat": "121.308828,31.144940",
        "count": 53
    },
    {
        "address": "九华路908弄",
        "name": "悦丰新苑",
        "lnglat": "121.448155,30.925249",
        "count": 34
    },
    {
        "address": "九江公路159弄",
        "name": "绿地海珀佘山",
        "lnglat": "121.174982,31.090283",
        "count": 202
    },
    {
        "address": "九江路333号",
        "name": "金融广场（上海）",
        "lnglat": "121.483206,31.235733",
        "count": 7
    },
    {
        "address": "九江路501号",
        "name": "外滩WE",
        "lnglat": "121.482035,31.235362",
        "count": 38
    },
    {
        "address": "九泾公路41号",
        "name": "创汇德智慧园",
        "lnglat": "121.301154,31.132187",
        "count": 8
    },
    {
        "address": "九泾路262号",
        "name": "恒瑞中心",
        "lnglat": "121.282735,31.149858",
        "count": 17
    },
    {
        "address": "九泾路655号",
        "name": "上海嘉南红塔商务广场",
        "lnglat": "121.282735,31.149858",
        "count": 85
    },
    {
        "address": "九泾路701号",
        "name": "新雅创业园",
        "lnglat": "121.282735,31.149858",
        "count": 25
    },
    {
        "address": "九泾路898号",
        "name": "898国际商务中心",
        "lnglat": "121.282919,31.149949",
        "count": 33
    },
    {
        "address": "九泾路959号",
        "name": "上海豪禺创业园",
        "lnglat": "121.283007,31.149993",
        "count": 45
    },
    {
        "address": "九龙路575号",
        "name": "新亚小区",
        "lnglat": "103.695323,30.639437",
        "count": 1
    },
    {
        "address": "九亭大街586弄",
        "name": "三元公寓",
        "lnglat": "121.324625,31.127669",
        "count": 40
    },
    {
        "address": "九亭大街851弄",
        "name": "富顿苑",
        "lnglat": "121.319286,31.125395",
        "count": 58
    },
    {
        "address": "九亭镇伴亭路488号",
        "name": "磊鑫大楼",
        "lnglat": "121.323119,31.134256",
        "count": 1
    },
    {
        "address": "九新公路10弄",
        "name": "亭园",
        "lnglat": "121.314618,31.135011",
        "count": 22
    },
    {
        "address": "九新公路338号",
        "name": "佳钢智慧园_九新公路",
        "lnglat": "121.317703,31.104006",
        "count": 5
    },
    {
        "address": "九新公路33弄1～6号",
        "name": "青春驿站",
        "lnglat": "121.316942,31.134793",
        "count": 36
    },
    {
        "address": "九新公路58弄",
        "name": "嘉和阳光城",
        "lnglat": "121.316933,31.132495",
        "count": 51
    },
    {
        "address": "九新公路76号",
        "name": "嘉和阳光大厦",
        "lnglat": "121.317209,31.132851",
        "count": 14
    },
    {
        "address": "九新公路800号",
        "name": "临港电姆产业园",
        "lnglat": "121.314433,31.118530",
        "count": 36
    },
    {
        "address": "九新公路877号",
        "name": "临港卓越科技园",
        "lnglat": "121.316721,31.095582",
        "count": 15
    },
    {
        "address": "九新公路90弄3号",
        "name": "九新商务大厦",
        "lnglat": "121.316929,31.132114",
        "count": 8
    },
    {
        "address": "久富路225号",
        "name": "玖福大厦",
        "lnglat": "121.316538,31.120395",
        "count": 10
    },
    {
        "address": "久富路650号",
        "name": "立同久富商务大厦",
        "lnglat": "121.307584,31.121227",
        "count": 7
    },
    {
        "address": "久业路89号",
        "name": "松港智造工坊",
        "lnglat": "121.112151,31.181966",
        "count": 17
    },
    {
        "address": "居家桥路199弄",
        "name": "昕泰苑",
        "lnglat": "121.562825,31.257626",
        "count": 44
    },
    {
        "address": "局门路153号",
        "name": "千羽创意园",
        "lnglat": "121.480368,31.207771",
        "count": 2
    },
    {
        "address": "局门路1号（徐家汇路）",
        "name": "中汇公寓上海",
        "lnglat": "121.480066,31.208964",
        "count": 21
    },
    {
        "address": "局门路295弄",
        "name": "江南世纪新苑",
        "lnglat": "121.481806,31.205093",
        "count": 21
    },
    {
        "address": "局门路427号",
        "name": "智造局二期",
        "lnglat": "121.482339,31.203111",
        "count": 8
    },
    {
        "address": "局门路436号",
        "name": "8号桥五里园",
        "lnglat": "121.481892,31.203106",
        "count": 3
    },
    {
        "address": "局门路457号",
        "name": "金地威新8号桥汝南园",
        "lnglat": "121.482917,31.202837",
        "count": 2
    },
    {
        "address": "局门路550号",
        "name": "8号桥瞿溪园",
        "lnglat": "121.482388,31.201105",
        "count": 4
    },
    {
        "address": "局门路599弄",
        "name": "东怡花园",
        "lnglat": "121.483400,31.200648",
        "count": 2
    },
    {
        "address": "局门路620号",
        "name": "重矿大厦(局门路)",
        "lnglat": "121.482849,31.199766",
        "count": 13
    },
    {
        "address": "局门路801号",
        "name": "黄浦海事局大楼",
        "lnglat": "121.481486,31.192576",
        "count": 2
    },
    {
        "address": "菊泉街1158-1596弄",
        "name": "馨佳园社区三街坊",
        "lnglat": "121.368441,31.366110",
        "count": 17
    },
    {
        "address": "菊泉街1280弄",
        "name": "馨佳园十二街坊",
        "lnglat": "121.371865,31.360649",
        "count": 34
    },
    {
        "address": "菊泉街1281弄1-15号",
        "name": "馨佳园十三街坊",
        "lnglat": "121.373881,31.360872",
        "count": 16
    },
    {
        "address": "菊泉街158弄",
        "name": "中怡雅苑",
        "lnglat": "121.374488,31.352473",
        "count": 48
    },
    {
        "address": "菊泉街1969弄",
        "name": "馨佳园社区五街坊",
        "lnglat": "121.371737,31.363946",
        "count": 12
    },
    {
        "address": "菊泉街2899弄1-8号",
        "name": "馨佳园社区四街坊",
        "lnglat": "121.370397,31.366651",
        "count": 13
    },
    {
        "address": "菊泉街577弄",
        "name": "宝沁苑",
        "lnglat": "121.374161,31.357256",
        "count": 44
    },
    {
        "address": "菊盛路468弄",
        "name": "宝翔苑",
        "lnglat": "121.371205,31.356429",
        "count": 42
    },
    {
        "address": "菊盛路851弄",
        "name": "馨佳园十一街坊",
        "lnglat": "121.368944,31.359835",
        "count": 56
    },
    {
        "address": "巨峰路1058号",
        "name": "乐坊（晨达广场）",
        "lnglat": "121.609200,31.279811",
        "count": 11
    },
    {
        "address": "巨峰路1058弄",
        "name": "新紫茂国际城",
        "lnglat": "121.609123,31.279721",
        "count": 32
    },
    {
        "address": "巨鹿路149号",
        "name": "紫勋雍邸",
        "lnglat": "121.465700,31.222762",
        "count": 55
    },
    {
        "address": "巨鹿路417号",
        "name": "欣广大厦",
        "lnglat": "121.457670,31.222029",
        "count": 3
    },
    {
        "address": "巨野路22号",
        "name": "陆家嘴滨江公馆（申城公寓）",
        "lnglat": "121.542612,31.244437",
        "count": 17
    },
    {
        "address": "巨野路455弄",
        "name": "龙威名邸",
        "lnglat": "121.547067,31.237423",
        "count": 4
    },
    {
        "address": "巨野路61弄",
        "name": "旭辉雅苑",
        "lnglat": "121.544845,31.244167",
        "count": 42
    },
    {
        "address": "钜庭路99弄",
        "name": "香溢雅园",
        "lnglat": "121.419627,30.904431",
        "count": 77
    },
    {
        "address": "俱进路90弄",
        "name": "铂庭俱进家园",
        "lnglat": "121.606321,31.297969",
        "count": 42
    },
    {
        "address": "聚丰园路188弄",
        "name": "学林苑",
        "lnglat": "121.384356,31.313940",
        "count": 19
    },
    {
        "address": "卡园二路58号",
        "name": "银信创智园",
        "lnglat": "121.669690,31.235586",
        "count": 20
    },
    {
        "address": "凯滨路183号",
        "name": "保利西岸中心A栋、B栋",
        "lnglat": "121.455306,31.182174",
        "count": 26
    },
    {
        "address": "凯进路151号",
        "name": "中油大厦（中油企业大厦）",
        "lnglat": "121.431145,31.182253",
        "count": 4
    },
    {
        "address": "凯旋路1010号A栋",
        "name": "上汽凯旋坊",
        "lnglat": "114.109040,22.593547",
        "count": 3
    },
    {
        "address": "凯旋路1205号",
        "name": "东风商务园区",
        "lnglat": "120.612925,30.673045",
        "count": 7
    },
    {
        "address": "凯旋路1222弄1-5号",
        "name": "凯旋都市花园",
        "lnglat": "109.028116,25.992053",
        "count": 33
    },
    {
        "address": "凯旋路1415号",
        "name": "凯旋商务大厦（中心）",
        "lnglat": "121.419902,31.200103",
        "count": 9
    },
    {
        "address": "凯旋路1669号",
        "name": "天星城",
        "lnglat": "121.421924,31.194924",
        "count": 4
    },
    {
        "address": "凯旋路2086号",
        "name": "凯旋Space",
        "lnglat": "121.424246,31.191735",
        "count": 3
    },
    {
        "address": "凯旋路3188弄",
        "name": "凯旋豪庭",
        "lnglat": "109.691968,27.431642",
        "count": 18
    },
    {
        "address": "凯旋路3500弄",
        "name": "华苑大厦",
        "lnglat": "109.691937,27.431689",
        "count": 4
    },
    {
        "address": "凯旋路369号",
        "name": "龙之梦雅仕大厦",
        "lnglat": "120.266712,30.862028",
        "count": 56
    },
    {
        "address": "康达路508弄",
        "name": "昱龙家园",
        "lnglat": "120.247353,30.492212",
        "count": 91
    },
    {
        "address": "康涵路58弄 ",
        "name": "世茂云图",
        "lnglat": "121.546449,31.116329",
        "count": 40
    },
    {
        "address": "康弘路428弄",
        "name": "达城锦园",
        "lnglat": "121.602222,31.119455",
        "count": 84
    },
    {
        "address": "康花路499号",
        "name": "中天科技商务园(东园)",
        "lnglat": "121.552006,31.147304",
        "count": 1
    },
    {
        "address": "康佳路38弄-39弄",
        "name": "康桥月苑",
        "lnglat": "105.701359,28.583429",
        "count": 56
    },
    {
        "address": "康宁路1021-1211号",
        "name": "秦辰创业商务楼",
        "lnglat": "87.949565,44.157826",
        "count": 5
    },
    {
        "address": "康宁路1021弄",
        "name": "幸福创智园",
        "lnglat": "87.949565,44.157826",
        "count": 45
    },
    {
        "address": "康宁路1211号",
        "name": "幸福商务大楼",
        "lnglat": "121.432462,31.311462",
        "count": 5
    },
    {
        "address": "康浦路51弄",
        "name": "绿地浦汇广场",
        "lnglat": "121.599801,31.117007",
        "count": 7
    },
    {
        "address": "康浦路51弄2号",
        "name": "绿地浦汇壹舍公寓",
        "lnglat": "121.599802,31.117006",
        "count": 4
    },
    {
        "address": "康桥东路1088号",
        "name": "松港1088创意园",
        "lnglat": "121.628295,31.155225",
        "count": 24
    },
    {
        "address": "康桥东路1159弄105号",
        "name": "松港产业园_康桥东路",
        "lnglat": "121.633433,31.160098",
        "count": 4
    },
    {
        "address": "康桥东路518号",
        "name": "绿太阳园区",
        "lnglat": "121.610463,31.152817",
        "count": 9
    },
    {
        "address": "康桥路1001弄",
        "name": "阳光城愉景公馆（上海康桥美乐）",
        "lnglat": "121.563694,31.147860",
        "count": 4
    },
    {
        "address": "康桥路1029弄",
        "name": "建华铂中环",
        "lnglat": "121.565105,31.148704",
        "count": 60
    },
    {
        "address": "康桥路1789号",
        "name": "丰动力康桥中心",
        "lnglat": "121.586230,31.150897",
        "count": 3
    },
    {
        "address": "康桥路787号",
        "name": "中天科技商务园",
        "lnglat": "121.549371,31.146152",
        "count": 5
    },
    {
        "address": "康杉路108弄3号",
        "name": "沃众创业园",
        "lnglat": "121.559020,31.156062",
        "count": 9
    },
    {
        "address": "康杉路359弄",
        "name": "颐盛云锦苑",
        "lnglat": "121.561527,31.151713",
        "count": 47
    },
    {
        "address": "康沈公路3001弄",
        "name": "桃园新城汇枫公寓",
        "lnglat": "121.575255,31.118075",
        "count": 90
    },
    {
        "address": "康沈路2039号",
        "name": "荻达公寓",
        "lnglat": "121.581740,31.105389",
        "count": 5
    },
    {
        "address": "康沈路633弄、秀沿路867弄、秀沿路836弄",
        "name": "中邦城市园",
        "lnglat": "121.569029,31.134246",
        "count": 617
    },
    {
        "address": "康沈路726弄",
        "name": "周康五村",
        "lnglat": "121.573977,31.132688",
        "count": 9
    },
    {
        "address": "康士路1弄",
        "name": "瑞景商务公寓",
        "lnglat": "121.564691,31.146628",
        "count": 20
    },
    {
        "address": "康文路330弄",
        "name": "共康雅苑三期",
        "lnglat": "121.419495,31.334203",
        "count": 95
    },
    {
        "address": "康新公路2333号",
        "name": "天慈生物医药生产基地（天慈国际产业园）",
        "lnglat": "121.628515,31.083766",
        "count": 21
    },
    {
        "address": "康悦路133弄1-26号",
        "name": "祥美苑",
        "lnglat": "121.534570,31.361613",
        "count": 32
    },
    {
        "address": "康悦路325弄",
        "name": "浦凌佳苑",
        "lnglat": "121.534161,31.358626",
        "count": 80
    },
    {
        "address": "科福路368号",
        "name": "华强科技园",
        "lnglat": "121.340437,31.330625",
        "count": 6
    },
    {
        "address": "科福路825号",
        "name": "梁杭产业园(嘉定)",
        "lnglat": "121.336822,31.341947",
        "count": 3
    },
    {
        "address": "科农路99弄",
        "name": "张江国际人才公寓一期（张江纳仕国际社区）",
        "lnglat": "121.622945,31.167814",
        "count": 39
    },
    {
        "address": "科苑路99号",
        "name": "魔方公寓张江店",
        "lnglat": "111.325799,27.726529",
        "count": 4
    },
    {
        "address": "控江路128弄",
        "name": "韵都城（上海）",
        "lnglat": "121.543788,31.287661",
        "count": 247
    },
    {
        "address": "控江路1500弄、凤城路51弄",
        "name": "新凤城",
        "lnglat": "121.521190,31.277005",
        "count": 138
    },
    {
        "address": "控江路1555号",
        "name": "上海信息技术大厦",
        "lnglat": "121.523566,31.277918",
        "count": 16
    },
    {
        "address": "控江路1690号",
        "name": "凤凰大厦(上海)",
        "lnglat": "121.514862,31.274466",
        "count": 7
    },
    {
        "address": "控江路1777号",
        "name": "君欣时代广场",
        "lnglat": "121.514140,31.273508",
        "count": 39
    },
    {
        "address": "控江路2063号",
        "name": "五环大厦西座",
        "lnglat": "121.508235,31.271472",
        "count": 9
    },
    {
        "address": "控江路2075号",
        "name": "贵人大厦（上海）",
        "lnglat": "121.507619,31.270861",
        "count": 8
    },
    {
        "address": "控江路2200号",
        "name": "和平花苑",
        "lnglat": "121.507283,31.271439",
        "count": 46
    },
    {
        "address": "控江路568弄",
        "name": "大众苑",
        "lnglat": "121.542485,31.286665",
        "count": 13
    },
    {
        "address": "控江路669弄",
        "name": "公园首府(上海)",
        "lnglat": "121.539065,31.282995",
        "count": 9
    },
    {
        "address": "控江路980弄",
        "name": "杨浦公寓",
        "lnglat": "121.531948,31.281107",
        "count": 53
    },
    {
        "address": "控江路980弄5号楼",
        "name": "杨浦公寓商务楼",
        "lnglat": "121.531949,31.281108",
        "count": 9
    },
    {
        "address": "奎照路790弄",
        "name": "奎照路790弄",
        "lnglat": "121.469103,31.299834",
        "count": 18
    },
    {
        "address": "奎照路890号",
        "name": "奎江公寓",
        "lnglat": "121.466783,31.299730",
        "count": 8
    },
    {
        "address": "昆港公路1088号",
        "name": "光塑科技园",
        "lnglat": "121.147706,31.019337",
        "count": 13
    },
    {
        "address": "昆明路518号A座",
        "name": "北美广场",
        "lnglat": "121.512926,31.260121",
        "count": 7
    },
    {
        "address": "昆明路640号",
        "name": "亚町工坊",
        "lnglat": "121.514336,31.261789",
        "count": 7
    },
    {
        "address": "昆明路739号",
        "name": "文通大厦",
        "lnglat": "121.515648,31.263589",
        "count": 22
    },
    {
        "address": "莱阳路2328弄",
        "name": "高弘家苑",
        "lnglat": "121.584419,31.309621",
        "count": 84
    },
    {
        "address": "莱阳路2450弄",
        "name": "高海家苑",
        "lnglat": "121.584225,31.311701",
        "count": 48
    },
    {
        "address": "莱阳路4279弄",
        "name": "高桥新城紫薇和苑",
        "lnglat": "121.577451,31.337363",
        "count": 72
    },
    {
        "address": "涞坊路1000号",
        "name": "新虹桥企业天地",
        "lnglat": "121.305717,31.149733",
        "count": 11
    },
    {
        "address": "涞坊路1033弄1-145",
        "name": "馨亭家苑",
        "lnglat": "121.307149,31.149953",
        "count": 41
    },
    {
        "address": "涞坊路333弄 ",
        "name": "知雅汇",
        "lnglat": "121.317075,31.153258",
        "count": 348
    },
    {
        "address": "涞坊路699弄",
        "name": "汇贤阁",
        "lnglat": "121.307736,31.149798",
        "count": 18
    },
    {
        "address": "涞寅路106弄",
        "name": "上海奥林匹克花园北区",
        "lnglat": "121.322248,31.153052",
        "count": 16
    },
    {
        "address": "涞寅路1200弄",
        "name": "上海源花城",
        "lnglat": "121.304161,31.141915",
        "count": 422
    },
    {
        "address": "涞寅路1200弄2号",
        "name": "上海源花城物业楼",
        "lnglat": "121.302734,31.142946",
        "count": 4
    },
    {
        "address": "涞寅路658弄",
        "name": "绿庭尚城",
        "lnglat": "121.312109,31.145106",
        "count": 360
    },
    {
        "address": "兰博路1189弄",
        "name": "绿地风清苑",
        "lnglat": "121.663671,30.911694",
        "count": 81
    },
    {
        "address": "兰博路1455弄",
        "name": "新城花屿湾",
        "lnglat": "121.659859,30.908233",
        "count": 25
    },
    {
        "address": "兰谷路2133号",
        "name": "仁恒森兰运动中心",
        "lnglat": "121.592559,31.295725",
        "count": 5
    },
    {
        "address": "兰坪路301弄22支弄",
        "name": "鹤庆高层小区",
        "lnglat": "121.421973,31.009374",
        "count": 24
    },
    {
        "address": "兰嵩路555号",
        "name": "森兰美伦商务楼",
        "lnglat": "121.594527,31.317450",
        "count": 20
    },
    {
        "address": "兰溪路10弄",
        "name": "曹杨君悦苑",
        "lnglat": "121.239286,29.982901",
        "count": 37
    },
    {
        "address": "兰溪路145号",
        "name": "安天大厦",
        "lnglat": "121.404623,31.239417",
        "count": 9
    },
    {
        "address": "兰溪路180号",
        "name": "安居兰庭",
        "lnglat": "121.403637,31.243458",
        "count": 56
    },
    {
        "address": "兰溪路182号",
        "name": "安居兰庭商务中心",
        "lnglat": "121.402655,31.243177",
        "count": 8
    },
    {
        "address": "兰溪路900弄",
        "name": "天汇广场一期",
        "lnglat": "121.402049,31.256066",
        "count": 12
    },
    {
        "address": "兰州路1333弄",
        "name": "信通浦皓园",
        "lnglat": "121.523026,31.271440",
        "count": 20
    },
    {
        "address": "兰州路667弄",
        "name": "圣骊名苑",
        "lnglat": "121.530701,31.260726",
        "count": 18
    },
    {
        "address": "岚皋西路61弄10支弄",
        "name": "实地公寓",
        "lnglat": "121.423696,31.247948",
        "count": 14
    },
    {
        "address": "蓝村路31弄",
        "name": "新都花园（上海）",
        "lnglat": "121.532476,31.212434",
        "count": 14
    },
    {
        "address": "蓝村路55弄",
        "name": "仕嘉名苑（上海）",
        "lnglat": "121.531670,31.214192",
        "count": 93
    },
    {
        "address": "蓝靛路1488号",
        "name": "阳光城丽景湾（上海丽景湾）",
        "lnglat": "121.635132,31.098130",
        "count": 36
    },
    {
        "address": "蓝靛路1688弄",
        "name": "保利艾庐",
        "lnglat": "121.640564,31.098440",
        "count": 86
    },
    {
        "address": "朗亭路288弄",
        "name": "朗庭上郡苑",
        "lnglat": "121.293289,31.150069",
        "count": 130
    },
    {
        "address": "崂山路689号",
        "name": "潍坊综合楼",
        "lnglat": "121.525185,31.220676",
        "count": 8
    },
    {
        "address": "老沪闵路1068弄",
        "name": "绿洲庭苑",
        "lnglat": "121.437447,31.130156",
        "count": 15
    },
    {
        "address": "老沪闵路1482号",
        "name": "瑞星商务中心",
        "lnglat": "121.435859,31.112945",
        "count": 6
    },
    {
        "address": "老沪闵路3105号",
        "name": "东苑米蓝城",
        "lnglat": "121.401802,31.070690",
        "count": 79
    },
    {
        "address": "老沪闵路666弄",
        "name": "幽澜苑",
        "lnglat": "121.429034,31.145296",
        "count": 24
    },
    {
        "address": "老沪闵路668号",
        "name": "幽澜苑办公楼",
        "lnglat": "121.429030,31.145257",
        "count": 4
    },
    {
        "address": "老沪闵路680弄",
        "name": "协合紫薇园",
        "lnglat": "121.429100,31.144811",
        "count": 18
    },
    {
        "address": "老沪闵路799号",
        "name": "阳光绿园",
        "lnglat": "121.430982,31.138814",
        "count": 108
    },
    {
        "address": "老沪闵路875弄1、2号",
        "name": "松枫花园",
        "lnglat": "121.434230,31.133400",
        "count": 8
    },
    {
        "address": "老沪太路201弄1号",
        "name": "广视大楼",
        "lnglat": "121.453177,31.268312",
        "count": 6
    },
    {
        "address": "老芦公路1055号",
        "name": "科创田园",
        "lnglat": "121.865315,30.948029",
        "count": 10
    },
    {
        "address": "老芦公路857号895号",
        "name": "禹洲城市广场西区",
        "lnglat": "121.865315,30.948029",
        "count": 12
    },
    {
        "address": "老芦公路868号",
        "name": "金港世纪广场",
        "lnglat": "121.866637,30.978963",
        "count": 7
    },
    {
        "address": "乐爱路268弄1-20号",
        "name": "瑞和明庭(268）",
        "lnglat": "121.232827,31.180551",
        "count": 24
    },
    {
        "address": "乐都西路1455弄",
        "name": "华亭新家银杏苑",
        "lnglat": "121.191497,31.011243",
        "count": 5
    },
    {
        "address": "乐都西路1558弄",
        "name": "万科金色华亭",
        "lnglat": "121.189535,31.014746",
        "count": 117
    },
    {
        "address": "乐都西路1636弄",
        "name": "荣乐雅筑",
        "lnglat": "121.187837,31.013441",
        "count": 126
    },
    {
        "address": "乐都西路959弄",
        "name": "乐都新界",
        "lnglat": "121.203713,31.012630",
        "count": 49
    },
    {
        "address": "乐高路200弄1-13号",
        "name": "徐泾北城馨浦苑东区",
        "lnglat": "121.240103,31.179888",
        "count": 12
    },
    {
        "address": "乐高路288弄之1-24号",
        "name": "徐泾北城馨浦苑北区(288)",
        "lnglat": "121.240262,31.181109",
        "count": 26
    },
    {
        "address": "乐国路218弄之1-12号",
        "name": "瑞和明庭东区",
        "lnglat": "121.235167,31.181146",
        "count": 6
    },
    {
        "address": "乐山路33号",
        "name": "交大慧谷创业园三部",
        "lnglat": "116.718386,23.400736",
        "count": 1
    },
    {
        "address": "乐山路71号",
        "name": "独乐山公寓楼",
        "lnglat": "110.623902,21.354832",
        "count": 5
    },
    {
        "address": "乐天路318弄",
        "name": "海棠馨苑北区",
        "lnglat": "121.241997,31.181716",
        "count": 82
    },
    {
        "address": "乐园路198号",
        "name": "FSPACE金桥中心",
        "lnglat": "121.610793,31.276969",
        "count": 27
    },
    {
        "address": "骊山路34弄12号",
        "name": "华经大厦",
        "lnglat": "121.444941,31.258149",
        "count": 3
    },
    {
        "address": "黎安路688号",
        "name": "强劲大厦",
        "lnglat": "121.367436,31.128744",
        "count": 27
    },
    {
        "address": "立跃路2795号",
        "name": "上海由谷产业园",
        "lnglat": "121.515136,31.090438",
        "count": 14
    },
    {
        "address": "立跃路519号",
        "name": "乐乎城市青年社区周浦店",
        "lnglat": "121.559498,31.106143",
        "count": 8
    },
    {
        "address": "丽水路58号",
        "name": "城隍珠宝",
        "lnglat": "100.243414,26.834415",
        "count": 14
    },
    {
        "address": "丽园路333弄",
        "name": "黄浦新苑（上海）",
        "lnglat": "121.483538,31.209896",
        "count": 156
    },
    {
        "address": "丽园路448号",
        "name": "高城苑",
        "lnglat": "121.483485,31.208173",
        "count": 16
    },
    {
        "address": "丽园路468号",
        "name": "运泰公寓",
        "lnglat": "121.482579,31.208030",
        "count": 18
    },
    {
        "address": "丽园路501号",
        "name": "丽园路501号二期",
        "lnglat": "121.481366,31.208014",
        "count": 4
    },
    {
        "address": "丽园路501弄",
        "name": "soho丽园",
        "lnglat": "108.873248,34.172091",
        "count": 2
    },
    {
        "address": "丽园路68弄",
        "name": "海洲丽园",
        "lnglat": "121.488877,31.210230",
        "count": 15
    },
    {
        "address": "丽园路700号",
        "name": "经纬天地园",
        "lnglat": "121.479364,31.207034",
        "count": 3
    },
    {
        "address": "丽园路818弄",
        "name": "开城新苑",
        "lnglat": "121.476943,31.206504",
        "count": 56
    },
    {
        "address": "丽园路888弄",
        "name": "东都公寓",
        "lnglat": "121.475147,31.206207",
        "count": 10
    },
    {
        "address": "丽园路8号",
        "name": "丽南公寓",
        "lnglat": "106.523027,29.602099",
        "count": 7
    },
    {
        "address": "利津路1313弄",
        "name": "证大家园五期",
        "lnglat": "121.593518,31.284142",
        "count": 130
    },
    {
        "address": "利津路555弄",
        "name": "璞真园",
        "lnglat": "121.586999,31.275309",
        "count": 30
    },
    {
        "address": "溧阳路1088号",
        "name": "龙邸大厦",
        "lnglat": "121.488875,31.260928",
        "count": 14
    },
    {
        "address": "溧阳路1155号",
        "name": "溧阳公馆",
        "lnglat": "121.488493,31.262434",
        "count": 4
    },
    {
        "address": "溧阳路735号",
        "name": "半岛湾时尚文化创意产业园",
        "lnglat": "121.489044,31.255215",
        "count": 16
    },
    {
        "address": "连富路155号",
        "name": "久仰科创园",
        "lnglat": "121.317991,31.116964",
        "count": 4
    },
    {
        "address": "莲花路1058弄1-3号",
        "name": "东苑怡景园",
        "lnglat": "109.028116,25.992053",
        "count": 72
    },
    {
        "address": "莲花路1308号",
        "name": "宏汇莲花广场",
        "lnglat": "117.231008,31.757815",
        "count": 12
    },
    {
        "address": "莲花路1559号",
        "name": "旺琦商业广场(勇卫商务大厦)",
        "lnglat": "121.392496,31.160405",
        "count": 4
    },
    {
        "address": "莲花路1733号",
        "name": "华纳商务中心",
        "lnglat": "121.390131,31.170061",
        "count": 1
    },
    {
        "address": "莲花路2080弄50号",
        "name": "金茂园",
        "lnglat": "108.903088,32.311585",
        "count": 1
    },
    {
        "address": "莲花路755弄",
        "name": "万源城E1",
        "lnglat": "108.903119,32.311750",
        "count": 148
    },
    {
        "address": "莲花南路1111弄",
        "name": "春申景城一期(春申景城湖滨晨韵)",
        "lnglat": "121.412026,31.106332",
        "count": 263
    },
    {
        "address": "莲花南路1188弄",
        "name": "上海春城",
        "lnglat": "121.408228,31.104267",
        "count": 551
    },
    {
        "address": "莲花南路1388号8号楼",
        "name": "北建华清商业广场商务楼",
        "lnglat": "120.859072,40.724503",
        "count": 7
    },
    {
        "address": "莲花南路1500弄",
        "name": "麦多生活广场",
        "lnglat": "121.412962,31.097106",
        "count": 91
    },
    {
        "address": "莲花南路155弄",
        "name": "世纪苑",
        "lnglat": "121.407039,31.130704",
        "count": 217
    },
    {
        "address": "莲花南路2228号",
        "name": "开幕啦城市更新园区",
        "lnglat": "121.425580,31.072906",
        "count": 21
    },
    {
        "address": "莲花南路2338号",
        "name": "沫谷城市空间",
        "lnglat": "121.427782,31.070496",
        "count": 9
    },
    {
        "address": "莲花南路2899号",
        "name": "莲谷新兴科技产业园",
        "lnglat": "121.433500,31.063218",
        "count": 31
    },
    {
        "address": "莲花南路3999弄",
        "name": "万乐城小区",
        "lnglat": "121.445764,31.037486",
        "count": 46
    },
    {
        "address": "莲花南路588弄",
        "name": "未名园",
        "lnglat": "121.422318,31.125218",
        "count": 242
    },
    {
        "address": "莲花山路700弄",
        "name": "康桥水都第二街区",
        "lnglat": "121.437350,31.361724",
        "count": 90
    },
    {
        "address": "莲花山路817弄",
        "name": "康桥水都第一街区",
        "lnglat": "121.436204,31.361176",
        "count": 40
    },
    {
        "address": "莲溪路1099弄",
        "name": "鹏裕苑",
        "lnglat": "121.565143,31.173606",
        "count": 130
    },
    {
        "address": "莲振路269号",
        "name": "贤诺国际青年社区",
        "lnglat": "121.567856,31.167970",
        "count": 5
    },
    {
        "address": "联川路213号",
        "name": "新必产业园",
        "lnglat": "121.527085,31.076412",
        "count": 3
    },
    {
        "address": "联川路319号",
        "name": "耀莱物联网产业园",
        "lnglat": "121.525259,31.075165",
        "count": 3
    },
    {
        "address": "联航路1188号",
        "name": "浦江智谷商务园",
        "lnglat": "121.524657,31.080237",
        "count": 20
    },
    {
        "address": "联航路1369号",
        "name": "浦江人才公寓",
        "lnglat": "121.521380,31.077530",
        "count": 32
    },
    {
        "address": "联航路1399弄",
        "name": "浦江智汇园",
        "lnglat": "121.520050,31.077019",
        "count": 201
    },
    {
        "address": "联航路1505弄",
        "name": "复地浦江商务中心",
        "lnglat": "121.518022,31.076351",
        "count": 54
    },
    {
        "address": "联航路1588号",
        "name": "产业大楼",
        "lnglat": "121.517340,31.077728",
        "count": 38
    },
    {
        "address": "联航路2015弄1-43",
        "name": "世博家园十四街坊",
        "lnglat": "121.505292,31.071932",
        "count": 42
    },
    {
        "address": "联民路100弄",
        "name": "正荣府",
        "lnglat": "113.628176,28.157306",
        "count": 164
    },
    {
        "address": "联民路88弄",
        "name": "上海捷克住宅小区",
        "lnglat": "121.278741,31.159011",
        "count": 106
    },
    {
        "address": "联明路389号",
        "name": "麦可将文创园区",
        "lnglat": "121.346917,31.144063",
        "count": 13
    },
    {
        "address": "联农路179号",
        "name": "福克斯连锁商务大厦（联农）",
        "lnglat": "121.398014,31.061689",
        "count": 6
    },
    {
        "address": "联泰路56号",
        "name": "鑫鑫花园",
        "lnglat": "121.428943,31.346069",
        "count": 4
    },
    {
        "address": "联杨路1078弄",
        "name": "保利叶上海",
        "lnglat": "121.354552,31.345265",
        "count": 346
    },
    {
        "address": "联谊路388号",
        "name": "智慧湾五期",
        "lnglat": "121.430839,31.344209",
        "count": 7
    },
    {
        "address": "联营路615号",
        "name": "企福新尚科技园",
        "lnglat": "121.310575,31.024674",
        "count": 5
    },
    {
        "address": "联友路118号",
        "name": "虹桥成信中心",
        "lnglat": "121.277724,31.213334",
        "count": 14
    },
    {
        "address": "良舍路199号",
        "name": "右岸嘉园",
        "lnglat": "121.248088,31.364783",
        "count": 54
    },
    {
        "address": "凉城路1188弄",
        "name": "一品新筑苑",
        "lnglat": "121.472400,31.302362",
        "count": 116
    },
    {
        "address": "凉城路139弄",
        "name": "锦秀文华",
        "lnglat": "121.469186,31.281724",
        "count": 79
    },
    {
        "address": "凉城路215弄",
        "name": "中虹新都苑",
        "lnglat": "121.468599,31.284090",
        "count": 119
    },
    {
        "address": "凉城路2289号",
        "name": "泽元文化广场",
        "lnglat": "121.471719,31.310093",
        "count": 3
    },
    {
        "address": "凉城路357弄",
        "name": "中虹花园(丽都苑)",
        "lnglat": "121.469237,31.286080",
        "count": 134
    },
    {
        "address": "凉城路68弄",
        "name": "凉城路68弄",
        "lnglat": "121.470052,31.280825",
        "count": 36
    },
    {
        "address": "亮秀路180弄",
        "name": "汇智湖畔家园",
        "lnglat": "121.606136,31.199775",
        "count": 112
    },
    {
        "address": "辽宁路244号",
        "name": "1930鑫鑫创意园",
        "lnglat": "121.491221,31.255160",
        "count": 2
    },
    {
        "address": "辽阳路508弄",
        "name": "文通雅苑",
        "lnglat": "121.514508,31.262929",
        "count": 6
    },
    {
        "address": "林德路718弄",
        "name": "东方康德家园二期",
        "lnglat": "121.509853,31.129501",
        "count": 16
    },
    {
        "address": "林悦路125弄",
        "name": "源浦秀苑",
        "lnglat": "121.493542,31.139607",
        "count": 56
    },
    {
        "address": "临汾路299弄",
        "name": "恒安小区",
        "lnglat": "121.461575,31.310674",
        "count": 36
    },
    {
        "address": "临汾路380弄之1-9号",
        "name": "星城花苑",
        "lnglat": "121.457964,31.311957",
        "count": 72
    },
    {
        "address": "临汾路80弄",
        "name": "临汾名城三期",
        "lnglat": "120.379753,36.181217",
        "count": 117
    },
    {
        "address": "临虹路128弄6号",
        "name": "红蜻蜓品牌中心",
        "lnglat": "121.353613,31.232225",
        "count": 4
    },
    {
        "address": "临虹路289弄1号楼",
        "name": "虹桥金座1号楼",
        "lnglat": "121.351288,31.229813",
        "count": 5
    },
    {
        "address": "临平北路2号",
        "name": "金殿苑",
        "lnglat": "121.493328,31.262529",
        "count": 1
    },
    {
        "address": "临平北路60弄",
        "name": "银欣花苑",
        "lnglat": "121.492263,31.262671",
        "count": 36
    },
    {
        "address": "临平北路68号",
        "name": "虹临大厦（虹临宝都）",
        "lnglat": "121.491517,31.263507",
        "count": 9
    },
    {
        "address": "临平北路88号",
        "name": "虹诚大厦",
        "lnglat": "121.491550,31.263820",
        "count": 9
    },
    {
        "address": "临平路133弄",
        "name": "瑞虹新城二期",
        "lnglat": "121.499625,31.260588",
        "count": 68
    },
    {
        "address": "临平路333号",
        "name": "瑞虹新城一期",
        "lnglat": "121.495951,31.263350",
        "count": 18
    },
    {
        "address": "临青路555号",
        "name": "银河经典苑",
        "lnglat": "121.537647,31.268355",
        "count": 9
    },
    {
        "address": "临洮路1000弄",
        "name": "宁兴上尚湾",
        "lnglat": "121.334600,31.267270",
        "count": 117
    },
    {
        "address": "临潼路188号",
        "name": "临潼188金融创新中心",
        "lnglat": "121.512906,31.254386",
        "count": 9
    },
    {
        "address": "临夏路800弄",
        "name": "汇丰沁苑北区",
        "lnglat": "121.328242,31.257299",
        "count": 60
    },
    {
        "address": "临沂北路150弄",
        "name": "东南华庭",
        "lnglat": "121.516797,31.205984",
        "count": 44
    },
    {
        "address": "临沂北路210弄",
        "name": "盛族家园",
        "lnglat": "121.519164,31.205217",
        "count": 45
    },
    {
        "address": "临沂路115弄1-3号",
        "name": "上海汇景阁",
        "lnglat": "121.513768,31.195327",
        "count": 15
    },
    {
        "address": "临沂路128号",
        "name": "慧盛大厦办公楼",
        "lnglat": "121.513617,31.195629",
        "count": 9
    },
    {
        "address": "临沂路61弄",
        "name": "龙阳花苑",
        "lnglat": "118.844492,35.562494",
        "count": 66
    },
    {
        "address": "临沂路8弄",
        "name": "联邦公馆(光鸿苑)",
        "lnglat": "121.516590,31.200728",
        "count": 103
    },
    {
        "address": "临泽路88弄/89弄/188弄/189弄，崇信路1518弄，云屏路1399弄，白银路1563，,165号",
        "name": "新城金郡（上海）",
        "lnglat": "121.241562,31.344144",
        "count": 249
    },
    {
        "address": "灵石路1177弄",
        "name": "远龙公寓",
        "lnglat": "121.426739,31.272643",
        "count": 6
    },
    {
        "address": "灵石路1188号",
        "name": "华仁商务大厦",
        "lnglat": "121.426794,31.271533",
        "count": 11
    },
    {
        "address": "灵石路1509弄",
        "name": "水韵华庭东苑",
        "lnglat": "121.422690,31.268757",
        "count": 32
    },
    {
        "address": "灵石路1669弄",
        "name": "东旺雍景苑",
        "lnglat": "121.421809,31.265723",
        "count": 28
    },
    {
        "address": "灵石路658号",
        "name": "大宁财智中心",
        "lnglat": "121.445773,31.282805",
        "count": 10
    },
    {
        "address": "灵石路666弄",
        "name": "大宁八一坊",
        "lnglat": "121.445591,31.282122",
        "count": 78
    },
    {
        "address": "灵石路695号",
        "name": "合金工厂商务园",
        "lnglat": "121.449643,31.284196",
        "count": 40
    },
    {
        "address": "灵石路697-3号",
        "name": "巨丰国际商务广场",
        "lnglat": "117.352762,31.891123",
        "count": 20
    },
    {
        "address": "灵石路697号",
        "name": "健康智谷",
        "lnglat": "121.431483,31.276116",
        "count": 55
    },
    {
        "address": "灵石路709号60幢",
        "name": "万灵谷花园",
        "lnglat": "121.443485,31.284547",
        "count": 9
    },
    {
        "address": "灵石路712号",
        "name": "大宁人才公寓",
        "lnglat": "121.440284,31.282400",
        "count": 4
    },
    {
        "address": "灵石路721号",
        "name": "乐平方园区8号楼",
        "lnglat": "121.441195,31.283354",
        "count": 11
    },
    {
        "address": "灵岩南路295号",
        "name": "三林世博创意园",
        "lnglat": "121.496799,31.157140",
        "count": 9
    },
    {
        "address": "灵岩南路769弄",
        "name": "源城锦苑",
        "lnglat": "121.498708,31.149640",
        "count": 18
    },
    {
        "address": "灵岩南路801弄",
        "name": "凌云公寓",
        "lnglat": "121.498930,31.147771",
        "count": 28
    },
    {
        "address": "铃兰路508弄",
        "name": "保利铃兰公馆",
        "lnglat": "121.919248,30.918681",
        "count": 97
    },
    {
        "address": "凌创路62号",
        "name": "高盛家园",
        "lnglat": "121.534209,31.363162",
        "count": 46
    },
    {
        "address": "凌河路200弄",
        "name": "浦沁苑",
        "lnglat": "121.596924,31.275545",
        "count": 55
    },
    {
        "address": "凌河路777弄",
        "name": "金桥一方雅苑",
        "lnglat": "121.603031,31.273889",
        "count": 114
    },
    {
        "address": "凌云路梅陇四村95号",
        "name": "梅陇四村凌云公寓",
        "lnglat": "121.419855,31.138052",
        "count": 9
    },
    {
        "address": "零陵北路9弄",
        "name": "日晖新城",
        "lnglat": "111.604165,26.450157",
        "count": 45
    },
    {
        "address": "零陵路231号",
        "name": "天迈商务楼",
        "lnglat": "121.459384,31.192784",
        "count": 5
    },
    {
        "address": "零陵路29弄",
        "name": "丝庐花语",
        "lnglat": "121.466909,31.195746",
        "count": 76
    },
    {
        "address": "零陵路342号",
        "name": "汇成民聚商务楼",
        "lnglat": "121.456928,31.191323",
        "count": 7
    },
    {
        "address": "零陵路583号",
        "name": "海洋石油大厦",
        "lnglat": "121.447739,31.188637",
        "count": 12
    },
    {
        "address": "零陵路585号",
        "name": "爱邦大厦",
        "lnglat": "121.447444,31.188243",
        "count": 2
    },
    {
        "address": "零陵路629号",
        "name": "爱和大厦",
        "lnglat": "121.446855,31.188223",
        "count": 1
    },
    {
        "address": "零陵路631号",
        "name": "爱乐大厦",
        "lnglat": "121.446470,31.188000",
        "count": 1
    },
    {
        "address": "零陵路635号",
        "name": "爱博大厦",
        "lnglat": "121.446193,31.188543",
        "count": 2
    },
    {
        "address": "零陵路777弄68号",
        "name": "鑫国家园",
        "lnglat": "121.440982,31.186362",
        "count": 42
    },
    {
        "address": "零陵路899号",
        "name": "飞洲国际广场",
        "lnglat": "121.437480,31.183167",
        "count": 77
    },
    {
        "address": "岭南路1115号",
        "name": "中铁商务楼",
        "lnglat": "121.454988,31.320950",
        "count": 8
    },
    {
        "address": "岭南路1118弄",
        "name": "珺乐苑(上海)",
        "lnglat": "121.456664,31.322445",
        "count": 28
    },
    {
        "address": "岭南路1288弄",
        "name": "岭南雅苑",
        "lnglat": "121.456600,31.324587",
        "count": 30
    },
    {
        "address": "柳埠路196弄 ",
        "name": "新沪东公寓",
        "lnglat": "121.583102,31.264176",
        "count": 38
    },
    {
        "address": "柳湖路299弄",
        "name": "御江金都2期",
        "lnglat": "121.247212,31.397975",
        "count": 48
    },
    {
        "address": "柳梁路55弄",
        "name": "悠活城酒店式公寓",
        "lnglat": "121.228397,31.377595",
        "count": 3
    },
    {
        "address": "柳林路150号",
        "name": "建发柳林大厦",
        "lnglat": "106.074074,30.792892",
        "count": 8
    },
    {
        "address": "柳市路1弄",
        "name": "长峰馨园",
        "lnglat": "121.499017,31.213052",
        "count": 32
    },
    {
        "address": "柳营路127号",
        "name": "明光公寓",
        "lnglat": "121.468261,31.271197",
        "count": 2
    },
    {
        "address": "柳营路515弄",
        "name": "鑫安公寓",
        "lnglat": "121.460884,31.266159",
        "count": 24
    },
    {
        "address": "柳营路635弄",
        "name": "惠龙公寓",
        "lnglat": "121.458278,31.266611",
        "count": 24
    },
    {
        "address": "柳营路650弄",
        "name": "心族公寓",
        "lnglat": "121.457521,31.263665",
        "count": 32
    },
    {
        "address": "柳营路669弄",
        "name": "盛源家豪城",
        "lnglat": "121.455632,31.265403",
        "count": 107
    },
    {
        "address": "柳营路768弄",
        "name": "上海枫景苑",
        "lnglat": "121.455813,31.262785",
        "count": 30
    },
    {
        "address": "柳营路8号",
        "name": "柳营路德必运动LOFT",
        "lnglat": "120.162370,30.247990",
        "count": 56
    },
    {
        "address": "柳州路128弄",
        "name": "康馨家园",
        "lnglat": "121.426636,31.159223",
        "count": 6
    },
    {
        "address": "柳州路181弄",
        "name": "海上名门",
        "lnglat": "121.427993,31.159284",
        "count": 49
    },
    {
        "address": "柳州路300弄",
        "name": "豪门府邸新大公寓",
        "lnglat": "119.913360,36.775924",
        "count": 28
    },
    {
        "address": "柳州路399号甲",
        "name": "恒地仓国际大厦",
        "lnglat": "121.425791,31.166922",
        "count": 14
    },
    {
        "address": "柳州路431号",
        "name": "锦和越界尚勤园",
        "lnglat": "121.424846,31.169619",
        "count": 4
    },
    {
        "address": "柳州路523号",
        "name": "和成阁公寓",
        "lnglat": "121.423631,31.172665",
        "count": 2
    },
    {
        "address": "柳州路523弄",
        "name": "平成阁公寓",
        "lnglat": "119.968481,36.284485",
        "count": 4
    },
    {
        "address": "柳州路600弄",
        "name": "金丽广场(上海)",
        "lnglat": "118.426046,32.295369",
        "count": 24
    },
    {
        "address": "柳州路928号",
        "name": "上海百丽国际广场",
        "lnglat": "121.420869,31.185963",
        "count": 9
    },
    {
        "address": "柳州路980弄",
        "name": "中瑞公寓",
        "lnglat": "121.421023,31.186548",
        "count": 31
    },
    {
        "address": "六合路98号",
        "name": "港陆黄浦中心",
        "lnglat": "110.333780,25.279878",
        "count": 6
    },
    {
        "address": "龙爱路139号",
        "name": "诺布中心",
        "lnglat": "121.461965,31.160808",
        "count": 64
    },
    {
        "address": "龙漕路200弄19号",
        "name": "龙漕德必易园",
        "lnglat": "121.442367,31.168409",
        "count": 4
    },
    {
        "address": "龙漕路38弄",
        "name": "龙漕家园",
        "lnglat": "121.436634,31.168426",
        "count": 5
    },
    {
        "address": "龙漕路51弄1号",
        "name": "金海大厦",
        "lnglat": "121.436957,31.168874",
        "count": 7
    },
    {
        "address": "龙漕路51弄3号",
        "name": "澳龙公寓",
        "lnglat": "121.436465,31.169193",
        "count": 9
    },
    {
        "address": "龙漕路51弄4号",
        "name": "银星名庭",
        "lnglat": "121.437472,31.169224",
        "count": 19
    },
    {
        "address": "龙漕路一弄一号",
        "name": "龙漕大楼(上海)",
        "lnglat": "121.436214,31.169229",
        "count": 4
    },
    {
        "address": "龙川北路777弄",
        "name": "城开汇社区",
        "lnglat": "121.436514,31.150680",
        "count": 30
    },
    {
        "address": "龙东大道3000号",
        "name": "张江集电港",
        "lnglat": "121.635044,31.224220",
        "count": 27
    },
    {
        "address": "龙东大道3000号11号楼",
        "name": "凯龙科技大厦",
        "lnglat": "121.635044,31.224220",
        "count": 15
    },
    {
        "address": "龙高路400号",
        "name": "奥家科创园",
        "lnglat": "121.306168,31.116825",
        "count": 1
    },
    {
        "address": "龙华东路325号",
        "name": "博荟广场",
        "lnglat": "121.481816,31.196852",
        "count": 88
    },
    {
        "address": "龙华东路647号",
        "name": "电科滨江中心",
        "lnglat": "121.476086,31.194566",
        "count": 20
    },
    {
        "address": "龙华东路810号",
        "name": "黄浦绿地缤纷城",
        "lnglat": "121.473475,31.193014",
        "count": 23
    },
    {
        "address": "龙华东路868号",
        "name": "绿地海外滩中心",
        "lnglat": "121.473290,31.192830",
        "count": 45
    },
    {
        "address": "龙华东路888弄",
        "name": "南园大厦（上海）",
        "lnglat": "110.368376,19.857985",
        "count": 7
    },
    {
        "address": "龙华路2518弄",
        "name": "盛大花园",
        "lnglat": "113.126717,28.185055",
        "count": 302
    },
    {
        "address": "龙华路3208弄",
        "name": "龙兆苑",
        "lnglat": "113.128381,28.185500",
        "count": 96
    },
    {
        "address": "龙华西路398弄",
        "name": "强生花苑",
        "lnglat": "121.444552,31.175833",
        "count": 24
    },
    {
        "address": "龙华西路525号",
        "name": "明安馨苑",
        "lnglat": "121.442111,31.175849",
        "count": 30
    },
    {
        "address": "龙华西路535弄",
        "name": "明佳苑",
        "lnglat": "121.442030,31.176558",
        "count": 20
    },
    {
        "address": "龙华西路585号",
        "name": "上海华富大厦",
        "lnglat": "121.441470,31.177058",
        "count": 28
    },
    {
        "address": "龙华西路591弄",
        "name": "宜仕怡家",
        "lnglat": "121.440631,31.176378",
        "count": 75
    },
    {
        "address": "龙华中路596号",
        "name": "绿地滨江国际中心",
        "lnglat": "121.458790,31.186263",
        "count": 16
    },
    {
        "address": "龙江路289弄",
        "name": "浦江风景苑",
        "lnglat": "101.539165,25.047103",
        "count": 144
    },
    {
        "address": "龙江路317弄",
        "name": "圣骊河滨苑一期",
        "lnglat": "101.539005,25.048691",
        "count": 55
    },
    {
        "address": "龙江路370弄",
        "name": "丹江商务楼",
        "lnglat": "101.539031,25.049216",
        "count": 9
    },
    {
        "address": "龙江路388弄",
        "name": "圣骊河滨苑二期",
        "lnglat": "101.539034,25.049179",
        "count": 47
    },
    {
        "address": "龙居路2弄",
        "name": "龙居苑",
        "lnglat": "121.558580,31.255931",
        "count": 40
    },
    {
        "address": "龙口路29弄7号",
        "name": "魔方公寓宁国路店",
        "lnglat": "121.532053,31.266758",
        "count": 3
    },
    {
        "address": "龙兰路277号(云锦路龙兰路路口)",
        "name": "东航滨江中心",
        "lnglat": "121.456515,31.165879",
        "count": 33
    },
    {
        "address": "龙联路58弄",
        "name": "玉兰清苑",
        "lnglat": "121.297692,31.197254",
        "count": 72
    },
    {
        "address": "龙联路59弄",
        "name": "城投玉兰清苑二期",
        "lnglat": "121.297387,31.196208",
        "count": 134
    },
    {
        "address": "龙马路433号",
        "name": "合景天悦",
        "lnglat": "113.482128,23.369915",
        "count": 62
    },
    {
        "address": "龙茗路1597弄",
        "name": "东兰世茗雅苑",
        "lnglat": "121.382442,31.151846",
        "count": 16
    },
    {
        "address": "龙茗路1699弄",
        "name": "东兰雅苑",
        "lnglat": "121.382006,31.150692",
        "count": 16
    },
    {
        "address": "龙茗路1897号",
        "name": "和润家园",
        "lnglat": "121.382046,31.154073",
        "count": 84
    },
    {
        "address": "龙茗路2822弄18-35号",
        "name": "九歌茗园",
        "lnglat": "121.380545,31.164183",
        "count": 64
    },
    {
        "address": "龙泉山路198弄",
        "name": "秋乐苑",
        "lnglat": "104.135649,30.621779",
        "count": 56
    },
    {
        "address": "龙胜路67号",
        "name": "合生海景公馆",
        "lnglat": "121.352516,30.726865",
        "count": 52
    },
    {
        "address": "龙水北路998弄",
        "name": "龙缘公寓",
        "lnglat": "121.447930,31.172932",
        "count": 15
    },
    {
        "address": "龙水南路336号",
        "name": "龙南佳苑",
        "lnglat": "121.453673,31.153051",
        "count": 21
    },
    {
        "address": "龙吴路1137弄17.18号",
        "name": "百龙小区",
        "lnglat": "121.449333,31.144575",
        "count": 14
    },
    {
        "address": "龙吴路1500号",
        "name": "交大海科大厦A楼",
        "lnglat": "121.453829,31.135485",
        "count": 1
    },
    {
        "address": "龙吴路1500号B幢",
        "name": "上海交大科技园海科园区B楼",
        "lnglat": "121.453829,31.135485",
        "count": 4
    },
    {
        "address": "龙吴路288弄",
        "name": "徐汇御景苑",
        "lnglat": "121.445961,31.166119",
        "count": 54
    },
    {
        "address": "龙吴路3389号",
        "name": "滨江商务生活广场",
        "lnglat": "121.456015,31.092530",
        "count": 11
    },
    {
        "address": "龙吴路410弄87号",
        "name": "纺运商务中心大厦",
        "lnglat": "121.451498,31.158581",
        "count": 2
    },
    {
        "address": "龙吴路515号",
        "name": "鑫龙苑（上海）",
        "lnglat": "121.449028,31.157678",
        "count": 102
    },
    {
        "address": "龙吴路555号",
        "name": "绿邑翠苑",
        "lnglat": "121.448841,31.156950",
        "count": 18
    },
    {
        "address": "龙吴路5688弄",
        "name": "万科花园小城(万科阳光苑)",
        "lnglat": "121.469093,31.038934",
        "count": 192
    },
    {
        "address": "龙轩路1998弄15号",
        "name": "正荣御首府",
        "lnglat": "121.318905,30.745233",
        "count": 142
    },
    {
        "address": "龙阳路1880弄",
        "name": "万邦都市花园",
        "lnglat": "121.554568,31.201198",
        "count": 259
    },
    {
        "address": "龙阳路1990号",
        "name": "龙阳商务大楼",
        "lnglat": "121.556400,31.202848",
        "count": 1
    },
    {
        "address": "龙阳路2277弄",
        "name": "永达国际大厦",
        "lnglat": "121.562641,31.204162",
        "count": 10
    },
    {
        "address": "隆昌路210号",
        "name": "博海商务楼",
        "lnglat": "121.548620,31.269594",
        "count": 8
    },
    {
        "address": "隆昌路588号",
        "name": "复旦软件园（杨浦）",
        "lnglat": "121.543406,31.275777",
        "count": 35
    },
    {
        "address": "隆昌路590-612号",
        "name": "复旦软件园裙房",
        "lnglat": "115.509498,38.903983",
        "count": 16
    },
    {
        "address": "娄山关路35号",
        "name": "大虹桥德必WE",
        "lnglat": "121.402724,31.202453",
        "count": 8
    },
    {
        "address": "娄山关路523、533号",
        "name": "金虹桥国际中心",
        "lnglat": "121.402556,31.208916",
        "count": 116
    },
    {
        "address": "娄山关路555号",
        "name": "长房国际广场",
        "lnglat": "121.403636,31.210199",
        "count": 6
    },
    {
        "address": "娄山关路83号",
        "name": "新虹桥中心大厦",
        "lnglat": "121.402641,31.204349",
        "count": 9
    },
    {
        "address": "娄山关路８５号",
        "name": "东方国际大厦B座",
        "lnglat": "121.402285,31.205323",
        "count": 7
    },
    {
        "address": "娄山关路999弄",
        "name": "上海春天花园",
        "lnglat": "121.403451,31.217147",
        "count": 204
    },
    {
        "address": "芦安路268弄",
        "name": "保利玲珑公馆",
        "lnglat": "121.854955,30.866802",
        "count": 32
    },
    {
        "address": "芦恒路378弄",
        "name": "一品漫城四五期",
        "lnglat": "121.490801,31.116904",
        "count": 25
    },
    {
        "address": "泸定路180号",
        "name": "嘉庭国际广场商场（东渡国际企业中心）",
        "lnglat": "121.387577,31.223862",
        "count": 2
    },
    {
        "address": "鲁班路209号",
        "name": "兴城商务楼",
        "lnglat": "121.475051,31.204689",
        "count": 3
    },
    {
        "address": "鲁班路277号",
        "name": "银杏家园",
        "lnglat": "121.475448,31.204609",
        "count": 17
    },
    {
        "address": "鲁班路277号299号",
        "name": "银杏家园2",
        "lnglat": "121.475448,31.204609",
        "count": 25
    },
    {
        "address": "鲁班路388弄",
        "name": "海悦花园",
        "lnglat": "121.474709,31.201626",
        "count": 52
    },
    {
        "address": "鲁班路509弄",
        "name": "卢湾都市花园",
        "lnglat": "121.477812,31.201558",
        "count": 100
    },
    {
        "address": "鲁班路558号",
        "name": "经纬国际大厦",
        "lnglat": "121.476183,31.198844",
        "count": 8
    },
    {
        "address": "鲁班路600号",
        "name": "江南造船大厦",
        "lnglat": "121.476277,31.197871",
        "count": 7
    },
    {
        "address": "鲁班路721弄",
        "name": "鲁班大楼",
        "lnglat": "121.478601,31.197163",
        "count": 14
    },
    {
        "address": "鲁班路88号",
        "name": "大同花园三期",
        "lnglat": "108.283674,22.845530",
        "count": 40
    },
    {
        "address": "鲁康路1198弄",
        "name": "永康城盛华园",
        "lnglat": "121.503233,31.030714",
        "count": 18
    },
    {
        "address": "陆丰路9号",
        "name": "宝通大楼",
        "lnglat": "118.151668,24.723920",
        "count": 8
    },
    {
        "address": "陆家浜路1011号",
        "name": "新世纪大厦酒店式公寓",
        "lnglat": "121.489071,31.212564",
        "count": 6
    },
    {
        "address": "陆家浜路1060弄",
        "name": "东方苑大楼",
        "lnglat": "121.488442,31.211628",
        "count": 1
    },
    {
        "address": "陆家浜路1100号",
        "name": "新凌大厦",
        "lnglat": "121.487041,31.211542",
        "count": 11
    },
    {
        "address": "陆家浜路1141号",
        "name": "六角大楼",
        "lnglat": "121.487319,31.212448",
        "count": 11
    },
    {
        "address": "陆家浜路1235弄",
        "name": "雅庐苑(上海)",
        "lnglat": "121.485311,31.211970",
        "count": 20
    },
    {
        "address": "陆家浜路1332号",
        "name": "南开大厦",
        "lnglat": "121.483788,31.211184",
        "count": 8
    },
    {
        "address": "陆家浜路1378号",
        "name": "万事利大厦",
        "lnglat": "121.483160,31.211111",
        "count": 10
    },
    {
        "address": "陆家浜路285弄",
        "name": "三角大楼",
        "lnglat": "121.498011,31.211275",
        "count": 7
    },
    {
        "address": "陆家浜路305弄",
        "name": "阳光公寓",
        "lnglat": "121.500771,31.211777",
        "count": 53
    },
    {
        "address": "陆家浜路413弄",
        "name": "金南新苑（群英荟）",
        "lnglat": "114.900765,33.439501",
        "count": 2
    },
    {
        "address": "陆家浜路428号",
        "name": "中福轻纺面料商城",
        "lnglat": "121.498738,31.211132",
        "count": 5
    },
    {
        "address": "陆家浜路456号",
        "name": "赛元大酒店",
        "lnglat": "121.497938,31.211126",
        "count": 16
    },
    {
        "address": "陆家浜路468弄28号",
        "name": "百汇公寓（上海）",
        "lnglat": "121.497723,31.210828",
        "count": 14
    },
    {
        "address": "陆家浜路521弄",
        "name": "阳光翠竹苑",
        "lnglat": "121.497774,31.212924",
        "count": 5
    },
    {
        "address": "陆家浜路688弄",
        "name": "金日世家",
        "lnglat": "121.495574,31.212161",
        "count": 36
    },
    {
        "address": "陆家浜路976号",
        "name": "富南大厦",
        "lnglat": "121.490129,31.211869",
        "count": 15
    },
    {
        "address": "陆家圈路168弄（陆家圈路269弄）",
        "name": "中海悦庭（中海悦府）",
        "lnglat": "121.295528,31.087457",
        "count": 98
    },
    {
        "address": "陆家嘴东路161号",
        "name": "招商局大厦（上海）",
        "lnglat": "121.508954,31.237631",
        "count": 34
    },
    {
        "address": "陆家嘴环路1233号",
        "name": "汇亚大厦",
        "lnglat": "121.504164,31.240987",
        "count": 7
    },
    {
        "address": "陆家嘴环路166号",
        "name": "未来资产大厦",
        "lnglat": "121.500258,31.235222",
        "count": 32
    },
    {
        "address": "陆家嘴环路958号",
        "name": "华能联合大厦",
        "lnglat": "121.508125,31.239183",
        "count": 7
    },
    {
        "address": "陆家嘴西路168号",
        "name": "正大广场",
        "lnglat": "121.499227,31.236732",
        "count": 40
    },
    {
        "address": "陆翔路1018号",
        "name": "龙湖北城天街铂金岛",
        "lnglat": "121.362005,31.358728",
        "count": 39
    },
    {
        "address": "陆翔路111号",
        "name": "宝山正大乐城",
        "lnglat": "121.371055,31.345255",
        "count": 37
    },
    {
        "address": "陆翔路3489弄",
        "name": "佳翔苑",
        "lnglat": "121.338626,31.400703",
        "count": 40
    },
    {
        "address": "罗芬路1288号",
        "name": "远洋美兰公寓",
        "lnglat": "121.354636,31.401989",
        "count": 172
    },
    {
        "address": "罗芬路888号",
        "name": "美兰湖国际会议中心",
        "lnglat": "121.354550,31.401240",
        "count": 20
    },
    {
        "address": "罗浮路89弄",
        "name": "金芙世纪公寓",
        "lnglat": "114.044091,23.214425",
        "count": 18
    },
    {
        "address": "罗和路118弄",
        "name": "美罗家园慧苑",
        "lnglat": "121.341807,31.381543",
        "count": 66
    },
    {
        "address": "罗和路855弄",
        "name": "金丰苑三区",
        "lnglat": "121.334507,31.391252",
        "count": 36
    },
    {
        "address": "罗和路935弄",
        "name": "金丰苑二区",
        "lnglat": "121.333584,31.393448",
        "count": 32
    },
    {
        "address": "罗锦路50号",
        "name": "西岸蓝海企业天地",
        "lnglat": "121.420915,31.124213",
        "count": 4
    },
    {
        "address": "罗锦路55号",
        "name": "锦宏产业园",
        "lnglat": "121.420730,31.125380",
        "count": 16
    },
    {
        "address": "罗锦路888弄",
        "name": "上海阳城(1至8支弄)",
        "lnglat": "121.398128,31.120744",
        "count": 241
    },
    {
        "address": "罗南路368号",
        "name": "美罗家园雅苑",
        "lnglat": "121.341492,31.389654",
        "count": 45
    },
    {
        "address": "罗宁路1288弄",
        "name": "联东U谷宝山国际企业港",
        "lnglat": "121.341852,31.457178",
        "count": 38
    },
    {
        "address": "罗星南路115号",
        "name": "万祥金邸",
        "lnglat": "121.166812,30.883272",
        "count": 177
    },
    {
        "address": "罗秀路1399号；罗秀路1459弄；上中西路855弄",
        "name": "中梅苑",
        "lnglat": "121.415478,31.129428",
        "count": 48
    },
    {
        "address": "罗秀路1555弄1-23号",
        "name": "罗秀苑南区",
        "lnglat": "121.411781,31.127661",
        "count": 28
    },
    {
        "address": "罗秀路1955弄",
        "name": "嘉和花苑",
        "lnglat": "121.403300,31.127079",
        "count": 292
    },
    {
        "address": "罗秀路200弄",
        "name": "长桥八村",
        "lnglat": "121.439874,31.131655",
        "count": 14
    },
    {
        "address": "罗秀路55弄",
        "name": "华馨公寓(上海)",
        "lnglat": "121.451168,31.134277",
        "count": 68
    },
    {
        "address": "罗秀路717弄",
        "name": "舒乐公寓",
        "lnglat": "121.434893,31.131170",
        "count": 30
    },
    {
        "address": "罗阳路599弄",
        "name": "莲花河畔景苑",
        "lnglat": "121.405505,31.124243",
        "count": 88
    },
    {
        "address": "罗真路188弄1-21号",
        "name": "罗兰佳苑东区",
        "lnglat": "121.342170,31.395465",
        "count": 126
    },
    {
        "address": "洛川东路360号",
        "name": "东方公寓",
        "lnglat": "121.461959,31.270080",
        "count": 8
    },
    {
        "address": "洛川东路494号",
        "name": "洛川大楼",
        "lnglat": "121.458990,31.268129",
        "count": 10
    },
    {
        "address": "洛川中路1158号",
        "name": "上海名仕街",
        "lnglat": "121.448423,31.262790",
        "count": 38
    },
    {
        "address": "洛川中路600弄",
        "name": "新理想家园",
        "lnglat": "121.456554,31.267019",
        "count": 18
    },
    {
        "address": "洛川中路777弄",
        "name": "悠和家园",
        "lnglat": "121.452773,31.266662",
        "count": 88
    },
    {
        "address": "洛川中路840号",
        "name": "E构空间",
        "lnglat": "121.452331,31.265368",
        "count": 14
    },
    {
        "address": "旅顺路199弄",
        "name": "白金府邸",
        "lnglat": "121.494862,31.250304",
        "count": 14
    },
    {
        "address": "绿湖路888弄",
        "name": "海上湾华庭闻涧",
        "lnglat": "121.023203,31.121049",
        "count": 149
    },
    {
        "address": "绿莲路99弄、绿莲路100弄",
        "name": "银河新都",
        "lnglat": "121.413366,31.094805",
        "count": 525
    },
    {
        "address": "马当路357弄之1-8号",
        "name": "马当小区",
        "lnglat": "121.475685,31.213394",
        "count": 6
    },
    {
        "address": "马当路588弄",
        "name": "淡水湾花园",
        "lnglat": "121.475128,31.210429",
        "count": 48
    },
    {
        "address": "马吉路2号",
        "name": "高帆大厦",
        "lnglat": "121.587982,31.348140",
        "count": 23
    },
    {
        "address": "马桥镇富卓路789弄",
        "name": "马桥景城品雅苑（万科公园大道）",
        "lnglat": "121.380541,31.025126",
        "count": 54
    },
    {
        "address": "玛瑙路58弄",
        "name": "玛瑙苑",
        "lnglat": "121.558661,29.877791",
        "count": 36
    },
    {
        "address": "茅台路830弄（威宁路）",
        "name": "天申综合小区",
        "lnglat": "121.385200,31.210813",
        "count": 4
    },
    {
        "address": "茅台路868号",
        "name": "光华大厦（上海）",
        "lnglat": "121.383132,31.211097",
        "count": 27
    },
    {
        "address": "茂华路50弄",
        "name": "唐家苑南区",
        "lnglat": "121.283769,31.372680",
        "count": 20
    },
    {
        "address": "茂华路99弄",
        "name": "华谊禄丰苑",
        "lnglat": "121.284280,31.371570",
        "count": 9
    },
    {
        "address": "茂名南路205号",
        "name": "瑞金大厦（上海）",
        "lnglat": "121.462977,31.213618",
        "count": 10
    },
    {
        "address": "茂兴路88号",
        "name": "仁恒广场",
        "lnglat": "118.605098,24.926010",
        "count": 43
    },
    {
        "address": "眉州路381号",
        "name": "华谊星城大厦",
        "lnglat": "121.534769,31.261596",
        "count": 25
    },
    {
        "address": "眉州路513弄",
        "name": "浦江天第苑",
        "lnglat": "121.532315,31.263211",
        "count": 22
    },
    {
        "address": "眉州路888弄",
        "name": "凯阳公寓",
        "lnglat": "121.530215,31.268333",
        "count": 16
    },
    {
        "address": "眉州路988弄",
        "name": "东田公寓",
        "lnglat": "121.529695,31.270564",
        "count": 16
    },
    {
        "address": "梅川路1209号",
        "name": "加速器金融园",
        "lnglat": "121.384484,31.241668",
        "count": 3
    },
    {
        "address": "梅川路1247号",
        "name": "新长征商务大厦",
        "lnglat": "121.384355,31.241017",
        "count": 2
    },
    {
        "address": "梅川路1333弄",
        "name": "祥和名邸",
        "lnglat": "121.376067,31.242454",
        "count": 72
    },
    {
        "address": "梅川路145号",
        "name": "西部秀苑",
        "lnglat": "121.401428,31.238611",
        "count": 24
    },
    {
        "address": "梅川路255弄",
        "name": "怒江苑",
        "lnglat": "121.398184,31.238347",
        "count": 6
    },
    {
        "address": "梅川路888弄",
        "name": "海上名庭（三期）",
        "lnglat": "121.390390,31.241451",
        "count": 104
    },
    {
        "address": "梅富路228号",
        "name": "春申创意园",
        "lnglat": "121.418382,31.108625",
        "count": 28
    },
    {
        "address": "梅花路777弄",
        "name": "建华新苑",
        "lnglat": "121.554315,31.210390",
        "count": 52
    },
    {
        "address": "梅林路866弄1-19号",
        "name": "宝虹水岸",
        "lnglat": "121.434755,31.371107",
        "count": 30
    },
    {
        "address": "梅林路97弄",
        "name": "康桥水都第四街区",
        "lnglat": "114.058138,22.568043",
        "count": 40
    },
    {
        "address": "梅岭南路380弄",
        "name": "常高公寓",
        "lnglat": "121.410287,31.236723",
        "count": 13
    },
    {
        "address": "梅陇路565弄",
        "name": "森陇家园",
        "lnglat": "121.416247,31.136961",
        "count": 28
    },
    {
        "address": "梅陇十村17～21号",
        "name": "徐汇锦梅苑",
        "lnglat": "121.424347,31.133657",
        "count": 32
    },
    {
        "address": "梅陇西路413号",
        "name": "莲花商务大厦",
        "lnglat": "121.408311,31.135183",
        "count": 4
    },
    {
        "address": "梅园路77号",
        "name": "人才大厦(上海)",
        "lnglat": "114.109918,22.562434",
        "count": 3
    },
    {
        "address": "湄浦路361弄",
        "name": "互联宝地锦溥园",
        "lnglat": "121.456692,31.403827",
        "count": 12
    },
    {
        "address": "美艾路177弄",
        "name": "万科琥珀郡园",
        "lnglat": "121.364134,31.394206",
        "count": 249
    },
    {
        "address": "美艾路198弄",
        "name": "美兰湖颐景园",
        "lnglat": "121.362322,31.393918",
        "count": 14
    },
    {
        "address": "美安路628弄",
        "name": "美罗家园宝欣苑九村",
        "lnglat": "121.342654,31.386758",
        "count": 30
    },
    {
        "address": "美丹路1033弄",
        "name": "佳境苑（上海）",
        "lnglat": "121.337576,31.392110",
        "count": 52
    },
    {
        "address": "美丹路1058弄",
        "name": "佳欣苑",
        "lnglat": "121.336839,31.394605",
        "count": 38
    },
    {
        "address": "美丹路188弄",
        "name": "信达郡庭",
        "lnglat": "121.351869,31.403509",
        "count": 125
    },
    {
        "address": "美丹路222号",
        "name": "上置美兰优湖",
        "lnglat": "121.351431,31.402344",
        "count": 22
    },
    {
        "address": "美丹路8号",
        "name": "美兰湖花园（办公楼）",
        "lnglat": "121.354919,31.405118",
        "count": 4
    },
    {
        "address": "美丹路998弄1-27号",
        "name": "罗兰佳苑西区",
        "lnglat": "121.340146,31.395423",
        "count": 182
    },
    {
        "address": "美丰路88号",
        "name": "香岛原墅",
        "lnglat": "120.911784,31.329014",
        "count": 26
    },
    {
        "address": "美康路818弄",
        "name": "金丰苑一区",
        "lnglat": "121.332649,31.395909",
        "count": 36
    },
    {
        "address": "美兰湖地铁站2号口",
        "name": "中集金地美兰城",
        "lnglat": "121.349788,31.401638",
        "count": 17
    },
    {
        "address": "美平路1060弄1-15号",
        "name": "美罗家园宝欣苑三村",
        "lnglat": "121.335883,31.387947",
        "count": 30
    },
    {
        "address": "美平路500弄1-14号",
        "name": "美罗家园绣苑",
        "lnglat": "121.342913,31.389633",
        "count": 63
    },
    {
        "address": "美平路696弄",
        "name": "美罗家园宝欣苑一村",
        "lnglat": "121.339709,31.388244",
        "count": 38
    },
    {
        "address": "美平路745弄12号",
        "name": "美罗家园宝欣苑二村",
        "lnglat": "121.338518,31.387369",
        "count": 34
    },
    {
        "address": "美平路999弄1-16号",
        "name": "美罗家园宝欣苑四村",
        "lnglat": "121.336447,31.387068",
        "count": 32
    },
    {
        "address": "美盛路255号",
        "name": "众原企业天地",
        "lnglat": "121.604484,31.338933",
        "count": 4
    },
    {
        "address": "美盛路27号",
        "name": "烨博大厦",
        "lnglat": "121.596062,31.335043",
        "count": 9
    },
    {
        "address": "美约路166号",
        "name": "美约路166号园区",
        "lnglat": "121.628366,31.300499",
        "count": 14
    },
    {
        "address": "美约路222号",
        "name": "生物医药园_上海",
        "lnglat": "121.630956,31.300503",
        "count": 4
    },
    {
        "address": "蒙自路169号",
        "name": "智造局一期",
        "lnglat": "121.478039,31.206443",
        "count": 16
    },
    {
        "address": "蒙自路207号",
        "name": "宏慧盟智园1号楼",
        "lnglat": "121.478425,31.205820",
        "count": 25
    },
    {
        "address": "蒙自路255号",
        "name": "华电公寓",
        "lnglat": "121.478471,31.204717",
        "count": 9
    },
    {
        "address": "蒙自路501弄",
        "name": "德福苑",
        "lnglat": "121.480185,31.201216",
        "count": 46
    },
    {
        "address": "蒙自路757号",
        "name": "平安滨江金融中心",
        "lnglat": "121.482101,31.197581",
        "count": 6
    },
    {
        "address": "蒙自路763号",
        "name": "丰盛创建大厦",
        "lnglat": "121.482556,31.196757",
        "count": 60
    },
    {
        "address": "米筛浜路699弄",
        "name": "佘北家园松和苑",
        "lnglat": "121.208242,31.128205",
        "count": 230
    },
    {
        "address": "苗圃路218弄",
        "name": "维多利华庭",
        "lnglat": "121.548322,31.243248",
        "count": 27
    },
    {
        "address": "苗圃路438弄",
        "name": "新城名园",
        "lnglat": "121.551485,31.238168",
        "count": 20
    },
    {
        "address": "妙川路300弄",
        "name": "凯佳公寓",
        "lnglat": "121.697461,31.176242",
        "count": 140
    },
    {
        "address": "妙川路800弄",
        "name": "阳光城愉景湾（上海愉景湾）",
        "lnglat": "121.704102,31.176698",
        "count": 70
    },
    {
        "address": "庙泾路52弄",
        "name": "水清三村",
        "lnglat": "121.378313,31.116808",
        "count": 42
    },
    {
        "address": "庙泾路58号",
        "name": "莘庄经济城",
        "lnglat": "121.378350,31.115658",
        "count": 3
    },
    {
        "address": "民府路1258弄",
        "name": "旭辉江湾墅",
        "lnglat": "121.498918,31.314675",
        "count": 8
    },
    {
        "address": "民京路658弄",
        "name": "民庆家园二期",
        "lnglat": "121.519755,31.321424",
        "count": 57
    },
    {
        "address": "民京路828弄",
        "name": "世晶花苑",
        "lnglat": "121.521456,31.322175",
        "count": 12
    },
    {
        "address": "民京路838弄",
        "name": "民京路838弄",
        "lnglat": "121.522170,31.322672",
        "count": 60
    },
    {
        "address": "民乐路28弄",
        "name": "世茂爱马尚郡",
        "lnglat": "105.031677,30.284235",
        "count": 55
    },
    {
        "address": "民乐路328弄",
        "name": "派米雷星火产业园A区",
        "lnglat": "109.219016,23.742943",
        "count": 2
    },
    {
        "address": "民强路485号",
        "name": "佳钢智慧园(民强路)",
        "lnglat": "121.297592,31.043638",
        "count": 30
    },
    {
        "address": "民生路118弄",
        "name": "滨江万科中心",
        "lnglat": "109.518182,34.506789",
        "count": 30
    },
    {
        "address": "民生路1199号",
        "name": "证大五道口广场",
        "lnglat": "121.549906,31.226561",
        "count": 26
    },
    {
        "address": "民生路1286号",
        "name": "上海汇商大厦",
        "lnglat": "121.549015,31.224674",
        "count": 4
    },
    {
        "address": "民生路1399号",
        "name": "太平人寿大厦",
        "lnglat": "121.550634,31.224255",
        "count": 3
    },
    {
        "address": "民生路1403号",
        "name": "上海信息大厦",
        "lnglat": "121.551364,31.224185",
        "count": 58
    },
    {
        "address": "民生路1518号",
        "name": "金鹰大厦（上海)",
        "lnglat": "121.550428,31.220473",
        "count": 14
    },
    {
        "address": "民生路999弄",
        "name": "中星恬园",
        "lnglat": "121.548864,31.229554",
        "count": 43
    },
    {
        "address": "民星路270号",
        "name": "谊客科技园",
        "lnglat": "121.544254,31.312162",
        "count": 7
    },
    {
        "address": "民星路376弄",
        "name": "锦都玫瑰园",
        "lnglat": "121.540387,31.312032",
        "count": 24
    },
    {
        "address": "民益路1698号",
        "name": "联东U谷上海松江新桥国际企业港",
        "lnglat": "121.284261,31.041048",
        "count": 4
    },
    {
        "address": "民主街495弄",
        "name": "绿洲茗馨公寓",
        "lnglat": "121.303018,31.288344",
        "count": 32
    },
    {
        "address": "闵驰二路256弄",
        "name": "欣佳宝邸三期",
        "lnglat": "121.536236,31.043870",
        "count": 124
    },
    {
        "address": "闵驰二路58弄、59弄",
        "name": "欣佳宝邸",
        "lnglat": "121.539396,31.044765",
        "count": 111
    },
    {
        "address": "闵驰一路197弄",
        "name": "汇秀景苑三街坊",
        "lnglat": "121.543288,31.039590",
        "count": 57
    },
    {
        "address": "闵驰一路208弄",
        "name": "汇秀景苑二街坊",
        "lnglat": "121.542972,31.040750",
        "count": 61
    },
    {
        "address": "闵驰一路299弄-1-13号",
        "name": "瑞和华苑南区",
        "lnglat": "121.541089,31.039122",
        "count": 45
    },
    {
        "address": "闵驰一路29弄1-22号",
        "name": "聚缘南庭",
        "lnglat": "121.546334,31.039666",
        "count": 78
    },
    {
        "address": "闵驰一路302弄",
        "name": "瑞和华苑北区",
        "lnglat": "121.539607,31.040336",
        "count": 160
    },
    {
        "address": "闵驰一路50弄",
        "name": "聚缘中庭",
        "lnglat": "121.545515,31.041520",
        "count": 94
    },
    {
        "address": "闵虹路166弄",
        "name": "中庚环球创意中心",
        "lnglat": "121.396310,31.130499",
        "count": 184
    },
    {
        "address": "名都路20弄",
        "name": "名都新城三期",
        "lnglat": "100.977641,22.775934",
        "count": 56
    },
    {
        "address": "明华路1077弄",
        "name": "象屿上海年华",
        "lnglat": "121.339380,31.073479",
        "count": 68
    },
    {
        "address": "明华路1177弄",
        "name": "象屿欣苑",
        "lnglat": "121.340731,31.071605",
        "count": 61
    },
    {
        "address": "明南路85号",
        "name": "启迪漕河泾（中山）科技园水紫荆园",
        "lnglat": "121.274735,31.043686",
        "count": 70
    },
    {
        "address": "明兴路528弄",
        "name": "新南路1（壹）号",
        "lnglat": "121.340224,31.085834",
        "count": 96
    },
    {
        "address": "明月路188号",
        "name": "世茂湖滨花园",
        "lnglat": "105.885125,32.638997",
        "count": 42
    },
    {
        "address": "明中路1588弄1-1086号",
        "name": "沿海丽水馨庭（丽水馨庭）",
        "lnglat": "121.324907,31.074350",
        "count": 108
    },
    {
        "address": "明中路1777弄",
        "name": "新弘国际城",
        "lnglat": "121.325010,31.073689",
        "count": 238
    },
    {
        "address": "明中路1800弄",
        "name": "明中苑",
        "lnglat": "121.320541,31.075653",
        "count": 242
    },
    {
        "address": "明珠路1018号",
        "name": "e通世界商务园（双子楼）",
        "lnglat": "121.260508,31.194295",
        "count": 12
    },
    {
        "address": "明珠路838号",
        "name": "恒润大厦",
        "lnglat": "119.915698,31.016802",
        "count": 3
    },
    {
        "address": "漠河路600弄",
        "name": "东鼎国际大厦",
        "lnglat": "121.469332,31.406805",
        "count": 27
    },
    {
        "address": "墨玉路28号",
        "name": "嘉正国际大厦",
        "lnglat": "121.163831,31.290814",
        "count": 12
    },
    {
        "address": "墨玉路398号",
        "name": "承安翡翠公馆",
        "lnglat": "121.162690,31.300865",
        "count": 16
    },
    {
        "address": "墨玉南路1033号",
        "name": "嘉亭大厦",
        "lnglat": "121.162743,31.287528",
        "count": 10
    },
    {
        "address": "牡丹江路1211号",
        "name": "安信广场",
        "lnglat": "121.487724,31.393994",
        "count": 30
    },
    {
        "address": "牡丹江路1248号",
        "name": "安信财富中心",
        "lnglat": "121.487810,31.393655",
        "count": 14
    },
    {
        "address": "牡丹江路1288号",
        "name": "宝莲府邸",
        "lnglat": "121.486245,31.396281",
        "count": 16
    },
    {
        "address": "牡丹江路1378号",
        "name": "璟都新园（景都新苑）",
        "lnglat": "121.485598,31.396743",
        "count": 28
    },
    {
        "address": "牡丹江路1588-1号",
        "name": "宝地宝杨商务中心",
        "lnglat": "121.631354,31.807393",
        "count": 3
    },
    {
        "address": "牡丹路60号",
        "name": "东辰大厦",
        "lnglat": "117.863998,31.594132",
        "count": 10
    },
    {
        "address": "纳贤路799号",
        "name": "科荣大楼",
        "lnglat": "121.606533,31.178822",
        "count": 17
    },
    {
        "address": "纳贤路800号",
        "name": "众创园（科海大楼）",
        "lnglat": "121.605125,31.178561",
        "count": 16
    },
    {
        "address": "南曹路1117弄",
        "name": "唐镇中芯花园",
        "lnglat": "121.667615,31.205827",
        "count": 70
    },
    {
        "address": "南昌路45号",
        "name": "城汇大厦",
        "lnglat": "103.872178,36.049763",
        "count": 16
    },
    {
        "address": "南昌路555号",
        "name": "东方巴黎霞飞苑",
        "lnglat": "103.855076,36.054539",
        "count": 9
    },
    {
        "address": "南昌路559号",
        "name": "南昌路559号大楼",
        "lnglat": "121.458199,31.214366",
        "count": 9
    },
    {
        "address": "南车站路318弄",
        "name": "豫景公寓",
        "lnglat": "121.491901,31.207382",
        "count": 4
    },
    {
        "address": "南车站路69弄1-3号",
        "name": "华教大厦",
        "lnglat": "121.490669,31.210994",
        "count": 14
    },
    {
        "address": "南丹东路168号",
        "name": "徐家汇新贵_福源汇居",
        "lnglat": "121.440994,31.188906",
        "count": 45
    },
    {
        "address": "南丹东路181号",
        "name": "莱诗邸商务裙楼",
        "lnglat": "121.440492,31.189697",
        "count": 1
    },
    {
        "address": "南丹东路18号",
        "name": "兴都大楼",
        "lnglat": "121.445571,31.190731",
        "count": 3
    },
    {
        "address": "南丹东路223弄",
        "name": "莱诗邸",
        "lnglat": "121.439501,31.189509",
        "count": 44
    },
    {
        "address": "南丹东路228弄",
        "name": "金轩公寓",
        "lnglat": "121.439504,31.188753",
        "count": 27
    },
    {
        "address": "南丹东路238号",
        "name": "新东亚酒店",
        "lnglat": "121.439133,31.188906",
        "count": 2
    },
    {
        "address": "南丹东路255号-275号",
        "name": "南天1号楼",
        "lnglat": "121.438530,31.189445",
        "count": 3
    },
    {
        "address": "南丹东路300弄",
        "name": "亚都商务楼",
        "lnglat": "121.438420,31.188651",
        "count": 71
    },
    {
        "address": "南丹东路99弄",
        "name": "天际花园三期",
        "lnglat": "121.444652,31.191342",
        "count": 18
    },
    {
        "address": "南丹路118弄",
        "name": "光启公寓",
        "lnglat": "121.433770,31.189274",
        "count": 9
    },
    {
        "address": "南丹路138弄",
        "name": "明华苑",
        "lnglat": "121.432296,31.189061",
        "count": 18
    },
    {
        "address": "南丹路189号",
        "name": "南虹公寓",
        "lnglat": "121.432022,31.190189",
        "count": 18
    },
    {
        "address": "南丹路191号",
        "name": "诚品商务中心",
        "lnglat": "121.431674,31.189937",
        "count": 10
    },
    {
        "address": "南丹路368弄",
        "name": "汇贤雅居",
        "lnglat": "121.427067,31.191943",
        "count": 6
    },
    {
        "address": "南奉公路4025号",
        "name": "上海铭基科创园",
        "lnglat": "121.556182,30.926972",
        "count": 9
    },
    {
        "address": "南奉公路6899弄",
        "name": "金昊雅苑",
        "lnglat": "121.500178,30.919721",
        "count": 204
    },
    {
        "address": "南奉公路7298号",
        "name": "浦南财富广场",
        "lnglat": "121.491068,30.919005",
        "count": 19
    },
    {
        "address": "南汇路69号",
        "name": "上海宁波联谊大楼",
        "lnglat": "121.456711,31.229851",
        "count": 1
    },
    {
        "address": "南江燕路229弄1-106边门",
        "name": "世博家园八街坊",
        "lnglat": "121.501616,31.078164",
        "count": 60
    },
    {
        "address": "南京东路300号",
        "name": "名人商业大厦",
        "lnglat": "118.774530,34.130760",
        "count": 48
    },
    {
        "address": "南京东路328号雅戈尔大厦",
        "name": "雅戈尔大厦",
        "lnglat": "121.483640,31.237328",
        "count": 3
    },
    {
        "address": "南京东路409-459号",
        "name": "申能置地广场",
        "lnglat": "117.193475,29.306227",
        "count": 8
    },
    {
        "address": "南京东路61号",
        "name": "新黄浦金融大厦（上海）",
        "lnglat": "117.192604,29.306490",
        "count": 8
    },
    {
        "address": "南京东路99号（四川中路346号）",
        "name": "嘉陵大楼",
        "lnglat": "121.488041,31.238198",
        "count": 2
    },
    {
        "address": "南京西路1038号",
        "name": "梅龙镇广场",
        "lnglat": "121.456858,31.229065",
        "count": 25
    },
    {
        "address": "南京西路1168号",
        "name": "中信泰富广场",
        "lnglat": "121.455726,31.228271",
        "count": 6
    },
    {
        "address": "南京西路1376号",
        "name": "上海商城",
        "lnglat": "121.451874,31.226810",
        "count": 8
    },
    {
        "address": "南京西路1468号",
        "name": "中欣大厦",
        "lnglat": "121.449715,31.225596",
        "count": 6
    },
    {
        "address": "南京西路1486号（铜仁路）",
        "name": "东海广场",
        "lnglat": "121.448932,31.226095",
        "count": 19
    },
    {
        "address": "南京西路1717号",
        "name": "会德丰国际广场",
        "lnglat": "121.444811,31.221786",
        "count": 16
    },
    {
        "address": "南京西路1728号",
        "name": "百乐门大都会",
        "lnglat": "121.444562,31.222603",
        "count": 22
    },
    {
        "address": "南京西路1788号",
        "name": "1788国际大厦",
        "lnglat": "121.443708,31.222564",
        "count": 75
    },
    {
        "address": "南京西路288号",
        "name": "创兴金融中心",
        "lnglat": "115.911879,28.685112",
        "count": 24
    },
    {
        "address": "南京西路338号",
        "name": "天安中心大厦",
        "lnglat": "115.913927,28.685174",
        "count": 18
    },
    {
        "address": "南京西路388号",
        "name": "仙乐斯广场",
        "lnglat": "115.915517,28.685122",
        "count": 17
    },
    {
        "address": "南京西路399号",
        "name": "明天广场",
        "lnglat": "121.469790,31.230360",
        "count": 6
    },
    {
        "address": "南京西路555号",
        "name": "555大厦",
        "lnglat": "115.925492,28.684456",
        "count": 19
    },
    {
        "address": "南京西路580号",
        "name": "仲益大厦",
        "lnglat": "115.923953,28.685076",
        "count": 22
    },
    {
        "address": "南京西路688号",
        "name": "688广场",
        "lnglat": "121.464374,31.231598",
        "count": 64
    },
    {
        "address": "南京西路818号",
        "name": "长春藤运通大厦",
        "lnglat": "121.460864,31.231078",
        "count": 7
    },
    {
        "address": "南京西路819号",
        "name": "中创大厦",
        "lnglat": "121.460921,31.230432",
        "count": 4
    },
    {
        "address": "南京西路920号",
        "name": "南泰大厦（上海）",
        "lnglat": "121.459234,31.230530",
        "count": 4
    },
    {
        "address": "南京西路993号",
        "name": "上海锦江向阳大楼",
        "lnglat": "121.458560,31.228909",
        "count": 2
    },
    {
        "address": "南乐路1276弄115号",
        "name": "创亿园（创亿国际企业园）",
        "lnglat": "121.279426,31.020502",
        "count": 24
    },
    {
        "address": "南六公路399号",
        "name": "艺泰安邦花园",
        "lnglat": "121.706482,31.062752",
        "count": 671
    },
    {
        "address": "南六公路851号",
        "name": "翔灵电商园",
        "lnglat": "121.711441,31.077117",
        "count": 11
    },
    {
        "address": "南芦公路1755弄",
        "name": "鸿音广场",
        "lnglat": "121.819214,30.910390",
        "count": 6
    },
    {
        "address": "南码头路101号",
        "name": "海博大厦",
        "lnglat": "121.507239,31.200873",
        "count": 13
    },
    {
        "address": "南码头路1136号",
        "name": "卢湾教工楼",
        "lnglat": "121.512339,31.183609",
        "count": 12
    },
    {
        "address": "南码头路1288弄",
        "name": "逸翠公馆",
        "lnglat": "121.514093,31.181956",
        "count": 27
    },
    {
        "address": "南宁路501弄",
        "name": "馨汇南苑",
        "lnglat": "121.444045,31.164912",
        "count": 27
    },
    {
        "address": "南宁路970号",
        "name": "徐汇万科中心",
        "lnglat": "121.434171,31.157434",
        "count": 25
    },
    {
        "address": "南桥路707弄",
        "name": "永达城市公寓",
        "lnglat": "121.696546,31.188887",
        "count": 131
    },
    {
        "address": "南桥镇程普路377号",
        "name": "悠口创意园",
        "lnglat": "121.439203,30.941307",
        "count": 81
    },
    {
        "address": "南桥镇奉浦大道97号",
        "name": "绿地智尊",
        "lnglat": "121.461024,30.942700",
        "count": 30
    },
    {
        "address": "南泉北路1015弄、1017弄",
        "name": "光明小区",
        "lnglat": "121.518724,31.226614",
        "count": 10
    },
    {
        "address": "南泉北路168号",
        "name": "东昌奕空间",
        "lnglat": "121.515960,31.236800",
        "count": 2
    },
    {
        "address": "南泉北路201号",
        "name": "房地大厦",
        "lnglat": "121.515927,31.235577",
        "count": 6
    },
    {
        "address": "南山路35弄",
        "name": "金棕榈公寓",
        "lnglat": "100.744068,35.587288",
        "count": 5
    },
    {
        "address": "南山路88弄",
        "name": "南顺公寓（上海）",
        "lnglat": "101.782783,36.606970",
        "count": 10
    },
    {
        "address": "南石二路135弄",
        "name": "兰溪公寓",
        "lnglat": "121.402733,31.245228",
        "count": 7
    },
    {
        "address": "南苏州路1393弄1号",
        "name": "良友高层",
        "lnglat": "121.462464,31.240836",
        "count": 9
    },
    {
        "address": "南苏州路1455号",
        "name": "南苏55苏河文创中心",
        "lnglat": "121.461369,31.240004",
        "count": 5
    },
    {
        "address": "南苏州路325号",
        "name": "物资大厦(上海)",
        "lnglat": "121.484390,31.242518",
        "count": 1
    },
    {
        "address": "南苏州路333号",
        "name": "华隆大厦",
        "lnglat": "121.484011,31.241887",
        "count": 4
    },
    {
        "address": "南苏州路877弄",
        "name": "河畔明珠",
        "lnglat": "121.475492,31.240790",
        "count": 28
    },
    {
        "address": "南苏州路999号",
        "name": "象屿集团大厦",
        "lnglat": "121.471449,31.239117",
        "count": 5
    },
    {
        "address": "南塘浜路133号",
        "name": "华业公寓",
        "lnglat": "121.471864,31.203297",
        "count": 4
    },
    {
        "address": "南蕰藻路669号",
        "name": "庙行人才孵化园",
        "lnglat": "121.427382,31.335732",
        "count": 5
    },
    {
        "address": "南阳路183弄1-2号",
        "name": "南阳大楼",
        "lnglat": "121.450740,31.227440",
        "count": 14
    },
    {
        "address": "南洋泾路280号",
        "name": "中新公寓",
        "lnglat": "121.553022,31.238713",
        "count": 34
    },
    {
        "address": "南洋泾路578号",
        "name": "界龙总部园御龙湾",
        "lnglat": "121.556452,31.231897",
        "count": 3
    },
    {
        "address": "南蕴藻路408号",
        "name": "栋霖科技园",
        "lnglat": "121.415759,31.335113",
        "count": 16
    },
    {
        "address": "内江路168弄",
        "name": "安居花苑",
        "lnglat": "121.550080,31.278156",
        "count": 24
    },
    {
        "address": "内江路221号",
        "name": "科技大厦(杨浦)",
        "lnglat": "121.548138,31.278362",
        "count": 3
    },
    {
        "address": "年吉路650弄",
        "name": "美罗家园润苑",
        "lnglat": "121.334318,31.399414",
        "count": 44
    },
    {
        "address": "年家浜东路129弄",
        "name": "印象春城",
        "lnglat": "121.591775,31.114397",
        "count": 312
    },
    {
        "address": "年家浜东路159弄",
        "name": "印象生活广场",
        "lnglat": "121.593874,31.115433",
        "count": 24
    },
    {
        "address": "年家浜路28弄",
        "name": "逸亭佳苑商务楼",
        "lnglat": "121.586468,31.114207",
        "count": 61
    },
    {
        "address": "年喜路29弄",
        "name": "中集金地美兰城澜都(北区南区公寓）",
        "lnglat": "121.334291,31.397375",
        "count": 20
    },
    {
        "address": "宁富路288号",
        "name": "上海磐业网络科技园",
        "lnglat": "121.490644,30.898647",
        "count": 15
    },
    {
        "address": "宁国路111号",
        "name": "绿地汇方广场",
        "lnglat": "121.537595,31.262282",
        "count": 24
    },
    {
        "address": "宁国路129号",
        "name": "城建大厦(上海)",
        "lnglat": "121.537356,31.263092",
        "count": 3
    },
    {
        "address": "宁国路228号B座",
        "name": "郡江国际大厦",
        "lnglat": "121.537366,31.264865",
        "count": 24
    },
    {
        "address": "宁国路313弄",
        "name": "龙泽大厦(上海)",
        "lnglat": "121.535532,31.265046",
        "count": 39
    },
    {
        "address": "宁国路399号",
        "name": "碧桂园中心",
        "lnglat": "121.533564,31.266482",
        "count": 3
    },
    {
        "address": "宁国路503号（长阳路1568号）",
        "name": "四季广场（上海）",
        "lnglat": "121.532951,31.267477",
        "count": 15
    },
    {
        "address": "宁海东路200号",
        "name": "申鑫大厦",
        "lnglat": "121.481835,31.229198",
        "count": 2
    },
    {
        "address": "宁桥路615号",
        "name": "由度工场",
        "lnglat": "121.616102,31.252474",
        "count": 13
    },
    {
        "address": "宁桥路825号",
        "name": "金桥825",
        "lnglat": "121.620090,31.253819",
        "count": 4
    },
    {
        "address": "宁桥路999号",
        "name": "金桥开发区T15",
        "lnglat": "121.623602,31.253874",
        "count": 16
    },
    {
        "address": "宁武路510弄",
        "name": "珠江香樟园北园",
        "lnglat": "108.259949,23.151523",
        "count": 84
    },
    {
        "address": "宁夏路201号",
        "name": "绿地科创大厦",
        "lnglat": "120.394713,36.079260",
        "count": 16
    },
    {
        "address": "宁夏路353弄",
        "name": "绿地世纪城世纪花园",
        "lnglat": "120.421989,36.066635",
        "count": 136
    },
    {
        "address": "宁夏路366弄",
        "name": "绿地世家",
        "lnglat": "121.417498,31.232958",
        "count": 68
    },
    {
        "address": "宁夏路777号",
        "name": "坤田社区",
        "lnglat": "121.411287,31.230679",
        "count": 2
    },
    {
        "address": "农民街118弄",
        "name": "汇贤雅苑",
        "lnglat": "115.636793,24.418827",
        "count": 30
    },
    {
        "address": "怒江北路219弄1号",
        "name": "开开大楼",
        "lnglat": "121.394555,31.235099",
        "count": 3
    },
    {
        "address": "怒江北路302弄",
        "name": "中天新曹杨商务楼",
        "lnglat": "121.391777,31.236641",
        "count": 19
    },
    {
        "address": "怒江北路399号",
        "name": "新曹杨科技大厦",
        "lnglat": "121.390370,31.235734",
        "count": 4
    },
    {
        "address": "怒江北路427号",
        "name": "曹杨经贸大厦",
        "lnglat": "121.388904,31.235683",
        "count": 3
    },
    {
        "address": "怒江北路449弄8，9号（C区B区）",
        "name": "上海新曹杨高新技术工业园区二街坊(B区C区)",
        "lnglat": "121.387421,31.235297",
        "count": 39
    },
    {
        "address": "欧阳路196号",
        "name": "法兰桥",
        "lnglat": "121.488133,31.266819",
        "count": 22
    },
    {
        "address": "欧阳路218弄之1-3号",
        "name": "明杨豪苑",
        "lnglat": "121.488148,31.267616",
        "count": 9
    },
    {
        "address": "欧阳路28弄",
        "name": "新文苑",
        "lnglat": "121.488867,31.264646",
        "count": 45
    },
    {
        "address": "欧阳路318弄",
        "name": "绿缘大厦",
        "lnglat": "120.580307,31.609060",
        "count": 2
    },
    {
        "address": "欧阳路501弄50号",
        "name": "裕群公寓",
        "lnglat": "121.487973,31.273077",
        "count": 9
    },
    {
        "address": "欧阳路561号",
        "name": "欧阳大厦",
        "lnglat": "121.486848,31.273914",
        "count": 7
    },
    {
        "address": "欧阳路568号",
        "name": "庐迅大厦",
        "lnglat": "121.486190,31.273741",
        "count": 5
    },
    {
        "address": "欧阳路681弄1-7号",
        "name": "山水苑(上海)",
        "lnglat": "81.842994,43.225450",
        "count": 24
    },
    {
        "address": "欧阳路85号",
        "name": "金陵国际大厦",
        "lnglat": "121.489510,31.265869",
        "count": 15
    },
    {
        "address": "牌楼东路528弄",
        "name": "清林径",
        "lnglat": "121.655910,31.025437",
        "count": 136
    },
    {
        "address": "潘广路1018弄",
        "name": "龙湖北城天街",
        "lnglat": "121.373805,31.366483",
        "count": 68
    },
    {
        "address": "潘广路1765号",
        "name": "馨佳园七街坊",
        "lnglat": "121.359674,31.362645",
        "count": 112
    },
    {
        "address": "潘泾路366弄56号",
        "name": "大华享寓锦绣四季宝荻路社区",
        "lnglat": "121.402220,31.358665",
        "count": 30
    },
    {
        "address": "潘泾路4655弄",
        "name": "旭辉城",
        "lnglat": "121.349462,31.462297",
        "count": 314
    },
    {
        "address": "潘泾路4777弄",
        "name": "宝山上河苑",
        "lnglat": "121.349338,31.466366",
        "count": 290
    },
    {
        "address": "潘泾路5777弄",
        "name": "雍和府",
        "lnglat": "121.338273,31.481650",
        "count": 34
    },
    {
        "address": "潘新路255弄",
        "name": "信达北苑(信达蓝庭)",
        "lnglat": "121.331659,31.486187",
        "count": 166
    },
    {
        "address": "盘安路501号",
        "name": "菊园智慧中心",
        "lnglat": "121.231787,31.385362",
        "count": 15
    },
    {
        "address": "盘古路388弄",
        "name": "祥腾国际广场",
        "lnglat": "121.482976,31.407758",
        "count": 27
    },
    {
        "address": "盘古路708号",
        "name": "宝建大厦",
        "lnglat": "121.470225,31.403309",
        "count": 4
    },
    {
        "address": "盘阳路59弄",
        "name": "融信绿地商务广场一期",
        "lnglat": "121.280543,31.210896",
        "count": 6
    },
    {
        "address": "盘阳路66弄",
        "name": "融信绿地商务广场二期",
        "lnglat": "121.281311,31.211550",
        "count": 7
    },
    {
        "address": "彭江路602号",
        "name": "大宁德必易园",
        "lnglat": "121.447477,31.286814",
        "count": 24
    },
    {
        "address": "彭平东路88弄",
        "name": "丽都景苑",
        "lnglat": "121.813182,30.905740",
        "count": 60
    },
    {
        "address": "平度路258号",
        "name": "金桥大拇指广场",
        "lnglat": "121.591306,31.254846",
        "count": 7
    },
    {
        "address": "平度路388弄",
        "name": "金桥和苑",
        "lnglat": "121.592207,31.253352",
        "count": 65
    },
    {
        "address": "平度路485弄488弄",
        "name": "金桥一景",
        "lnglat": "121.595207,31.252786",
        "count": 16
    },
    {
        "address": "平江路25号",
        "name": "平江大楼",
        "lnglat": "104.270292,30.981982",
        "count": 6
    },
    {
        "address": "平凉路1000弄",
        "name": "天科国际大厦",
        "lnglat": "121.530893,31.259358",
        "count": 22
    },
    {
        "address": "平凉路1055号",
        "name": "上海创意联盟产业园",
        "lnglat": "121.532306,31.260974",
        "count": 5
    },
    {
        "address": "平凉路1090弄",
        "name": "天科国际商务楼",
        "lnglat": "121.529657,31.258171",
        "count": 16
    },
    {
        "address": "平凉路1104号",
        "name": "银鹿大厦",
        "lnglat": "121.533133,31.260851",
        "count": 2
    },
    {
        "address": "平凉路1289号",
        "name": "联升大厦",
        "lnglat": "121.535560,31.263224",
        "count": 7
    },
    {
        "address": "平凉路1398号",
        "name": "上海杨浦工贸大楼",
        "lnglat": "121.531107,31.254322",
        "count": 1
    },
    {
        "address": "平凉路1550弄",
        "name": "金凤大楼",
        "lnglat": "121.540498,31.265781",
        "count": 12
    },
    {
        "address": "平凉路1889弄",
        "name": "珠江香樟南园",
        "lnglat": "121.545612,31.269991",
        "count": 204
    },
    {
        "address": "平凉路207号",
        "name": "平凉园区",
        "lnglat": "121.518124,31.253548",
        "count": 5
    },
    {
        "address": "平凉路2241号",
        "name": "智慧坊",
        "lnglat": "121.549682,31.272687",
        "count": 28
    },
    {
        "address": "平凉路2440号",
        "name": "芯工创意园",
        "lnglat": "121.551751,31.275192",
        "count": 13
    },
    {
        "address": "平凉路2545弄",
        "name": "益民小区",
        "lnglat": "121.552205,31.277887",
        "count": 18
    },
    {
        "address": "平凉路618号",
        "name": "界龙商务大厦",
        "lnglat": "121.524384,31.257080",
        "count": 9
    },
    {
        "address": "平凉路624号",
        "name": "德昌园创意园",
        "lnglat": "121.525322,31.257841",
        "count": 4
    },
    {
        "address": "平陆路490弄",
        "name": "彭浦商务园区",
        "lnglat": "121.446063,31.288084",
        "count": 8
    },
    {
        "address": "平武路168号",
        "name": "玉嘉大厦",
        "lnglat": "121.432503,31.208777",
        "count": 1
    },
    {
        "address": "平武路31弄1-3号",
        "name": "平武公寓",
        "lnglat": "121.430011,31.208368",
        "count": 12
    },
    {
        "address": "平型关路1083弄",
        "name": "慧芝湖花园一期",
        "lnglat": "121.458773,31.281544",
        "count": 159
    },
    {
        "address": "平型关路1088弄",
        "name": "慧芝湖花园三期(嘉悦天地)",
        "lnglat": "121.457506,31.280636",
        "count": 85
    },
    {
        "address": "平型关路108弄",
        "name": "108广场（金银108创意广场）",
        "lnglat": "121.465869,31.267022",
        "count": 104
    },
    {
        "address": "平型关路108弄37号、39号",
        "name": "108广场(品座尚座)",
        "lnglat": "121.465636,31.267274",
        "count": 5
    },
    {
        "address": "平型关路1700号",
        "name": "宏慧视界BOX",
        "lnglat": "121.459604,31.293439",
        "count": 40
    },
    {
        "address": "平型关路18号",
        "name": "和源大楼商务楼",
        "lnglat": "121.467661,31.264942",
        "count": 7
    },
    {
        "address": "平型关路377弄",
        "name": "上海嘉利明珠城",
        "lnglat": "121.463754,31.273626",
        "count": 18
    },
    {
        "address": "平型关路38号",
        "name": "和源大楼",
        "lnglat": "121.467744,31.264878",
        "count": 7
    },
    {
        "address": "平型关路680弄",
        "name": "崇文园",
        "lnglat": "121.460184,31.275206",
        "count": 64
    },
    {
        "address": "平型关路68弄",
        "name": "申地苑",
        "lnglat": "121.466285,31.265944",
        "count": 44
    },
    {
        "address": "平阳路1465弄",
        "name": "平阳苑",
        "lnglat": "121.384349,31.134267",
        "count": 25
    },
    {
        "address": "平阳路1481号",
        "name": "古美现代服务企业中心",
        "lnglat": "121.383499,31.134194",
        "count": 21
    },
    {
        "address": "平阳路1515弄",
        "name": "龙祥嘉园（闵行）",
        "lnglat": "121.383079,31.133476",
        "count": 15
    },
    {
        "address": "平阳路151弄",
        "name": "金领华庭",
        "lnglat": "107.364936,22.404733",
        "count": 35
    },
    {
        "address": "平阳路50弄",
        "name": "古美七村",
        "lnglat": "111.662323,25.957153",
        "count": 32
    },
    {
        "address": "瓶安路1258号",
        "name": "中臻科创园",
        "lnglat": "121.402760,31.048312",
        "count": 20
    },
    {
        "address": "瓶安路1358号",
        "name": "久创科技园",
        "lnglat": "121.401015,31.052569",
        "count": 19
    },
    {
        "address": "瓶安路1600号",
        "name": "鑫都城宝铭苑",
        "lnglat": "121.400240,31.055140",
        "count": 31
    },
    {
        "address": "瓶北路155号",
        "name": "英格尔认证检测大楼",
        "lnglat": "121.403093,31.053339",
        "count": 6
    },
    {
        "address": "蒲汇路168-178号",
        "name": "旭辉丰禄纯真中心（九亭U天地）",
        "lnglat": "121.324976,31.139569",
        "count": 18
    },
    {
        "address": "蒲汇路200弄",
        "name": "上海中泰广场",
        "lnglat": "121.323422,31.139523",
        "count": 10
    },
    {
        "address": "蒲汇塘路101号",
        "name": "沪贵苑",
        "lnglat": "121.433397,31.187179",
        "count": 8
    },
    {
        "address": "蒲汇塘路11号",
        "name": "博大商务楼",
        "lnglat": "121.435736,31.186479",
        "count": 8
    },
    {
        "address": "蒲汇塘路163弄",
        "name": "泰德苑（上海）",
        "lnglat": "121.431524,31.187976",
        "count": 24
    },
    {
        "address": "蒲汇塘路200号(近宜山路)",
        "name": "锦和越界蒲汇Space",
        "lnglat": "121.429727,31.188146",
        "count": 4
    },
    {
        "address": "蒲汇塘路50号",
        "name": "玉兰花苑",
        "lnglat": "121.435064,31.186110",
        "count": 25
    },
    {
        "address": "蒲松北路10号",
        "name": "申亚时代广场",
        "lnglat": "121.375254,31.217064",
        "count": 14
    },
    {
        "address": "浦北路388号",
        "name": "康健星辰",
        "lnglat": "120.841408,31.023265",
        "count": 32
    },
    {
        "address": "浦北路6号",
        "name": "德必世纪WE",
        "lnglat": "120.841169,31.017026",
        "count": 40
    },
    {
        "address": "浦北路999弄1-3号",
        "name": "百合花苑",
        "lnglat": "121.412896,31.150924",
        "count": 3
    },
    {
        "address": "浦城路366弄",
        "name": "菊园",
        "lnglat": "121.512876,31.228046",
        "count": 18
    },
    {
        "address": "浦城路680号",
        "name": "上海滨江世茂52",
        "lnglat": "121.514977,31.223544",
        "count": 10
    },
    {
        "address": "浦驰路188弄1-109号",
        "name": "世博家园十一街坊",
        "lnglat": "121.504192,31.074866",
        "count": 60
    },
    {
        "address": "浦驰路235弄1-4号",
        "name": "世博家园十二街坊",
        "lnglat": "121.502310,31.075213",
        "count": 36
    },
    {
        "address": "浦驰路345弄1-39号",
        "name": "世博家园九街坊",
        "lnglat": "121.500941,31.076736",
        "count": 24
    },
    {
        "address": "浦电路29弄之1-35号",
        "name": "滨江大楼",
        "lnglat": "121.514492,31.216538",
        "count": 16
    },
    {
        "address": "浦电路360号",
        "name": "陆家嘴投资大厦",
        "lnglat": "121.530353,31.221812",
        "count": 1
    },
    {
        "address": "浦电路400弄",
        "name": "兴业嘉园",
        "lnglat": "121.526253,31.221089",
        "count": 31
    },
    {
        "address": "浦电路438号",
        "name": "双鸽大厦",
        "lnglat": "121.533230,31.222847",
        "count": 34
    },
    {
        "address": "浦电路489号",
        "name": "由由燕乔大厦",
        "lnglat": "121.535229,31.222676",
        "count": 12
    },
    {
        "address": "浦东大道1000弄",
        "name": "巨洋豪园",
        "lnglat": "121.533615,31.241503",
        "count": 18
    },
    {
        "address": "浦东大道1081-1089号",
        "name": "中信五牛城",
        "lnglat": "121.533074,31.241589",
        "count": 4
    },
    {
        "address": "浦东大道1093弄",
        "name": "名门滨江苑",
        "lnglat": "121.530135,31.243000",
        "count": 36
    },
    {
        "address": "浦东大道1097弄",
        "name": "珠江玫瑰花园",
        "lnglat": "121.531924,31.243578",
        "count": 45
    },
    {
        "address": "浦东大道1139号",
        "name": "惠扬大厦",
        "lnglat": "121.533159,31.242217",
        "count": 47
    },
    {
        "address": "浦东大道1200弄",
        "name": "巨洋大厦",
        "lnglat": "120.887187,29.627533",
        "count": 5
    },
    {
        "address": "浦东大道138号",
        "name": "上海永华大厦",
        "lnglat": "120.879545,29.628383",
        "count": 10
    },
    {
        "address": "浦东大道1476号",
        "name": "山海大厦",
        "lnglat": "121.536341,31.242488",
        "count": 14
    },
    {
        "address": "浦东大道1525-1539号",
        "name": "中国石化大厦(上海)",
        "lnglat": "121.536333,31.243434",
        "count": 51
    },
    {
        "address": "浦东大道1819弄",
        "name": "和达家园",
        "lnglat": "121.545572,31.247319",
        "count": 25
    },
    {
        "address": "浦东大道1868号",
        "name": "东方城市大厦",
        "lnglat": "121.547261,31.246551",
        "count": 20
    },
    {
        "address": "浦东大道1号",
        "name": "船舶大厦",
        "lnglat": "120.862809,29.626408",
        "count": 15
    },
    {
        "address": "浦东大道2000号",
        "name": "阳光世界大厦",
        "lnglat": "121.549007,31.247651",
        "count": 24
    },
    {
        "address": "浦东大道2123号",
        "name": "龙珠广场",
        "lnglat": "121.550114,31.250093",
        "count": 4
    },
    {
        "address": "浦东大道2188号",
        "name": "上安商务楼",
        "lnglat": "121.550928,31.249472",
        "count": 5
    },
    {
        "address": "浦东大道2220号、2160号",
        "name": "上安大厦",
        "lnglat": "121.551156,31.249628",
        "count": 18
    },
    {
        "address": "浦东大道2511弄19号",
        "name": "柚米国际公寓(浦东大道店)",
        "lnglat": "121.559399,31.259106",
        "count": 9
    },
    {
        "address": "浦东大道2515号、2521号",
        "name": "金茂花园",
        "lnglat": "121.560826,31.258768",
        "count": 15
    },
    {
        "address": "浦东大道2554号",
        "name": "仙都绿苑",
        "lnglat": "121.562892,31.259040",
        "count": 18
    },
    {
        "address": "浦东大道2568弄",
        "name": "军官公寓",
        "lnglat": "121.564105,31.260063",
        "count": 20
    },
    {
        "address": "浦东大道2742弄",
        "name": "中环滨江大厦",
        "lnglat": "121.571815,31.266393",
        "count": 19
    },
    {
        "address": "浦东大道2752号",
        "name": "浦建大厦",
        "lnglat": "121.574424,31.268863",
        "count": 2
    },
    {
        "address": "浦东大道288号",
        "name": "SDL智汇东信",
        "lnglat": "120.864684,29.626273",
        "count": 8
    },
    {
        "address": "浦东大道688号",
        "name": "浦东大道688号基地",
        "lnglat": "121.523960,31.240314",
        "count": 7
    },
    {
        "address": "浦东大道720号2B",
        "name": "上海国际航运大厦",
        "lnglat": "121.524798,31.239899",
        "count": 10
    },
    {
        "address": "浦东大道727弄1号",
        "name": "VIP大厦",
        "lnglat": "121.525483,31.240871",
        "count": 27
    },
    {
        "address": "浦东大道988号",
        "name": "东晶国际公寓",
        "lnglat": "121.531979,31.241289",
        "count": 40
    },
    {
        "address": "浦东南路1036号",
        "name": "隆宇大厦",
        "lnglat": "121.515030,31.229004",
        "count": 25
    },
    {
        "address": "浦东南路1085号",
        "name": "上海华申大厦",
        "lnglat": "121.516752,31.229424",
        "count": 13
    },
    {
        "address": "浦东南路1088号",
        "name": "中融大厦",
        "lnglat": "121.515173,31.228279",
        "count": 12
    },
    {
        "address": "浦东南路1101号",
        "name": "上海远东大厦",
        "lnglat": "121.517370,31.229140",
        "count": 16
    },
    {
        "address": "浦东南路1118号",
        "name": "鄂尔多斯大厦",
        "lnglat": "121.515397,31.227597",
        "count": 15
    },
    {
        "address": "浦东南路1341弄2号",
        "name": "紫金瀚宫",
        "lnglat": "121.518517,31.225235",
        "count": 12
    },
    {
        "address": "浦东南路1525号",
        "name": "振环大厦",
        "lnglat": "121.518789,31.220901",
        "count": 4
    },
    {
        "address": "浦东南路1550弄",
        "name": "天科苑",
        "lnglat": "121.517878,31.220678",
        "count": 28
    },
    {
        "address": "浦东南路1630号",
        "name": "闻通商务楼",
        "lnglat": "121.518284,31.219531",
        "count": 9
    },
    {
        "address": "浦东南路1862弄",
        "name": "众鑫大厦",
        "lnglat": "121.517604,31.215860",
        "count": 2
    },
    {
        "address": "浦东南路1877号",
        "name": "东旅大厦",
        "lnglat": "121.519166,31.215451",
        "count": 7
    },
    {
        "address": "浦东南路2157、2159号",
        "name": "众城商厦",
        "lnglat": "121.516905,31.207570",
        "count": 6
    },
    {
        "address": "浦东南路2162号",
        "name": "浦江2162",
        "lnglat": "121.515069,31.208053",
        "count": 2
    },
    {
        "address": "浦东南路2169号",
        "name": "久事大桥公寓",
        "lnglat": "121.516577,31.207175",
        "count": 8
    },
    {
        "address": "浦东南路2179弄",
        "name": "宏润公寓",
        "lnglat": "121.516132,31.206519",
        "count": 35
    },
    {
        "address": "浦东南路2240号",
        "name": "永业商业大楼",
        "lnglat": "121.513991,31.205644",
        "count": 14
    },
    {
        "address": "浦东南路2250号",
        "name": "滨江2250",
        "lnglat": "121.513755,31.204908",
        "count": 18
    },
    {
        "address": "浦东南路256号",
        "name": "华夏银行大厦",
        "lnglat": "121.508804,31.239700",
        "count": 5
    },
    {
        "address": "浦东南路3456号",
        "name": "江天大厦（上海）",
        "lnglat": "121.507916,31.195347",
        "count": 3
    },
    {
        "address": "浦东南路360号",
        "name": "新上海国际大厦",
        "lnglat": "121.509393,31.238840",
        "count": 20
    },
    {
        "address": "浦东南路379号",
        "name": "金穗大厦（上海）",
        "lnglat": "121.510407,31.239280",
        "count": 7
    },
    {
        "address": "浦东南路4250弄",
        "name": "雪野家园",
        "lnglat": "121.500686,31.183055",
        "count": 52
    },
    {
        "address": "浦东南路4301、4401、4501号",
        "name": "云台苑",
        "lnglat": "121.500780,31.181847",
        "count": 3
    },
    {
        "address": "浦东南路500号",
        "name": "国家开发银行大厦",
        "lnglat": "121.510467,31.237063",
        "count": 11
    },
    {
        "address": "浦东南路528号",
        "name": "证券大厦",
        "lnglat": "121.511215,31.236295",
        "count": 6
    },
    {
        "address": "浦东南路855号",
        "name": "世界广场",
        "lnglat": "121.515018,31.232394",
        "count": 33
    },
    {
        "address": "浦东南路999号",
        "name": "新梅联合广场",
        "lnglat": "121.516128,31.229462",
        "count": 7
    },
    {
        "address": "浦东新区临港新城申港大道87号",
        "name": "毓阳泓智大厦",
        "lnglat": "121.924833,30.896969",
        "count": 3
    },
    {
        "address": "浦东新区栖山路401弄7号",
        "name": "雅华公寓",
        "lnglat": "121.549578,31.247656",
        "count": 8
    },
    {
        "address": "浦东新区庭安路825弄",
        "name": "高行绿洲五期",
        "lnglat": "121.595144,31.326049",
        "count": 85
    },
    {
        "address": "浦航路178弄",
        "name": "汇秀景苑一街坊",
        "lnglat": "121.542186,31.044173",
        "count": 66
    },
    {
        "address": "浦航路36弄",
        "name": "聚缘北庭",
        "lnglat": "121.545959,31.044094",
        "count": 149
    },
    {
        "address": "浦航路718弄",
        "name": "浦润苑",
        "lnglat": "121.534012,31.041697",
        "count": 25
    },
    {
        "address": "浦建路1086弄",
        "name": "锦绣华庭",
        "lnglat": "121.538044,31.206399",
        "count": 105
    },
    {
        "address": "浦建路118号",
        "name": "巴黎春天(浦建店)",
        "lnglat": "121.519659,31.208451",
        "count": 6
    },
    {
        "address": "浦建路1458弄",
        "name": "志豪公寓",
        "lnglat": "121.544131,31.202365",
        "count": 16
    },
    {
        "address": "浦建路145号",
        "name": "强生大厦",
        "lnglat": "121.522553,31.208794",
        "count": 3
    },
    {
        "address": "浦建路1578弄",
        "name": "龙昌苑",
        "lnglat": "121.545910,31.200662",
        "count": 35
    },
    {
        "address": "浦建路365弄",
        "name": "金龙东苑",
        "lnglat": "121.527501,31.208815",
        "count": 45
    },
    {
        "address": "浦建路47号",
        "name": "东源大厦",
        "lnglat": "121.519139,31.210619",
        "count": 9
    },
    {
        "address": "浦建路60弄",
        "name": "澳丽花苑",
        "lnglat": "121.518298,31.207376",
        "count": 136
    },
    {
        "address": "浦建路727号",
        "name": "东方金座",
        "lnglat": "121.530530,31.208251",
        "count": 12
    },
    {
        "address": "浦建路76号",
        "name": "由由国际广场",
        "lnglat": "121.519422,31.208560",
        "count": 20
    },
    {
        "address": "浦锦街道联航路2165弄世博家园(近联航路)",
        "name": "世博家园十五街坊",
        "lnglat": "121.501782,31.071041",
        "count": 48
    },
    {
        "address": "浦锦街道浦泉路251弄",
        "name": "浦江颐城尚院",
        "lnglat": "121.501202,31.098199",
        "count": 76
    },
    {
        "address": "浦锦路1266-1328号",
        "name": "新浦江城四期LOFT",
        "lnglat": "121.493302,31.092743",
        "count": 30
    },
    {
        "address": "浦锦路1275号",
        "name": "浦锦新天地",
        "lnglat": "121.492594,31.092598",
        "count": 15
    },
    {
        "address": "浦锦路2049号",
        "name": "中粮万科VMO",
        "lnglat": "121.485276,31.110409",
        "count": 48
    },
    {
        "address": "浦锦路2159弄",
        "name": "浦恒馨苑",
        "lnglat": "121.483819,31.113395",
        "count": 352
    },
    {
        "address": "浦连路388弄",
        "name": "金硕河畔景园东区",
        "lnglat": "121.535922,31.055002",
        "count": 7
    },
    {
        "address": "浦连路439弄",
        "name": "浦江丽都一期",
        "lnglat": "121.537378,31.054323",
        "count": 35
    },
    {
        "address": "浦连路598弄",
        "name": "金硕河畔景园南区",
        "lnglat": "121.534169,31.052597",
        "count": 30
    },
    {
        "address": "浦明路1188弄",
        "name": "家化滨江苑",
        "lnglat": "121.514532,31.214468",
        "count": 3
    },
    {
        "address": "浦明路1221号",
        "name": "香园商务楼",
        "lnglat": "121.515221,31.213167",
        "count": 8
    },
    {
        "address": "浦明路1333号",
        "name": "浦江海景",
        "lnglat": "121.514127,31.210517",
        "count": 10
    },
    {
        "address": "浦明路233弄",
        "name": "江临天下",
        "lnglat": "121.510709,31.226751",
        "count": 92
    },
    {
        "address": "浦明路258弄",
        "name": "财富海景花园",
        "lnglat": "121.508907,31.225884",
        "count": 23
    },
    {
        "address": "浦明路868弄",
        "name": "保利one56",
        "lnglat": "121.512436,31.219347",
        "count": 30
    },
    {
        "address": "浦明路99弄",
        "name": "仁恒滨江园",
        "lnglat": "121.508604,31.230173",
        "count": 42
    },
    {
        "address": "浦瑞路53弄、浦瑞路56弄",
        "name": "景舒苑十村",
        "lnglat": "121.493735,31.069614",
        "count": 36
    },
    {
        "address": "浦瑞南路76弄",
        "name": "滨浦新苑8村",
        "lnglat": "121.495178,31.063329",
        "count": 45
    },
    {
        "address": "浦三路12弄",
        "name": "海浦小区",
        "lnglat": "121.510577,31.196693",
        "count": 17
    },
    {
        "address": "浦三路3058号",
        "name": "长青企业广场",
        "lnglat": "121.537354,31.151865",
        "count": 4
    },
    {
        "address": "浦三路895号",
        "name": "冠寓_杨高南路店",
        "lnglat": "121.520147,31.180915",
        "count": 5
    },
    {
        "address": "浦申路633弄1-57号",
        "name": "世博家园二街坊",
        "lnglat": "121.501591,31.082582",
        "count": 60
    },
    {
        "address": "浦涛路100弄",
        "name": "中虹浦江苑北区",
        "lnglat": "121.543674,31.051740",
        "count": 73
    },
    {
        "address": "浦涛路400弄",
        "name": "瑞和新苑北区",
        "lnglat": "121.537850,31.049779",
        "count": 40
    },
    {
        "address": "浦涛路505弄",
        "name": "虹浦新城南区",
        "lnglat": "121.536182,31.045956",
        "count": 199
    },
    {
        "address": "浦涛路510弄",
        "name": "虹浦新城北区",
        "lnglat": "121.535985,31.047572",
        "count": 78
    },
    {
        "address": "浦涛路751弄",
        "name": "水语人家南苑",
        "lnglat": "121.532361,31.046159",
        "count": 112
    },
    {
        "address": "浦涛路75弄",
        "name": "中虹浦江苑南区",
        "lnglat": "121.544557,31.048615",
        "count": 88
    },
    {
        "address": "浦星公路1919弄",
        "name": "绿地峰尚汇",
        "lnglat": "121.510561,31.080125",
        "count": 6
    },
    {
        "address": "浦星公路1969号",
        "name": "红星国际广场(上海)",
        "lnglat": "121.511119,31.076663",
        "count": 52
    },
    {
        "address": "浦秀路1139弄",
        "name": "浦秀馨苑",
        "lnglat": "121.489837,31.086424",
        "count": 60
    },
    {
        "address": "浦雪路179弄",
        "name": "景舒苑九村",
        "lnglat": "121.494271,31.071823",
        "count": 54
    },
    {
        "address": "浦雪路351弄",
        "name": "景舒苑七村",
        "lnglat": "121.493926,31.079084",
        "count": 48
    },
    {
        "address": "浦雪南路206弄",
        "name": "滨浦新苑六村",
        "lnglat": "121.498023,31.064156",
        "count": 222
    },
    {
        "address": "浦雪南路366弄1-55号",
        "name": "滨浦新苑5村",
        "lnglat": "121.496179,31.066540",
        "count": 42
    },
    {
        "address": "浦雪南路369弄",
        "name": "滨浦新苑7村",
        "lnglat": "121.494833,31.066535",
        "count": 22
    },
    {
        "address": "普安路177号",
        "name": "十方大厦名都商务楼",
        "lnglat": "121.478272,31.223258",
        "count": 1
    },
    {
        "address": "普安路189号",
        "name": "曙光大厦(上海)",
        "lnglat": "121.478894,31.222550",
        "count": 14
    },
    {
        "address": "普善路239弄，521弄",
        "name": "北美公寓",
        "lnglat": "121.456191,31.258024",
        "count": 18
    },
    {
        "address": "普善路390弄",
        "name": "普善新苑",
        "lnglat": "121.453761,31.260169",
        "count": 38
    },
    {
        "address": "普陀区武威东路888弄",
        "name": "恒盛鼎城圣都汇",
        "lnglat": "121.388348,31.277566",
        "count": 147
    },
    {
        "address": "普陀区中山北路1759号",
        "name": "浦发广场",
        "lnglat": "121.433907,31.252038",
        "count": 12
    },
    {
        "address": "普育东路200弄",
        "name": "东元坊",
        "lnglat": "121.495667,31.207939",
        "count": 11
    },
    {
        "address": "七浦路535号",
        "name": "七浦商厦",
        "lnglat": "121.474930,31.244273",
        "count": 3
    },
    {
        "address": "七莘路1507号",
        "name": "莘庄维璟印象城",
        "lnglat": "121.365232,31.132284",
        "count": 8
    },
    {
        "address": "七莘路1599弄3号楼",
        "name": "平金中心",
        "lnglat": "121.364489,31.133680",
        "count": 2
    },
    {
        "address": "七莘路1728弄",
        "name": "蓼花汀",
        "lnglat": "121.363972,31.136241",
        "count": 64
    },
    {
        "address": "七莘路182号",
        "name": "182花园办公园",
        "lnglat": "121.378140,31.112338",
        "count": 10
    },
    {
        "address": "七莘路1839号",
        "name": "财富108广场",
        "lnglat": "121.362237,31.134848",
        "count": 101
    },
    {
        "address": "七莘路1855号",
        "name": "丽婴房大楼",
        "lnglat": "121.361621,31.136178",
        "count": 16
    },
    {
        "address": "七莘路1890弄",
        "name": "东碧林湾",
        "lnglat": "121.362216,31.139769",
        "count": 30
    },
    {
        "address": "七莘路3333号",
        "name": "万科城市花园老区",
        "lnglat": "121.343541,31.158620",
        "count": 76
    },
    {
        "address": "七莘路3599弄",
        "name": "华商时代",
        "lnglat": "121.341297,31.162764",
        "count": 64
    },
    {
        "address": "七莘路50号",
        "name": "乾锦创业园",
        "lnglat": "121.379039,31.110745",
        "count": 5
    },
    {
        "address": "七莘路646号",
        "name": "兴城商务广场",
        "lnglat": "121.373319,31.119475",
        "count": 15
    },
    {
        "address": "栖林路265弄",
        "name": "金地格林风范城高尔夫公馆",
        "lnglat": "121.319498,31.307427",
        "count": 36
    },
    {
        "address": "栖林路392弄",
        "name": "金地格林风范城城市公馆",
        "lnglat": "121.318118,31.309073",
        "count": 6
    },
    {
        "address": "栖山路1578弄",
        "name": "云山苑",
        "lnglat": "121.565674,31.257442",
        "count": 12
    },
    {
        "address": "栖山路1876弄",
        "name": "弘扬雅苑",
        "lnglat": "121.573268,31.260362",
        "count": 79
    },
    {
        "address": "栖山路401弄1号",
        "name": "凌高小区",
        "lnglat": "121.549599,31.246675",
        "count": 66
    },
    {
        "address": "栖山路465弄16号",
        "name": "鼎隆大厦",
        "lnglat": "121.551151,31.247615",
        "count": 7
    },
    {
        "address": "齐河路257弄",
        "name": "上南花苑",
        "lnglat": "121.503606,31.181092",
        "count": 49
    },
    {
        "address": "齐河路257弄21号",
        "name": "上南花苑",
        "lnglat": "121.502988,31.180265",
        "count": 22
    },
    {
        "address": "齐河路909弄",
        "name": "华业翠都",
        "lnglat": "121.515784,31.184841",
        "count": 18
    },
    {
        "address": "齐恒路177弄",
        "name": "凯德嘉博名邸",
        "lnglat": "121.522112,31.186137",
        "count": 72
    },
    {
        "address": "齐齐哈尔路240弄",
        "name": "丹江新苑",
        "lnglat": "121.531670,31.257190",
        "count": 10
    },
    {
        "address": "齐齐哈尔路928号",
        "name": "印坊928",
        "lnglat": "121.524906,31.266692",
        "count": 15
    },
    {
        "address": "祁安路365弄5-125号",
        "name": "安居金祁新城一期",
        "lnglat": "121.384412,31.293226",
        "count": 10
    },
    {
        "address": "祁安路88弄1-22号",
        "name": "安居古浪苑",
        "lnglat": "121.385899,31.286440",
        "count": 15
    },
    {
        "address": "祁连山路2233弄",
        "name": "中裕豪庭",
        "lnglat": "121.381268,31.306791",
        "count": 12
    },
    {
        "address": "祁连山南路1988号",
        "name": "嘉龙大厦_上海",
        "lnglat": "121.372470,31.249351",
        "count": 38
    },
    {
        "address": "祁连山南路2199号",
        "name": "真新商务楼",
        "lnglat": "121.372189,31.252689",
        "count": 3
    },
    {
        "address": "祁连山南路2891弄",
        "name": "未来岛科技园区",
        "lnglat": "121.374062,31.267253",
        "count": 10
    },
    {
        "address": "祁连山南路2891弄100号",
        "name": "智创壹佰",
        "lnglat": "121.374072,31.267356",
        "count": 33
    },
    {
        "address": "祁连山南路588弄1号",
        "name": "康帅大厦",
        "lnglat": "121.367402,31.235564",
        "count": 5
    },
    {
        "address": "祁连山南路999弄",
        "name": "金沙嘉年华",
        "lnglat": "121.366743,31.243255",
        "count": 160
    },
    {
        "address": "祁顺路1388弄",
        "name": "复地香栀花园",
        "lnglat": "121.391833,31.293490",
        "count": 38
    },
    {
        "address": "棋盘路1150弄",
        "name": "嘉康坊",
        "lnglat": "121.252031,31.397529",
        "count": 12
    },
    {
        "address": "启帆路515号,519号",
        "name": "森兰美奂大厦",
        "lnglat": "121.591215,31.313792",
        "count": 11
    },
    {
        "address": "启源路1000弄",
        "name": "汇丰颐苑",
        "lnglat": "121.283415,31.418121",
        "count": 32
    },
    {
        "address": "启源路900弄",
        "name": "绿洲香润苑",
        "lnglat": "121.284299,31.415571",
        "count": 246
    },
    {
        "address": "启悦路700弄",
        "name": "碧桂园嘉誉",
        "lnglat": "121.276468,31.419072",
        "count": 88
    },
    {
        "address": "千帆路288弄",
        "name": "G60科创云廊",
        "lnglat": "121.326163,31.090403",
        "count": 30
    },
    {
        "address": "钦江路28弄",
        "name": "东方康洛",
        "lnglat": "121.412288,31.177621",
        "count": 19
    },
    {
        "address": "钦江路333号41幢",
        "name": "上海大唐移动商务楼",
        "lnglat": "121.399898,31.173397",
        "count": 1
    },
    {
        "address": "钦州北路1122号",
        "name": "漕河泾_新汇园",
        "lnglat": "121.403332,31.178937",
        "count": 40
    },
    {
        "address": "钦州北路1198号",
        "name": "智汇园(桂平科技园)",
        "lnglat": "121.400417,31.177789",
        "count": 37
    },
    {
        "address": "钦州北路188号",
        "name": "华京商务大厦",
        "lnglat": "121.420993,31.180862",
        "count": 2
    },
    {
        "address": "钦州北路399弄",
        "name": "金祥苑",
        "lnglat": "121.419093,31.179985",
        "count": 40
    },
    {
        "address": "钦州北路475号",
        "name": "广厦公寓",
        "lnglat": "121.416854,31.180483",
        "count": 6
    },
    {
        "address": "钦州北路567号",
        "name": "长春新苑",
        "lnglat": "121.415111,31.180898",
        "count": 10
    },
    {
        "address": "钦州北路927弄",
        "name": "航天公寓1期",
        "lnglat": "121.410624,31.180285",
        "count": 36
    },
    {
        "address": "钦州北路953号",
        "name": "上海航天公寓长春商务楼",
        "lnglat": "121.410740,31.180093",
        "count": 8
    },
    {
        "address": "钦州路108号",
        "name": "梓树园",
        "lnglat": "121.430387,31.162632",
        "count": 24
    },
    {
        "address": "钦州路109号",
        "name": "逸安商务楼",
        "lnglat": "121.431175,31.162001",
        "count": 1
    },
    {
        "address": "钦州路111弄6号",
        "name": "钦州大厦",
        "lnglat": "121.431414,31.161489",
        "count": 3
    },
    {
        "address": "钦州路428弄之1-9号",
        "name": "中虹汇之苑",
        "lnglat": "121.430731,31.166456",
        "count": 9
    },
    {
        "address": "钦州路760、780、820号",
        "name": "钦州公寓",
        "lnglat": "121.427663,31.175738",
        "count": 42
    },
    {
        "address": "钦州路840号-900号",
        "name": "钦州花苑",
        "lnglat": "106.918818,27.717442",
        "count": 63
    },
    {
        "address": "钦州路920号",
        "name": "钦州路920号",
        "lnglat": "121.425118,31.178881",
        "count": 4
    },
    {
        "address": "钦州南路8号",
        "name": "中海馨园",
        "lnglat": "121.428738,31.162025",
        "count": 74
    },
    {
        "address": "秦安路27弄",
        "name": "大名城",
        "lnglat": "103.837023,36.058480",
        "count": 67
    },
    {
        "address": "勤政路88弄",
        "name": "华发四季",
        "lnglat": "120.965941,28.112535",
        "count": 38
    },
    {
        "address": "沁春路717号",
        "name": "青春商务园",
        "lnglat": "121.369142,31.092329",
        "count": 10
    },
    {
        "address": "青安路40号",
        "name": "凯特利广场",
        "lnglat": "121.117039,31.149336",
        "count": 19
    },
    {
        "address": "青城山路180弄",
        "name": "佘北家园茗雅苑",
        "lnglat": "121.213969,31.122335",
        "count": 42
    },
    {
        "address": "青城山路280弄",
        "name": "佘北家园富雅苑",
        "lnglat": "120.416441,31.350918",
        "count": 38
    },
    {
        "address": "青城山路291弄",
        "name": "佘北家园秀雅苑",
        "lnglat": "121.211565,31.124227",
        "count": 37
    },
    {
        "address": "青村港路68弄",
        "name": "青港丽苑",
        "lnglat": "119.659417,29.067520",
        "count": 8
    },
    {
        "address": "青黛路508号",
        "name": "新菲尔生物科技园区",
        "lnglat": "121.619735,31.096242",
        "count": 10
    },
    {
        "address": "青岛路66弄",
        "name": "金色家园（上海）",
        "lnglat": "84.714834,44.414488",
        "count": 65
    },
    {
        "address": "青海路118号",
        "name": "云海苑商务楼",
        "lnglat": "120.338067,36.084921",
        "count": 7
    },
    {
        "address": "青海路132号",
        "name": "云海苑（公寓楼）",
        "lnglat": "120.338244,36.085094",
        "count": 4
    },
    {
        "address": "青湖路998-1002号",
        "name": "万福财富中心",
        "lnglat": "121.128139,31.145344",
        "count": 12
    },
    {
        "address": "青鸟路269弄",
        "name": "东亚阳光里",
        "lnglat": "121.809095,30.906306",
        "count": 117
    },
    {
        "address": "青鸟路599号",
        "name": "碧桂园浦东星作",
        "lnglat": "121.805000,30.906916",
        "count": 49
    },
    {
        "address": "青厦路200弄",
        "name": "华夏银桂苑",
        "lnglat": "121.684986,31.196994",
        "count": 20
    },
    {
        "address": "青杉路150弄",
        "name": "龙柏四季花园",
        "lnglat": "121.366349,31.178254",
        "count": 95
    },
    {
        "address": "青杉路169弄、157弄",
        "name": "龙柏香榭苑",
        "lnglat": "121.366241,31.175212",
        "count": 118
    },
    {
        "address": "青杉路200弄1号",
        "name": "俊领国际（青杉路200弄1号）",
        "lnglat": "121.365331,31.176769",
        "count": 7
    },
    {
        "address": "青衫路341号",
        "name": "青衫商务园区",
        "lnglat": "121.364536,31.176022",
        "count": 2
    },
    {
        "address": "青松路405弄",
        "name": "帕缇欧香苑三期",
        "lnglat": "121.118875,31.139432",
        "count": 28
    },
    {
        "address": "青桐路618弄",
        "name": "城市经典四期高迪",
        "lnglat": "121.618118,31.213546",
        "count": 128
    },
    {
        "address": "青云路108弄",
        "name": "虹口花苑三期",
        "lnglat": "102.359718,24.660953",
        "count": 24
    },
    {
        "address": "青竹路161弄",
        "name": "中铁逸都",
        "lnglat": "121.129906,31.154214",
        "count": 216
    },
    {
        "address": "清河湾路1121弄62号楼",
        "name": "卓越商务广场",
        "lnglat": "121.101514,31.170855",
        "count": 10
    },
    {
        "address": "清河湾路425弄",
        "name": "旭辉百合宫馆",
        "lnglat": "121.091871,31.168162",
        "count": 64
    },
    {
        "address": "清河湾路486弄",
        "name": "富力桃园(上海)",
        "lnglat": "121.091502,31.165659",
        "count": 248
    },
    {
        "address": "清河湾路699弄",
        "name": "旭辉玫瑰湾",
        "lnglat": "121.096644,31.165876",
        "count": 250
    },
    {
        "address": "清河湾路80弄",
        "name": "清河湾公寓",
        "lnglat": "121.099690,31.165810",
        "count": 50
    },
    {
        "address": "清河湾路819弄",
        "name": "青浦卓越世纪中心",
        "lnglat": "121.101426,31.167862",
        "count": 101
    },
    {
        "address": "清宁路239弄",
        "name": "白沙恒苑",
        "lnglat": "110.141838,22.635404",
        "count": 28
    },
    {
        "address": "清宁路359弄",
        "name": "白沙通苑",
        "lnglat": "110.135559,22.639901",
        "count": 27
    },
    {
        "address": "清宁路469弄",
        "name": "白沙西苑",
        "lnglat": "121.512016,30.941656",
        "count": 26
    },
    {
        "address": "清宁路58弄218弄",
        "name": "东原郦湾",
        "lnglat": "110.147380,22.629868",
        "count": 95
    },
    {
        "address": "清宁路85弄",
        "name": "白沙东苑",
        "lnglat": "110.146251,22.631541",
        "count": 48
    },
    {
        "address": "清峪路258弄",
        "name": "上海豪园",
        "lnglat": "121.372241,31.239842",
        "count": 48
    },
    {
        "address": "清峪路368弄",
        "name": "金沙雅苑三期滨湖世家",
        "lnglat": "121.370306,31.241943",
        "count": 162
    },
    {
        "address": "清真路55弄",
        "name": "大闻公寓",
        "lnglat": "121.459931,31.199463",
        "count": 14
    },
    {
        "address": "庆园路189弄",
        "name": "桐南美麓",
        "lnglat": "121.487934,30.954852",
        "count": 76
    },
    {
        "address": "秋岚路251弄",
        "name": "高行绿洲二期",
        "lnglat": "121.593540,31.328503",
        "count": 6
    },
    {
        "address": "秋潭路155弄",
        "name": "秋雅苑",
        "lnglat": "111.203512,30.478797",
        "count": 58
    },
    {
        "address": "秋亭路88弄",
        "name": "朗诗未来树",
        "lnglat": "121.761991,31.097684",
        "count": 40
    },
    {
        "address": "秋兴路875号",
        "name": "中汽联（临港）全球汽车零部件创新中心",
        "lnglat": "121.794851,30.912473",
        "count": 108
    },
    {
        "address": "秋月路26号",
        "name": "矽岸国际",
        "lnglat": "112.986275,28.232747",
        "count": 6
    },
    {
        "address": "秋竹路118弄",
        "name": "胜悦嘉苑东区",
        "lnglat": "121.227386,31.371842",
        "count": 100
    },
    {
        "address": "秋竹路119弄",
        "name": "胜悦嘉苑西区",
        "lnglat": "121.209471,31.367206",
        "count": 118
    },
    {
        "address": "秋竹路618弄",
        "name": "叠翠峰苑一期",
        "lnglat": "121.222050,31.380739",
        "count": 138
    },
    {
        "address": "秋竹路655弄",
        "name": "叠翠峰苑二期",
        "lnglat": "121.219307,31.379112",
        "count": 167
    },
    {
        "address": "秋竹路801弄",
        "name": "金色榴乡园",
        "lnglat": "121.218408,31.382598",
        "count": 327
    },
    {
        "address": "虬江路1488弄",
        "name": "精文城市花园",
        "lnglat": "121.465110,31.249364",
        "count": 197
    },
    {
        "address": "虬江路997弄",
        "name": "东新大楼",
        "lnglat": "121.473761,31.252113",
        "count": 8
    },
    {
        "address": "虬江支路181号",
        "name": "虹口商城楼",
        "lnglat": "121.481699,31.253457",
        "count": 19
    },
    {
        "address": "虬泾路99弄",
        "name": "九亭明珠苑",
        "lnglat": "121.332496,31.133007",
        "count": 34
    },
    {
        "address": "曲阜西路268号（乌镇路）",
        "name": "上海恒安大厦",
        "lnglat": "121.467296,31.241050",
        "count": 11
    },
    {
        "address": "曲沃路66弄",
        "name": "闻喜华庭(上海)",
        "lnglat": "121.445962,31.306997",
        "count": 30
    },
    {
        "address": "曲吴路589号",
        "name": "中国梦谷南上海文化创意产业园",
        "lnglat": "121.454751,31.053861",
        "count": 20
    },
    {
        "address": "曲阳路489弄8号",
        "name": "虹口创客服务中心",
        "lnglat": "121.489207,31.274820",
        "count": 3
    },
    {
        "address": "瞿溪路1072弄",
        "name": "南园新村",
        "lnglat": "121.474194,31.198656",
        "count": 75
    },
    {
        "address": "瞿溪路1168号",
        "name": "开源大厦",
        "lnglat": "121.472753,31.198148",
        "count": 6
    },
    {
        "address": "瞿溪路1199弄",
        "name": "复兴南苑",
        "lnglat": "121.471191,31.198520",
        "count": 22
    },
    {
        "address": "瞿溪路301弄",
        "name": "蓬莱家园(二期)",
        "lnglat": "121.491872,31.204893",
        "count": 34
    },
    {
        "address": "瞿溪路694号",
        "name": "汇典商务楼",
        "lnglat": "121.476298,31.199540",
        "count": 9
    },
    {
        "address": "瞿溪路811弄",
        "name": "大众家园",
        "lnglat": "121.480999,31.201168",
        "count": 55
    },
    {
        "address": "瞿溪路988号",
        "name": "汇暻生活广场",
        "lnglat": "121.477715,31.198774",
        "count": 13
    },
    {
        "address": "群峰路128弄",
        "name": "新元盛璟苑",
        "lnglat": "121.808489,30.886762",
        "count": 41
    },
    {
        "address": "人民北路71弄",
        "name": "松石苑",
        "lnglat": "75.871186,39.385967",
        "count": 8
    },
    {
        "address": "人民路777弄",
        "name": "东淮海公寓",
        "lnglat": "121.484893,31.227221",
        "count": 65
    },
    {
        "address": "人民路889号",
        "name": "淮海中华大厦",
        "lnglat": "107.031780,33.085870",
        "count": 2
    },
    {
        "address": "人民路998号",
        "name": "金天地国际大厦",
        "lnglat": "121.483006,31.223078",
        "count": 4
    },
    {
        "address": "人民南路49弄1-13号",
        "name": "汇民轩",
        "lnglat": "109.028116,25.992053",
        "count": 12
    },
    {
        "address": "人民西路1533弄",
        "name": "艺泰一品花园",
        "lnglat": "103.762305,29.564476",
        "count": 114
    },
    {
        "address": "仁德路333号",
        "name": "平溪商业广场",
        "lnglat": "120.721016,30.782821",
        "count": 20
    },
    {
        "address": "仁庆路356号",
        "name": "2号地块张江东区商业办公楼",
        "lnglat": "121.703901,31.245137",
        "count": 8
    },
    {
        "address": "日晖六村33号",
        "name": "新徐汇商务中心",
        "lnglat": "121.460771,31.196427",
        "count": 4
    },
    {
        "address": "日京路161号",
        "name": "商都大楼",
        "lnglat": "121.598283,31.342979",
        "count": 5
    },
    {
        "address": "日京路35号",
        "name": "凯兴大楼",
        "lnglat": "121.593406,31.340216",
        "count": 2
    },
    {
        "address": "茸平路333弄",
        "name": "国乐广场",
        "lnglat": "121.252424,31.034092",
        "count": 42
    },
    {
        "address": "茸平路515弄",
        "name": "福都商务广场",
        "lnglat": "121.248926,31.033525",
        "count": 3
    },
    {
        "address": "茸平路8号",
        "name": "汇甲大厦",
        "lnglat": "121.257683,31.034916",
        "count": 26
    },
    {
        "address": "茸兴路280弄",
        "name": "恒大帝景一期",
        "lnglat": "121.249834,31.038443",
        "count": 29
    },
    {
        "address": "茸兴路285号",
        "name": "时亦商务大厦",
        "lnglat": "121.249742,31.038603",
        "count": 4
    },
    {
        "address": "茸兴路407号",
        "name": "茸407创意园",
        "lnglat": "121.249354,31.047439",
        "count": 15
    },
    {
        "address": "荣华东道119号",
        "name": "巴黎花园（上海）",
        "lnglat": "121.394790,31.195330",
        "count": 28
    },
    {
        "address": "荣华东道119弄",
        "name": "巴黎经典",
        "lnglat": "121.395489,31.195415",
        "count": 8
    },
    {
        "address": "荣华东道128号",
        "name": "维多利亚E座",
        "lnglat": "121.394143,31.195585",
        "count": 6
    },
    {
        "address": "荣华东道19弄",
        "name": "鹿特丹花园",
        "lnglat": "121.395285,31.193907",
        "count": 16
    },
    {
        "address": "荣华东道35号-25号",
        "name": "广场大厦",
        "lnglat": "121.396314,31.194195",
        "count": 2
    },
    {
        "address": "荣华东道46-49号",
        "name": "雅典花园",
        "lnglat": "118.203766,39.684610",
        "count": 23
    },
    {
        "address": "荣华东道59弄",
        "name": "里昂花园",
        "lnglat": "121.396606,31.194398",
        "count": 45
    },
    {
        "address": "荣华东道79弄",
        "name": "马赛花园",
        "lnglat": "121.396369,31.195765",
        "count": 18
    },
    {
        "address": "荣华东道98号",
        "name": "维多利亚C座",
        "lnglat": "121.396358,31.196000",
        "count": 4
    },
    {
        "address": "荣华西道19弄",
        "name": "金狮公寓",
        "lnglat": "121.393187,31.194048",
        "count": 32
    },
    {
        "address": "荣华西道19弄1-4号",
        "name": "金龙公寓",
        "lnglat": "121.392897,31.193252",
        "count": 4
    },
    {
        "address": "荣华西道79号",
        "name": "金象公寓",
        "lnglat": "121.391772,31.194755",
        "count": 12
    },
    {
        "address": "荣华西道79弄、39弄",
        "name": "金鹿公寓",
        "lnglat": "121.391772,31.194755",
        "count": 18
    },
    {
        "address": "荣华西道99号",
        "name": "金马公寓",
        "lnglat": "121.392973,31.194553",
        "count": 12
    },
    {
        "address": "荣科路177弄",
        "name": "张江荣科苑",
        "lnglat": "121.608194,31.178475",
        "count": 21
    },
    {
        "address": "荣乐东路2369号",
        "name": "绿地松江商务广场",
        "lnglat": "121.246290,31.016795",
        "count": 14
    },
    {
        "address": "荣乐西路1058号",
        "name": "松江颐景园",
        "lnglat": "121.192569,31.016686",
        "count": 81
    },
    {
        "address": "荣乐西路266弄",
        "name": "维罗纳贵都",
        "lnglat": "121.205102,31.016587",
        "count": 278
    },
    {
        "address": "荣乐西路399号",
        "name": "海尚名都",
        "lnglat": "121.203472,31.015098",
        "count": 18
    },
    {
        "address": "荣轩路60弄",
        "name": "君悦华庭（上海）",
        "lnglat": "121.194049,31.290142",
        "count": 74
    },
    {
        "address": "荣谊路108弄",
        "name": "东方花园三期",
        "lnglat": "121.364366,31.143751",
        "count": 140
    },
    {
        "address": "乳山路233号",
        "name": "梅园WE",
        "lnglat": "121.526442,31.237424",
        "count": 26
    },
    {
        "address": "乳山路505弄",
        "name": "上海滩花园洋房_南北区",
        "lnglat": "121.533002,31.240217",
        "count": 294
    },
    {
        "address": "乳山路98号",
        "name": "普联大厦",
        "lnglat": "121.520216,31.234583",
        "count": 14
    },
    {
        "address": "瑞金南路185弄",
        "name": "瑞南新苑",
        "lnglat": "106.712190,26.567100",
        "count": 70
    },
    {
        "address": "瑞金南路1号",
        "name": "海兴广场",
        "lnglat": "106.706672,26.576202",
        "count": 22
    },
    {
        "address": "瑞金南路333弄",
        "name": "名盛苑",
        "lnglat": "106.715680,26.565360",
        "count": 93
    },
    {
        "address": "瑞金南路345号",
        "name": "裕兴大厦（商务楼）",
        "lnglat": "106.715915,26.565168",
        "count": 11
    },
    {
        "address": "瑞金南路345弄",
        "name": "裕兴大厦（上海）",
        "lnglat": "106.715915,26.565168",
        "count": 6
    },
    {
        "address": "瑞金南路458弄",
        "name": "瑞金南苑",
        "lnglat": "121.467559,31.199779",
        "count": 89
    },
    {
        "address": "瑞金南路500号",
        "name": "新视觉500",
        "lnglat": "121.467894,31.198441",
        "count": 12
    },
    {
        "address": "瑞金南路546,570号",
        "name": "双晖小区",
        "lnglat": "121.467801,31.196855",
        "count": 4
    },
    {
        "address": "瑞金南路628弄",
        "name": "环龙新苑",
        "lnglat": "121.469470,31.195788",
        "count": 40
    },
    {
        "address": "瑞丽路918弄",
        "name": "海赋尚品苑",
        "lnglat": "121.403365,31.018805",
        "count": 111
    },
    {
        "address": "瑞宁路908弄",
        "name": "保利西岸",
        "lnglat": "121.456232,31.180836",
        "count": 22
    },
    {
        "address": "瑞浦路287弄-1-82号",
        "name": "桃园新城中虹佳园（中虹佳园）",
        "lnglat": "121.585028,31.095649",
        "count": 4
    },
    {
        "address": "瑞浦路8弄",
        "name": "桃园新城中虹佳园北区（中虹佳园北区）",
        "lnglat": "121.584007,31.098431",
        "count": 14
    },
    {
        "address": "瑞庆路528号、胜利路836号",
        "name": "张江医疗器械园",
        "lnglat": "121.704585,31.242803",
        "count": 10
    },
    {
        "address": "润兴路8弄",
        "name": "金山玫瑰公馆",
        "lnglat": "119.403772,32.174363",
        "count": 46
    },
    {
        "address": "三达路25号",
        "name": "思兰创客中心",
        "lnglat": "112.889155,23.172539",
        "count": 22
    },
    {
        "address": "三达路517号",
        "name": "乘秋517工坊",
        "lnglat": "121.520211,31.072006",
        "count": 2
    },
    {
        "address": "三林路1300弄",
        "name": "金色雅筑(中林苑)",
        "lnglat": "121.518117,31.143820",
        "count": 87
    },
    {
        "address": "三林路1466弄1662弄",
        "name": "阳辰美景（衡辰三林苑）",
        "lnglat": "121.522466,31.146035",
        "count": 63
    },
    {
        "address": "三林路158号",
        "name": "前滩尚博园",
        "lnglat": "121.495499,31.136403",
        "count": 9
    },
    {
        "address": "三林路738号",
        "name": "上海谨泛创意产业园",
        "lnglat": "121.506483,31.141318",
        "count": 8
    },
    {
        "address": "三林路88弄",
        "name": "明通文化创意产业园",
        "lnglat": "106.959156,26.462255",
        "count": 30
    },
    {
        "address": "三林镇平家桥路36号",
        "name": "晶耀商务广场",
        "lnglat": "121.478319,31.152339",
        "count": 43
    },
    {
        "address": "三鲁公路1739弄",
        "name": "水月锦绣苑",
        "lnglat": "121.530223,31.049784",
        "count": 82
    },
    {
        "address": "三鲁公路2799号",
        "name": "禾谷文创四达园",
        "lnglat": "121.524086,31.071949",
        "count": 15
    },
    {
        "address": "三鲁公路2868弄151号",
        "name": "翱翔空间创新园",
        "lnglat": "121.526855,31.073214",
        "count": 2
    },
    {
        "address": "三鲁公路3398号",
        "name": "上海国茸浦江科创园",
        "lnglat": "121.521924,31.082495",
        "count": 42
    },
    {
        "address": "三门路1266弄",
        "name": "恒大江湾华庭",
        "lnglat": "121.468898,31.310370",
        "count": 35
    },
    {
        "address": "三门路318弄",
        "name": "同济北苑",
        "lnglat": "121.496028,31.309115",
        "count": 66
    },
    {
        "address": "三门路333弄",
        "name": "三门路333弄（空军干部家属院）",
        "lnglat": "121.501247,31.311997",
        "count": 14
    },
    {
        "address": "三门路351弄",
        "name": "尊堡园",
        "lnglat": "121.496331,31.315352",
        "count": 18
    },
    {
        "address": "三泉路1858弄",
        "name": "宝宸共和家园",
        "lnglat": "121.438119,31.331880",
        "count": 296
    },
    {
        "address": "三泉路1859弄",
        "name": "宝宸怡景园",
        "lnglat": "121.436180,31.330029",
        "count": 449
    },
    {
        "address": "三新北路1333弄-1-90号",
        "name": "恒杰丁香花园",
        "lnglat": "121.185771,31.044395",
        "count": 35
    },
    {
        "address": "三源路41弄",
        "name": "曹杨五月天",
        "lnglat": "121.407577,31.261023",
        "count": 17
    },
    {
        "address": "三源路66弄",
        "name": "曹杨雅苑",
        "lnglat": "121.406356,31.261339",
        "count": 14
    },
    {
        "address": "沙河路58号",
        "name": "美好中心",
        "lnglat": "106.944797,27.693823",
        "count": 5
    },
    {
        "address": "沙浦路128弄",
        "name": "上海绿洲花园",
        "lnglat": "121.388523,31.356735",
        "count": 172
    },
    {
        "address": "沙浦路311弄",
        "name": "新天地荻泾花园",
        "lnglat": "121.387228,31.355467",
        "count": 75
    },
    {
        "address": "山连路799号",
        "name": "新天地创意园",
        "lnglat": "121.341969,31.309687",
        "count": 9
    },
    {
        "address": "山西北路222弄",
        "name": "联富假日公寓",
        "lnglat": "121.480297,31.244324",
        "count": 28
    },
    {
        "address": "山西南路350号(北京东路）",
        "name": "上海物资大厦",
        "lnglat": "121.481428,31.239501",
        "count": 12
    },
    {
        "address": "陕西北路1155弄",
        "name": "静安晶华园",
        "lnglat": "121.444808,31.239794",
        "count": 41
    },
    {
        "address": "陕西北路1283弄3号",
        "name": "宝都大厦",
        "lnglat": "121.442594,31.241392",
        "count": 7
    },
    {
        "address": "陕西北路1283弄9号",
        "name": "玉城大厦",
        "lnglat": "121.442356,31.241137",
        "count": 14
    },
    {
        "address": "陕西北路1789弄",
        "name": "都华名苑",
        "lnglat": "121.437351,31.246141",
        "count": 36
    },
    {
        "address": "陕西北路278号",
        "name": "金鹰国际购物中心(上海店)",
        "lnglat": "121.454845,31.228483",
        "count": 14
    },
    {
        "address": "陕西北路66号",
        "name": "科恩国际中心",
        "lnglat": "121.456760,31.224960",
        "count": 10
    },
    {
        "address": "陕西北路688号",
        "name": "静工创意智社（智社iCommune）",
        "lnglat": "121.450406,31.234316",
        "count": 7
    },
    {
        "address": "陕西北路900号",
        "name": "MOHO办公楼",
        "lnglat": "121.447502,31.237525",
        "count": 55
    },
    {
        "address": "陕西南路3号",
        "name": "城市一品苑",
        "lnglat": "121.457600,31.222785",
        "count": 2
    },
    {
        "address": "陕西南路888弄",
        "name": "汇景苑",
        "lnglat": "121.460891,31.204547",
        "count": 33
    },
    {
        "address": "商城路108弄",
        "name": "汇豪天下",
        "lnglat": "112.380276,26.960430",
        "count": 67
    },
    {
        "address": "商城路1900号",
        "name": "金桃大厦",
        "lnglat": "121.537785,31.237656",
        "count": 5
    },
    {
        "address": "商城路1986号",
        "name": "商城商务楼",
        "lnglat": "121.539060,31.238205",
        "count": 5
    },
    {
        "address": "商城路2000号",
        "name": "宜嘉商务楼",
        "lnglat": "121.539394,31.238289",
        "count": 1
    },
    {
        "address": "商城路297号",
        "name": "申金大厦",
        "lnglat": "121.510321,31.229357",
        "count": 10
    },
    {
        "address": "商城路341号",
        "name": "紫光大厦",
        "lnglat": "120.263724,30.871029",
        "count": 2
    },
    {
        "address": "商城路518号",
        "name": "内外联大厦",
        "lnglat": "121.517189,31.230036",
        "count": 3
    },
    {
        "address": "商城路618号",
        "name": "上海良友大厦",
        "lnglat": "121.518049,31.230226",
        "count": 6
    },
    {
        "address": "商城路660号",
        "name": "乐凯大厦",
        "lnglat": "121.518718,31.230505",
        "count": 12
    },
    {
        "address": "商城路738号",
        "name": "胜康廖氏大厦",
        "lnglat": "121.519236,31.230474",
        "count": 63
    },
    {
        "address": "商城路889号",
        "name": "波特营园区",
        "lnglat": "121.521654,31.232785",
        "count": 10
    },
    {
        "address": "上大路1号",
        "name": "文景楼",
        "lnglat": "120.538597,30.049791",
        "count": 9
    },
    {
        "address": "上大路2弄",
        "name": "锦秀苑",
        "lnglat": "120.581060,30.006210",
        "count": 40
    },
    {
        "address": "上海黄浦区宁波路1号",
        "name": "申华金融大厦",
        "lnglat": "121.486611,31.239484",
        "count": 5
    },
    {
        "address": "上海市宝山区天家路116弄",
        "name": "美罗家园宝欣苑七村",
        "lnglat": "121.339810,31.384714",
        "count": 18
    },
    {
        "address": "上海市宝山区天家路199弄",
        "name": "美罗家园宝欣苑六村",
        "lnglat": "121.338590,31.382569",
        "count": 24
    },
    {
        "address": "上海市宝山区天家路200弄",
        "name": "美罗家园宝欣苑五村",
        "lnglat": "121.337913,31.384845",
        "count": 28
    },
    {
        "address": "上海市宝山区天家路99弄",
        "name": "美罗家园宝欣苑八村",
        "lnglat": "121.340548,31.383253",
        "count": 14
    },
    {
        "address": "上海市奉贤区望园南路1121号",
        "name": "上海泽天产业园",
        "lnglat": "121.492163,30.902236",
        "count": 9
    },
    {
        "address": "上海市虹口区北苏州路88号",
        "name": "中美信托金融大厦",
        "lnglat": "121.488584,31.245078",
        "count": 42
    },
    {
        "address": "上海市虹口区逸仙路288弄",
        "name": "逸虹景苑(上海)",
        "lnglat": "121.486303,31.298842",
        "count": 42
    },
    {
        "address": "上海市黄浦区西藏中路336号",
        "name": "华旭国际大厦",
        "lnglat": "121.475835,31.233751",
        "count": 16
    },
    {
        "address": "上海市黄浦区斜土路313号",
        "name": "黄浦区税务局第七税务所",
        "lnglat": "121.479635,31.205161",
        "count": 2
    },
    {
        "address": "上海市浦东新区海洋四路99弄1-35号",
        "name": "智菁科技中心创新魔方一期",
        "lnglat": "121.912955,30.864608",
        "count": 23
    },
    {
        "address": "上海市普陀区武宁路19号",
        "name": "丽晶阳光大厦",
        "lnglat": "121.428979,31.233394",
        "count": 6
    },
    {
        "address": "上海市青浦区青泰路616弄",
        "name": "西虹桥壹号",
        "lnglat": "121.079357,31.137033",
        "count": 86
    },
    {
        "address": "上海市吴中路8号",
        "name": "锦辉大厦",
        "lnglat": "121.419630,31.189113",
        "count": 3
    },
    {
        "address": "上海外高桥保税区港澳路239号",
        "name": "兴江国贸大楼",
        "lnglat": "121.615364,31.315535",
        "count": 12
    },
    {
        "address": "上南路1500弄",
        "name": "城建公寓",
        "lnglat": "121.494717,31.169969",
        "count": 7
    },
    {
        "address": "上南路2779号",
        "name": "大桥海达楼",
        "lnglat": "121.497263,31.166859",
        "count": 5
    },
    {
        "address": "上南路2985号",
        "name": "海宏大厦（上海）",
        "lnglat": "121.497525,31.165076",
        "count": 4
    },
    {
        "address": "上南路3521号",
        "name": "宝丰生活广场",
        "lnglat": "121.504250,31.155128",
        "count": 24
    },
    {
        "address": "上南路3855号",
        "name": "如日商务园",
        "lnglat": "121.507078,31.151086",
        "count": 7
    },
    {
        "address": "上南路3899弄",
        "name": "瀚林苑（恒大翰城）",
        "lnglat": "121.503246,31.153061",
        "count": 32
    },
    {
        "address": "上南路6500弄",
        "name": "阳光城丽景湾PLUS（上海丽景湾PLUS）",
        "lnglat": "121.547632,31.117557",
        "count": 128
    },
    {
        "address": "上南路7992号",
        "name": "泰苑公寓",
        "lnglat": "121.574944,31.117541",
        "count": 16
    },
    {
        "address": "上中路303号",
        "name": "万街303创意园区",
        "lnglat": "121.443508,31.139240",
        "count": 9
    },
    {
        "address": "上中路479号",
        "name": "上中路483弄（479弄）商办楼",
        "lnglat": "121.447756,31.141162",
        "count": 10
    },
    {
        "address": "上中路495号",
        "name": "汇达商务园",
        "lnglat": "121.448531,31.141442",
        "count": 6
    },
    {
        "address": "上中路51弄",
        "name": "书香逸居",
        "lnglat": "113.865439,22.964430",
        "count": 64
    },
    {
        "address": "上中路55弄",
        "name": "长桥一村",
        "lnglat": "113.865459,22.964287",
        "count": 14
    },
    {
        "address": "尚博路366弄",
        "name": "湾流域三期",
        "lnglat": "121.516656,31.146457",
        "count": 36
    },
    {
        "address": "尚博路569弄",
        "name": "湾流域二期",
        "lnglat": "121.519158,31.149194",
        "count": 223
    },
    {
        "address": "尚博路650弄",
        "name": "金橘新苑南区",
        "lnglat": "121.523173,31.149547",
        "count": 78
    },
    {
        "address": "尚博路799弄",
        "name": "金橘新苑北区",
        "lnglat": "121.524708,31.151032",
        "count": 281
    },
    {
        "address": "尚茂路798弄",
        "name": "徐泾北城馨浦苑西区",
        "lnglat": "121.238530,31.179010",
        "count": 38
    },
    {
        "address": "尚泰路458弄",
        "name": "徐泾北城欣沁苑西区(458）",
        "lnglat": "121.234299,31.182127",
        "count": 15
    },
    {
        "address": "尚文路168号",
        "name": "东波大厦",
        "lnglat": "121.490817,31.215324",
        "count": 7
    },
    {
        "address": "尚文路185号",
        "name": "平利大厦",
        "lnglat": "121.490280,31.215441",
        "count": 17
    },
    {
        "address": "尚文路198号",
        "name": "中华大厦",
        "lnglat": "121.490346,31.215222",
        "count": 7
    },
    {
        "address": "尚义路229弄",
        "name": "虹梅景苑二街坊",
        "lnglat": "121.450000,31.042717",
        "count": 105
    },
    {
        "address": "尚义路39弄2号",
        "name": "吴泾宝龙中心（一期）",
        "lnglat": "121.462632,31.039588",
        "count": 16
    },
    {
        "address": "尚义路428弄",
        "name": "虹梅景苑四街坊",
        "lnglat": "121.450936,31.045602",
        "count": 80
    },
    {
        "address": "尚义路459弄",
        "name": "虹梅景苑三街坊",
        "lnglat": "121.449271,31.045477",
        "count": 52
    },
    {
        "address": "尚义路91号",
        "name": "吴泾宝龙中心（二期）",
        "lnglat": "120.432163,29.800293",
        "count": 56
    },
    {
        "address": "韶山路245弄",
        "name": "馨佳园十街坊",
        "lnglat": "113.134915,27.831661",
        "count": 39
    },
    {
        "address": "少年村路451弄68号",
        "name": "景和创意园区",
        "lnglat": "121.431242,31.299944",
        "count": 6
    },
    {
        "address": "少年村路479弄",
        "name": "白玉兰馨园",
        "lnglat": "121.429760,31.300383",
        "count": 63
    },
    {
        "address": "申北路168弄",
        "name": "正峰苑",
        "lnglat": "121.383957,31.092084",
        "count": 44
    },
    {
        "address": "申滨路9号",
        "name": "九星虹桥商务中心",
        "lnglat": "121.309370,31.194120",
        "count": 39
    },
    {
        "address": "申滨南路1126号",
        "name": "龙湖虹桥天街",
        "lnglat": "121.312787,31.191794",
        "count": 71
    },
    {
        "address": "申港大道158号",
        "name": "昊坤国际大厦",
        "lnglat": "121.923841,30.898233",
        "count": 21
    },
    {
        "address": "申港路660号",
        "name": "科溢智慧园",
        "lnglat": "121.344022,31.066294",
        "count": 11
    },
    {
        "address": "申虹路1188弄",
        "name": "恒基旭辉中心",
        "lnglat": "121.317077,31.213180",
        "count": 12
    },
    {
        "address": "申虹路663号",
        "name": "虹桥协信中心",
        "lnglat": "121.315489,31.201745",
        "count": 37
    },
    {
        "address": "申虹路666弄",
        "name": "正荣中心",
        "lnglat": "121.316794,31.202839",
        "count": 32
    },
    {
        "address": "申虹路988弄",
        "name": "虹桥富力悦都商办区域",
        "lnglat": "121.316231,31.209015",
        "count": 101
    },
    {
        "address": "申江路5005弄",
        "name": "星创科技广场",
        "lnglat": "121.626327,31.209205",
        "count": 6
    },
    {
        "address": "申昆路1999号",
        "name": "长三角电子商务中心",
        "lnglat": "121.323960,31.205828",
        "count": 15
    },
    {
        "address": "申南路59弄",
        "name": "凯龙莘庄商务园",
        "lnglat": "121.394592,31.077644",
        "count": 19
    },
    {
        "address": "申旺路789号",
        "name": "慧高光创园(光创园)",
        "lnglat": "121.374934,31.081233",
        "count": 4
    },
    {
        "address": "申长路1466弄",
        "name": "虹桥富力中心",
        "lnglat": "121.315116,31.208167",
        "count": 21
    },
    {
        "address": "申长路1588弄1号楼",
        "name": "虹桥平安财富中心",
        "lnglat": "121.313150,31.210894",
        "count": 3
    },
    {
        "address": "申长路1688弄3号",
        "name": "中骏广场一期3号楼",
        "lnglat": "121.312973,31.212290",
        "count": 20
    },
    {
        "address": "申长路288弄",
        "name": "隆视广场",
        "lnglat": "121.319172,31.184661",
        "count": 17
    },
    {
        "address": "申长路518号",
        "name": "虹桥绿谷WE",
        "lnglat": "121.316932,31.187898",
        "count": 58
    },
    {
        "address": "申长路519号",
        "name": "上海富力环球中心",
        "lnglat": "121.316945,31.187936",
        "count": 13
    },
    {
        "address": "申长路869号",
        "name": "龙湖虹桥天街北区",
        "lnglat": "121.313342,31.192178",
        "count": 121
    },
    {
        "address": "申长路988号",
        "name": "虹桥万科中心",
        "lnglat": "121.315461,31.196639",
        "count": 5
    },
    {
        "address": "申郑路18弄",
        "name": "万科时一区一期(虹桥万科润园)",
        "lnglat": "121.311372,31.203531",
        "count": 65
    },
    {
        "address": "莘浜路10弄2号",
        "name": "上海银星大厦",
        "lnglat": "121.379566,31.107160",
        "count": 7
    },
    {
        "address": "莘东路298弄",
        "name": "世纪茗苑",
        "lnglat": "121.377227,31.109283",
        "count": 24
    },
    {
        "address": "莘福路388号",
        "name": "莘东置业大厦",
        "lnglat": "121.361360,31.107106",
        "count": 44
    },
    {
        "address": "莘建东路198弄",
        "name": "地铁明珠苑",
        "lnglat": "121.384930,31.112769",
        "count": 45
    },
    {
        "address": "莘建东路388 399弄",
        "name": "众众家园",
        "lnglat": "121.382540,31.110377",
        "count": 80
    },
    {
        "address": "莘建东路58号",
        "name": "绿地科技岛",
        "lnglat": "121.387154,31.116246",
        "count": 54
    },
    {
        "address": "莘建路228弄",
        "name": "闵富大厦",
        "lnglat": "121.375639,31.105592",
        "count": 16
    },
    {
        "address": "莘松路1288弄",
        "name": "绿洲长香岛花园",
        "lnglat": "121.347360,31.101189",
        "count": 430
    },
    {
        "address": "莘松路380号",
        "name": "智慧园",
        "lnglat": "121.378919,31.106242",
        "count": 4
    },
    {
        "address": "莘松路58号",
        "name": "东苑丽宝广场",
        "lnglat": "121.377259,31.109258",
        "count": 8
    },
    {
        "address": "莘松路855号",
        "name": "青春商务楼",
        "lnglat": "121.364555,31.098832",
        "count": 9
    },
    {
        "address": "莘松路958弄",
        "name": "上海康城三期",
        "lnglat": "121.352626,31.104480",
        "count": 561
    },
    {
        "address": "莘松路958弄大浪湾道",
        "name": "上海康城四期",
        "lnglat": "121.352626,31.104480",
        "count": 568
    },
    {
        "address": "莘松路958弄三林道89号",
        "name": "上海康城二期",
        "lnglat": "121.352626,31.104480",
        "count": 476
    },
    {
        "address": "莘松路980弄",
        "name": "上海康城一期",
        "lnglat": "121.357985,31.103611",
        "count": 322
    },
    {
        "address": "莘朱路2111弄1-7号",
        "name": "朱莘苑",
        "lnglat": "121.425311,31.123505",
        "count": 28
    },
    {
        "address": "莘朱路695号",
        "name": "莘南综合楼(稷下商务中心)",
        "lnglat": "121.395867,31.111910",
        "count": 5
    },
    {
        "address": "莘朱路718弄",
        "name": "莘东两湾苑",
        "lnglat": "121.395980,31.113963",
        "count": 62
    },
    {
        "address": "莘朱路820弄",
        "name": "梅香苑",
        "lnglat": "121.397696,31.113580",
        "count": 79
    },
    {
        "address": "莘庄镇园秀路28弄",
        "name": "旭辉莘庄中心",
        "lnglat": "121.365027,31.122923",
        "count": 27
    },
    {
        "address": "沈杜公路3872弄",
        "name": "显贵商务楼",
        "lnglat": "121.514560,31.060800",
        "count": 10
    },
    {
        "address": "沈杜公路3872弄4号楼",
        "name": "上海节能环保科技孵化基地",
        "lnglat": "121.514123,31.060691",
        "count": 13
    },
    {
        "address": "沈杜公路4285号",
        "name": "程文商务中心",
        "lnglat": "121.513477,31.059887",
        "count": 14
    },
    {
        "address": "沈杜路118号",
        "name": "118空间",
        "lnglat": "121.269053,30.165440",
        "count": 18
    },
    {
        "address": "沈梅路600号",
        "name": "环宇集团上海智能产业园",
        "lnglat": "121.568761,31.091357",
        "count": 7
    },
    {
        "address": "沈梅路99号",
        "name": "智慧产业园",
        "lnglat": "121.577489,31.090866",
        "count": 5
    },
    {
        "address": "沈阳路123弄",
        "name": "华谊星城名苑",
        "lnglat": "118.774235,34.124427",
        "count": 9
    },
    {
        "address": "沈砖公路5599号",
        "name": "伟凯科技产业园",
        "lnglat": "121.251417,31.093107",
        "count": 2
    },
    {
        "address": "沈砖公路6000号",
        "name": "创异工房",
        "lnglat": "121.260957,31.091091",
        "count": 52
    },
    {
        "address": "胜利路1680号",
        "name": "联东U谷青浦国际企业港",
        "lnglat": "121.105212,31.183642",
        "count": 11
    },
    {
        "address": "胜辛路3285号",
        "name": "运通大厦",
        "lnglat": "121.225786,31.376306",
        "count": 8
    },
    {
        "address": "胜竹路1364号（双坪路285弄）",
        "name": "景悦名苑",
        "lnglat": "121.269708,31.406196",
        "count": 56
    },
    {
        "address": "盛富路490号",
        "name": "佳钢科创园_盛富路",
        "lnglat": "121.310176,31.103905",
        "count": 5
    },
    {
        "address": "盛富路508号",
        "name": "永旺园区",
        "lnglat": "121.308409,31.103655",
        "count": 1
    },
    {
        "address": "盛富路669号",
        "name": "科溢科创中心",
        "lnglat": "121.306997,31.101973",
        "count": 5
    },
    {
        "address": "盛荣路188弄",
        "name": "盛大天地创意中心一期（青春里）",
        "lnglat": "121.606302,31.170751",
        "count": 36
    },
    {
        "address": "盛荣路288弄",
        "name": "盛大天地创意中心二期（青春里）",
        "lnglat": "121.605796,31.169961",
        "count": 60
    },
    {
        "address": "盛荣路388弄",
        "name": "百佳通",
        "lnglat": "121.607097,31.167222",
        "count": 4
    },
    {
        "address": "盛荣路88弄1-16号",
        "name": "盛大天地源创谷",
        "lnglat": "121.604541,31.172566",
        "count": 79
    },
    {
        "address": "盛夏路500弄",
        "name": "张江光大园",
        "lnglat": "121.628652,31.209524",
        "count": 15
    },
    {
        "address": "盛夏路560号",
        "name": "北大楼2期",
        "lnglat": "121.626499,31.208394",
        "count": 11
    },
    {
        "address": "盛夏路570号",
        "name": "895创新基地",
        "lnglat": "121.628536,31.208356",
        "count": 11
    },
    {
        "address": "盛夏路58号",
        "name": "张江集电港天之骄子创业公寓",
        "lnglat": "121.628590,31.214669",
        "count": 54
    },
    {
        "address": "盛夏路666号",
        "name": "普洛斯盛银大厦(上投盛银大厦)",
        "lnglat": "121.628840,31.205640",
        "count": 18
    },
    {
        "address": "施湾航城三路518弄",
        "name": "东亚启航公馆",
        "lnglat": "121.749953,31.151138",
        "count": 119
    },
    {
        "address": "石龙路329号",
        "name": "智慧谷(上海)",
        "lnglat": "121.441800,31.156129",
        "count": 6
    },
    {
        "address": "石龙路345弄28号",
        "name": "大树下创意空间",
        "lnglat": "121.441198,31.153081",
        "count": 16
    },
    {
        "address": "石龙路345弄3号",
        "name": "杰初智园",
        "lnglat": "121.440782,31.155242",
        "count": 9
    },
    {
        "address": "石龙路569号",
        "name": "S569园区",
        "lnglat": "121.436154,31.153812",
        "count": 14
    },
    {
        "address": "石龙路666号",
        "name": "上海长途客运南站",
        "lnglat": "121.433616,31.152807",
        "count": 8
    },
    {
        "address": "石龙路951号",
        "name": "美通科创空间",
        "lnglat": "121.431100,31.148160",
        "count": 5
    },
    {
        "address": "石龙路980弄",
        "name": "麦克花园",
        "lnglat": "121.428733,31.148115",
        "count": 9
    },
    {
        "address": "石龙路999弄",
        "name": "汇京佳丽园",
        "lnglat": "121.429459,31.147378",
        "count": 71
    },
    {
        "address": "石门二路258号",
        "name": "现代建筑设计大厦",
        "lnglat": "121.460760,31.235247",
        "count": 5
    },
    {
        "address": "石门二路333弄3号",
        "name": "振安广场_恒安大厦",
        "lnglat": "121.459363,31.236018",
        "count": 2
    },
    {
        "address": "石门二路503号",
        "name": "恒丰大楼",
        "lnglat": "121.458515,31.237324",
        "count": 4
    },
    {
        "address": "石门一路116号",
        "name": "中邦艾格美国际公寓",
        "lnglat": "121.463308,31.226558",
        "count": 5
    },
    {
        "address": "石门一路211号",
        "name": "旺旺大厦(上海)",
        "lnglat": "121.462146,31.227865",
        "count": 16
    },
    {
        "address": "石泉东路168弄",
        "name": "香溢花城",
        "lnglat": "121.434336,31.255758",
        "count": 222
    },
    {
        "address": "石泉东路215号",
        "name": "香溢花城三期",
        "lnglat": "121.432932,31.254204",
        "count": 60
    },
    {
        "address": "石泉路450弄",
        "name": "宁泉新苑",
        "lnglat": "121.416716,31.247449",
        "count": 36
    },
    {
        "address": "石泉路49弄1号",
        "name": "石泉大厦",
        "lnglat": "121.429154,31.252267",
        "count": 9
    },
    {
        "address": "石湾路7弄51号101室",
        "name": "康泰公寓（上海）",
        "lnglat": "121.413260,31.229760",
        "count": 2
    },
    {
        "address": "世博馆路50、52号",
        "name": "鲁能国际中心AB座",
        "lnglat": "121.486542,31.185136",
        "count": 65
    },
    {
        "address": "世纪大道1090号",
        "name": "斯米克大厦",
        "lnglat": "121.520144,31.230316",
        "count": 4
    },
    {
        "address": "世纪大道1198号",
        "name": "上海世纪汇广场商场",
        "lnglat": "121.528238,31.227080",
        "count": 158
    },
    {
        "address": "世纪大道1500号",
        "name": "东方大厦（上海）",
        "lnglat": "103.697479,30.617240",
        "count": 53
    },
    {
        "address": "世纪大道1568号",
        "name": "中建大厦（上海）",
        "lnglat": "103.697536,30.615891",
        "count": 4
    },
    {
        "address": "世纪大道1589号",
        "name": "长泰国际金融大厦",
        "lnglat": "121.535107,31.224889",
        "count": 7
    },
    {
        "address": "世纪大道1600号",
        "name": "陆家嘴商务广场（浦项商务广场）",
        "lnglat": "103.697102,30.614152",
        "count": 9
    },
    {
        "address": "世纪大道160号",
        "name": "览海国际广场",
        "lnglat": "114.428383,35.052412",
        "count": 7
    },
    {
        "address": "世纪大道1701号",
        "name": "中国钻石交易中心",
        "lnglat": "103.695883,30.608840",
        "count": 1
    },
    {
        "address": "世纪大道201号",
        "name": "渣打银行大厦",
        "lnglat": "116.700941,28.699832",
        "count": 2
    },
    {
        "address": "世纪大道210号",
        "name": "上海二十一世纪中心大厦",
        "lnglat": "103.551010,27.184550",
        "count": 26
    },
    {
        "address": "世纪大道211号",
        "name": "上海信息大楼",
        "lnglat": "116.693757,28.699913",
        "count": 24
    },
    {
        "address": "世纪大道88号",
        "name": "金茂大厦",
        "lnglat": "112.480482,23.027355",
        "count": 20
    },
    {
        "address": "世界路133号",
        "name": "133绿源天地广场",
        "lnglat": "121.525152,31.321674",
        "count": 16
    },
    {
        "address": "世界路15弄",
        "name": "明丰阳光苑",
        "lnglat": "121.524140,31.316209",
        "count": 60
    },
    {
        "address": "市光二村103-106号",
        "name": "新钢大楼(市光二村)",
        "lnglat": "121.540956,31.317995",
        "count": 16
    },
    {
        "address": "市光路390号",
        "name": "盛世豪园",
        "lnglat": "121.517471,31.318151",
        "count": 77
    },
    {
        "address": "市台路515弄",
        "name": "金地艺境商住楼",
        "lnglat": "121.350189,31.316089",
        "count": 6
    },
    {
        "address": "市台路555弄",
        "name": "金地宝山艺境城",
        "lnglat": "121.349402,31.318510",
        "count": 209
    },
    {
        "address": "寿光路78弄",
        "name": "江南山水",
        "lnglat": "121.585964,31.272589",
        "count": 190
    },
    {
        "address": "寿阳路555号",
        "name": "哈瑞中心",
        "lnglat": "121.456394,31.300823",
        "count": 16
    },
    {
        "address": "寿阳路99弄27号",
        "name": "上勤大厦",
        "lnglat": "121.458187,31.296349",
        "count": 3
    },
    {
        "address": "疏影路1098弄",
        "name": "林水美地苑商务楼",
        "lnglat": "121.360387,31.118430",
        "count": 6
    },
    {
        "address": "树屏路588弄",
        "name": "财智金岸（商务园）",
        "lnglat": "121.259186,31.409478",
        "count": 13
    },
    {
        "address": "双柏路518号",
        "name": "双柏工业园",
        "lnglat": "121.450133,31.092589",
        "count": 10
    },
    {
        "address": "双城路803弄",
        "name": "宝莲城",
        "lnglat": "121.485255,31.389031",
        "count": 2
    },
    {
        "address": "双单路889弄",
        "name": "臻品嘉园",
        "lnglat": "121.262346,31.330755",
        "count": 56
    },
    {
        "address": "双联路88号",
        "name": "三银基金产业园",
        "lnglat": "120.554480,30.448288",
        "count": 14
    },
    {
        "address": "双流路188弄",
        "name": "宝地新品居",
        "lnglat": "121.380898,31.215118",
        "count": 37
    },
    {
        "address": "双坪路185弄",
        "name": "旭辉锦庭",
        "lnglat": "121.270001,31.405033",
        "count": 111
    },
    {
        "address": "双浦路70弄",
        "name": "花香澜庭",
        "lnglat": "121.346943,30.026295",
        "count": 44
    },
    {
        "address": "双山路167弄",
        "name": "甘泉公寓",
        "lnglat": "121.423601,31.262564",
        "count": 24
    },
    {
        "address": "双阳北路395号",
        "name": "香阁丽苑",
        "lnglat": "121.525911,31.298288",
        "count": 39
    },
    {
        "address": "双阳路300弄",
        "name": "幸福苑(上海)",
        "lnglat": "121.535624,31.273522",
        "count": 2
    },
    {
        "address": "双阳路365号",
        "name": "海林大楼",
        "lnglat": "121.534019,31.279062",
        "count": 7
    },
    {
        "address": "双阳路502弄1号",
        "name": "万昌大厦",
        "lnglat": "120.522294,30.925674",
        "count": 1
    },
    {
        "address": "双阳路50弄",
        "name": "新疆克拉玛依大厦",
        "lnglat": "122.230326,29.970649",
        "count": 9
    },
    {
        "address": "水产西路680弄",
        "name": "绿地宝里",
        "lnglat": "121.418423,31.356392",
        "count": 31
    },
    {
        "address": "水产西路999弄1-57号",
        "name": "自然居家园",
        "lnglat": "121.409567,31.353621",
        "count": 128
    },
    {
        "address": "水城路468弄",
        "name": "五洲大厦",
        "lnglat": "121.391478,31.209780",
        "count": 21
    },
    {
        "address": "水城路675号",
        "name": "怡乐公寓",
        "lnglat": "121.391370,31.212431",
        "count": 2
    },
    {
        "address": "水城南路16弄",
        "name": "四季晶园",
        "lnglat": "121.396334,31.192776",
        "count": 41
    },
    {
        "address": "水城南路17号",
        "name": "万科广场17号",
        "lnglat": "121.393628,31.193956",
        "count": 4
    },
    {
        "address": "水城南路348弄",
        "name": "金麟公寓",
        "lnglat": "121.393252,31.198104",
        "count": 8
    },
    {
        "address": "水城南路37号",
        "name": "万科广场37",
        "lnglat": "121.393422,31.194658",
        "count": 16
    },
    {
        "address": "水城南路55号",
        "name": "六月汇",
        "lnglat": "121.392900,31.196564",
        "count": 6
    },
    {
        "address": "水城南路59号",
        "name": "明珠大楼",
        "lnglat": "121.392924,31.196604",
        "count": 8
    },
    {
        "address": "水电路1412号",
        "name": "凉城地区中心办公楼(虹口图书馆)",
        "lnglat": "121.475930,31.296594",
        "count": 45
    },
    {
        "address": "水电路393弄1.2号",
        "name": "吉联大厦",
        "lnglat": "121.475283,31.276590",
        "count": 4
    },
    {
        "address": "水电路682号",
        "name": "天虹商务大厦",
        "lnglat": "121.475249,31.283082",
        "count": 4
    },
    {
        "address": "水电路688号",
        "name": "万泰大厦",
        "lnglat": "121.476034,31.283727",
        "count": 20
    },
    {
        "address": "水丰路15弄",
        "name": "帆升公寓",
        "lnglat": "121.542627,31.279821",
        "count": 27
    },
    {
        "address": "水清路378弄25支弄",
        "name": "水清二村",
        "lnglat": "121.381301,31.117135",
        "count": 23
    },
    {
        "address": "水清路999弄",
        "name": "香树丽舍(上海)",
        "lnglat": "121.375115,31.126720",
        "count": 36
    },
    {
        "address": "水泉路88弄",
        "name": "达安春之声一期",
        "lnglat": "103.218980,35.591117",
        "count": 126
    },
    {
        "address": "水泉路99弄",
        "name": "达安春之声花园二期",
        "lnglat": "121.400718,31.268850",
        "count": 124
    },
    {
        "address": "顺昌路10号",
        "name": "经纬公寓（上海）",
        "lnglat": "113.344201,22.813224",
        "count": 3
    },
    {
        "address": "顺德路92号",
        "name": "顺德苑",
        "lnglat": "121.520200,29.847280",
        "count": 16
    },
    {
        "address": "顺丰路508号",
        "name": "精品人才公寓",
        "lnglat": "121.329049,31.327848",
        "count": 4
    },
    {
        "address": "顺凌路49弄1-45号、顺凌路147号",
        "name": "金色郦苑",
        "lnglat": "121.537085,31.364750",
        "count": 50
    },
    {
        "address": "顺宁路501弄、启宁路421弄、胜竹东路3850弄、胜竹东路3870弄",
        "name": "佳兆业城市广场(上海)",
        "lnglat": "121.275509,31.405864",
        "count": 157
    },
    {
        "address": "顺平路60弄 ",
        "name": "中环和乐苑",
        "lnglat": "121.555372,31.283862",
        "count": 72
    },
    {
        "address": "顺义路188号",
        "name": "顺达公寓",
        "lnglat": "121.417634,31.230658",
        "count": 2
    },
    {
        "address": "四川北路1318号",
        "name": "上海盛邦国际大厦",
        "lnglat": "121.484710,31.251460",
        "count": 15
    },
    {
        "address": "四川北路1350号",
        "name": "利通广场",
        "lnglat": "121.484703,31.252772",
        "count": 51
    },
    {
        "address": "四川北路1363号及1361号",
        "name": "壹丰广场",
        "lnglat": "121.483530,31.252509",
        "count": 20
    },
    {
        "address": "四川北路1500号",
        "name": "叶大昌商厦(上海投资组合中心大厦)",
        "lnglat": "121.483762,31.255065",
        "count": 5
    },
    {
        "address": "四川北路1611号",
        "name": "凯润金城商务楼",
        "lnglat": "121.482557,31.257354",
        "count": 30
    },
    {
        "address": "四川北路1661号",
        "name": "凯润金城",
        "lnglat": "121.482114,31.257374",
        "count": 24
    },
    {
        "address": "四川北路1688号",
        "name": "福德商务中心",
        "lnglat": "121.483303,31.258210",
        "count": 76
    },
    {
        "address": "四川北路1717号",
        "name": "嘉杰国际广场(办公楼)",
        "lnglat": "121.482567,31.258710",
        "count": 31
    },
    {
        "address": "四川北路1727弄",
        "name": "嘉杰国际(住宅楼)",
        "lnglat": "121.482447,31.258373",
        "count": 19
    },
    {
        "address": "四川北路1851号",
        "name": "荣欣大厦",
        "lnglat": "121.483491,31.261503",
        "count": 21
    },
    {
        "address": "四川北路1885号",
        "name": "明猷商务中心",
        "lnglat": "121.483544,31.262135",
        "count": 2
    },
    {
        "address": "四川北路1915号",
        "name": "上海时装商厦",
        "lnglat": "121.483611,31.262235",
        "count": 2
    },
    {
        "address": "四川北路1941号",
        "name": "金海岸商厦",
        "lnglat": "121.483794,31.262689",
        "count": 9
    },
    {
        "address": "四川北路2115号",
        "name": "方舟大厦（上海）",
        "lnglat": "121.481488,31.265085",
        "count": 1
    },
    {
        "address": "四川北路2261-2263号",
        "name": "嘉兰大厦",
        "lnglat": "121.482926,31.268088",
        "count": 1
    },
    {
        "address": "四川北路525号",
        "name": "宇航大厦",
        "lnglat": "121.485177,31.246769",
        "count": 3
    },
    {
        "address": "四川北路818号",
        "name": "上海保利N加四川北路店",
        "lnglat": "121.485428,31.247990",
        "count": 1
    },
    {
        "address": "四川北路859号",
        "name": "上海中信广场",
        "lnglat": "121.484254,31.248357",
        "count": 40
    },
    {
        "address": "四川北路888号",
        "name": "海泰国际大厦",
        "lnglat": "121.485185,31.249530",
        "count": 2
    },
    {
        "address": "四川中路213号",
        "name": "久事商务大厦",
        "lnglat": "121.488095,31.236126",
        "count": 7
    },
    {
        "address": "四川中路320号",
        "name": "安利大楼",
        "lnglat": "121.488406,31.237622",
        "count": 8
    },
    {
        "address": "四川中路321号",
        "name": "中央大厦",
        "lnglat": "121.487859,31.237713",
        "count": 18
    },
    {
        "address": "四达路58弄",
        "name": "世博花园",
        "lnglat": "106.491944,29.431307",
        "count": 117
    },
    {
        "address": "四平路1147弄1、8、9号",
        "name": "伊顿公寓",
        "lnglat": "121.503914,31.278201",
        "count": 20
    },
    {
        "address": "四平路1188号",
        "name": "远洋广场",
        "lnglat": "121.504622,31.277980",
        "count": 3
    },
    {
        "address": "四平路1230弄甲",
        "name": "通华小区",
        "lnglat": "121.506032,31.280045",
        "count": 10
    },
    {
        "address": "四平路1388号",
        "name": "同济联合广场",
        "lnglat": "121.507312,31.281404",
        "count": 15
    },
    {
        "address": "四平路188号",
        "name": "上海商贸大厦",
        "lnglat": "87.582473,43.905513",
        "count": 3
    },
    {
        "address": "四平路200号",
        "name": "盛泰国际大厦",
        "lnglat": "121.491257,31.262872",
        "count": 3
    },
    {
        "address": "四平路210号",
        "name": "家纺大厦",
        "lnglat": "121.490901,31.263597",
        "count": 2
    },
    {
        "address": "四平路2158号",
        "name": "富庆国定大厦",
        "lnglat": "121.513710,31.294690",
        "count": 17
    },
    {
        "address": "四平路228号",
        "name": "大世界商务大厦",
        "lnglat": "121.491335,31.264406",
        "count": 6
    },
    {
        "address": "四平路2500号",
        "name": "悠迈生活广场",
        "lnglat": "121.515810,31.298613",
        "count": 7
    },
    {
        "address": "四平路2500弄",
        "name": "金岛大厦",
        "lnglat": "87.585903,43.899481",
        "count": 12
    },
    {
        "address": "四平路257号",
        "name": "永融企业中心",
        "lnglat": "87.580331,43.907027",
        "count": 11
    },
    {
        "address": "四平路277号",
        "name": "福龙大厦（上海）",
        "lnglat": "119.397168,36.023324",
        "count": 5
    },
    {
        "address": "四平路283号",
        "name": "虹临花园嘉园",
        "lnglat": "121.489792,31.263728",
        "count": 52
    },
    {
        "address": "四平路311号",
        "name": "恒城花苑",
        "lnglat": "121.490903,31.265215",
        "count": 4
    },
    {
        "address": "四平路415号（四达路58弄靠近世博花园）",
        "name": "馥敦坊",
        "lnglat": "121.486296,31.267702",
        "count": 42
    },
    {
        "address": "四平路460弄",
        "name": "新陆花苑",
        "lnglat": "121.493296,31.266706",
        "count": 30
    },
    {
        "address": "四平路623号",
        "name": "新宏大厦",
        "lnglat": "121.496247,31.270586",
        "count": 9
    },
    {
        "address": "四平路758弄",
        "name": "金轩大邸",
        "lnglat": "121.498866,31.271043",
        "count": 80
    },
    {
        "address": "四平路775弄",
        "name": "天宝华庭",
        "lnglat": "121.498735,31.272763",
        "count": 22
    },
    {
        "address": "四平路778号",
        "name": "盛业大厦",
        "lnglat": "121.499189,31.272260",
        "count": 2
    },
    {
        "address": "四平路96号",
        "name": "金融街海伦中心D座",
        "lnglat": "119.115935,36.710859",
        "count": 25
    },
    {
        "address": "泗凤公路1500弄",
        "name": "新凯城玉兰苑",
        "lnglat": "121.237459,31.109940",
        "count": 35
    },
    {
        "address": "泗凤公路1718弄1-22号",
        "name": "新凯城丹桂苑",
        "lnglat": "121.232482,31.109778",
        "count": 25
    },
    {
        "address": "泗凤公路508弄",
        "name": "金地自在城三期",
        "lnglat": "121.254467,31.113856",
        "count": 118
    },
    {
        "address": "泗凯路415弄",
        "name": "新凯城钟秀苑",
        "lnglat": "121.237127,31.112593",
        "count": 32
    },
    {
        "address": "泗通路246号",
        "name": "嘉南红塔大厦",
        "lnglat": "121.256100,31.117228",
        "count": 29
    },
    {
        "address": "泗通路688弄",
        "name": "万业名苑",
        "lnglat": "121.255992,31.125963",
        "count": 87
    },
    {
        "address": "泗祥路518弄",
        "name": "金地自在城二期",
        "lnglat": "121.250525,31.118872",
        "count": 54
    },
    {
        "address": "泗砖路269弄",
        "name": "唯富科技产业园",
        "lnglat": "121.285864,31.106109",
        "count": 23
    },
    {
        "address": "泗砖路600号",
        "name": "松江钢材城南区园区",
        "lnglat": "121.283451,31.100101",
        "count": 81
    },
    {
        "address": "泗砖南路255弄",
        "name": "名企公馆新桥艺术园区",
        "lnglat": "121.284638,31.068907",
        "count": 79
    },
    {
        "address": "松东路326号",
        "name": "锐服高新技术产业园",
        "lnglat": "121.253971,31.021760",
        "count": 1
    },
    {
        "address": "松花江路205弄",
        "name": "松花江路205弄小区",
        "lnglat": "106.711971,26.500914",
        "count": 8
    },
    {
        "address": "松花江路215弄",
        "name": "延吉大楼",
        "lnglat": "106.711976,26.501149",
        "count": 8
    },
    {
        "address": "松花江路251弄",
        "name": "白玉兰广场",
        "lnglat": "121.821933,29.918262",
        "count": 35
    },
    {
        "address": "松花江路2539号",
        "name": "复旦科技园创业大厦",
        "lnglat": "121.499286,31.290526",
        "count": 12
    },
    {
        "address": "松花江路2628号",
        "name": "冠寓_复旦大学店",
        "lnglat": "121.498949,31.292580",
        "count": 5
    },
    {
        "address": "松花江路287号",
        "name": "伊格尔公寓",
        "lnglat": "121.822228,29.918861",
        "count": 7
    },
    {
        "address": "松花江路311-319号",
        "name": "松益公寓",
        "lnglat": "115.546957,35.265966",
        "count": 16
    },
    {
        "address": "松汇中路351号",
        "name": "天汇佳园",
        "lnglat": "121.239399,31.001015",
        "count": 24
    },
    {
        "address": "松汇中路758弄",
        "name": "醉白景苑",
        "lnglat": "121.229779,31.004551",
        "count": 24
    },
    {
        "address": "松江区同利路2-4号",
        "name": "福贵诚工业园",
        "lnglat": "121.318255,31.109649",
        "count": 45
    },
    {
        "address": "松兰路198弄",
        "name": "春江美庐",
        "lnglat": "121.451881,31.368148",
        "count": 66
    },
    {
        "address": "松林路111号",
        "name": "海怡私家花园",
        "lnglat": "104.630841,30.120595",
        "count": 29
    },
    {
        "address": "松林路283-287号",
        "name": "新港大厦(松林路)",
        "lnglat": "106.122007,30.784939",
        "count": 3
    },
    {
        "address": "松林路97弄",
        "name": "海怡别墅",
        "lnglat": "104.630531,30.120786",
        "count": 15
    },
    {
        "address": "松胜路758号",
        "name": "松胜路758号商务楼",
        "lnglat": "121.276590,31.023094",
        "count": 14
    },
    {
        "address": "松卫北路280号",
        "name": "凯富家园广场5号楼",
        "lnglat": "121.259930,31.028857",
        "count": 10
    },
    {
        "address": "松卫北路295号",
        "name": "上海陆国时代商务大厦",
        "lnglat": "121.261160,31.030130",
        "count": 4
    },
    {
        "address": "松卫北路665号",
        "name": "企福天地",
        "lnglat": "121.261768,31.023318",
        "count": 10
    },
    {
        "address": "松卫北路819号",
        "name": "光电大楼",
        "lnglat": "121.262389,31.020350",
        "count": 6
    },
    {
        "address": "凇桥东路111号",
        "name": "021联和滨江大厦",
        "lnglat": "108.257070,24.831160",
        "count": 16
    },
    {
        "address": "菘波路1717号",
        "name": "茸锦青浦科创园",
        "lnglat": "82.885121,41.714813",
        "count": 32
    },
    {
        "address": "崧复路1999号",
        "name": "奥帛科创园",
        "lnglat": "121.165632,31.183096",
        "count": 10
    },
    {
        "address": "崧复路777号",
        "name": "集池宇科创空间",
        "lnglat": "121.165910,31.164706",
        "count": 4
    },
    {
        "address": "崧华路666号",
        "name": "WEIHUAPARK",
        "lnglat": "121.171166,31.159186",
        "count": 4
    },
    {
        "address": "崧建路339弄",
        "name": "佳兆业君汇上品（上海）",
        "lnglat": "121.193239,31.196699",
        "count": 156
    },
    {
        "address": "崧涟二路66弄",
        "name": "昱翠雅苑",
        "lnglat": "121.160143,31.139232",
        "count": 55
    },
    {
        "address": "崧润路1176弄",
        "name": "秀景苑一期",
        "lnglat": "121.159725,31.165066",
        "count": 31
    },
    {
        "address": "崧润路49弄",
        "name": "德康雅苑",
        "lnglat": "121.158765,31.144460",
        "count": 99
    },
    {
        "address": "崧润路800弄",
        "name": "逸泰雅苑二期",
        "lnglat": "121.160100,31.158461",
        "count": 202
    },
    {
        "address": "崧泽大道2229弄47-57号",
        "name": "天空之城虹之森",
        "lnglat": "121.254479,31.177923",
        "count": 15
    },
    {
        "address": "崧泽大道2333弄",
        "name": "万科天空之城云之谷",
        "lnglat": "121.246469,31.176128",
        "count": 112
    },
    {
        "address": "崧泽大道333号",
        "name": "国家会展中心(上海)",
        "lnglat": "121.301464,31.189896",
        "count": 186
    },
    {
        "address": "崧泽大道6555号",
        "name": "奥帛置业大厦",
        "lnglat": "121.176406,31.174568",
        "count": 6
    },
    {
        "address": "崧泽大道6698号",
        "name": "圆益科创园",
        "lnglat": "121.171605,31.175627",
        "count": 2
    },
    {
        "address": "崧泽大道6699号",
        "name": "百丽商务大厦",
        "lnglat": "121.173377,31.174377",
        "count": 10
    },
    {
        "address": "崧子浦路289弄",
        "name": "崧子苑",
        "lnglat": "121.084075,31.145467",
        "count": 112
    },
    {
        "address": "崧子浦路55弄",
        "name": "顾会庭",
        "lnglat": "121.085161,31.143104",
        "count": 168
    },
    {
        "address": "淞宝路155弄",
        "name": "星月国际商务广场",
        "lnglat": "121.500926,31.380459",
        "count": 50
    },
    {
        "address": "淞发路25弄",
        "name": "鎏园",
        "lnglat": "121.498178,31.344253",
        "count": 92
    },
    {
        "address": "淞发路500弄",
        "name": "万临家园",
        "lnglat": "121.489819,31.342177",
        "count": 102
    },
    {
        "address": "淞发路901弄",
        "name": "祥腾生活广场之公寓楼",
        "lnglat": "121.487245,31.342729",
        "count": 6
    },
    {
        "address": "淞虹路128弄",
        "name": "金淞家园",
        "lnglat": "121.361951,31.221762",
        "count": 63
    },
    {
        "address": "淞虹路855弄",
        "name": "郁庭峰",
        "lnglat": "121.362397,31.205702",
        "count": 77
    },
    {
        "address": "淞沪路161号",
        "name": "中环国际大厦",
        "lnglat": "121.513354,31.303279",
        "count": 4
    },
    {
        "address": "淞沪路1号",
        "name": "巴黎春天(五角场店)",
        "lnglat": "121.514543,31.300770",
        "count": 16
    },
    {
        "address": "淞沪路388号",
        "name": "创智天地",
        "lnglat": "121.512897,31.307515",
        "count": 31
    },
    {
        "address": "淞沪路98号",
        "name": "平盛大厦",
        "lnglat": "121.514851,31.302908",
        "count": 10
    },
    {
        "address": "淞良路99弄",
        "name": "盛世宝邸二期",
        "lnglat": "121.492101,31.335382",
        "count": 88
    },
    {
        "address": "淞肇路333弄",
        "name": "新城尚景苑",
        "lnglat": "121.482313,31.342960",
        "count": 65
    },
    {
        "address": "宋园路62号",
        "name": "开城大厦",
        "lnglat": "121.414065,31.191477",
        "count": 4
    },
    {
        "address": "宋园路62弄",
        "name": "开城公寓",
        "lnglat": "121.413646,31.191678",
        "count": 18
    },
    {
        "address": "宋园路69号",
        "name": "圣美邸",
        "lnglat": "121.413023,31.191866",
        "count": 18
    },
    {
        "address": "苏家浜路435弄",
        "name": "宝顾佳苑",
        "lnglat": "121.391879,31.359847",
        "count": 36
    },
    {
        "address": "绥德路470弄128号",
        "name": "海天下集团",
        "lnglat": "121.370181,31.268195",
        "count": 16
    },
    {
        "address": "绥德路889弄",
        "name": "3点3万小区",
        "lnglat": "121.361210,31.266057",
        "count": 12
    },
    {
        "address": "绥德路与祁连山南路交叉口西280米",
        "name": "多礼米",
        "lnglat": "121.376111,31.264962",
        "count": 2
    },
    {
        "address": "绥化路158弄、228弄",
        "name": "新月锦绣园",
        "lnglat": "121.433208,31.406091",
        "count": 36
    },
    {
        "address": "绥化路260号",
        "name": "宝莲湖景园",
        "lnglat": "121.429220,31.405864",
        "count": 84
    },
    {
        "address": "绥化路265弄",
        "name": "万升家园(万昇家园)",
        "lnglat": "121.427563,31.406627",
        "count": 32
    },
    {
        "address": "绥化路50弄",
        "name": "庆安苑",
        "lnglat": "121.436495,31.404738",
        "count": 12
    },
    {
        "address": "塔城东路288弄",
        "name": "嘉贤庄",
        "lnglat": "121.272224,31.391747",
        "count": 87
    },
    {
        "address": "塔城路718弄",
        "name": "金地格林春岸",
        "lnglat": "121.239114,31.373482",
        "count": 69
    },
    {
        "address": "台儿庄路666弄",
        "name": "金桥名都",
        "lnglat": "121.596136,31.254737",
        "count": 150
    },
    {
        "address": "台中南路2号",
        "name": "新贸楼",
        "lnglat": "121.606509,31.315874",
        "count": 4
    },
    {
        "address": "台中南路68号",
        "name": "远洋洲海大厦",
        "lnglat": "121.608464,31.315400",
        "count": 63
    },
    {
        "address": "太仓路233号",
        "name": "新茂大厦",
        "lnglat": "121.473636,31.220713",
        "count": 51
    },
    {
        "address": "太阳山路188弄、长兴路168弄",
        "name": "中海万锦城二_三期",
        "lnglat": "121.461978,31.250227",
        "count": 80
    },
    {
        "address": "太原路289弄",
        "name": "太原邸",
        "lnglat": "121.457036,31.203839",
        "count": 6
    },
    {
        "address": "泰谷路168号",
        "name": "烨博智慧园",
        "lnglat": "121.603441,31.335345",
        "count": 5
    },
    {
        "address": "泰谷路169号",
        "name": "华源国际大厦(上海)",
        "lnglat": "121.603297,31.334612",
        "count": 15
    },
    {
        "address": "泰谷路18号",
        "name": "鲁能大厦(外高桥写字楼)",
        "lnglat": "121.597690,31.332939",
        "count": 4
    },
    {
        "address": "泰谷路239号",
        "name": "天啸大厦",
        "lnglat": "121.607023,31.336902",
        "count": 11
    },
    {
        "address": "泰谷路85号",
        "name": "永富大楼",
        "lnglat": "121.600717,31.333592",
        "count": 9
    },
    {
        "address": "泰和路2038号",
        "name": "北外环信息产业园(北上海创意港）",
        "lnglat": "121.438475,31.355536",
        "count": 37
    },
    {
        "address": "泰康路210弄",
        "name": "田子坊5号楼",
        "lnglat": "121.469026,31.208484",
        "count": 3
    },
    {
        "address": "泰青公路119弄128支弄1-16号",
        "name": "申亚翠庭",
        "lnglat": "121.567340,30.984166",
        "count": 60
    },
    {
        "address": "泰涛路55号",
        "name": "晨日产业园",
        "lnglat": "121.252330,31.312045",
        "count": 14
    },
    {
        "address": "泰兴路555号",
        "name": "武泰公寓",
        "lnglat": "121.456377,31.236129",
        "count": 12
    },
    {
        "address": "泰兴路625弄",
        "name": "泰府名邸",
        "lnglat": "121.455942,31.236709",
        "count": 74
    },
    {
        "address": "谈家渡路28号",
        "name": "盛泉大厦",
        "lnglat": "121.422065,31.234387",
        "count": 4
    },
    {
        "address": "唐山路1018号",
        "name": "宝地广场",
        "lnglat": "121.511865,31.261391",
        "count": 22
    },
    {
        "address": "唐山路835弄",
        "name": "家化公寓",
        "lnglat": "121.508401,31.259527",
        "count": 14
    },
    {
        "address": "唐山路921号",
        "name": "木材大厦",
        "lnglat": "121.509128,31.259956",
        "count": 1
    },
    {
        "address": "塘沽路463号",
        "name": "虹口科技金融大厦",
        "lnglat": "121.486169,31.248082",
        "count": 10
    },
    {
        "address": "塘沽路835号",
        "name": "万豪公寓",
        "lnglat": "121.479424,31.246049",
        "count": 18
    },
    {
        "address": "塘浚路51弄",
        "name": "塘和家园齐康苑",
        "lnglat": "121.245950,31.090508",
        "count": 54
    },
    {
        "address": "塘祁路577弄",
        "name": "保利叶之林二期",
        "lnglat": "121.376116,31.325728",
        "count": 91
    },
    {
        "address": "塘祁路677-679弄",
        "name": "保利叶之林三期",
        "lnglat": "121.375140,31.325886",
        "count": 78
    },
    {
        "address": "塘桥路400弄",
        "name": "新塘桥生活广场",
        "lnglat": "121.518190,31.210916",
        "count": 21
    },
    {
        "address": "塘桥新路201弄",
        "name": "东方天伦大厦",
        "lnglat": "121.515846,31.211279",
        "count": 8
    },
    {
        "address": "桃林路1141弄",
        "name": "新天家园",
        "lnglat": "121.542775,31.226639",
        "count": 42
    },
    {
        "address": "桃林路18号",
        "name": "环球广场",
        "lnglat": "104.887732,26.578345",
        "count": 57
    },
    {
        "address": "桃林路777号",
        "name": "鄂尔多斯艾力（上海）",
        "lnglat": "111.703300,28.945094",
        "count": 4
    },
    {
        "address": "桃浦路165弄",
        "name": "嘉发公寓",
        "lnglat": "121.399982,31.260460",
        "count": 24
    },
    {
        "address": "桃浦路226号",
        "name": "泊寓上海西站店",
        "lnglat": "121.396743,31.260457",
        "count": 19
    },
    {
        "address": "桃浦路296号",
        "name": "星河世纪广场",
        "lnglat": "121.395308,31.260514",
        "count": 30
    },
    {
        "address": "桃浦路321弄",
        "name": "星河世纪城__樱树芳庭",
        "lnglat": "121.394212,31.258880",
        "count": 55
    },
    {
        "address": "桃源路111弄",
        "name": "淮海晶华苑",
        "lnglat": "109.760850,38.299633",
        "count": 22
    },
    {
        "address": "天宝路181弄",
        "name": "瑞虹新城 铭庭",
        "lnglat": "108.974791,34.914863",
        "count": 12
    },
    {
        "address": "天宝路558号",
        "name": "中信和平家园",
        "lnglat": "121.498060,31.268504",
        "count": 67
    },
    {
        "address": "天宝路900号",
        "name": "天宝创业空间",
        "lnglat": "121.500646,31.272549",
        "count": 8
    },
    {
        "address": "天等路128弄",
        "name": "明秀公寓",
        "lnglat": "121.429641,31.133285",
        "count": 10
    },
    {
        "address": "天等路400号(近丹棱路)",
        "name": "凌云里",
        "lnglat": "121.427668,31.137264",
        "count": 2
    },
    {
        "address": "天工路857号",
        "name": "金创园一期",
        "lnglat": "121.337810,30.824716",
        "count": 2
    },
    {
        "address": "天津路180号",
        "name": "应氏大厦",
        "lnglat": "114.298641,30.584324",
        "count": 2
    },
    {
        "address": "天目西路111号",
        "name": "慧空间(长三角乡村振兴联合服务平台)",
        "lnglat": "121.457832,31.246494",
        "count": 5
    },
    {
        "address": "天目西路218号",
        "name": "嘉里不夜城一期",
        "lnglat": "121.456919,31.245138",
        "count": 3
    },
    {
        "address": "天目西路290号",
        "name": "康吉大厦（市政楼）",
        "lnglat": "121.455536,31.245608",
        "count": 10
    },
    {
        "address": "天目西路511号",
        "name": "外贸锦程大厦",
        "lnglat": "121.451439,31.246258",
        "count": 7
    },
    {
        "address": "天目西路99号",
        "name": "丽丰天际中心",
        "lnglat": "121.458530,31.246689",
        "count": 18
    },
    {
        "address": "天目中路353号",
        "name": "万佳商务中心",
        "lnglat": "119.695565,30.633406",
        "count": 3
    },
    {
        "address": "天目中路363号",
        "name": "万佳商务楼",
        "lnglat": "121.467957,31.245270",
        "count": 7
    },
    {
        "address": "天目中路380号",
        "name": "北方大厦",
        "lnglat": "119.695076,30.632978",
        "count": 11
    },
    {
        "address": "天目中路428号",
        "name": "凯旋门大厦（上海）",
        "lnglat": "119.695029,30.632192",
        "count": 76
    },
    {
        "address": "天目中路520号",
        "name": "北苑大厦(520号)",
        "lnglat": "121.465340,31.243952",
        "count": 10
    },
    {
        "address": "天目中路538弄1号",
        "name": "北苑大厦(538弄1号)",
        "lnglat": "119.695349,30.629723",
        "count": 7
    },
    {
        "address": "天目中路585号",
        "name": "新梅大厦",
        "lnglat": "119.695276,30.628763",
        "count": 6
    },
    {
        "address": "天目中路749弄71号",
        "name": "海鸥康恒大厦",
        "lnglat": "121.462035,31.247300",
        "count": 6
    },
    {
        "address": "天宁路51号",
        "name": "福缘集团园区",
        "lnglat": "120.855650,30.741359",
        "count": 20
    },
    {
        "address": "天山路88号",
        "name": "元丰天山花园",
        "lnglat": "81.328218,43.927334",
        "count": 142
    },
    {
        "address": "天山西路125号",
        "name": "宜嘉坊",
        "lnglat": "121.374960,31.216119",
        "count": 18
    },
    {
        "address": "天山西路541号",
        "name": "光大安石虹桥中心",
        "lnglat": "121.359693,31.217843",
        "count": 10
    },
    {
        "address": "天山西路567号",
        "name": "神州智慧天地",
        "lnglat": "121.356699,31.217870",
        "count": 14
    },
    {
        "address": "天山西路568号",
        "name": "统一梦时代大厦",
        "lnglat": "121.360414,31.219006",
        "count": 11
    },
    {
        "address": "天山西路789号",
        "name": "中山国际广场",
        "lnglat": "121.355286,31.218004",
        "count": 7
    },
    {
        "address": "天山支路138弄",
        "name": "雍景园",
        "lnglat": "121.397146,31.215408",
        "count": 14
    },
    {
        "address": "天山支路158号",
        "name": "嘉平商务楼",
        "lnglat": "121.396872,31.214536",
        "count": 3
    },
    {
        "address": "天山支路168弄",
        "name": "虹桥电子时代广场",
        "lnglat": "121.396306,31.215204",
        "count": 3
    },
    {
        "address": "天山支路201号",
        "name": "长宁科技大楼",
        "lnglat": "121.396065,31.213609",
        "count": 20
    },
    {
        "address": "天潼路133号",
        "name": "上海家化金融大厦",
        "lnglat": "121.488641,31.245819",
        "count": 4
    },
    {
        "address": "天潼路328号",
        "name": "上海星荟中心",
        "lnglat": "121.486471,31.246276",
        "count": 16
    },
    {
        "address": "天雄路588弄",
        "name": "医谷现代商务园一期",
        "lnglat": "115.174882,36.290187",
        "count": 11
    },
    {
        "address": "天钥桥路1188号",
        "name": "创邑朵云轩",
        "lnglat": "121.447236,31.174642",
        "count": 17
    },
    {
        "address": "天钥桥路123号",
        "name": "城开YOYO联合办公",
        "lnglat": "121.442028,31.192403",
        "count": 12
    },
    {
        "address": "天钥桥路180弄",
        "name": "徐家汇馆(华狮国际公寓)",
        "lnglat": "121.441875,31.191020",
        "count": 12
    },
    {
        "address": "天钥桥路180弄8号",
        "name": "南馨公寓",
        "lnglat": "121.440986,31.190998",
        "count": 10
    },
    {
        "address": "天钥桥路191弄",
        "name": "南天大楼",
        "lnglat": "121.442605,31.191128",
        "count": 28
    },
    {
        "address": "天钥桥路20号",
        "name": "T20(百胜集团大楼)",
        "lnglat": "121.440338,31.193860",
        "count": 7
    },
    {
        "address": "天钥桥路218号",
        "name": "华狮国际公寓",
        "lnglat": "121.442068,31.190688",
        "count": 2
    },
    {
        "address": "天钥桥路30号",
        "name": "美罗大厦",
        "lnglat": "121.440538,31.193002",
        "count": 5
    },
    {
        "address": "天钥桥路321号",
        "name": "天和苑综合办公楼",
        "lnglat": "121.442619,31.189382",
        "count": 13
    },
    {
        "address": "天钥桥路325号",
        "name": "嘉汇国际广场",
        "lnglat": "121.442888,31.188805",
        "count": 17
    },
    {
        "address": "天钥桥路333号",
        "name": "上海腾飞大厦",
        "lnglat": "121.442493,31.188061",
        "count": 13
    },
    {
        "address": "天钥桥路380弄",
        "name": "通汇公寓",
        "lnglat": "121.439853,31.188076",
        "count": 16
    },
    {
        "address": "天钥桥路380弄20-28号",
        "name": "天钥花苑",
        "lnglat": "121.440140,31.188335",
        "count": 21
    },
    {
        "address": "天钥桥路380弄36号37号",
        "name": "南溪公寓",
        "lnglat": "121.439064,31.187696",
        "count": 5
    },
    {
        "address": "天钥桥路438号，458号",
        "name": "申峰大厦",
        "lnglat": "121.441939,31.187218",
        "count": 24
    },
    {
        "address": "天钥桥路500弄",
        "name": "新贵都万体景苑",
        "lnglat": "121.442099,31.186087",
        "count": 26
    },
    {
        "address": "天钥桥路69弄",
        "name": "凯歌公寓",
        "lnglat": "121.441903,31.193697",
        "count": 9
    },
    {
        "address": "天钥桥路69弄 ",
        "name": "科汇公寓（上海）",
        "lnglat": "121.441903,31.193697",
        "count": 21
    },
    {
        "address": "天钥桥路811号",
        "name": "鹏欣公寓",
        "lnglat": "121.443798,31.184101",
        "count": 6
    },
    {
        "address": "天钥桥路859号",
        "name": "北海大厦",
        "lnglat": "121.443831,31.183790",
        "count": 18
    },
    {
        "address": "天钥桥路869号",
        "name": "美晶佳园",
        "lnglat": "121.444314,31.182594",
        "count": 2
    },
    {
        "address": "天钥桥路907号",
        "name": "天龙公寓",
        "lnglat": "121.445282,31.179090",
        "count": 8
    },
    {
        "address": "天钥桥路909-915号",
        "name": "D1国际创意空间",
        "lnglat": "121.445801,31.178679",
        "count": 4
    },
    {
        "address": "天钥桥路93号",
        "name": "中福实业大厦",
        "lnglat": "121.441681,31.193105",
        "count": 7
    },
    {
        "address": "天钥桥南路1111号",
        "name": "誉仁家园",
        "lnglat": "121.455489,31.156465",
        "count": 10
    },
    {
        "address": "天一路568号",
        "name": "8090青年创业基地青浦新城园",
        "lnglat": "121.108492,31.196722",
        "count": 69
    },
    {
        "address": "天祝路377弄",
        "name": "华都商务广场",
        "lnglat": "121.263419,31.347647",
        "count": 28
    },
    {
        "address": "天祝路555弄",
        "name": "合景峰汇嘉苑",
        "lnglat": "121.259064,31.345049",
        "count": 18
    },
    {
        "address": "天祝路789弄",
        "name": "金嘉商务广场",
        "lnglat": "121.255505,31.343963",
        "count": 38
    },
    {
        "address": "天祝路818号",
        "name": "嘉鼎国际大厦",
        "lnglat": "121.256875,31.346745",
        "count": 9
    },
    {
        "address": "田东路377弄3号",
        "name": "金衡公寓",
        "lnglat": "113.133955,27.880391",
        "count": 33
    },
    {
        "address": "田东路69弄",
        "name": "科汇景苑",
        "lnglat": "113.791606,23.170379",
        "count": 15
    },
    {
        "address": "田东路70弄",
        "name": "华南公寓",
        "lnglat": "121.440792,31.172094",
        "count": 20
    },
    {
        "address": "田林东路100弄",
        "name": "爱建园",
        "lnglat": "121.432584,31.175038",
        "count": 311
    },
    {
        "address": "田林东路556弄",
        "name": "田林亲家",
        "lnglat": "121.425932,31.172796",
        "count": 6
    },
    {
        "address": "田林东路55号",
        "name": "汇阳广场",
        "lnglat": "121.433260,31.174268",
        "count": 2
    },
    {
        "address": "田林东路568号对面",
        "name": "田林十一村",
        "lnglat": "121.425508,31.172473",
        "count": 21
    },
    {
        "address": "田林路1016号",
        "name": "科技绿洲三期",
        "lnglat": "121.387916,31.164901",
        "count": 34
    },
    {
        "address": "田林路130号",
        "name": "越界田林坊",
        "lnglat": "121.414571,31.171551",
        "count": 13
    },
    {
        "address": "田林路300号",
        "name": "田林大楼",
        "lnglat": "121.402140,31.167906",
        "count": 3
    },
    {
        "address": "田林路388号",
        "name": "新业大楼",
        "lnglat": "121.398206,31.167291",
        "count": 28
    },
    {
        "address": "田林路418号",
        "name": "徐汇乐业天地",
        "lnglat": "121.396198,31.166473",
        "count": 6
    },
    {
        "address": "田州路99号",
        "name": "新安大厦",
        "lnglat": "121.396139,31.162485",
        "count": 3
    },
    {
        "address": "铁岭路32号",
        "name": "同叶大厦",
        "lnglat": "121.514504,31.278093",
        "count": 12
    },
    {
        "address": "铁岭路50弄23号",
        "name": "铁岭大楼",
        "lnglat": "121.514744,31.279867",
        "count": 9
    },
    {
        "address": "听潮路101号",
        "name": "南发集团大楼",
        "lnglat": "121.741964,31.048076",
        "count": 1
    },
    {
        "address": "听达路185弄",
        "name": "丽水雅苑北苑",
        "lnglat": "121.754942,31.071297",
        "count": 88
    },
    {
        "address": "听达路325弄",
        "name": "丽水雅苑南苑",
        "lnglat": "121.755515,31.067697",
        "count": 87
    },
    {
        "address": "听健路151弄",
        "name": "秀园西园",
        "lnglat": "121.744843,31.067232",
        "count": 43
    },
    {
        "address": "听康路181弄",
        "name": "文竹苑南苑",
        "lnglat": "121.748435,31.067424",
        "count": 71
    },
    {
        "address": "听康路190弄",
        "name": "秀园东园",
        "lnglat": "121.746499,31.067523",
        "count": 44
    },
    {
        "address": "听康路79弄",
        "name": "文竹苑北苑",
        "lnglat": "121.748017,31.069422",
        "count": 100
    },
    {
        "address": "听悦路1200弄",
        "name": "惠益绿苑西苑",
        "lnglat": "121.739162,31.064130",
        "count": 14
    },
    {
        "address": "通波路725弄",
        "name": "安琪佳苑",
        "lnglat": "121.236839,31.040490",
        "count": 76
    },
    {
        "address": "通阁路150号",
        "name": "长信公寓",
        "lnglat": "121.471077,31.258591",
        "count": 7
    },
    {
        "address": "通河路1号",
        "name": "乐业创意中心",
        "lnglat": "113.325438,30.926561",
        "count": 3
    },
    {
        "address": "通河路438弄",
        "name": "住嘉新苑",
        "lnglat": "121.446190,31.334225",
        "count": 24
    },
    {
        "address": "通河一村1号-4号",
        "name": "通河一村",
        "lnglat": "128.872262,46.021046",
        "count": 56
    },
    {
        "address": "通济路1279弄",
        "name": "秀园北苑",
        "lnglat": "121.745592,31.067235",
        "count": 40
    },
    {
        "address": "通南路91弄99支弄",
        "name": "上海骏景雅苑",
        "lnglat": "121.475031,31.341452",
        "count": 99
    },
    {
        "address": "通协路288弄",
        "name": "旭辉虹桥国际广场",
        "lnglat": "121.353782,31.227125",
        "count": 54
    },
    {
        "address": "通州路88弄",
        "name": "海泰苑",
        "lnglat": "121.498867,31.254911",
        "count": 24
    },
    {
        "address": "同丰路667号",
        "name": "紫金公馆",
        "lnglat": "121.468185,31.273473",
        "count": 19
    },
    {
        "address": "同济路669弄7号楼",
        "name": "火炬城市峰汇",
        "lnglat": "121.481214,31.395740",
        "count": 11
    },
    {
        "address": "同济支路157号",
        "name": "智慧柒立方",
        "lnglat": "121.491032,31.378494",
        "count": 5
    },
    {
        "address": "同济支路199号",
        "name": "智慧柒立方二期",
        "lnglat": "121.491406,31.378795",
        "count": 26
    },
    {
        "address": "同凯路228弄",
        "name": "建邦国宸府（建邦华庭）",
        "lnglat": "121.363285,30.734916",
        "count": 86
    },
    {
        "address": "同乐路566弄",
        "name": "斌娇智能科创园",
        "lnglat": "108.609893,23.432302",
        "count": 4
    },
    {
        "address": "同普路1130弄9号",
        "name": "璨申智创工坊",
        "lnglat": "121.371902,31.231871",
        "count": 2
    },
    {
        "address": "同普路1153弄",
        "name": "云岭坊2期",
        "lnglat": "121.371769,31.230331",
        "count": 1
    },
    {
        "address": "同普路1175弄",
        "name": "同普坊",
        "lnglat": "121.370890,31.230352",
        "count": 4
    },
    {
        "address": "同普路1220号",
        "name": "同普大厦",
        "lnglat": "121.370290,31.232713",
        "count": 15
    },
    {
        "address": "同普路1225弄",
        "name": "真北坊",
        "lnglat": "121.369926,31.231014",
        "count": 2
    },
    {
        "address": "同普路1412号",
        "name": "长征工业设计中心",
        "lnglat": "121.366891,31.234547",
        "count": 10
    },
    {
        "address": "同普路1501弄",
        "name": "牡丹苑",
        "lnglat": "121.361680,31.232810",
        "count": 126
    },
    {
        "address": "同普路1680弄",
        "name": "玫瑰苑（上海）",
        "lnglat": "121.360679,31.234786",
        "count": 24
    },
    {
        "address": "同普路299弄",
        "name": "浙铁绿城长风中心",
        "lnglat": "121.420113,31.236925",
        "count": 20
    },
    {
        "address": "同心路1115弄",
        "name": "春满园B区",
        "lnglat": "102.665112,25.107133",
        "count": 36
    },
    {
        "address": "同心路116弄1号",
        "name": "同心苑",
        "lnglat": "113.023105,25.804341",
        "count": 7
    },
    {
        "address": "同心路28弄",
        "name": "嘉宏紫薇园",
        "lnglat": "97.790329,24.186091",
        "count": 42
    },
    {
        "address": "同心路3号",
        "name": "同和苑",
        "lnglat": "111.048085,39.056691",
        "count": 7
    },
    {
        "address": "彤闻路199弄",
        "name": "古北萃庭二期",
        "lnglat": "121.163037,31.319442",
        "count": 38
    },
    {
        "address": "彤闻路77弄",
        "name": "古北萃庭一期",
        "lnglat": "121.163322,31.318999",
        "count": 56
    },
    {
        "address": "铜川路1422弄",
        "name": "绿洲公寓",
        "lnglat": "121.393855,31.252183",
        "count": 28
    },
    {
        "address": "铜川路1615弄",
        "name": "佳祥公寓",
        "lnglat": "121.390083,31.251029",
        "count": 8
    },
    {
        "address": "铜川路2655弄",
        "name": "鼎秀园",
        "lnglat": "121.365766,31.255178",
        "count": 170
    },
    {
        "address": "铜仁路258号",
        "name": "九安广场",
        "lnglat": "121.450183,31.226581",
        "count": 12
    },
    {
        "address": "图门路6号",
        "name": "沧达大厦",
        "lnglat": "106.683326,26.543461",
        "count": 4
    },
    {
        "address": "团汇公路258弄",
        "name": "逸贤雅苑",
        "lnglat": "121.508899,30.955829",
        "count": 42
    },
    {
        "address": "团汇公路479弄",
        "name": "汇港苑",
        "lnglat": "121.512535,30.959867",
        "count": 24
    },
    {
        "address": "团林路38号",
        "name": "猫之家团林路店(精品公寓)",
        "lnglat": "121.570162,31.263557",
        "count": 4
    },
    {
        "address": "袜子弄18号",
        "name": "G60米念PARK创业园",
        "lnglat": "121.242115,31.009319",
        "count": 6
    },
    {
        "address": "外高桥保税区奥纳路18号",
        "name": "奥吉大厦",
        "lnglat": "121.589894,31.344362",
        "count": 7
    },
    {
        "address": "外高桥保税区基隆路1号",
        "name": "汤臣国际贸易大楼",
        "lnglat": "121.587682,31.349648",
        "count": 6
    },
    {
        "address": "外高桥富特西一路381号",
        "name": "汤臣工业园区",
        "lnglat": "121.594842,31.337065",
        "count": 15
    },
    {
        "address": "外马路974号",
        "name": "三盛宏业大厦",
        "lnglat": "121.506888,31.212369",
        "count": 4
    },
    {
        "address": "外婆泾路299弄",
        "name": "建发玖珑湾",
        "lnglat": "121.258346,31.115383",
        "count": 40
    },
    {
        "address": "外青松公路6666弄",
        "name": "帕缇欧香苑",
        "lnglat": "121.122434,31.140095",
        "count": 87
    },
    {
        "address": "宛平南路1415号",
        "name": "保利西岸明轩",
        "lnglat": "121.455196,31.180574",
        "count": 14
    },
    {
        "address": "宛平南路255号",
        "name": "徐家汇花园",
        "lnglat": "121.447207,31.193531",
        "count": 140
    },
    {
        "address": "宛平南路300弄",
        "name": "宛平南苑",
        "lnglat": "121.446120,31.192352",
        "count": 24
    },
    {
        "address": "宛平南路381号",
        "name": "沪港国际大厦",
        "lnglat": "121.447865,31.191442",
        "count": 15
    },
    {
        "address": "宛平南路388弄1-6号",
        "name": "海螺花园",
        "lnglat": "121.447084,31.190861",
        "count": 20
    },
    {
        "address": "宛平南路401号",
        "name": "辉煌大厦（上海）",
        "lnglat": "121.447886,31.190932",
        "count": 4
    },
    {
        "address": "宛平南路420号1-2号",
        "name": "佳安公寓",
        "lnglat": "121.447235,31.189864",
        "count": 15
    },
    {
        "address": "宛平南路521号",
        "name": "恒昌花园",
        "lnglat": "121.449273,31.189024",
        "count": 23
    },
    {
        "address": "宛平南路590弄",
        "name": "爱建大厦",
        "lnglat": "121.448225,31.188855",
        "count": 6
    },
    {
        "address": "宛平南路75号",
        "name": "建科大厦",
        "lnglat": "121.445927,31.195578",
        "count": 4
    },
    {
        "address": "宛平南路88号",
        "name": "东方财富大厦",
        "lnglat": "121.444814,31.195270",
        "count": 1
    },
    {
        "address": "宛平南路921弄",
        "name": "临江豪园",
        "lnglat": "121.453034,31.183337",
        "count": 45
    },
    {
        "address": "宛平南路968号",
        "name": "腾王阁",
        "lnglat": "121.451808,31.182372",
        "count": 18
    },
    {
        "address": "畹町路479号3-5层及1层120号",
        "name": "朗诗寓(莘庄店)",
        "lnglat": "121.399915,31.108588",
        "count": 8
    },
    {
        "address": "万安路1323弄",
        "name": "良辰美景(南块)",
        "lnglat": "113.821111,22.719331",
        "count": 56
    },
    {
        "address": "万春街162弄56支弄30号",
        "name": "鸿力鸿鹄公寓",
        "lnglat": "121.437918,31.228498",
        "count": 12
    },
    {
        "address": "万德路11弄",
        "name": "上海东方广场",
        "lnglat": "102.480563,23.715969",
        "count": 16
    },
    {
        "address": "万航渡后路77弄",
        "name": "蔚蓝水岸",
        "lnglat": "121.425308,31.229413",
        "count": 16
    },
    {
        "address": "万航渡路1455号",
        "name": "华阳公寓（上海）",
        "lnglat": "121.421126,31.225020",
        "count": 9
    },
    {
        "address": "万航渡路2452号",
        "name": "苏州河DOHO",
        "lnglat": "121.405616,31.220481",
        "count": 3
    },
    {
        "address": "万航渡路2453号",
        "name": "周家桥创意产业园",
        "lnglat": "121.406334,31.220204",
        "count": 12
    },
    {
        "address": "万航渡路623弄85号",
        "name": "建华大楼",
        "lnglat": "121.433541,31.226861",
        "count": 6
    },
    {
        "address": "万航渡路736号",
        "name": "金融街静安中心",
        "lnglat": "121.431006,31.227307",
        "count": 9
    },
    {
        "address": "万航渡路83号",
        "name": "金航大厦",
        "lnglat": "121.443433,31.224640",
        "count": 9
    },
    {
        "address": "万航渡路849号",
        "name": "海森国际大厦",
        "lnglat": "121.429959,31.228430",
        "count": 3
    },
    {
        "address": "万航渡路858弄25-38号",
        "name": "静安丽舍",
        "lnglat": "121.429387,31.226958",
        "count": 54
    },
    {
        "address": "万航渡路858弄8号",
        "name": "蓝朝部落",
        "lnglat": "121.429318,31.227130",
        "count": 18
    },
    {
        "address": "万航渡路888号",
        "name": "开开广场",
        "lnglat": "121.428683,31.228237",
        "count": 1
    },
    {
        "address": "万康路290号",
        "name": "伟创禾谷科创园",
        "lnglat": "121.524053,31.083311",
        "count": 5
    },
    {
        "address": "万荣路1050号",
        "name": "万荣阳光苑",
        "lnglat": "121.441132,31.289871",
        "count": 34
    },
    {
        "address": "万荣路1188号",
        "name": "龙软万荣基地",
        "lnglat": "121.440507,31.293180",
        "count": 15
    },
    {
        "address": "万荣路30弄",
        "name": "宁和公寓",
        "lnglat": "121.885187,30.020458",
        "count": 9
    },
    {
        "address": "万荣路388弄、大宁路883弄",
        "name": "歌林春天馨园",
        "lnglat": "121.443858,31.272894",
        "count": 237
    },
    {
        "address": "万荣路700号",
        "name": "大宁中心广场A3",
        "lnglat": "121.441851,31.281416",
        "count": 4
    },
    {
        "address": "万荣路777号",
        "name": "大宁音乐广场H座",
        "lnglat": "121.443748,31.280676",
        "count": 4
    },
    {
        "address": "万荣路828弄",
        "name": "大宁858国际公寓",
        "lnglat": "121.443200,31.282585",
        "count": 32
    },
    {
        "address": "万荣路959号",
        "name": "悦舜959创意生活广场",
        "lnglat": "121.442357,31.287997",
        "count": 3
    },
    {
        "address": "万荣一路15号",
        "name": "增美都市工业园区",
        "lnglat": "121.446278,31.299565",
        "count": 4
    },
    {
        "address": "万荣一路90号",
        "name": "国际青年创业社区",
        "lnglat": "121.444716,31.299748",
        "count": 5
    },
    {
        "address": "万顺路1885弄",
        "name": "敬贤雅苑",
        "lnglat": "121.517399,30.953301",
        "count": 26
    },
    {
        "address": "万顺路1988号",
        "name": "百曲雅苑",
        "lnglat": "121.519228,30.956405",
        "count": 176
    },
    {
        "address": "万顺路2089弄",
        "name": "百曲乐苑",
        "lnglat": "121.516861,30.959135",
        "count": 157
    },
    {
        "address": "万顺路2768弄",
        "name": "天和前滩时代2期",
        "lnglat": "121.516413,30.969715",
        "count": 50
    },
    {
        "address": "万顺路2968弄",
        "name": "天和前滩时代",
        "lnglat": "121.516375,30.970983",
        "count": 28
    },
    {
        "address": "万顺路709弄",
        "name": "金域华庭(万科金域华府)",
        "lnglat": "121.517348,30.935009",
        "count": 257
    },
    {
        "address": "万松路88号",
        "name": "金盾产业园",
        "lnglat": "120.637102,27.781838",
        "count": 8
    },
    {
        "address": "万祥镇祥凯路",
        "name": "同润金色橘苑",
        "lnglat": "121.810544,30.967080",
        "count": 45
    },
    {
        "address": "万源路2138号",
        "name": "泓茂中心",
        "lnglat": "121.388255,31.168603",
        "count": 7
    },
    {
        "address": "万源路2158号",
        "name": "泓毅大厦",
        "lnglat": "121.388019,31.169265",
        "count": 4
    },
    {
        "address": "万源路2161弄150号",
        "name": "冉东商务中心",
        "lnglat": "121.384211,31.168688",
        "count": 12
    },
    {
        "address": "万源路2163号",
        "name": "新桥商务中心",
        "lnglat": "121.385991,31.169139",
        "count": 3
    },
    {
        "address": "万源路2289号",
        "name": "万源新城三期",
        "lnglat": "121.385568,31.170349",
        "count": 84
    },
    {
        "address": "万源路788弄",
        "name": "万源城逸郡",
        "lnglat": "121.395928,31.146308",
        "count": 155
    },
    {
        "address": "万源路986弄",
        "name": "万源城朗郡",
        "lnglat": "121.396989,31.149144",
        "count": 149
    },
    {
        "address": "万镇路381号",
        "name": "运旺新村阳光世家",
        "lnglat": "121.374004,31.242058",
        "count": 2
    },
    {
        "address": "万镇路501弄",
        "name": "东旺家苑",
        "lnglat": "121.374879,31.242981",
        "count": 15
    },
    {
        "address": "王家厍路199弄",
        "name": "塘和家园顺康苑",
        "lnglat": "121.560450,31.227231",
        "count": 40
    },
    {
        "address": "望东中路99弄",
        "name": "森祥投资晟维商务园",
        "lnglat": "121.296724,31.121468",
        "count": 19
    },
    {
        "address": "望亭路135号",
        "name": "淮海金融大楼",
        "lnglat": "121.476551,31.224435",
        "count": 2
    },
    {
        "address": "望园路1698弄",
        "name": "聚惠领域_百村创业园B区",
        "lnglat": "121.474864,30.961090",
        "count": 29
    },
    {
        "address": "望园路1888号",
        "name": "复旦奥医高新科创园",
        "lnglat": "121.473002,30.965693",
        "count": 35
    },
    {
        "address": "望园路2066弄",
        "name": "百村创业园A区",
        "lnglat": "121.471800,30.967824",
        "count": 63
    },
    {
        "address": "望园路2509弄",
        "name": "悦达南郊华都",
        "lnglat": "121.466869,30.972852",
        "count": 84
    },
    {
        "address": "威海路128号",
        "name": "长发大厦",
        "lnglat": "119.538881,35.411023",
        "count": 18
    },
    {
        "address": "威海路168弄",
        "name": "杰仕豪庭",
        "lnglat": "119.538829,35.410103",
        "count": 2
    },
    {
        "address": "威海路333弄",
        "name": "中凯城市之光花园",
        "lnglat": "120.358753,36.090980",
        "count": 65
    },
    {
        "address": "威海路48号",
        "name": "民生银行大厦（上海）",
        "lnglat": "122.071608,37.296045",
        "count": 21
    },
    {
        "address": "威海路511号",
        "name": "上海国际集团大厦",
        "lnglat": "121.461694,31.226483",
        "count": 6
    },
    {
        "address": "威海路567号",
        "name": "晶采世纪大厦",
        "lnglat": "121.460999,31.226600",
        "count": 5
    },
    {
        "address": "威海路755号",
        "name": "文新大厦(上海)",
        "lnglat": "121.457553,31.225353",
        "count": 14
    },
    {
        "address": "威航路218弄",
        "name": "金地威新宝山智造园",
        "lnglat": "121.356297,31.462823",
        "count": 31
    },
    {
        "address": "威宁路258号",
        "name": "天申综合大楼",
        "lnglat": "121.384871,31.211258",
        "count": 5
    },
    {
        "address": "威宁路369号",
        "name": "缤谷大厦",
        "lnglat": "121.384756,31.214008",
        "count": 26
    },
    {
        "address": "威宁路458弄",
        "name": "天山华庭",
        "lnglat": "121.386389,31.216362",
        "count": 75
    },
    {
        "address": "威宁路511弄",
        "name": "天山怡景苑",
        "lnglat": "121.385367,31.217739",
        "count": 128
    },
    {
        "address": "潍坊西路55号",
        "name": "上海世茂大厦",
        "lnglat": "121.515426,31.222978",
        "count": 22
    },
    {
        "address": "伟成路62号",
        "name": "创智天地企业中心3号楼",
        "lnglat": "121.510619,31.305927",
        "count": 8
    },
    {
        "address": "伟成路70号",
        "name": "弘源创新大厦",
        "lnglat": "121.510220,31.305820",
        "count": 18
    },
    {
        "address": "伟业路780弄",
        "name": "梅香苑东苑",
        "lnglat": "120.159080,30.191533",
        "count": 16
    },
    {
        "address": "纬地路358弄",
        "name": "经纬城市绿洲观澜泓郡家园",
        "lnglat": "121.397652,31.327490",
        "count": 348
    },
    {
        "address": "纬地路375弄",
        "name": "经纬城市绿洲泓汇地标家园",
        "lnglat": "121.396728,31.324751",
        "count": 140
    },
    {
        "address": "纬地路88弄",
        "name": "经纬城市绿洲阳光水岸家园",
        "lnglat": "121.403772,31.328842",
        "count": 522
    },
    {
        "address": "纬地路99弄",
        "name": "经纬城市绿洲学士逸居家园",
        "lnglat": "121.404861,31.324929",
        "count": 201
    },
    {
        "address": "蕰川路1623号",
        "name": "柏丽华庭",
        "lnglat": "121.432034,31.369481",
        "count": 66
    },
    {
        "address": "蕰川路512号",
        "name": "红石科技大楼",
        "lnglat": "121.433564,31.352171",
        "count": 20
    },
    {
        "address": "蕰川路516号",
        "name": "泰德科技园",
        "lnglat": "121.433316,31.353021",
        "count": 6
    },
    {
        "address": "蕰川路6号",
        "name": "智慧湾",
        "lnglat": "121.433507,31.344333",
        "count": 52
    },
    {
        "address": "文诚路358号",
        "name": "嘉和休闲广场",
        "lnglat": "121.218351,31.033462",
        "count": 22
    },
    {
        "address": "文诚路500弄",
        "name": "安信生活广场",
        "lnglat": "121.216181,31.032725",
        "count": 66
    },
    {
        "address": "文定路200号",
        "name": "盛源恒华大厦",
        "lnglat": "121.431924,31.186956",
        "count": 10
    },
    {
        "address": "文定路218号",
        "name": "徐家汇WE",
        "lnglat": "121.431654,31.185821",
        "count": 24
    },
    {
        "address": "文定路288弄",
        "name": "文定天下苑",
        "lnglat": "121.430219,31.184632",
        "count": 60
    },
    {
        "address": "文定路81弄",
        "name": "锦汇苑",
        "lnglat": "120.285058,31.902957",
        "count": 14
    },
    {
        "address": "文涵路737弄1-37号",
        "name": "逸庭苑(上海)",
        "lnglat": "121.186197,31.036791",
        "count": 57
    },
    {
        "address": "文翔东路58号",
        "name": "上海友喜国际高科技园区二期",
        "lnglat": "121.269030,31.038745",
        "count": 41
    },
    {
        "address": "文翔路1000-1010号",
        "name": "西郊公馆(松云银座)",
        "lnglat": "104.456173,30.842760",
        "count": 36
    },
    {
        "address": "文翔路3688弄",
        "name": "复地翠堤",
        "lnglat": "121.180713,31.041863",
        "count": 12
    },
    {
        "address": "文翔路928号",
        "name": "松云水苑",
        "lnglat": "121.237441,31.042758",
        "count": 182
    },
    {
        "address": "文益街5号",
        "name": "通盛商务广场",
        "lnglat": "121.765142,31.053914",
        "count": 3
    },
    {
        "address": "文宇路88弄",
        "name": "上海绿地诺丁山",
        "lnglat": "121.186555,31.046911",
        "count": 66
    },
    {
        "address": "汶水东路181弄",
        "name": "三九大厦（上海）",
        "lnglat": "121.485369,31.291660",
        "count": 20
    },
    {
        "address": "汶水东路351号 ",
        "name": "1876老站创意园",
        "lnglat": "121.482579,31.291016",
        "count": 15
    },
    {
        "address": "汶水东路918号",
        "name": "信南都市型产业园区5号楼信南商务大楼",
        "lnglat": "121.463639,31.292314",
        "count": 3
    },
    {
        "address": "汶水路480号",
        "name": "汇智印针园区",
        "lnglat": "121.434954,31.288533",
        "count": 12
    },
    {
        "address": "乌鲁木齐北路199号",
        "name": "世纪时空大厦",
        "lnglat": "121.442726,31.222504",
        "count": 3
    },
    {
        "address": "乌鲁木齐北路211号",
        "name": "聚安大厦",
        "lnglat": "79.920884,37.122192",
        "count": 10
    },
    {
        "address": "乌鲁木齐北路480号",
        "name": "万泰国际大厦",
        "lnglat": "121.443414,31.218086",
        "count": 7
    },
    {
        "address": "乌鲁木齐南路299号",
        "name": "联业大厦",
        "lnglat": "84.678527,44.424688",
        "count": 14
    },
    {
        "address": "乌鲁木齐中路261弄",
        "name": "乌中小区",
        "lnglat": "121.446960,31.212120",
        "count": 6
    },
    {
        "address": "吴宝路169弄",
        "name": "上海嘉景苑",
        "lnglat": "121.348973,31.159401",
        "count": 21
    },
    {
        "address": "吴宝路27弄50支弄",
        "name": "上海嘉丽苑",
        "lnglat": "121.349153,31.156694",
        "count": 30
    },
    {
        "address": "吴宝路390-1号",
        "name": "蒂芬妮文创园",
        "lnglat": "121.346891,31.162569",
        "count": 2
    },
    {
        "address": "吴家湾路61弄24-34号",
        "name": "住安产业中心",
        "lnglat": "121.485120,31.292581",
        "count": 5
    },
    {
        "address": "吴江路15号",
        "name": "五月花商务中心 ",
        "lnglat": "120.858624,28.021876",
        "count": 1
    },
    {
        "address": "吴江路188号",
        "name": "静安新时代大厦",
        "lnglat": "121.460184,31.230072",
        "count": 8
    },
    {
        "address": "吴江路31号",
        "name": "东方有线大厦",
        "lnglat": "121.463356,31.230316",
        "count": 8
    },
    {
        "address": "吴淞路130号",
        "name": "城投控股大厦",
        "lnglat": "121.490269,31.246471",
        "count": 3
    },
    {
        "address": "吴淞路218号",
        "name": "宝矿国际大厦",
        "lnglat": "121.490966,31.248541",
        "count": 43
    },
    {
        "address": "吴淞路258号，308号",
        "name": "耀江国际广场",
        "lnglat": "121.490064,31.249002",
        "count": 17
    },
    {
        "address": "吴淞路469号",
        "name": "森林湾大厦",
        "lnglat": "121.488205,31.251122",
        "count": 73
    },
    {
        "address": "吴淞路669号",
        "name": "申贝大厦（上海）",
        "lnglat": "121.486051,31.254354",
        "count": 14
    },
    {
        "address": "吴兴路219号",
        "name": "吴兴公寓",
        "lnglat": "121.444832,31.201553",
        "count": 7
    },
    {
        "address": "吴兴路278号",
        "name": "宛平公寓",
        "lnglat": "121.445744,31.198886",
        "count": 1
    },
    {
        "address": "吴兴路283号",
        "name": "申谊大厦",
        "lnglat": "121.446008,31.198804",
        "count": 4
    },
    {
        "address": "吴杨东路333弄",
        "name": "金帝城市岸泊",
        "lnglat": "121.306740,31.269796",
        "count": 85
    },
    {
        "address": "吴中东路491号",
        "name": "宏云广场",
        "lnglat": "121.424611,31.189800",
        "count": 10
    },
    {
        "address": "吴中东路506弄",
        "name": "嘉欣公寓",
        "lnglat": "121.422787,31.190190",
        "count": 15
    },
    {
        "address": "吴中东路588弄",
        "name": "上海华中大厦",
        "lnglat": "121.421500,31.190011",
        "count": 3
    },
    {
        "address": "吴中路1029号",
        "name": "灿虹世纪广场",
        "lnglat": "121.387940,31.177199",
        "count": 9
    },
    {
        "address": "吴中路1050号",
        "name": "虹桥盛世莲花广场",
        "lnglat": "121.387583,31.178567",
        "count": 51
    },
    {
        "address": "吴中路1059号",
        "name": "灿虹精英大厦",
        "lnglat": "121.388356,31.176761",
        "count": 14
    },
    {
        "address": "吴中路1081号",
        "name": "灿虹聚富大厦",
        "lnglat": "121.387024,31.176949",
        "count": 15
    },
    {
        "address": "吴中路1099号",
        "name": "吴中商务大楼",
        "lnglat": "121.386112,31.176434",
        "count": 5
    },
    {
        "address": "吴中路1100号",
        "name": "炫润国际大厦",
        "lnglat": "121.386088,31.177319",
        "count": 16
    },
    {
        "address": "吴中路1189号",
        "name": "虹桥德必易园",
        "lnglat": "121.383998,31.175912",
        "count": 51
    },
    {
        "address": "吴中路1217号",
        "name": "长江商务楼",
        "lnglat": "121.382814,31.175909",
        "count": 4
    },
    {
        "address": "吴中路1235号",
        "name": "新宏商务大楼",
        "lnglat": "121.382035,31.175475",
        "count": 4
    },
    {
        "address": "吴中路1238号",
        "name": "新盛商务大楼",
        "lnglat": "121.381018,31.176122",
        "count": 3
    },
    {
        "address": "吴中路1366号",
        "name": "金汇德必易园",
        "lnglat": "121.376610,31.175894",
        "count": 38
    },
    {
        "address": "吴中路1369号",
        "name": "欧银中心",
        "lnglat": "121.374455,31.172038",
        "count": 14
    },
    {
        "address": "吴中路1439号",
        "name": "莱茵虹景中心",
        "lnglat": "121.373187,31.172009",
        "count": 12
    },
    {
        "address": "吴中路1799号",
        "name": "万象城(一期)",
        "lnglat": "121.367913,31.169873",
        "count": 49
    },
    {
        "address": "吴中路369号",
        "name": "美恒大厦",
        "lnglat": "121.412611,31.185871",
        "count": 9
    },
    {
        "address": "吴中路380弄9号",
        "name": "海联花苑",
        "lnglat": "121.412670,31.187249",
        "count": 10
    },
    {
        "address": "吴中路39号",
        "name": "新概念大厦",
        "lnglat": "121.419274,31.187643",
        "count": 24
    },
    {
        "address": "吴中路500号",
        "name": "涵博大厦",
        "lnglat": "121.404825,31.185383",
        "count": 4
    },
    {
        "address": "吴中路511弄",
        "name": "古北新城",
        "lnglat": "121.402989,31.183920",
        "count": 161
    },
    {
        "address": "吴中路682弄",
        "name": "金虹桥广场（C座）",
        "lnglat": "121.435498,29.389868",
        "count": 10
    },
    {
        "address": "吴中路686弄2号",
        "name": "金虹桥广场E座",
        "lnglat": "121.396658,31.182748",
        "count": 6
    },
    {
        "address": "吴中路686弄D座",
        "name": "东航金融中心",
        "lnglat": "121.396530,31.182670",
        "count": 4
    },
    {
        "address": "吴中路889号",
        "name": "君怡公寓",
        "lnglat": "121.391816,31.179161",
        "count": 30
    },
    {
        "address": "梧州路218弄",
        "name": "中皇广场",
        "lnglat": "121.493903,31.254794",
        "count": 28
    },
    {
        "address": "梧州路299弄",
        "name": "凯虹家园",
        "lnglat": "121.493086,31.255901",
        "count": 37
    },
    {
        "address": "五昆路88弄",
        "name": "云著深蓝",
        "lnglat": "121.251445,31.032168",
        "count": 72
    },
    {
        "address": "五莲路1168号",
        "name": "新馨白领公寓五莲路店",
        "lnglat": "121.596840,31.272521",
        "count": 10
    },
    {
        "address": "五厍浜路168弄",
        "name": "汇丰豪轩",
        "lnglat": "121.109680,31.145174",
        "count": 88
    },
    {
        "address": "五星路410弄72号",
        "name": "湾流国际青年社区北蔡店",
        "lnglat": "105.050697,29.599404",
        "count": 1
    },
    {
        "address": "五星路706弄26号楼",
        "name": "御河企业公馆D2E3",
        "lnglat": "130.972872,45.299063",
        "count": 7
    },
    {
        "address": "五星路707弄",
        "name": "御河企业公馆",
        "lnglat": "105.050012,29.598506",
        "count": 14
    },
    {
        "address": "武定路1102号",
        "name": "怡甸公寓",
        "lnglat": "121.441230,31.229859",
        "count": 5
    },
    {
        "address": "武定路1128弄",
        "name": "瀚林府邸",
        "lnglat": "121.438819,31.229165",
        "count": 58
    },
    {
        "address": "武定路1145弄",
        "name": "沪中新苑",
        "lnglat": "121.437350,31.227144",
        "count": 79
    },
    {
        "address": "武定路333号",
        "name": "申银发展大厦",
        "lnglat": "121.453833,31.234411",
        "count": 25
    },
    {
        "address": "武定路458号",
        "name": "洪安大厦(上海)",
        "lnglat": "121.451464,31.234373",
        "count": 3
    },
    {
        "address": "武定路881号",
        "name": "881创意园",
        "lnglat": "121.444743,31.230308",
        "count": 14
    },
    {
        "address": "武定路969号",
        "name": "华祺大厦",
        "lnglat": "121.443805,31.230220",
        "count": 19
    },
    {
        "address": "武定西路1158弄",
        "name": "瑞丽公寓",
        "lnglat": "121.435871,31.227097",
        "count": 10
    },
    {
        "address": "武定西路1398弄",
        "name": "静安城",
        "lnglat": "121.429509,31.224675",
        "count": 40
    },
    {
        "address": "武定西路1438号",
        "name": "雅筑公寓",
        "lnglat": "121.430649,31.224549",
        "count": 6
    },
    {
        "address": "武东路28弄",
        "name": "同和国际",
        "lnglat": "114.457362,30.578201",
        "count": 20
    },
    {
        "address": "武进路289号",
        "name": "海泰时代大厦",
        "lnglat": "121.485414,31.251757",
        "count": 6
    },
    {
        "address": "武进路41号",
        "name": "吉汇大厦(虹口SOHO)",
        "lnglat": "121.489277,31.253360",
        "count": 31
    },
    {
        "address": "武进路579号",
        "name": "武进大楼",
        "lnglat": "121.480036,31.249959",
        "count": 9
    },
    {
        "address": "武康路112号",
        "name": "康兴公寓",
        "lnglat": "102.406927,25.528840",
        "count": 4
    },
    {
        "address": "武康路280弄",
        "name": "汇成武康公寓",
        "lnglat": "121.438556,31.207378",
        "count": 12
    },
    {
        "address": "武宁路101号",
        "name": "我格广场（商场）",
        "lnglat": "121.423228,31.237918",
        "count": 6
    },
    {
        "address": "武宁路2101号",
        "name": "嘉安大厦",
        "lnglat": "121.383074,31.254642",
        "count": 9
    },
    {
        "address": "武宁路300弄",
        "name": "武宁小城",
        "lnglat": "121.421874,31.241466",
        "count": 38
    },
    {
        "address": "武宁路423号",
        "name": "五零智慧产业科技园",
        "lnglat": "121.416189,31.243069",
        "count": 62
    },
    {
        "address": "武宁路501号",
        "name": "鸿运大厦",
        "lnglat": "121.415723,31.243800",
        "count": 4
    },
    {
        "address": "武宁路509号",
        "name": "电科大厦",
        "lnglat": "121.413781,31.244281",
        "count": 22
    },
    {
        "address": "武宁路8弄1号",
        "name": "大众河滨大厦",
        "lnglat": "121.429350,31.234520",
        "count": 5
    },
    {
        "address": "武宁路99号",
        "name": "我格广场",
        "lnglat": "121.423205,31.237876",
        "count": 12
    },
    {
        "address": "武宁南路287号",
        "name": "康定汽车公寓",
        "lnglat": "121.433722,31.229853",
        "count": 4
    },
    {
        "address": "武宁南路310-322号",
        "name": "宏安家园一期",
        "lnglat": "121.433194,31.230628",
        "count": 36
    },
    {
        "address": "武宁南路418弄",
        "name": "怡乐花园(上海)",
        "lnglat": "121.431511,31.232381",
        "count": 24
    },
    {
        "address": "武宁南路488号",
        "name": "智慧广场",
        "lnglat": "121.430943,31.233610",
        "count": 5
    },
    {
        "address": "武威东路478弄",
        "name": "雅诗蓝郡",
        "lnglat": "121.399879,31.275338",
        "count": 69
    },
    {
        "address": "武威东路788弄",
        "name": "恒盛鼎城华公馆",
        "lnglat": "121.388697,31.277592",
        "count": 155
    },
    {
        "address": "武威路2600弄",
        "name": "新华悦都",
        "lnglat": "102.189782,38.495250",
        "count": 16
    },
    {
        "address": "武威路2909弄",
        "name": "连飞虹湖天地国际公寓",
        "lnglat": "121.324804,31.279882",
        "count": 6
    },
    {
        "address": "武乡南路259弄",
        "name": "大成名庭",
        "lnglat": "121.264364,31.405247",
        "count": 125
    },
    {
        "address": "武夷路351号",
        "name": "武夷商务中心",
        "lnglat": "121.423519,31.213792",
        "count": 6
    },
    {
        "address": "武夷路416弄",
        "name": "天诚花苑",
        "lnglat": "121.422269,31.212248",
        "count": 21
    },
    {
        "address": "武夷路418弄1号",
        "name": "武定大厦",
        "lnglat": "121.421933,31.212581",
        "count": 8
    },
    {
        "address": "武夷路438号",
        "name": "星辰公寓",
        "lnglat": "121.421481,31.212623",
        "count": 5
    },
    {
        "address": "武夷路718弄",
        "name": "武夷花园",
        "lnglat": "121.415599,31.212632",
        "count": 69
    },
    {
        "address": "武夷路770弄1号",
        "name": "友联大楼",
        "lnglat": "121.414439,31.212544",
        "count": 4
    },
    {
        "address": "物华路58号",
        "name": "物华大厦（上海）",
        "lnglat": "120.113109,29.371354",
        "count": 2
    },
    {
        "address": "物华路73号",
        "name": "侨园渡边物华园",
        "lnglat": "121.496508,31.259868",
        "count": 1
    },
    {
        "address": "西藏北路166号",
        "name": "上海静安大悦城购物中心",
        "lnglat": "121.472155,31.243637",
        "count": 47
    },
    {
        "address": "西藏北路18号",
        "name": "四行天地",
        "lnglat": "121.472133,31.241102",
        "count": 5
    },
    {
        "address": "西藏北路199号",
        "name": "农房总部大厦",
        "lnglat": "121.470966,31.243812",
        "count": 8
    },
    {
        "address": "西藏北路528弄",
        "name": "博园大楼",
        "lnglat": "121.469891,31.250045",
        "count": 20
    },
    {
        "address": "西藏北路568号",
        "name": "上海铭德国际广场",
        "lnglat": "121.468829,31.252049",
        "count": 2
    },
    {
        "address": "西藏北路605号",
        "name": "兴中心创意园区",
        "lnglat": "121.468466,31.252615",
        "count": 4
    },
    {
        "address": "西藏北路88号",
        "name": "盈凯文创广场",
        "lnglat": "121.472131,31.241926",
        "count": 24
    },
    {
        "address": "西藏南路1090弄",
        "name": "银南大厦",
        "lnglat": "121.485766,31.211417",
        "count": 2
    },
    {
        "address": "西藏南路1108弄",
        "name": "黄浦新苑办公楼",
        "lnglat": "121.485565,31.210563",
        "count": 13
    },
    {
        "address": "西藏南路1109号",
        "name": "永明大厦",
        "lnglat": "121.486785,31.211087",
        "count": 3
    },
    {
        "address": "西藏南路1129弄",
        "name": "丽园公寓（上海）",
        "lnglat": "121.487511,31.210611",
        "count": 3
    },
    {
        "address": "西藏南路1200弄",
        "name": "黄浦丽园",
        "lnglat": "121.486033,31.208471",
        "count": 66
    },
    {
        "address": "西藏南路1208弄",
        "name": "东吴证券大厦",
        "lnglat": "121.487223,31.209461",
        "count": 18
    },
    {
        "address": "西藏南路1225号",
        "name": "城信大厦",
        "lnglat": "121.487230,31.209332",
        "count": 3
    },
    {
        "address": "西藏南路1332号",
        "name": "协作大厦",
        "lnglat": "121.487177,31.207291",
        "count": 15
    },
    {
        "address": "西藏南路1433弄",
        "name": "新中苑生活大师",
        "lnglat": "121.489622,31.204295",
        "count": 5
    },
    {
        "address": "西藏南路1501弄",
        "name": "弘辉名苑",
        "lnglat": "121.489863,31.203065",
        "count": 59
    },
    {
        "address": "西藏南路1558弄",
        "name": "上海人家",
        "lnglat": "121.488458,31.202795",
        "count": 14
    },
    {
        "address": "西藏南路1639号",
        "name": "精文苑",
        "lnglat": "121.492236,31.201393",
        "count": 25
    },
    {
        "address": "西藏南路1717弄",
        "name": "白玉兰家园",
        "lnglat": "121.491329,31.199765",
        "count": 18
    },
    {
        "address": "西藏南路1739弄",
        "name": "耀江花园二期",
        "lnglat": "121.492226,31.198389",
        "count": 70
    },
    {
        "address": "西藏南路218号",
        "name": "永银大厦",
        "lnglat": "121.480517,31.224384",
        "count": 8
    },
    {
        "address": "西藏南路555号",
        "name": "黄浦众鑫城",
        "lnglat": "121.483453,31.219842",
        "count": 7
    },
    {
        "address": "西藏南路748号",
        "name": "惠达大厦",
        "lnglat": "121.484003,31.215966",
        "count": 11
    },
    {
        "address": "西藏南路758号",
        "name": "桥苑公寓(上海)",
        "lnglat": "121.484533,31.215405",
        "count": 8
    },
    {
        "address": "西藏南路760号",
        "name": "安基大厦",
        "lnglat": "121.484838,31.214718",
        "count": 3
    },
    {
        "address": "西藏南路831弄",
        "name": "南吉公寓",
        "lnglat": "121.485736,31.214329",
        "count": 12
    },
    {
        "address": "西藏南路879-899号",
        "name": "幸运福邸（上海）",
        "lnglat": "121.485639,31.214288",
        "count": 12
    },
    {
        "address": "西藏南路900弄",
        "name": "开元坊",
        "lnglat": "121.484719,31.213522",
        "count": 34
    },
    {
        "address": "西藏中路18号",
        "name": "港陆广场",
        "lnglat": "121.478658,31.229355",
        "count": 12
    },
    {
        "address": "西藏中路268号",
        "name": "来福士广场",
        "lnglat": "121.476581,31.232275",
        "count": 61
    },
    {
        "address": "西藏中路525号",
        "name": "雅居乐国际广场",
        "lnglat": "121.473196,31.236304",
        "count": 6
    },
    {
        "address": "西藏中路656号",
        "name": "美华大楼",
        "lnglat": "121.473568,31.238763",
        "count": 1
    },
    {
        "address": "西藏中路725号",
        "name": "家化中房苑",
        "lnglat": "121.472044,31.239376",
        "count": 3
    },
    {
        "address": "西环路629号",
        "name": "同久文创园",
        "lnglat": "113.847784,27.617072",
        "count": 5
    },
    {
        "address": "西江湾路230号",
        "name": "驰民大楼",
        "lnglat": "121.478208,31.268774",
        "count": 12
    },
    {
        "address": "西江湾路388号",
        "name": "凯德龙之梦虹口广场(商场)",
        "lnglat": "121.478679,31.271071",
        "count": 36
    },
    {
        "address": "西江湾路5号",
        "name": "冠都公寓",
        "lnglat": "121.477736,31.265552",
        "count": 3
    },
    {
        "address": "西康路1000号",
        "name": "冠龙大厦",
        "lnglat": "121.442233,31.240344",
        "count": 1
    },
    {
        "address": "西康路1018号",
        "name": "元茂金豪大厦",
        "lnglat": "121.442073,31.240755",
        "count": 2
    },
    {
        "address": "西康路1249弄",
        "name": "泰极大厦",
        "lnglat": "121.438106,31.242110",
        "count": 7
    },
    {
        "address": "西康路1255号",
        "name": "普陀科技大厦",
        "lnglat": "121.437992,31.242691",
        "count": 41
    },
    {
        "address": "西康路1277弄",
        "name": "云都苑",
        "lnglat": "121.437183,31.242950",
        "count": 21
    },
    {
        "address": "西康路1288弄",
        "name": "光明城市花园",
        "lnglat": "125.312437,43.865428",
        "count": 36
    },
    {
        "address": "西康路1297号 ",
        "name": "云都商务中心",
        "lnglat": "121.437365,31.243242",
        "count": 1
    },
    {
        "address": "西康路1407号",
        "name": "荣联公寓",
        "lnglat": "121.434997,31.244444",
        "count": 19
    },
    {
        "address": "西康路300号",
        "name": "本本大厦",
        "lnglat": "121.450439,31.231135",
        "count": 2
    },
    {
        "address": "西康路339弄",
        "name": "怡景苑",
        "lnglat": "121.448905,31.231817",
        "count": 20
    },
    {
        "address": "西康路446号",
        "name": "伯龙公寓",
        "lnglat": "121.448320,31.233125",
        "count": 5
    },
    {
        "address": "西康路464号",
        "name": "康定大厦",
        "lnglat": "121.448087,31.233236",
        "count": 7
    },
    {
        "address": "西康路520号",
        "name": "华通公寓",
        "lnglat": "121.447385,31.234130",
        "count": 6
    },
    {
        "address": "西康路556号",
        "name": "联谊西康大厦",
        "lnglat": "121.447109,31.234671",
        "count": 13
    },
    {
        "address": "西康路600弄",
        "name": "华通大厦(上海)",
        "lnglat": "125.321407,43.865778",
        "count": 14
    },
    {
        "address": "西康路658弄7-9号",
        "name": "静安东海园",
        "lnglat": "121.445254,31.236614",
        "count": 51
    },
    {
        "address": "西康路699弄",
        "name": "静安鼎鑫佳苑",
        "lnglat": "121.444515,31.235683",
        "count": 14
    },
    {
        "address": "西康路757号",
        "name": "侨侨大楼",
        "lnglat": "121.444354,31.236625",
        "count": 3
    },
    {
        "address": "西康路838号",
        "name": "康海大楼",
        "lnglat": "121.444151,31.237939",
        "count": 9
    },
    {
        "address": "西康路928号",
        "name": "静安创展中心",
        "lnglat": "121.443431,31.239553",
        "count": 13
    },
    {
        "address": "西凌家宅路111弄4号",
        "name": "科凌公寓",
        "lnglat": "121.486320,31.205310",
        "count": 6
    },
    {
        "address": "西苏州路85弄",
        "name": "静安河滨花园",
        "lnglat": "121.452348,31.240829",
        "count": 22
    },
    {
        "address": "西泰林路158弄",
        "name": "环球翡翠湾花园",
        "lnglat": "121.531470,31.152330",
        "count": 204
    },
    {
        "address": "西陶浜路28弄 ",
        "name": "北平家园",
        "lnglat": "121.364366,31.222599",
        "count": 134
    },
    {
        "address": "西营路58、62号",
        "name": "明珠花苑",
        "lnglat": "108.619567,21.958483",
        "count": 32
    },
    {
        "address": "西营南路67弄",
        "name": "恒大华城_天地苑三期",
        "lnglat": "121.485251,31.158423",
        "count": 189
    },
    {
        "address": "西油墩港路177弄",
        "name": "逸泰雅苑一期",
        "lnglat": "121.160325,31.157738",
        "count": 69
    },
    {
        "address": "希望路1333号",
        "name": "常发豪庭",
        "lnglat": "121.247094,31.330582",
        "count": 80
    },
    {
        "address": "希望路260弄",
        "name": "海上名苑",
        "lnglat": "119.935552,33.610374",
        "count": 36
    },
    {
        "address": "希望路689弄",
        "name": "嘉定宝龙中心（四期）",
        "lnglat": "101.641515,36.997889",
        "count": 72
    },
    {
        "address": "希望路978弄",
        "name": "领峰理想家",
        "lnglat": "104.310074,30.604577",
        "count": 69
    },
    {
        "address": "溪平路237弄",
        "name": "金海华城鸿明佳苑",
        "lnglat": "121.690011,31.262362",
        "count": 94
    },
    {
        "address": "喜泉路118弄",
        "name": "外冈景苑",
        "lnglat": "121.157314,31.370329",
        "count": 640
    },
    {
        "address": "喜泰路255号",
        "name": "海桐商务楼",
        "lnglat": "121.451817,31.143499",
        "count": 4
    },
    {
        "address": "细林路298弄",
        "name": "佘山水岸名邸",
        "lnglat": "121.182772,31.100611",
        "count": 35
    },
    {
        "address": "霞光路368弄",
        "name": "东港铭筑",
        "lnglat": "121.803400,30.900940",
        "count": 46
    },
    {
        "address": "霞光路78弄",
        "name": "蓝色城邦",
        "lnglat": "103.861707,30.068653",
        "count": 116
    },
    {
        "address": "夏碧路79弄",
        "name": "瑞禾明苑",
        "lnglat": "121.589595,31.338982",
        "count": 15
    },
    {
        "address": "仙霞路1281号",
        "name": "帝豪苑",
        "lnglat": "121.374086,31.208506",
        "count": 18
    },
    {
        "address": "仙霞路137号",
        "name": "盛高国际大厦",
        "lnglat": "121.404063,31.206196",
        "count": 8
    },
    {
        "address": "仙霞路1388弄",
        "name": "虹康景博苑",
        "lnglat": "121.372814,31.207007",
        "count": 16
    },
    {
        "address": "仙霞路319号",
        "name": "远东国际广场",
        "lnglat": "121.400659,31.206465",
        "count": 13
    },
    {
        "address": "仙霞路322号",
        "name": "鑫达大厦",
        "lnglat": "121.399063,31.205479",
        "count": 3
    },
    {
        "address": "仙霞路333号",
        "name": "东方维京大厦",
        "lnglat": "121.398761,31.206355",
        "count": 18
    },
    {
        "address": "仙霞路345号",
        "name": "东方世纪大厦",
        "lnglat": "121.397932,31.206163",
        "count": 2
    },
    {
        "address": "仙霞路357号",
        "name": "制版楼",
        "lnglat": "121.397187,31.206688",
        "count": 1
    },
    {
        "address": "仙霞路369号",
        "name": "KB现代广场",
        "lnglat": "121.396957,31.206025",
        "count": 2
    },
    {
        "address": "仙霞路80号",
        "name": "天虹大楼",
        "lnglat": "119.885854,28.389239",
        "count": 1
    },
    {
        "address": "仙霞路88号",
        "name": "太阳广场",
        "lnglat": "119.885837,28.389086",
        "count": 24
    },
    {
        "address": "仙霞西路300弄",
        "name": "虹康花苑",
        "lnglat": "121.366860,31.208721",
        "count": 71
    },
    {
        "address": "仙霞西路500弄",
        "name": "虹康花苑一期",
        "lnglat": "121.363803,31.209824",
        "count": 46
    },
    {
        "address": "先锋街25号",
        "name": "宝纳大厦",
        "lnglat": "105.157018,31.630425",
        "count": 3
    },
    {
        "address": "先锋街525号",
        "name": "虹桥525",
        "lnglat": "121.376809,31.176696",
        "count": 14
    },
    {
        "address": "先新路1058弄",
        "name": "浦江馨都",
        "lnglat": "121.532405,31.039833",
        "count": 48
    },
    {
        "address": "贤浦路218弄",
        "name": "海尚惠苑",
        "lnglat": "121.518570,30.915577",
        "count": 27
    },
    {
        "address": "香车路388号",
        "name": "宝奇电子商务楼",
        "lnglat": "121.293981,31.001429",
        "count": 5
    },
    {
        "address": "香山路33号",
        "name": "香山丽舍",
        "lnglat": "109.249840,25.063950",
        "count": 4
    },
    {
        "address": "襄阳南路175-号",
        "name": "环中商厦（上海）",
        "lnglat": "106.718026,26.843451",
        "count": 6
    },
    {
        "address": "襄阳南路489号",
        "name": "金环大厦",
        "lnglat": "121.458435,31.204464",
        "count": 19
    },
    {
        "address": "襄阳南路500号",
        "name": "巴黎时韵",
        "lnglat": "121.457880,31.205636",
        "count": 4
    },
    {
        "address": "襄阳南路550弄",
        "name": "天元襄阳公寓",
        "lnglat": "121.458154,31.203696",
        "count": 20
    },
    {
        "address": "祥德路381号",
        "name": "越界祥德里",
        "lnglat": "121.491457,31.270935",
        "count": 3
    },
    {
        "address": "祥凯路2013弄",
        "name": "天健翠园",
        "lnglat": "121.807597,30.955046",
        "count": 129
    },
    {
        "address": "祥科路298号",
        "name": "佑越国际",
        "lnglat": "121.610050,31.181468",
        "count": 32
    },
    {
        "address": "翔江公路2299号",
        "name": "北虹桥松日2299广场",
        "lnglat": "121.276843,31.271724",
        "count": 2
    },
    {
        "address": "翔江公路518号",
        "name": "寅尚工业产业园",
        "lnglat": "121.291898,31.296938",
        "count": 14
    },
    {
        "address": "翔殷路1128号",
        "name": "沪东金融大厦",
        "lnglat": "121.517043,31.300953",
        "count": 16
    },
    {
        "address": "翔殷路128号",
        "name": "上海理工科技园",
        "lnglat": "121.550480,31.308490",
        "count": 19
    },
    {
        "address": "翔殷路165号",
        "name": "上海创意联盟产业园(分部)",
        "lnglat": "121.547320,31.306718",
        "count": 2
    },
    {
        "address": "翔殷路258弄",
        "name": "星云苑",
        "lnglat": "121.542407,31.309895",
        "count": 51
    },
    {
        "address": "翔殷路500弄之1-64号",
        "name": "莱茵半岛",
        "lnglat": "121.536808,31.307935",
        "count": 172
    },
    {
        "address": "翔殷路505弄",
        "name": "翔殷路505弄小区",
        "lnglat": "121.535566,31.305847",
        "count": 8
    },
    {
        "address": "翔殷路873弄",
        "name": "梅花村",
        "lnglat": "121.524446,31.301823",
        "count": 24
    },
    {
        "address": "向成路58号",
        "name": "东方国际科技大厦",
        "lnglat": "121.529189,31.224673",
        "count": 12
    },
    {
        "address": "向城路15号",
        "name": "锦城大厦（上海）",
        "lnglat": "121.528980,31.224043",
        "count": 15
    },
    {
        "address": "向城路19号",
        "name": "众城公寓",
        "lnglat": "121.529795,31.224113",
        "count": 3
    },
    {
        "address": "向城路288号",
        "name": "国华人寿金融大厦",
        "lnglat": "121.533307,31.226372",
        "count": 39
    },
    {
        "address": "向阳路880号",
        "name": "歆翱智联大厦",
        "lnglat": "121.426522,31.071498",
        "count": 10
    },
    {
        "address": "萧云路1318弄",
        "name": "霄云湾公寓",
        "lnglat": "121.331722,31.455997",
        "count": 96
    },
    {
        "address": "萧云路99弄",
        "name": "万科启宸（智云新苑）",
        "lnglat": "121.337397,31.436978",
        "count": 171
    },
    {
        "address": "小木桥路219号",
        "name": "悦樘公寓(小木桥店)",
        "lnglat": "121.457687,31.198660",
        "count": 4
    },
    {
        "address": "小木桥路224号",
        "name": "儿科大楼",
        "lnglat": "121.457345,31.198248",
        "count": 7
    },
    {
        "address": "小木桥路251号",
        "name": "上海天亿大厦",
        "lnglat": "121.458331,31.197641",
        "count": 1
    },
    {
        "address": "小木桥路268弄",
        "name": "泰康大楼",
        "lnglat": "121.457881,31.197006",
        "count": 3
    },
    {
        "address": "小木桥路456号",
        "name": "X2创意空间二期",
        "lnglat": "121.460427,31.193639",
        "count": 3
    },
    {
        "address": "小木桥路538弄,518弄",
        "name": "新湖云庭",
        "lnglat": "121.461140,31.191395",
        "count": 24
    },
    {
        "address": "小木桥路800号",
        "name": "UTOP联创空间",
        "lnglat": "121.463628,31.188496",
        "count": 3
    },
    {
        "address": "肖南路16号",
        "name": "乐活生活馆",
        "lnglat": "121.436949,30.961531",
        "count": 8
    },
    {
        "address": "肖塘路255弄",
        "name": "乐活青年公寓",
        "lnglat": "121.434748,30.961605",
        "count": 8
    },
    {
        "address": "协和路1033号",
        "name": "文洋大厦",
        "lnglat": "121.353710,31.222914",
        "count": 8
    },
    {
        "address": "斜土东路265弄",
        "name": "锦绣家园",
        "lnglat": "121.486292,31.207815",
        "count": 10
    },
    {
        "address": "斜土东路333弄",
        "name": "华浩苑",
        "lnglat": "121.485150,31.207389",
        "count": 10
    },
    {
        "address": "斜土路1077号",
        "name": "鼎园",
        "lnglat": "121.467080,31.201252",
        "count": 4
    },
    {
        "address": "斜土路1111弄",
        "name": "福华花苑",
        "lnglat": "121.465688,31.201069",
        "count": 5
    },
    {
        "address": "斜土路1175号",
        "name": "景泰大厦",
        "lnglat": "121.465117,31.199803",
        "count": 8
    },
    {
        "address": "斜土路118弄1号",
        "name": "大众汽车公寓",
        "lnglat": "121.482267,31.205703",
        "count": 18
    },
    {
        "address": "斜土路1221号",
        "name": "之俊大厦（上海）",
        "lnglat": "121.464437,31.199889",
        "count": 22
    },
    {
        "address": "斜土路1515号",
        "name": "银亿茗悦公寓",
        "lnglat": "121.460006,31.197729",
        "count": 5
    },
    {
        "address": "斜土路1975弄、2099弄",
        "name": "阳光名苑二期(阳光巴黎二期)",
        "lnglat": "121.450774,31.194496",
        "count": 32
    },
    {
        "address": "斜土路2088号",
        "name": "徐汇创客中心",
        "lnglat": "121.450562,31.193298",
        "count": 7
    },
    {
        "address": "斜土路2096弄",
        "name": "锦蝶苑",
        "lnglat": "121.451632,31.191123",
        "count": 9
    },
    {
        "address": "斜土路2099弄",
        "name": "阳光名苑",
        "lnglat": "121.450958,31.194583",
        "count": 15
    },
    {
        "address": "斜土路2200弄",
        "name": "荣承公寓",
        "lnglat": "121.449167,31.191509",
        "count": 18
    },
    {
        "address": "斜土路2200弄47,48号",
        "name": "红旗教师公寓",
        "lnglat": "121.450248,31.191242",
        "count": 18
    },
    {
        "address": "斜土路2455号",
        "name": "同济杰作（同汇苑）",
        "lnglat": "121.445498,31.189732",
        "count": 30
    },
    {
        "address": "斜土路2526号",
        "name": "新亚徐汇公寓",
        "lnglat": "121.446246,31.189276",
        "count": 3
    },
    {
        "address": "斜土路2600号",
        "name": "海高大厦",
        "lnglat": "121.443337,31.186528",
        "count": 1
    },
    {
        "address": "斜土路2601号",
        "name": "嘉汇广场",
        "lnglat": "121.443176,31.187389",
        "count": 9
    },
    {
        "address": "斜土路2897号",
        "name": "海文商务楼（斜土路）",
        "lnglat": "121.441411,31.186377",
        "count": 4
    },
    {
        "address": "斜土路2899号",
        "name": "上影公寓",
        "lnglat": "121.441136,31.185471",
        "count": 14
    },
    {
        "address": "斜土路2899甲号",
        "name": "光启文化广场",
        "lnglat": "121.441238,31.185406",
        "count": 63
    },
    {
        "address": "斜土路298弄",
        "name": "永业仁德坊",
        "lnglat": "121.480442,31.204522",
        "count": 48
    },
    {
        "address": "斜土路448号",
        "name": "蒙自大楼",
        "lnglat": "121.478251,31.203837",
        "count": 6
    },
    {
        "address": "斜土路468号",
        "name": "白云公寓",
        "lnglat": "121.477534,31.203357",
        "count": 3
    },
    {
        "address": "斜土路500号",
        "name": "人才大厦（斜土路）",
        "lnglat": "121.477035,31.203232",
        "count": 4
    },
    {
        "address": "斜土路766弄1号",
        "name": "莱兴公寓",
        "lnglat": "121.471985,31.201565",
        "count": 2
    },
    {
        "address": "斜土路768号",
        "name": "致远大厦",
        "lnglat": "121.471415,31.201643",
        "count": 34
    },
    {
        "address": "斜土路780号",
        "name": "经宇商务楼",
        "lnglat": "121.470679,31.201525",
        "count": 12
    },
    {
        "address": "斜土路788号",
        "name": "飞纶商务中心",
        "lnglat": "121.470423,31.201608",
        "count": 2
    },
    {
        "address": "斜土路791号",
        "name": "三毛集团办公楼",
        "lnglat": "121.471495,31.202463",
        "count": 6
    },
    {
        "address": "斜土路810弄",
        "name": "郁金香花苑",
        "lnglat": "121.469953,31.200774",
        "count": 48
    },
    {
        "address": "斜土路816弄1号",
        "name": "卢宛816",
        "lnglat": "121.471013,31.201529",
        "count": 1
    },
    {
        "address": "辛耕路81弄",
        "name": "永新世纪苑",
        "lnglat": "121.444925,31.193096",
        "count": 26
    },
    {
        "address": "欣浪路1028弄",
        "name": "松南城华顺苑",
        "lnglat": "121.277290,30.986014",
        "count": 13
    },
    {
        "address": "欣浪路888弄",
        "name": "松南城华品苑",
        "lnglat": "121.277776,30.996851",
        "count": 18
    },
    {
        "address": "新昌路477弄",
        "name": "上海滩新昌城",
        "lnglat": "119.902206,31.814362",
        "count": 20
    },
    {
        "address": "新场镇康新公路1588号",
        "name": "千禾创业园",
        "lnglat": "121.636320,31.058333",
        "count": 9
    },
    {
        "address": "新车公路555号",
        "name": "逸南智能科技产业园",
        "lnglat": "121.305821,31.039665",
        "count": 3
    },
    {
        "address": "新陈路303弄",
        "name": "莲泰苑",
        "lnglat": "121.565959,31.180729",
        "count": 36
    },
    {
        "address": "新成路261弄之1-18号",
        "name": "迎园东一坊",
        "lnglat": "121.267697,31.381440",
        "count": 2
    },
    {
        "address": "新城镇海基六路218弄",
        "name": "海立方科技园",
        "lnglat": "121.910310,30.865002",
        "count": 30
    },
    {
        "address": "新村路1321号",
        "name": "新村路1321号",
        "lnglat": "121.413811,31.266762",
        "count": 2
    },
    {
        "address": "新村路1759弄",
        "name": "凯旋花园",
        "lnglat": "106.767398,39.225873",
        "count": 102
    },
    {
        "address": "新村路2080弄",
        "name": "万里晶品苑",
        "lnglat": "106.767398,39.225873",
        "count": 40
    },
    {
        "address": "新村路423弄",
        "name": "绿地普陀商务广场",
        "lnglat": "103.268114,29.231922",
        "count": 55
    },
    {
        "address": "新村路550弄",
        "name": "西部名邸",
        "lnglat": "106.767056,39.225622",
        "count": 44
    },
    {
        "address": "新村路789弄",
        "name": "嘉华苑",
        "lnglat": "121.417245,31.266933",
        "count": 72
    },
    {
        "address": "新村路877号",
        "name": "大华齐成晟商务园",
        "lnglat": "121.414535,31.266670",
        "count": 14
    },
    {
        "address": "新二路183弄",
        "name": "馨良苑",
        "lnglat": "121.475548,31.325229",
        "count": 108
    },
    {
        "address": "新二路999弄",
        "name": "四季绿城",
        "lnglat": "121.476359,31.327489",
        "count": 176
    },
    {
        "address": "新飞路1500号",
        "name": "上海市松江科技创业中心",
        "lnglat": "121.318314,31.038684",
        "count": 33
    },
    {
        "address": "新飞路1756号",
        "name": "翔展创客园",
        "lnglat": "121.318750,31.045662",
        "count": 18
    },
    {
        "address": "新府中路1536弄",
        "name": "华新宝龙城市广场",
        "lnglat": "121.234833,31.228751",
        "count": 38
    },
    {
        "address": "新府中路1600号，华志路333弄",
        "name": "虹桥宝龙城",
        "lnglat": "121.227124,31.230466",
        "count": 49
    },
    {
        "address": "新格路388号",
        "name": "屺盛科研中心",
        "lnglat": "121.281040,31.050706",
        "count": 3
    },
    {
        "address": "新格路599号",
        "name": "新格路599号商务楼",
        "lnglat": "121.280597,31.054924",
        "count": 5
    },
    {
        "address": "新沪路1083弄",
        "name": "上寓酒店公寓（唐鋆酒店公寓）",
        "lnglat": "121.419828,31.276215",
        "count": 10
    },
    {
        "address": "新沪路198弄",
        "name": "久华佳苑",
        "lnglat": "121.420185,31.269082",
        "count": 69
    },
    {
        "address": "新沪路250号",
        "name": "久华商务楼",
        "lnglat": "121.420214,31.270458",
        "count": 6
    },
    {
        "address": "新沪路55弄",
        "name": "久华佳苑二期",
        "lnglat": "121.418809,31.267991",
        "count": 44
    },
    {
        "address": "新沪路58弄",
        "name": "水韵华庭西苑",
        "lnglat": "121.419500,31.267579",
        "count": 68
    },
    {
        "address": "新华路272弄",
        "name": "畅翠苑",
        "lnglat": "107.516994,26.257131",
        "count": 2
    },
    {
        "address": "新华路2号",
        "name": "鸿发苑",
        "lnglat": "110.035653,37.611512",
        "count": 10
    },
    {
        "address": "新华路329弄47-71号",
        "name": "新华名门",
        "lnglat": "107.517372,26.257248",
        "count": 22
    },
    {
        "address": "新华路519号",
        "name": "新华御庭",
        "lnglat": "121.422873,31.204064",
        "count": 9
    },
    {
        "address": "新华路543号",
        "name": "上海新华大厦",
        "lnglat": "121.422377,31.204226",
        "count": 17
    },
    {
        "address": "新华路569弄77号",
        "name": "鉴赏新华小区",
        "lnglat": "106.924916,27.686563",
        "count": 29
    },
    {
        "address": "新华路569弄99号",
        "name": "当代新华",
        "lnglat": "106.924916,27.686563",
        "count": 37
    },
    {
        "address": "新华路590弄6-16号",
        "name": "博园",
        "lnglat": "112.961398,22.776511",
        "count": 18
    },
    {
        "address": "新华路664号",
        "name": "万宝国际商务中心",
        "lnglat": "121.420885,31.205137",
        "count": 7
    },
    {
        "address": "新华路666弄1-5号",
        "name": "申亚新华府",
        "lnglat": "109.028116,25.992053",
        "count": 17
    },
    {
        "address": "新华路668号",
        "name": "申畅国际商务楼",
        "lnglat": "121.419935,31.205447",
        "count": 5
    },
    {
        "address": "新华路699弄1-3号",
        "name": "新华嘉利公寓",
        "lnglat": "109.028116,25.992053",
        "count": 9
    },
    {
        "address": "新华路720号",
        "name": "交通公寓",
        "lnglat": "121.418353,31.205790",
        "count": 3
    },
    {
        "address": "新华路726号",
        "name": "新华世纪园",
        "lnglat": "121.418653,31.206520",
        "count": 48
    },
    {
        "address": "新华路728号",
        "name": "华联发展大厦",
        "lnglat": "121.417808,31.206332",
        "count": 8
    },
    {
        "address": "新华路755号",
        "name": "凯新苑",
        "lnglat": "121.418174,31.205248",
        "count": 8
    },
    {
        "address": "新嘉路1弄",
        "name": "瑞嘉苑小区",
        "lnglat": "118.016437,24.519734",
        "count": 28
    },
    {
        "address": "新疆路500号",
        "name": "绿地海悦酒店公寓",
        "lnglat": "121.466916,31.242455",
        "count": 7
    },
    {
        "address": "新界路1号",
        "name": "微衡1号工坊",
        "lnglat": "121.201618,30.188007",
        "count": 20
    },
    {
        "address": "新金桥路1122号",
        "name": "方正大厦",
        "lnglat": "121.621738,31.259990",
        "count": 16
    },
    {
        "address": "新金桥路1599弄",
        "name": "东方万国企业中心",
        "lnglat": "121.620540,31.256779",
        "count": 18
    },
    {
        "address": "新金桥路1599弄B2栋",
        "name": "东方万国企业中心B2栋",
        "lnglat": "121.620540,31.256779",
        "count": 4
    },
    {
        "address": "新金桥路1888号36号楼",
        "name": "凯龙金领大厦",
        "lnglat": "121.622357,31.259840",
        "count": 23
    },
    {
        "address": "新金桥路1888号7号楼",
        "name": "金领之都",
        "lnglat": "121.622357,31.259840",
        "count": 43
    },
    {
        "address": "新金桥路201号",
        "name": "现代通信大厦",
        "lnglat": "121.598618,31.248127",
        "count": 8
    },
    {
        "address": "新金桥路255号",
        "name": "金桥商务公寓",
        "lnglat": "121.599397,31.248751",
        "count": 14
    },
    {
        "address": "新金桥路28号",
        "name": "新金桥大厦",
        "lnglat": "121.591493,31.245645",
        "count": 4
    },
    {
        "address": "新金桥路58号",
        "name": "银东大厦",
        "lnglat": "121.593215,31.246659",
        "count": 24
    },
    {
        "address": "新骏环路115号",
        "name": "寰启商务中心",
        "lnglat": "121.523268,31.089420",
        "count": 5
    },
    {
        "address": "新骏环路188号",
        "name": "漕河泾浦江高科技园F区",
        "lnglat": "121.519958,31.090787",
        "count": 57
    },
    {
        "address": "新兰路9号",
        "name": "晓富金融大厦",
        "lnglat": "121.589222,31.351632",
        "count": 9
    },
    {
        "address": "新乐路158号",
        "name": "东湖公寓",
        "lnglat": "113.905310,22.554440",
        "count": 2
    },
    {
        "address": "新龙路1111弄",
        "name": "万科朗润园",
        "lnglat": "104.438605,30.844212",
        "count": 69
    },
    {
        "address": "新龙路1333弄",
        "name": "七宝万新国际中心",
        "lnglat": "104.438605,30.844212",
        "count": 162
    },
    {
        "address": "新龙路311弄6号",
        "name": "七宝宝龙城T6",
        "lnglat": "121.355956,31.159265",
        "count": 3
    },
    {
        "address": "新龙路399弄56号",
        "name": "七宝宝龙城",
        "lnglat": "121.353574,31.158969",
        "count": 24
    },
    {
        "address": "新庙三路669号",
        "name": "669科创园",
        "lnglat": "121.284915,31.053472",
        "count": 9
    },
    {
        "address": "新闵路481弄",
        "name": "星河景苑",
        "lnglat": "121.428016,31.001749",
        "count": 223
    },
    {
        "address": "新南街299弄",
        "name": "亚龙华泽新苑",
        "lnglat": "103.878675,30.808028",
        "count": 50
    },
    {
        "address": "新南街301弄",
        "name": "万宇阳光苑",
        "lnglat": "103.878604,30.807983",
        "count": 87
    },
    {
        "address": "新南街350弄",
        "name": "新桥首府",
        "lnglat": "118.951916,25.115458",
        "count": 52
    },
    {
        "address": "新农河路508弄",
        "name": "上坤旭辉墅",
        "lnglat": "121.292826,31.091773",
        "count": 42
    },
    {
        "address": "新桥镇明中路881弄，1010弄",
        "name": "万科白马花园",
        "lnglat": "121.343323,31.078383",
        "count": 91
    },
    {
        "address": "新泉路66弄",
        "name": "万里欣苑",
        "lnglat": "106.769097,26.629782",
        "count": 50
    },
    {
        "address": "新胜路155号",
        "name": "圆益科创产业园",
        "lnglat": "121.339089,37.562034",
        "count": 4
    },
    {
        "address": "新市路251弄",
        "name": "曲阳名邸",
        "lnglat": "120.792764,30.665040",
        "count": 40
    },
    {
        "address": "新市路86号",
        "name": "灵峰公寓",
        "lnglat": "107.323768,25.833144",
        "count": 2
    },
    {
        "address": "新市南路515弄",
        "name": "五矿公寓",
        "lnglat": "121.481324,31.291283",
        "count": 20
    },
    {
        "address": "新市南路780弄",
        "name": "望隆苑（望华苑）",
        "lnglat": "121.479715,31.295916",
        "count": 29
    },
    {
        "address": "新水路9号",
        "name": "济洪圆创",
        "lnglat": "121.138936,31.169541",
        "count": 1
    },
    {
        "address": "新松江路1060号",
        "name": "恒杰商务大楼B座",
        "lnglat": "121.217049,31.039200",
        "count": 5
    },
    {
        "address": "新松江路1234号",
        "name": "恒杰商务大楼A座",
        "lnglat": "121.212657,31.039241",
        "count": 6
    },
    {
        "address": "新松江路1277号",
        "name": "东鼎商务大厦",
        "lnglat": "121.210596,31.037760",
        "count": 52
    },
    {
        "address": "新松江路1455号",
        "name": "东鼎名人府",
        "lnglat": "121.207708,31.038537",
        "count": 71
    },
    {
        "address": "新松江路887弄",
        "name": "单身公寓",
        "lnglat": "121.220102,31.038479",
        "count": 24
    },
    {
        "address": "新松江路925号",
        "name": "丰源大厦(上海)",
        "lnglat": "121.219561,31.037996",
        "count": 2
    },
    {
        "address": "新雅东路125弄",
        "name": "唐镇同福苑",
        "lnglat": "121.688464,31.237614",
        "count": 105
    },
    {
        "address": "新杨公路1666号",
        "name": "临港润材智能产业园",
        "lnglat": "121.761691,30.873023",
        "count": 3
    },
    {
        "address": "新渔东路456弄",
        "name": "知雅园",
        "lnglat": "121.382467,31.212570",
        "count": 35
    },
    {
        "address": "新渔东路60号",
        "name": "安龙大楼",
        "lnglat": "121.393194,31.211843",
        "count": 8
    },
    {
        "address": "新渔东路800号",
        "name": "莲森集团商务楼",
        "lnglat": "121.378301,31.214257",
        "count": 7
    },
    {
        "address": "新郁路846弄56号",
        "name": "兆地商务金座_B座",
        "lnglat": "121.363639,31.252068",
        "count": 14
    },
    {
        "address": "新源路1356号",
        "name": "上海正珏科技电子商务产业园",
        "lnglat": "121.397916,31.048908",
        "count": 24
    },
    {
        "address": "新源路1399弄",
        "name": "上海航天人才公寓",
        "lnglat": "121.150391,31.309529",
        "count": 102
    },
    {
        "address": "新跃路900弄",
        "name": "绿杨家园",
        "lnglat": "102.869915,36.413943",
        "count": 38
    },
    {
        "address": "新闸路1001号",
        "name": "亚成公寓",
        "lnglat": "121.457033,31.233181",
        "count": 6
    },
    {
        "address": "新闸路166号",
        "name": "水景苑",
        "lnglat": "121.406598,28.639664",
        "count": 12
    },
    {
        "address": "新闸路1851号",
        "name": "新闸大厦",
        "lnglat": "121.442899,31.227102",
        "count": 2
    },
    {
        "address": "新闸路218号",
        "name": "中泰公寓",
        "lnglat": "121.356702,31.642738",
        "count": 6
    },
    {
        "address": "新闸路356号",
        "name": "悦达黄浦河滨大厦",
        "lnglat": "121.466972,31.239669",
        "count": 17
    },
    {
        "address": "新闸路831弄",
        "name": "丽都新贵",
        "lnglat": "113.445570,29.805463",
        "count": 17
    },
    {
        "address": "新镇街1058弄",
        "name": "东渡海派青城",
        "lnglat": "121.315412,31.066628",
        "count": 88
    },
    {
        "address": "新镇街99弄",
        "name": "九城家天下商务楼",
        "lnglat": "112.165820,29.399824",
        "count": 3
    },
    {
        "address": "新中街119弄1-22号",
        "name": "新乐雅苑",
        "lnglat": "104.089537,30.556531",
        "count": 9
    },
    {
        "address": "新中街199号",
        "name": "新乐名苑",
        "lnglat": "121.310036,31.063368",
        "count": 52
    },
    {
        "address": "鑫都路2688号",
        "name": "天恒名城",
        "lnglat": "121.392301,31.056877",
        "count": 247
    },
    {
        "address": "邢家桥北路269号",
        "name": "天伦家园",
        "lnglat": "121.485449,31.258148",
        "count": 16
    },
    {
        "address": "行南路1150弄",
        "name": "南新西园",
        "lnglat": "121.582406,31.327876",
        "count": 135
    },
    {
        "address": "行南路900弄",
        "name": "南新东园",
        "lnglat": "121.588575,31.327729",
        "count": 108
    },
    {
        "address": "行知路380弄",
        "name": "远景佳苑一期",
        "lnglat": "121.415653,31.285669",
        "count": 32
    },
    {
        "address": "行知路381弄",
        "name": "远景佳苑二期",
        "lnglat": "121.413054,31.285430",
        "count": 87
    },
    {
        "address": "兴国路228号",
        "name": "嘉豪苑",
        "lnglat": "115.810703,28.684554",
        "count": 2
    },
    {
        "address": "兴虹路299弄",
        "name": "万科时一区二期（虹桥万科润园）",
        "lnglat": "121.311546,31.202151",
        "count": 64
    },
    {
        "address": "兴虹路368弄",
        "name": "万科润园时一区三期",
        "lnglat": "121.311060,31.203422",
        "count": 21
    },
    {
        "address": "兴虹路399弄",
        "name": "万科润园时一区四期",
        "lnglat": "121.310515,31.202148",
        "count": 59
    },
    {
        "address": "兴梅路1199弄",
        "name": "春申景城二期",
        "lnglat": "121.412072,31.105395",
        "count": 191
    },
    {
        "address": "兴梅路485号",
        "name": "中环科技园",
        "lnglat": "121.427621,31.109627",
        "count": 12
    },
    {
        "address": "兴义路48号",
        "name": "新世纪广场",
        "lnglat": "121.403649,31.204464",
        "count": 26
    },
    {
        "address": "兴义路8号",
        "name": "万都中心大厦",
        "lnglat": "104.978502,25.156134",
        "count": 15
    },
    {
        "address": "杏山路12弄-1-9号",
        "name": "泰富苑",
        "lnglat": "121.409397,31.232519",
        "count": 2
    },
    {
        "address": "杏山路500弄",
        "name": "曹杨华庭",
        "lnglat": "121.404675,31.237873",
        "count": 52
    },
    {
        "address": "杏山路8号",
        "name": "银都名庭",
        "lnglat": "117.763566,35.919301",
        "count": 20
    },
    {
        "address": "幸福路111弄1-6号（新华路）",
        "name": "恒力苑",
        "lnglat": "121.431090,31.205026",
        "count": 6
    },
    {
        "address": "幸福路42号",
        "name": "福苑大厦",
        "lnglat": "121.431398,31.203950",
        "count": 10
    },
    {
        "address": "幸福路88号",
        "name": "浙海公寓",
        "lnglat": "121.431394,31.204541",
        "count": 10
    },
    {
        "address": "秀淳路233弄1～20号",
        "name": "绿地新里城派克公馆",
        "lnglat": "121.157077,31.166048",
        "count": 78
    },
    {
        "address": "秀禾路235弄",
        "name": "佳福雅苑A2",
        "lnglat": "121.156805,31.156190",
        "count": 63
    },
    {
        "address": "秀涓路338弄",
        "name": "崧泽华城华中苑3区",
        "lnglat": "121.154643,31.141281",
        "count": 346
    },
    {
        "address": "秀涓路46弄",
        "name": "观景雅苑",
        "lnglat": "121.155732,31.141040",
        "count": 112
    },
    {
        "address": "秀康路958弄",
        "name": "周康新苑",
        "lnglat": "121.562903,31.136128",
        "count": 76
    },
    {
        "address": "秀浦路2388号",
        "name": "上海康桥先进制造技术创业园",
        "lnglat": "121.605319,31.128415",
        "count": 53
    },
    {
        "address": "秀浦路2555号",
        "name": "漕河泾康桥商务绿洲（临港康桥商务绿洲）",
        "lnglat": "121.606820,31.132409",
        "count": 66
    },
    {
        "address": "秀浦路3188弄",
        "name": "创研智造E",
        "lnglat": "121.623756,31.128419",
        "count": 12
    },
    {
        "address": "秀浦路886弄",
        "name": "绿地东上海海富城市花园3期（海富城市花园二期C块）",
        "lnglat": "121.572149,31.126387",
        "count": 163
    },
    {
        "address": "秀沁路132弄",
        "name": "和瑞东苑",
        "lnglat": "121.159284,31.139062",
        "count": 88
    },
    {
        "address": "秀沁路238弄",
        "name": "和瑞西苑",
        "lnglat": "121.156769,31.139105",
        "count": 104
    },
    {
        "address": "秀水新路145弄",
        "name": "龙潭南苑",
        "lnglat": "121.230204,31.008692",
        "count": 8
    },
    {
        "address": "秀文路898号",
        "name": "西子国际中心",
        "lnglat": "121.363556,31.123435",
        "count": 22
    },
    {
        "address": "秀文路908号(莘庄商务区内)",
        "name": "中铁诺德国际中心",
        "lnglat": "121.367745,31.124956",
        "count": 54
    },
    {
        "address": "秀沿路1028弄",
        "name": "康桥城中花园（康桥半岛秀溪公寓）",
        "lnglat": "121.579706,31.130553",
        "count": 135
    },
    {
        "address": "秀沿路1668号",
        "name": "八元桥创新创业园",
        "lnglat": "121.593086,31.135763",
        "count": 10
    },
    {
        "address": "秀沿西路258弄",
        "name": "中海御景熙岸",
        "lnglat": "121.529790,31.129512",
        "count": 120
    },
    {
        "address": "秀沿西路68弄",
        "name": "保利林语溪",
        "lnglat": "121.537304,31.131437",
        "count": 171
    },
    {
        "address": "秀韵路105弄",
        "name": "灏景湾",
        "lnglat": "121.520597,30.934345",
        "count": 5
    },
    {
        "address": "秀泽路225弄",
        "name": "佳福雅苑A6",
        "lnglat": "121.156162,31.154051",
        "count": 114
    },
    {
        "address": "秀泽路226弄",
        "name": "佳福雅苑A4",
        "lnglat": "121.157100,31.154969",
        "count": 49
    },
    {
        "address": "徐和路58弄",
        "name": "首创禧瑞庭",
        "lnglat": "121.280565,31.157844",
        "count": 88
    },
    {
        "address": "徐虹北路18弄",
        "name": "徐家汇景园",
        "lnglat": "121.427638,31.188991",
        "count": 33
    },
    {
        "address": "徐虹北路5弄",
        "name": "徐虹华庭（哈佛印象）",
        "lnglat": "121.425357,31.190065",
        "count": 77
    },
    {
        "address": "徐虹中路20号",
        "name": "西岸创意园一期",
        "lnglat": "121.424598,31.188182",
        "count": 10
    },
    {
        "address": "徐汇区柳州路585弄",
        "name": "申德公寓",
        "lnglat": "121.421519,31.176847",
        "count": 17
    },
    {
        "address": "徐家汇路1弄",
        "name": "新家坡园景苑",
        "lnglat": "121.481948,31.210279",
        "count": 68
    },
    {
        "address": "徐家汇路268号",
        "name": "凯德晶萃广场",
        "lnglat": "121.477067,31.210363",
        "count": 51
    },
    {
        "address": "徐家汇路388号",
        "name": "瑞金新苑",
        "lnglat": "121.474054,31.209526",
        "count": 14
    },
    {
        "address": "徐家汇路515号",
        "name": "汇龙新城",
        "lnglat": "121.475985,31.208369",
        "count": 70
    },
    {
        "address": "徐家汇路518号",
        "name": "天天花园",
        "lnglat": "121.471266,31.207382",
        "count": 24
    },
    {
        "address": "徐家汇路550号",
        "name": "宝鼎大厦",
        "lnglat": "121.470402,31.206169",
        "count": 24
    },
    {
        "address": "徐家汇路552弄1号",
        "name": "富源公寓",
        "lnglat": "121.470162,31.206833",
        "count": 1
    },
    {
        "address": "徐家汇路558弄1号",
        "name": "双钱公寓",
        "lnglat": "121.469597,31.207021",
        "count": 15
    },
    {
        "address": "徐家汇路569号",
        "name": "帝庭爱仕大厦",
        "lnglat": "121.472314,31.207028",
        "count": 12
    },
    {
        "address": "徐灵路300弄",
        "name": "二联馨苑",
        "lnglat": "121.292542,31.198458",
        "count": 116
    },
    {
        "address": "徐塘路519号",
        "name": "阡陌创意产业园",
        "lnglat": "121.266238,31.047690",
        "count": 5
    },
    {
        "address": "徐塘路58号",
        "name": "民丰科创园",
        "lnglat": "121.277467,31.047133",
        "count": 6
    },
    {
        "address": "徐祥路368号",
        "name": "8090青年创业基地数字经济总部园",
        "lnglat": "121.262990,31.195120",
        "count": 18
    },
    {
        "address": "徐祥路38号",
        "name": "西虹桥同联创新产业园",
        "lnglat": "121.269825,31.198615",
        "count": 13
    },
    {
        "address": "徐盈路588弄",
        "name": "锦绣逸庭",
        "lnglat": "121.259294,31.170794",
        "count": 128
    },
    {
        "address": "许昌路1560弄",
        "name": "伊东苑",
        "lnglat": "121.513467,31.272375",
        "count": 12
    },
    {
        "address": "许昌路630弄",
        "name": "全家福家园",
        "lnglat": "121.524069,31.259029",
        "count": 30
    },
    {
        "address": "许昌路899号",
        "name": "明昌公寓",
        "lnglat": "121.519878,31.262360",
        "count": 8
    },
    {
        "address": "宣化路28号",
        "name": "企业发展大厦",
        "lnglat": "120.355140,36.108647",
        "count": 7
    },
    {
        "address": "宣化路299弄",
        "name": "富都花园",
        "lnglat": "121.424654,31.216710",
        "count": 21
    },
    {
        "address": "宣化路300号",
        "name": "华宁国际大厦",
        "lnglat": "121.422436,31.217479",
        "count": 6
    },
    {
        "address": "宣秋路129号",
        "name": "上海尧煊实业有限公司(园区)",
        "lnglat": "121.712937,31.089585",
        "count": 11
    },
    {
        "address": "宣秋路858号",
        "name": "盛镛智慧科技园",
        "lnglat": "121.726959,31.089102",
        "count": 3
    },
    {
        "address": "学府街88弄",
        "name": "三湘世纪花城三期",
        "lnglat": "105.709880,29.700986",
        "count": 78
    },
    {
        "address": "学后街28号",
        "name": "银桥商务大楼",
        "lnglat": "121.582951,31.349864",
        "count": 4
    },
    {
        "address": "学林路36弄",
        "name": "研创园",
        "lnglat": "105.080237,31.086921",
        "count": 6
    },
    {
        "address": "学前街111弄",
        "name": "沧海苑",
        "lnglat": "102.922102,30.158392",
        "count": 28
    },
    {
        "address": "学院路32弄",
        "name": "圣莲大厦",
        "lnglat": "113.914492,30.931484",
        "count": 8
    },
    {
        "address": "雪绒花路369弄",
        "name": "金域澜湾",
        "lnglat": "121.924400,30.914727",
        "count": 285
    },
    {
        "address": "雪松路392号",
        "name": "锦翔大楼",
        "lnglat": "121.353071,31.285505",
        "count": 16
    },
    {
        "address": "雅丹路789弄",
        "name": "昌吉名邸",
        "lnglat": "121.198691,31.294648",
        "count": 54
    },
    {
        "address": "延安东路1200号",
        "name": "电信世界",
        "lnglat": "121.472673,31.226184",
        "count": 6
    },
    {
        "address": "延安东路175号",
        "name": "旺角广场",
        "lnglat": "120.602912,29.989281",
        "count": 11
    },
    {
        "address": "延安东路222号",
        "name": "外滩中心",
        "lnglat": "106.718030,26.585760",
        "count": 6
    },
    {
        "address": "延安东路45号",
        "name": "工商联大厦",
        "lnglat": "106.715881,26.585534",
        "count": 3
    },
    {
        "address": "延安东路550号",
        "name": "海洋大厦",
        "lnglat": "121.481499,31.230938",
        "count": 30
    },
    {
        "address": "延安东路600-618号",
        "name": "远洋商业大厦(一期)",
        "lnglat": "106.718181,26.585806",
        "count": 7
    },
    {
        "address": "延安东路618号",
        "name": "远洋商业大厦(二期)",
        "lnglat": "120.613834,29.988225",
        "count": 14
    },
    {
        "address": "延安东路700号",
        "name": "港泰广场",
        "lnglat": "121.479348,31.229796",
        "count": 5
    },
    {
        "address": "延安西路1030弄",
        "name": "佳信都市花园",
        "lnglat": "121.431682,31.212216",
        "count": 30
    },
    {
        "address": "延安西路1033号",
        "name": "大众金融大厦",
        "lnglat": "121.429688,31.212598",
        "count": 9
    },
    {
        "address": "延安西路1088号",
        "name": "长峰中心",
        "lnglat": "121.430956,31.211582",
        "count": 51
    },
    {
        "address": "延安西路1118号",
        "name": "龙之梦大厦(延安路)",
        "lnglat": "121.430331,31.210834",
        "count": 21
    },
    {
        "address": "延安西路1146号",
        "name": "新先锋商务中心",
        "lnglat": "121.430703,31.210304",
        "count": 4
    },
    {
        "address": "延安西路1221号",
        "name": "泛太大厦",
        "lnglat": "121.427860,31.210864",
        "count": 2
    },
    {
        "address": "延安西路1228弄2号",
        "name": "上海嘉利大厦",
        "lnglat": "121.427844,31.209853",
        "count": 50
    },
    {
        "address": "延安西路1228弄4号",
        "name": "嘉阳公寓",
        "lnglat": "121.428279,31.209521",
        "count": 3
    },
    {
        "address": "延安西路1228弄8号",
        "name": "嘉苑公寓",
        "lnglat": "121.428453,31.209197",
        "count": 9
    },
    {
        "address": "延安西路1235弄",
        "name": "佳达新苑",
        "lnglat": "121.427393,31.211105",
        "count": 35
    },
    {
        "address": "延安西路1260号",
        "name": "延安公寓(延安西路)",
        "lnglat": "121.427125,31.210005",
        "count": 4
    },
    {
        "address": "延安西路1262号",
        "name": "上生新所",
        "lnglat": "121.427407,31.208476",
        "count": 8
    },
    {
        "address": "延安西路129号",
        "name": "华侨大厦",
        "lnglat": "106.699795,26.581522",
        "count": 4
    },
    {
        "address": "延安西路1303号",
        "name": "上汽万众大厦",
        "lnglat": "121.426041,31.210552",
        "count": 12
    },
    {
        "address": "延安西路1326号",
        "name": "生物大厦",
        "lnglat": "121.425759,31.209621",
        "count": 16
    },
    {
        "address": "延安西路1328弄",
        "name": "今日丽园",
        "lnglat": "121.425515,31.209255",
        "count": 26
    },
    {
        "address": "延安西路1355弄1、2号（定西路）",
        "name": "银都公寓",
        "lnglat": "121.424417,31.210415",
        "count": 8
    },
    {
        "address": "延安西路1399号",
        "name": "汇享1399",
        "lnglat": "121.424037,31.210064",
        "count": 4
    },
    {
        "address": "延安西路1448弄",
        "name": "华融国际大厦",
        "lnglat": "121.422894,31.208866",
        "count": 7
    },
    {
        "address": "延安西路1566号",
        "name": "龙峰大厦",
        "lnglat": "121.420851,31.208337",
        "count": 4
    },
    {
        "address": "延安西路1590号",
        "name": "增泽世贸大楼",
        "lnglat": "121.419882,31.208427",
        "count": 3
    },
    {
        "address": "延安西路1600号",
        "name": "禾森商务中心",
        "lnglat": "121.419790,31.207997",
        "count": 8
    },
    {
        "address": "延安西路2067号",
        "name": "仲盛金融中心",
        "lnglat": "121.408174,31.203960",
        "count": 4
    },
    {
        "address": "延安西路2077号",
        "name": "金桥大厦",
        "lnglat": "121.407530,31.203580",
        "count": 14
    },
    {
        "address": "延安西路2201号",
        "name": "上海国际贸易中心",
        "lnglat": "121.404085,31.202415",
        "count": 4
    },
    {
        "address": "延安西路2299号",
        "name": "上海世贸商城",
        "lnglat": "121.400640,31.201794",
        "count": 115
    },
    {
        "address": "延安西路2633号",
        "name": "美丽华商务中心(美丽华商务大厦)",
        "lnglat": "121.392469,31.197488",
        "count": 11
    },
    {
        "address": "延安西路300号",
        "name": "静安大厦",
        "lnglat": "121.439477,31.219202",
        "count": 5
    },
    {
        "address": "延安西路3062弄18号",
        "name": "华菱大厦",
        "lnglat": "121.380278,31.189807",
        "count": 2
    },
    {
        "address": "延安西路3500号",
        "name": "南洋绿都",
        "lnglat": "121.360579,31.183694",
        "count": 20
    },
    {
        "address": "延安西路358号",
        "name": "美丽园大厦",
        "lnglat": "121.439086,31.218843",
        "count": 9
    },
    {
        "address": "延安西路376弄22号",
        "name": "永兴商务楼",
        "lnglat": "121.437834,31.218915",
        "count": 8
    },
    {
        "address": "延安西路396号",
        "name": "美丽园大酒店",
        "lnglat": "121.437869,31.218424",
        "count": 3
    },
    {
        "address": "延安西路487/501号",
        "name": "政宁小区",
        "lnglat": "121.437515,31.216603",
        "count": 10
    },
    {
        "address": "延安西路500号",
        "name": "嘉宁国际大厦",
        "lnglat": "121.436321,31.217144",
        "count": 25
    },
    {
        "address": "延安西路548弄3-11号",
        "name": "申亚瑞庭",
        "lnglat": "121.435765,31.217484",
        "count": 14
    },
    {
        "address": "延安西路688弄",
        "name": "华敏世纪广场_上海",
        "lnglat": "121.433924,31.216251",
        "count": 62
    },
    {
        "address": "延安西路719号",
        "name": "佳都大厦",
        "lnglat": "121.434260,31.214368",
        "count": 10
    },
    {
        "address": "延安西路777号",
        "name": "裕丰国际广场",
        "lnglat": "121.434646,31.214075",
        "count": 6
    },
    {
        "address": "延安西路895号",
        "name": "申亚金融广场",
        "lnglat": "121.432241,31.214631",
        "count": 16
    },
    {
        "address": "延安西路973、983号",
        "name": "五环大楼",
        "lnglat": "121.431415,31.213703",
        "count": 12
    },
    {
        "address": "延安中路596号",
        "name": "天壹坊",
        "lnglat": "121.462513,31.224344",
        "count": 1
    },
    {
        "address": "延安中路658号",
        "name": "陕西大厦",
        "lnglat": "121.461642,31.224403",
        "count": 3
    },
    {
        "address": "延安中路841号",
        "name": "东方海外大厦",
        "lnglat": "121.454393,31.223126",
        "count": 7
    },
    {
        "address": "延川路299弄",
        "name": "广德苑",
        "lnglat": "121.369109,31.246168",
        "count": 4
    },
    {
        "address": "延吉东路140弄",
        "name": "长华绿苑",
        "lnglat": "121.544852,31.292483",
        "count": 35
    },
    {
        "address": "延吉中路25弄",
        "name": "泰鸿新苑",
        "lnglat": "121.534956,31.284538",
        "count": 32
    },
    {
        "address": "延平路121号",
        "name": "三和大厦",
        "lnglat": "121.441008,31.228474",
        "count": 14
    },
    {
        "address": "延平路123弄1-16号",
        "name": "三和花园",
        "lnglat": "121.439958,31.228338",
        "count": 8
    },
    {
        "address": "延平路128号",
        "name": "盛达园区",
        "lnglat": "121.441111,31.229073",
        "count": 2
    },
    {
        "address": "延平路135号",
        "name": "静安WE",
        "lnglat": "121.440634,31.229221",
        "count": 20
    },
    {
        "address": "延平路223弄",
        "name": "益民公寓",
        "lnglat": "121.439591,31.230343",
        "count": 16
    },
    {
        "address": "延平路518弄",
        "name": "静安锦都公寓",
        "lnglat": "121.436866,31.235555",
        "count": 2
    },
    {
        "address": "延平路69号",
        "name": "延平大厦",
        "lnglat": "119.300989,26.052793",
        "count": 1
    },
    {
        "address": "延平路81号",
        "name": "金叶大楼",
        "lnglat": "119.300857,26.052707",
        "count": 4
    },
    {
        "address": "延平路98号",
        "name": "98创意园",
        "lnglat": "121.441804,31.228477",
        "count": 2
    },
    {
        "address": "延长路162弄",
        "name": "爱甸苑",
        "lnglat": "121.452483,31.270177",
        "count": 6
    },
    {
        "address": "延长路99弄",
        "name": "峥宸苑",
        "lnglat": "121.462317,31.274490",
        "count": 48
    },
    {
        "address": "延长西路220弄5号",
        "name": "浦安公寓",
        "lnglat": "121.438034,31.263326",
        "count": 7
    },
    {
        "address": "延长西路555弄4、6、7号（广新路）",
        "name": "银都佳园",
        "lnglat": "121.432323,31.259602",
        "count": 27
    },
    {
        "address": "延长西路633弄3号",
        "name": "志丹苑",
        "lnglat": "121.429970,31.259091",
        "count": 8
    },
    {
        "address": "延长西路677弄",
        "name": "华延公寓",
        "lnglat": "121.427214,31.259315",
        "count": 28
    },
    {
        "address": "延长中路576号",
        "name": "新世纪公寓（延长中路）",
        "lnglat": "121.450277,31.269014",
        "count": 14
    },
    {
        "address": "延长中路619号",
        "name": "延中大厦",
        "lnglat": "121.448855,31.268683",
        "count": 13
    },
    {
        "address": "延长中路625号",
        "name": "延长工业园",
        "lnglat": "121.448467,31.268926",
        "count": 20
    },
    {
        "address": "延长中路629弄",
        "name": "延铁家园",
        "lnglat": "121.447795,31.269010",
        "count": 32
    },
    {
        "address": "延长中路801号",
        "name": "新华文化科技园",
        "lnglat": "121.444818,31.266887",
        "count": 9
    },
    {
        "address": "严家桥路1号",
        "name": "宏慧音悦湾",
        "lnglat": "121.529431,31.196454",
        "count": 28
    },
    {
        "address": "严桥路58弄",
        "name": "由由新邸",
        "lnglat": "121.526389,31.189241",
        "count": 132
    },
    {
        "address": "言迈路219弄",
        "name": "水畔兰庭",
        "lnglat": "121.342311,31.360067",
        "count": 30
    },
    {
        "address": "盐铁塘路176弄",
        "name": "永康城蒲芳苑",
        "lnglat": "121.511349,31.036169",
        "count": 72
    },
    {
        "address": "盐铁塘路272弄1-21号",
        "name": "永康城丽华园",
        "lnglat": "121.508727,31.036185",
        "count": 66
    },
    {
        "address": "盐铁塘路565弄",
        "name": "永康城星华园",
        "lnglat": "121.501423,31.034366",
        "count": 40
    },
    {
        "address": "雁荡路5号",
        "name": "金雁坊",
        "lnglat": "120.704487,30.882858",
        "count": 4
    },
    {
        "address": "阳城路280弄",
        "name": "阳城贵都",
        "lnglat": "121.425925,31.284558",
        "count": 187
    },
    {
        "address": "阳城路283弄",
        "name": "大华阳城花园",
        "lnglat": "121.426177,31.284049",
        "count": 80
    },
    {
        "address": "阳城路388弄",
        "name": "浦联佳苑",
        "lnglat": "121.423040,31.284930",
        "count": 16
    },
    {
        "address": "杨高北路1188号",
        "name": "阳明花园广场",
        "lnglat": "121.591942,31.336554",
        "count": 25
    },
    {
        "address": "杨高北路528号",
        "name": "招商中心大楼",
        "lnglat": "121.587391,31.345736",
        "count": 5
    },
    {
        "address": "杨高北路5291弄",
        "name": "金桥新城（金石苑）",
        "lnglat": "121.605505,31.264735",
        "count": 48
    },
    {
        "address": "杨高北路536号",
        "name": "乐非天地",
        "lnglat": "121.587671,31.345725",
        "count": 13
    },
    {
        "address": "杨高北路610号",
        "name": "三铭公寓",
        "lnglat": "121.588146,31.344580",
        "count": 10
    },
    {
        "address": "杨高南路1288号",
        "name": "中远龙阳公寓",
        "lnglat": "121.529652,31.203739",
        "count": 17
    },
    {
        "address": "杨高南路2875号",
        "name": "康琳大楼",
        "lnglat": "121.519956,31.176507",
        "count": 21
    },
    {
        "address": "杨高南路428号",
        "name": "由由世纪广场",
        "lnglat": "121.534172,31.217295",
        "count": 52
    },
    {
        "address": "杨高南路5055号",
        "name": "明丰花园",
        "lnglat": "121.532103,31.150577",
        "count": 48
    },
    {
        "address": "杨高南路5135弄",
        "name": "日月豪庭",
        "lnglat": "121.534060,31.148877",
        "count": 24
    },
    {
        "address": "杨高南路729号",
        "name": "陆家嘴世纪金融广场",
        "lnglat": "121.535232,31.213523",
        "count": 5
    },
    {
        "address": "杨高中路2112号",
        "name": "界龙总部园",
        "lnglat": "121.556021,31.231936",
        "count": 8
    },
    {
        "address": "杨辉路966弄",
        "name": "禧瑞祥云",
        "lnglat": "121.664292,31.032674",
        "count": 24
    },
    {
        "address": "杨柳青路118弄",
        "name": "万都花园",
        "lnglat": "121.404324,31.234324",
        "count": 25
    },
    {
        "address": "杨南路399弄",
        "name": "翡翠上南苑上南翡翠",
        "lnglat": "121.404484,31.402765",
        "count": 57
    },
    {
        "address": "杨牌路488号",
        "name": "奥帛德文科创园",
        "lnglat": "121.489243,30.894063",
        "count": 8
    },
    {
        "address": "杨浦区黄兴路122号",
        "name": "光大信成大厦",
        "lnglat": "121.532678,31.271058",
        "count": 3
    },
    {
        "address": "杨树浦路1736弄",
        "name": "丰泰世纪公寓",
        "lnglat": "121.541543,31.258914",
        "count": 25
    },
    {
        "address": "杨树浦路248号",
        "name": "瑞丰国际大厦",
        "lnglat": "121.515675,31.250760",
        "count": 8
    },
    {
        "address": "杨树浦路2866号",
        "name": "上海国际时尚中心",
        "lnglat": "121.557522,31.272492",
        "count": 9
    },
    {
        "address": "杨树浦路2893号",
        "name": "海尚大厦",
        "lnglat": "121.557500,31.272188",
        "count": 48
    },
    {
        "address": "杨思路1121弄",
        "name": "东方悦居苑",
        "lnglat": "121.505787,31.164901",
        "count": 160
    },
    {
        "address": "杨思路855弄",
        "name": "申江豪城",
        "lnglat": "121.499898,31.164773",
        "count": 24
    },
    {
        "address": "杨泰路2158弄",
        "name": "远洋悦庭二期",
        "lnglat": "121.429522,31.393276",
        "count": 134
    },
    {
        "address": "杨泰路2158弄50-68号",
        "name": "远洋悦庭三期",
        "lnglat": "121.429684,31.395957",
        "count": 128
    },
    {
        "address": "杨泰路2158弄5-32号",
        "name": "远洋悦庭一期",
        "lnglat": "121.430522,31.393669",
        "count": 144
    },
    {
        "address": "杨新东路160号",
        "name": "世博树源",
        "lnglat": "121.503575,31.166070",
        "count": 1
    },
    {
        "address": "杨新路88号",
        "name": "尚馥骊湾88文化创意园",
        "lnglat": "113.966943,22.922956",
        "count": 11
    },
    {
        "address": "杨鑫路98弄",
        "name": "禄德华苑",
        "lnglat": "121.450984,31.370626",
        "count": 4
    },
    {
        "address": "杨宅路255号",
        "name": "新发现才富园",
        "lnglat": "121.417132,31.202803",
        "count": 3
    },
    {
        "address": "姚虹路299号",
        "name": "恒盛苑",
        "lnglat": "121.407541,31.190766",
        "count": 62
    },
    {
        "address": "耀华路488号",
        "name": "信建大厦",
        "lnglat": "121.482652,31.172335",
        "count": 13
    },
    {
        "address": "耀华路550弄",
        "name": "耀华大楼",
        "lnglat": "121.481458,31.171040",
        "count": 24
    },
    {
        "address": "耀元路58号",
        "name": "上海环球都会广场",
        "lnglat": "121.472528,31.169876",
        "count": 8
    },
    {
        "address": "业煌路1676弄",
        "name": "佘北家园丽雅苑",
        "lnglat": "121.202138,31.133318",
        "count": 89
    },
    {
        "address": "业煌路99弄",
        "name": "映虹桥（茂政滨水雅苑）",
        "lnglat": "121.233402,31.134272",
        "count": 148
    },
    {
        "address": "叶城东路350弄",
        "name": "唐家苑北区",
        "lnglat": "121.282267,31.376310",
        "count": 20
    },
    {
        "address": "叶城东路363弄",
        "name": "唐家苑中区",
        "lnglat": "121.283591,31.374790",
        "count": 14
    },
    {
        "address": "叶城路1118号",
        "name": "淮海国际广场(嘉定)",
        "lnglat": "121.244913,31.363068",
        "count": 11
    },
    {
        "address": "叶城路1128号",
        "name": "中青旅东方国际酒店",
        "lnglat": "121.244639,31.362754",
        "count": 9
    },
    {
        "address": "叶城路818号",
        "name": "嘉禾大厦_上海",
        "lnglat": "121.251748,31.365695",
        "count": 17
    },
    {
        "address": "叶家宅南路66弄128支弄1号",
        "name": "复景创园壹号",
        "lnglat": "121.435541,31.236405",
        "count": 7
    },
    {
        "address": "叶联路699弄",
        "name": "南山雨果",
        "lnglat": "121.270118,31.161379",
        "count": 216
    },
    {
        "address": "一二八纪念东路518弄",
        "name": "象屿郦庭",
        "lnglat": "121.478673,31.328222",
        "count": 108
    },
    {
        "address": "一二八纪念路933弄",
        "name": "好天缘家苑",
        "lnglat": "121.447033,31.325401",
        "count": 74
    },
    {
        "address": "一二八纪念路968号",
        "name": "宝山万达写字楼",
        "lnglat": "121.447170,31.323586",
        "count": 62
    },
    {
        "address": "伊犁南路111号",
        "name": "钱江商务广场",
        "lnglat": "121.403641,31.191123",
        "count": 3
    },
    {
        "address": "伊犁南路34弄",
        "name": "虹桥明珠公寓",
        "lnglat": "121.404998,31.191546",
        "count": 8
    },
    {
        "address": "伊犁南路500弄",
        "name": "古北中央花园",
        "lnglat": "121.407019,31.195795",
        "count": 68
    },
    {
        "address": "医学院路15号",
        "name": "嘉馨公寓",
        "lnglat": "121.459554,31.200414",
        "count": 9
    },
    {
        "address": "医学院路69弄",
        "name": "上海华业大厦",
        "lnglat": "106.510956,29.534072",
        "count": 9
    },
    {
        "address": "依玛路389弄",
        "name": "新城香溢璟庭",
        "lnglat": "121.248256,31.353901",
        "count": 167
    },
    {
        "address": "宜昌路588弄",
        "name": "大上海城市花园",
        "lnglat": "121.431096,31.243435",
        "count": 92
    },
    {
        "address": "宜川路299号",
        "name": "宜乐荟",
        "lnglat": "121.437994,31.262464",
        "count": 3
    },
    {
        "address": "宜川路351弄62-66号",
        "name": "展宏公寓",
        "lnglat": "121.439205,31.265015",
        "count": 12
    },
    {
        "address": "宜川路733弄",
        "name": "望景苑",
        "lnglat": "121.438107,31.269934",
        "count": 40
    },
    {
        "address": "宜川路778弄",
        "name": "宁泰馨苑",
        "lnglat": "121.438290,31.270553",
        "count": 76
    },
    {
        "address": "宜山路1009号",
        "name": "创新大厦",
        "lnglat": "121.400970,31.170655",
        "count": 40
    },
    {
        "address": "宜山路1289号",
        "name": "克隆科技园",
        "lnglat": "121.396772,31.169270",
        "count": 14
    },
    {
        "address": "宜山路1398号",
        "name": "皓顺大厦",
        "lnglat": "121.395284,31.170601",
        "count": 15
    },
    {
        "address": "宜山路1698号",
        "name": "兴迪商务大厦",
        "lnglat": "121.390671,31.168786",
        "count": 8
    },
    {
        "address": "宜山路1768号",
        "name": "福维克大厦(耀光虹桥中心)",
        "lnglat": "121.389175,31.168313",
        "count": 2
    },
    {
        "address": "宜山路187号",
        "name": "南山大楼",
        "lnglat": "121.430420,31.189463",
        "count": 9
    },
    {
        "address": "宜山路1888号",
        "name": "瑞特国际大厦",
        "lnglat": "121.388421,31.168033",
        "count": 1
    },
    {
        "address": "宜山路2016号",
        "name": "合川大厦",
        "lnglat": "121.384921,31.167090",
        "count": 4
    },
    {
        "address": "宜山路2301弄",
        "name": "九歌商务中心",
        "lnglat": "121.382517,31.165564",
        "count": 16
    },
    {
        "address": "宜山路333号",
        "name": "汇鑫国际大厦",
        "lnglat": "121.430416,31.187458",
        "count": 28
    },
    {
        "address": "宜山路425号",
        "name": "光启城",
        "lnglat": "121.428622,31.183807",
        "count": 46
    },
    {
        "address": "宜山路439号",
        "name": "七建大厦",
        "lnglat": "121.426909,31.185042",
        "count": 2
    },
    {
        "address": "宜山路508号",
        "name": "景鸿大厦",
        "lnglat": "121.425734,31.181960",
        "count": 19
    },
    {
        "address": "宜山路515弄",
        "name": "环线广场",
        "lnglat": "121.421298,31.176551",
        "count": 11
    },
    {
        "address": "宜山路520号",
        "name": "中华门大厦",
        "lnglat": "121.425517,31.181401",
        "count": 2
    },
    {
        "address": "宜山路655弄6号",
        "name": "高知楼_高级知识分子楼",
        "lnglat": "121.425654,31.176266",
        "count": 9
    },
    {
        "address": "宜山路700号",
        "name": "上海普天信息产业园",
        "lnglat": "121.417865,31.176881",
        "count": 111
    },
    {
        "address": "宜山路705号",
        "name": "上海科技大厦",
        "lnglat": "121.415723,31.173968",
        "count": 17
    },
    {
        "address": "宜山路810号",
        "name": "上海贝岭大厦",
        "lnglat": "121.406941,31.172892",
        "count": 22
    },
    {
        "address": "宜山路888号",
        "name": "新银大厦",
        "lnglat": "121.402898,31.172264",
        "count": 13
    },
    {
        "address": "宜山路889号",
        "name": "齐来大厦及齐来工业城",
        "lnglat": "121.404415,31.171015",
        "count": 30
    },
    {
        "address": "宜山路900号",
        "name": "科产楼C楼",
        "lnglat": "121.401292,31.172037",
        "count": 51
    },
    {
        "address": "宜山路926号",
        "name": "新思大厦",
        "lnglat": "121.398301,31.171605",
        "count": 18
    },
    {
        "address": "宜州路180号",
        "name": "华鑫天地",
        "lnglat": "121.408528,31.170198",
        "count": 8
    },
    {
        "address": "益文路101弄",
        "name": "锦鸿公寓",
        "lnglat": "121.410947,31.136963",
        "count": 27
    },
    {
        "address": "逸仙路1277号",
        "name": "财景科技园",
        "lnglat": "121.485809,31.313998",
        "count": 3
    },
    {
        "address": "逸仙路1300号",
        "name": "悦樘公寓(殷高西路店)",
        "lnglat": "121.484679,31.316107",
        "count": 2
    },
    {
        "address": "逸仙路1321弄5支弄7支弄",
        "name": "幸之苑",
        "lnglat": "121.487663,31.314282",
        "count": 7
    },
    {
        "address": "逸仙路1328号",
        "name": "新业坊源创全球科创示范区（新业坊源创园区）",
        "lnglat": "121.483836,31.318393",
        "count": 39
    },
    {
        "address": "逸仙路158号",
        "name": "宝隆一方大厦",
        "lnglat": "113.528445,22.239928",
        "count": 41
    },
    {
        "address": "逸仙路25号",
        "name": "同济逸仙大厦（同济晶度）",
        "lnglat": "110.416670,21.192530",
        "count": 31
    },
    {
        "address": "逸仙路2816号",
        "name": "华滋奔腾大厦",
        "lnglat": "121.493785,31.336574",
        "count": 19
    },
    {
        "address": "逸仙路3000号",
        "name": "上海国际工业设计中心",
        "lnglat": "121.497026,31.340224",
        "count": 22
    },
    {
        "address": "逸仙路300号",
        "name": "元和投资大厦",
        "lnglat": "121.486956,31.299066",
        "count": 15
    },
    {
        "address": "逸仙路3508弄",
        "name": "尚城汇景园",
        "lnglat": "121.500880,31.348969",
        "count": 52
    },
    {
        "address": "逸仙路3901号",
        "name": "东海航运大楼",
        "lnglat": "121.502790,31.353445",
        "count": 18
    },
    {
        "address": "逸仙路432弄",
        "name": "久久公寓",
        "lnglat": "121.486193,31.301153",
        "count": 11
    },
    {
        "address": "逸仙路655弄",
        "name": "文化花园二期(明珠苑)",
        "lnglat": "121.488958,31.302009",
        "count": 218
    },
    {
        "address": "逸仙路661号",
        "name": "新海商务大厦",
        "lnglat": "121.487065,31.301982",
        "count": 10
    },
    {
        "address": "殷高西路10弄",
        "name": "景瑞站前大楼",
        "lnglat": "121.484483,31.320177",
        "count": 7
    },
    {
        "address": "殷高西路518号",
        "name": "尚景天地",
        "lnglat": "121.472369,31.320077",
        "count": 28
    },
    {
        "address": "殷高西路711号",
        "name": "高境文化广场",
        "lnglat": "121.469290,31.319952",
        "count": 16
    },
    {
        "address": "殷行路1286号",
        "name": "上海嘉誉国际广场",
        "lnglat": "121.508359,31.329903",
        "count": 8
    },
    {
        "address": "银城路66号",
        "name": "尚悦湾广场",
        "lnglat": "121.510173,31.241248",
        "count": 25
    },
    {
        "address": "银城中路200号",
        "name": "中银大厦(上海)",
        "lnglat": "117.578216,28.944129",
        "count": 18
    },
    {
        "address": "银城中路488号",
        "name": "太平金融大厦（上海）",
        "lnglat": "121.503366,31.234214",
        "count": 72
    },
    {
        "address": "银城中路501号",
        "name": "上海中心",
        "lnglat": "121.505531,31.233544",
        "count": 580
    },
    {
        "address": "银城中路600弄",
        "name": "中粮海景壹号",
        "lnglat": "121.503520,31.231466",
        "count": 12
    },
    {
        "address": "银城中路68号5楼",
        "name": "时代金融中心",
        "lnglat": "109.639698,30.541808",
        "count": 72
    },
    {
        "address": "银城中路8号",
        "name": "中融碧玉蓝天",
        "lnglat": "113.729679,22.788288",
        "count": 31
    },
    {
        "address": "银春路1799弄",
        "name": "夏朵园上海",
        "lnglat": "121.397843,31.025056",
        "count": 312
    },
    {
        "address": "银春路2200弄",
        "name": "万科马桥景城乐康苑",
        "lnglat": "121.386817,31.025653",
        "count": 301
    },
    {
        "address": "银冬路491号",
        "name": "集创公园",
        "lnglat": "121.634344,31.206723",
        "count": 16
    },
    {
        "address": "银都路2188弄",
        "name": "中海寰宇名邸",
        "lnglat": "121.415801,31.099402",
        "count": 96
    },
    {
        "address": "银都路2755号",
        "name": "福克斯连锁商务大厦（银都园区）",
        "lnglat": "121.410121,31.097062",
        "count": 13
    },
    {
        "address": "银都路398号",
        "name": "博济银都汇谷",
        "lnglat": "121.448807,31.106835",
        "count": 4
    },
    {
        "address": "银都路4277号",
        "name": "金地威新闵行科创园(银都路园)",
        "lnglat": "121.378704,31.085472",
        "count": 8
    },
    {
        "address": "银都路466号",
        "name": "上海聚科生物园区",
        "lnglat": "121.447450,31.106358",
        "count": 12
    },
    {
        "address": "银都路466弄23号",
        "name": "九润商务大厦(龙吴)",
        "lnglat": "121.445395,31.106949",
        "count": 11
    },
    {
        "address": "银都西路215号",
        "name": "歆翱创意园(东区)",
        "lnglat": "121.366020,31.081527",
        "count": 14
    },
    {
        "address": "银康路735弄",
        "name": "马桥景城元景富文苑",
        "lnglat": "121.374975,31.019485",
        "count": 133
    },
    {
        "address": "银康路750号",
        "name": "马桥景城和苑",
        "lnglat": "121.374300,31.020555",
        "count": 149
    },
    {
        "address": "银康路76弄",
        "name": "银春苑",
        "lnglat": "121.388266,31.024021",
        "count": 114
    },
    {
        "address": "银林路100弄",
        "name": "银康苑",
        "lnglat": "121.388565,31.021039",
        "count": 246
    },
    {
        "address": "银秋路1351弄",
        "name": "保利雅苑闵行",
        "lnglat": "121.368832,31.021722",
        "count": 126
    },
    {
        "address": "银翔路1227弄",
        "name": "安居时代广场",
        "lnglat": "121.313953,31.283326",
        "count": 5
    },
    {
        "address": "银翔路609号",
        "name": "汇锦南翔中心",
        "lnglat": "121.323355,31.290638",
        "count": 9
    },
    {
        "address": "银翔路655号",
        "name": "蓝天创业广场",
        "lnglat": "121.321951,31.289555",
        "count": 5
    },
    {
        "address": "银翔路799号",
        "name": "昌辉大厦",
        "lnglat": "121.320146,31.288476",
        "count": 8
    },
    {
        "address": "银翔路819弄1号",
        "name": "中暨大厦",
        "lnglat": "121.319350,31.287901",
        "count": 11
    },
    {
        "address": "银霄路39弄",
        "name": "浦东世纪花园二期",
        "lnglat": "121.559255,31.212756",
        "count": 80
    },
    {
        "address": "银欣路38号",
        "name": "麒麟大厦",
        "lnglat": "121.491354,31.262052",
        "count": 7
    },
    {
        "address": "银樽路58弄",
        "name": "张江国际豪庭",
        "lnglat": "121.647853,31.212731",
        "count": 100
    },
    {
        "address": "英伦路396号",
        "name": "富立康大厦",
        "lnglat": "121.616847,31.311649",
        "count": 7
    },
    {
        "address": "樱花路801弄",
        "name": "大唐盛世花园二期",
        "lnglat": "121.356183,28.579081",
        "count": 184
    },
    {
        "address": "樱花路802弄",
        "name": "大唐国际公寓",
        "lnglat": "121.356186,28.579076",
        "count": 128
    },
    {
        "address": "樱花路868号",
        "name": "建工大唐国际广场",
        "lnglat": "121.562425,31.207124",
        "count": 2
    },
    {
        "address": "迎春路1355弄",
        "name": "浦东虹桥公寓",
        "lnglat": "106.301842,29.558527",
        "count": 147
    },
    {
        "address": "迎春路670号",
        "name": "上海移动（浦东店）",
        "lnglat": "111.440448,27.225798",
        "count": 6
    },
    {
        "address": "迎春路736弄",
        "name": "联洋新苑",
        "lnglat": "106.302081,29.558759",
        "count": 16
    },
    {
        "address": "迎勋北路8弄",
        "name": "唐城公寓",
        "lnglat": "121.489654,31.216862",
        "count": 2
    },
    {
        "address": "盈港东路6400号",
        "name": "上纵企业园",
        "lnglat": "121.179121,31.161772",
        "count": 3
    },
    {
        "address": "盈港东路6433号",
        "name": "8090青年创业基地赵巷园",
        "lnglat": "121.180987,31.160341",
        "count": 12
    },
    {
        "address": "盈港东路7802号",
        "name": "宝龙中心（青浦）",
        "lnglat": "121.153412,31.161974",
        "count": 42
    },
    {
        "address": "盈港东路8300弄",
        "name": "佳乐苑",
        "lnglat": "121.140203,31.161944",
        "count": 93
    },
    {
        "address": "盈港路453号",
        "name": "港隆国际大厦",
        "lnglat": "121.115811,31.159029",
        "count": 17
    },
    {
        "address": "盈清路188号",
        "name": "北极星广场",
        "lnglat": "121.093050,31.139790",
        "count": 32
    },
    {
        "address": "营口路578号",
        "name": "海尚杰座",
        "lnglat": "121.534531,31.294639",
        "count": 26
    },
    {
        "address": "营口路600弄",
        "name": "佳龙花园",
        "lnglat": "121.534410,31.295573",
        "count": 261
    },
    {
        "address": "营口路625弄",
        "name": "营口大厦",
        "lnglat": "121.533014,31.292851",
        "count": 14
    },
    {
        "address": "影佳路333号",
        "name": "雅居乐星徽",
        "lnglat": "121.310455,31.007064",
        "count": 88
    },
    {
        "address": "影振路299弄",
        "name": "安贝尔花园",
        "lnglat": "121.310207,31.004635",
        "count": 59
    },
    {
        "address": "永川路187号",
        "name": "经纬梦园",
        "lnglat": "121.439183,31.154422",
        "count": 5
    },
    {
        "address": "永丰路270弄",
        "name": "玉龙苑",
        "lnglat": "121.214888,31.011697",
        "count": 80
    },
    {
        "address": "永和路118弄",
        "name": "东方环球企业中心43号",
        "lnglat": "105.437068,28.165247",
        "count": 40
    },
    {
        "address": "永和路201号",
        "name": "久合201",
        "lnglat": "121.444636,31.287864",
        "count": 11
    },
    {
        "address": "永和路318弄18号",
        "name": "东方环球企业中心18号",
        "lnglat": "103.809074,30.865751",
        "count": 16
    },
    {
        "address": "永和路455号",
        "name": "创景空间",
        "lnglat": "121.440630,31.287111",
        "count": 7
    },
    {
        "address": "永吉路9号",
        "name": "永吉广场",
        "lnglat": "110.681103,31.063884",
        "count": 4
    },
    {
        "address": "永嘉路158号",
        "name": "嘉嘉大楼",
        "lnglat": "121.459187,31.209556",
        "count": 11
    },
    {
        "address": "永嘉路31号,35号",
        "name": "茂名大厦（上海）",
        "lnglat": "118.851813,34.122680",
        "count": 15
    },
    {
        "address": "永嘉路570号",
        "name": "永嘉庭",
        "lnglat": "121.451083,31.205864",
        "count": 12
    },
    {
        "address": "永嘉路589号",
        "name": "永嘉大楼（上海）",
        "lnglat": "121.449370,31.204639",
        "count": 7
    },
    {
        "address": "永靖路1100号",
        "name": "财智金岸",
        "lnglat": "121.258322,31.409044",
        "count": 12
    },
    {
        "address": "永靖路501弄",
        "name": "嘉华居",
        "lnglat": "121.258109,31.402300",
        "count": 78
    },
    {
        "address": "永隆路255-333弄",
        "name": "象屿屿果公寓",
        "lnglat": "121.196165,31.005395",
        "count": 35
    },
    {
        "address": "永平南路198弄",
        "name": "东苑佳和园",
        "lnglat": "121.434962,31.012271",
        "count": 134
    },
    {
        "address": "永盛路1218号",
        "name": "金元大厦",
        "lnglat": "121.255643,31.346934",
        "count": 4
    },
    {
        "address": "永颂路455弄",
        "name": "永康城颂和苑",
        "lnglat": "121.499798,31.033799",
        "count": 23
    },
    {
        "address": "永泰路1058弄1-26号",
        "name": "新达汇三林",
        "lnglat": "104.068898,37.197311",
        "count": 15
    },
    {
        "address": "永泰路1650弄",
        "name": "名嘉新苑",
        "lnglat": "104.068949,37.195932",
        "count": 175
    },
    {
        "address": "永泰路2080弄",
        "name": "浦发绿城（南区）",
        "lnglat": "104.068987,37.194931",
        "count": 6
    },
    {
        "address": "永泰路595弄1-41号",
        "name": "金谊河畔一期",
        "lnglat": "104.069721,37.189937",
        "count": 388
    },
    {
        "address": "永泰路595弄42-68号",
        "name": "金谊河畔二期",
        "lnglat": "104.069721,37.189937",
        "count": 276
    },
    {
        "address": "永兴路258弄1号楼",
        "name": "兴亚广场",
        "lnglat": "113.898104,35.302982",
        "count": 1
    },
    {
        "address": "永兴路39弄",
        "name": "蒙特利城一期",
        "lnglat": "113.276723,22.720055",
        "count": 44
    },
    {
        "address": "永兴路888弄",
        "name": "万锦城",
        "lnglat": "108.928971,34.286179",
        "count": 38
    },
    {
        "address": "永跃路208弄1-38号",
        "name": "江山都会",
        "lnglat": "121.511338,31.024502",
        "count": 4
    },
    {
        "address": "永跃路215弄",
        "name": "新城千禧公园",
        "lnglat": "106.768208,28.923583",
        "count": 23
    },
    {
        "address": "永跃路555弄",
        "name": "永康城馨宁佳苑",
        "lnglat": "121.509715,31.031028",
        "count": 24
    },
    {
        "address": "永跃路782弄",
        "name": "永康城佳兴苑",
        "lnglat": "121.511183,31.034282",
        "count": 112
    },
    {
        "address": "友东路358号",
        "name": "闵欣大厦",
        "lnglat": "121.353908,31.126203",
        "count": 19
    },
    {
        "address": "友东路81号",
        "name": "友东路81号商务楼",
        "lnglat": "121.355658,31.122351",
        "count": 9
    },
    {
        "address": "友东路85号",
        "name": "友东路85号商务楼",
        "lnglat": "121.355958,31.121683",
        "count": 5
    },
    {
        "address": "友情路50弄",
        "name": "名都新城四期",
        "lnglat": "121.389808,31.108774",
        "count": 90
    },
    {
        "address": "友谊路1060号",
        "name": "璨阳文化科创园",
        "lnglat": "121.023425,31.314013",
        "count": 2
    },
    {
        "address": "友谊路1506号",
        "name": "东智商务广场",
        "lnglat": "121.456007,31.394166",
        "count": 28
    },
    {
        "address": "友谊路1508号",
        "name": "晶钢商务馆",
        "lnglat": "121.456019,31.393023",
        "count": 18
    },
    {
        "address": "友谊路1518弄",
        "name": "永景国际大厦",
        "lnglat": "114.083878,23.020999",
        "count": 29
    },
    {
        "address": "友谊路1588弄",
        "name": "钢领",
        "lnglat": "114.084040,23.020752",
        "count": 70
    },
    {
        "address": "友谊路160号",
        "name": "宝地友谊商务中心（宝学汇）",
        "lnglat": "106.716053,26.590638",
        "count": 14
    },
    {
        "address": "友谊路1869弄",
        "name": "海尚明城",
        "lnglat": "114.084692,23.019760",
        "count": 76
    },
    {
        "address": "友谊路2699号",
        "name": "海创杨泰高新科技园B座",
        "lnglat": "121.436477,31.386890",
        "count": 19
    },
    {
        "address": "友谊路318号",
        "name": "灏唯滨江智创园",
        "lnglat": "114.083635,23.021271",
        "count": 8
    },
    {
        "address": "友谊西路101号",
        "name": "上海建筑科技产业园",
        "lnglat": "106.210120,37.974167",
        "count": 15
    },
    {
        "address": "于塘南路280弄",
        "name": "恒大名都(上海)",
        "lnglat": "121.193238,31.292906",
        "count": 45
    },
    {
        "address": "于塘南路82弄",
        "name": "盛世景庭",
        "lnglat": "121.193389,31.289697",
        "count": 145
    },
    {
        "address": "于田南路36号",
        "name": "智能网联新能源汽车创新孵化中心",
        "lnglat": "121.181580,31.280245",
        "count": 20
    },
    {
        "address": "余姚路19号余姚路27号",
        "name": "永昌大厦",
        "lnglat": "121.443806,31.235986",
        "count": 19
    },
    {
        "address": "余姚路288弄",
        "name": "鸿新商务楼(汇智创意园)",
        "lnglat": "121.438630,31.236073",
        "count": 5
    },
    {
        "address": "余姚路339号",
        "name": "百乐门商务楼",
        "lnglat": "121.437431,31.235056",
        "count": 3
    },
    {
        "address": "余姚路420号",
        "name": "荣瑞商务中心(汇智金昌园区)",
        "lnglat": "121.435701,31.234487",
        "count": 9
    },
    {
        "address": "余姚路456号",
        "name": "新都城公寓",
        "lnglat": "121.434869,31.233982",
        "count": 1
    },
    {
        "address": "余姚路500弄",
        "name": "家化绿苑",
        "lnglat": "121.434174,31.233822",
        "count": 2
    },
    {
        "address": "余姚路566弄",
        "name": "均泰丽轩",
        "lnglat": "121.433312,31.233442",
        "count": 12
    },
    {
        "address": "余姚路569号",
        "name": "美联大厦(上海)",
        "lnglat": "121.433845,31.232393",
        "count": 4
    },
    {
        "address": "俞泾港路15弄18，19号",
        "name": "乐业公寓",
        "lnglat": "121.464908,31.265817",
        "count": 16
    },
    {
        "address": "榆林路858弄",
        "name": "滨江晶典",
        "lnglat": "121.528636,31.259876",
        "count": 22
    },
    {
        "address": "愚园路1155弄",
        "name": "愚园公馆",
        "lnglat": "121.427544,31.218258",
        "count": 24
    },
    {
        "address": "愚园路1203弄",
        "name": "仲信苑",
        "lnglat": "121.426895,31.217800",
        "count": 2
    },
    {
        "address": "愚园路1221弄1号",
        "name": "御华名苑",
        "lnglat": "121.426202,31.218635",
        "count": 4
    },
    {
        "address": "愚园路1258号",
        "name": "绿地商务大厦",
        "lnglat": "121.425928,31.219444",
        "count": 23
    },
    {
        "address": "愚园路168号",
        "name": "环球世界大厦",
        "lnglat": "121.444438,31.224176",
        "count": 7
    },
    {
        "address": "愚园路172号",
        "name": "环球世界大厦B座",
        "lnglat": "121.444397,31.224195",
        "count": 2
    },
    {
        "address": "愚园路309号",
        "name": "紫安大厦",
        "lnglat": "121.442665,31.223118",
        "count": 9
    },
    {
        "address": "愚园路68号",
        "name": "晶品大厦",
        "lnglat": "121.446449,31.225692",
        "count": 16
    },
    {
        "address": "愚园路716号",
        "name": "愚园1890",
        "lnglat": "121.435422,31.221085",
        "count": 8
    },
    {
        "address": "愚园路888号",
        "name": "畅园",
        "lnglat": "121.431722,31.220482",
        "count": 18
    },
    {
        "address": "愚园路905-907号",
        "name": "新利商务楼",
        "lnglat": "121.432023,31.219649",
        "count": 2
    },
    {
        "address": "羽山路600弄",
        "name": "东方中华园(第五大道)",
        "lnglat": "121.547086,31.232949",
        "count": 258
    },
    {
        "address": "羽山路851弄",
        "name": "新城名庭",
        "lnglat": "121.553129,31.236578",
        "count": 30
    },
    {
        "address": "羽山路967弄",
        "name": "森林湾家园",
        "lnglat": "121.555041,31.237298",
        "count": 20
    },
    {
        "address": "羽山路998弄",
        "name": "景宏嘉园",
        "lnglat": "121.556631,31.237118",
        "count": 92
    },
    {
        "address": "玉兰路8号",
        "name": "盛第大厦",
        "lnglat": "113.159408,22.974671",
        "count": 9
    },
    {
        "address": "玉屏南路113弄17号",
        "name": "锦屏公寓",
        "lnglat": "121.410172,31.212048",
        "count": 4
    },
    {
        "address": "玉屏南路1号",
        "name": "玉屏大楼",
        "lnglat": "105.894615,29.350831",
        "count": 2
    },
    {
        "address": "玉屏南路498弄1-3号",
        "name": "安基大楼",
        "lnglat": "121.404078,31.214413",
        "count": 12
    },
    {
        "address": "玉屏南路9号",
        "name": "新联大楼",
        "lnglat": "121.411588,31.212288",
        "count": 5
    },
    {
        "address": "玉树路1569号",
        "name": "上海科技影都茸源文创园",
        "lnglat": "121.209091,30.992152",
        "count": 2
    },
    {
        "address": "郁江巷路129弄",
        "name": "三湘海尚",
        "lnglat": "121.478852,31.342852",
        "count": 108
    },
    {
        "address": "育才路555弄",
        "name": "西郊美德苑",
        "lnglat": "109.778763,38.297058",
        "count": 35
    },
    {
        "address": "育英南街55弄",
        "name": "恒大御景湾(上海)",
        "lnglat": "121.281839,31.318449",
        "count": 57
    },
    {
        "address": "御衡路68弄",
        "name": "锦绣华都",
        "lnglat": "121.582049,31.153556",
        "count": 73
    },
    {
        "address": "御桥路1679弄",
        "name": "御桥河滨苑（万科海上传奇）",
        "lnglat": "121.567502,31.158238",
        "count": 204
    },
    {
        "address": "御桥路1978弄3号",
        "name": "地杰国际城F街坊",
        "lnglat": "121.573451,31.156780",
        "count": 162
    },
    {
        "address": "御桥路2066弄",
        "name": "地杰国际城E街坊",
        "lnglat": "121.574933,31.158257",
        "count": 139
    },
    {
        "address": "御桥路288弄",
        "name": "未来域",
        "lnglat": "121.537539,31.145650",
        "count": 189
    },
    {
        "address": "御水路150弄",
        "name": "万科金色城市2期悦庭(地杰国际C街坊)",
        "lnglat": "121.572289,31.161036",
        "count": 228
    },
    {
        "address": "御水路199弄",
        "name": "地杰国际城D街坊",
        "lnglat": "121.574730,31.160047",
        "count": 90
    },
    {
        "address": "裕德路168号",
        "name": "徐汇商务大厦",
        "lnglat": "121.432580,31.185365",
        "count": 8
    },
    {
        "address": "裕德路92弄",
        "name": "江南裕德大厦",
        "lnglat": "121.434808,31.184569",
        "count": 13
    },
    {
        "address": "裕民路1000弄",
        "name": "清水颐园",
        "lnglat": "112.964531,22.774389",
        "count": 321
    },
    {
        "address": "裕通路100号",
        "name": "宝矿洲际商务中心",
        "lnglat": "121.453486,31.244418",
        "count": 30
    },
    {
        "address": "元江路3599号",
        "name": "福克斯创新园",
        "lnglat": "121.399415,31.047033",
        "count": 10
    },
    {
        "address": "元江路3699号",
        "name": "新光华创智园",
        "lnglat": "121.395829,31.046406",
        "count": 7
    },
    {
        "address": "园二路299弄",
        "name": "广盛佳苑",
        "lnglat": "121.634392,31.317354",
        "count": 136
    },
    {
        "address": "园丰路69号",
        "name": "联东U谷宝山科创中心",
        "lnglat": "121.344011,31.303742",
        "count": 23
    },
    {
        "address": "园区北路19号",
        "name": "上海雍臻公寓",
        "lnglat": "121.431896,31.042551",
        "count": 10
    },
    {
        "address": "园通路128号",
        "name": "东方智谷",
        "lnglat": "121.729066,31.018822",
        "count": 32
    },
    {
        "address": "原平路1028弄-1029弄",
        "name": "成亿花园",
        "lnglat": "121.431103,31.297891",
        "count": 22
    },
    {
        "address": "原平路383弄",
        "name": "永和丽园",
        "lnglat": "121.431436,31.285696",
        "count": 5
    },
    {
        "address": "源深路836号",
        "name": "香榭丽花园",
        "lnglat": "121.536010,31.226960",
        "count": 67
    },
    {
        "address": "源深路92号",
        "name": "航科大厦",
        "lnglat": "121.529180,31.240188",
        "count": 13
    },
    {
        "address": "月富路55弄",
        "name": "新城昱翠湾",
        "lnglat": "121.412285,31.429520",
        "count": 318
    },
    {
        "address": "月罗公路2120号",
        "name": "程居电商产业园",
        "lnglat": "121.357505,31.412387",
        "count": 2
    },
    {
        "address": "月罗公路2333号",
        "name": "兰湖美域",
        "lnglat": "121.352339,31.411975",
        "count": 197
    },
    {
        "address": "月罗公路2368号",
        "name": "程居汽车办公产业园",
        "lnglat": "121.353199,31.410878",
        "count": 1
    },
    {
        "address": "月罗路2255号",
        "name": "博济上海美兰湖园",
        "lnglat": "121.366568,31.414869",
        "count": 14
    },
    {
        "address": "岳阳路217号",
        "name": "岳阳公寓",
        "lnglat": "121.452991,31.204305",
        "count": 10
    },
    {
        "address": "岳州路319弄",
        "name": "虹领公寓",
        "lnglat": "121.501702,31.260373",
        "count": 14
    },
    {
        "address": "岳州路399弄",
        "name": "紫虹嘉苑",
        "lnglat": "121.503521,31.261521",
        "count": 82
    },
    {
        "address": "云端路1388弄",
        "name": "凌波苑",
        "lnglat": "121.817151,30.887429",
        "count": 12
    },
    {
        "address": "云端路1389弄",
        "name": "海云苑",
        "lnglat": "121.817301,30.891070",
        "count": 50
    },
    {
        "address": "云端路1565弄",
        "name": "雨浥苑",
        "lnglat": "121.821907,30.890057",
        "count": 82
    },
    {
        "address": "云端路1566弄",
        "name": "春晓苑",
        "lnglat": "121.820197,30.889059",
        "count": 28
    },
    {
        "address": "云恩路58弄",
        "name": "松江悦都一期",
        "lnglat": "121.218942,31.066412",
        "count": 202
    },
    {
        "address": "云恩路59弄",
        "name": "松江悦都二期",
        "lnglat": "121.218018,31.066699",
        "count": 171
    },
    {
        "address": "云汉路1096弄",
        "name": "荷风华庭",
        "lnglat": "121.804755,30.911409",
        "count": 23
    },
    {
        "address": "云汉路977弄",
        "name": "荷风翠庭",
        "lnglat": "121.806830,30.910270",
        "count": 13
    },
    {
        "address": "云汉路978弄",
        "name": "荷风景庭",
        "lnglat": "121.807586,30.910747",
        "count": 12
    },
    {
        "address": "云锦路500号",
        "name": "绿地汇中心",
        "lnglat": "106.504507,29.370511",
        "count": 26
    },
    {
        "address": "云锦路600号 ",
        "name": "航汇大厦",
        "lnglat": "121.457886,31.163798",
        "count": 16
    },
    {
        "address": "云娟路410弄",
        "name": "玲珑悦庭",
        "lnglat": "121.922757,30.898462",
        "count": 9
    },
    {
        "address": "云岭东路391",
        "name": "长风嘉庭国际",
        "lnglat": "121.387960,31.222409",
        "count": 24
    },
    {
        "address": "云岭东路599弄",
        "name": "汇银金融商务楼",
        "lnglat": "121.383430,31.221925",
        "count": 49
    },
    {
        "address": "云岭东路651号",
        "name": "合星大厦",
        "lnglat": "121.382167,31.223578",
        "count": 10
    },
    {
        "address": "云岭西路356弄",
        "name": "璨申众创空间",
        "lnglat": "121.371415,31.229112",
        "count": 4
    },
    {
        "address": "云岭西路600弄",
        "name": "金环商务花园二期",
        "lnglat": "121.367601,31.231021",
        "count": 37
    },
    {
        "address": "云岭西路899弄",
        "name": "河滨香景园",
        "lnglat": "121.361160,31.231235",
        "count": 48
    },
    {
        "address": "云南北路59号",
        "name": "六合大厦",
        "lnglat": "118.779563,32.066097",
        "count": 1
    },
    {
        "address": "云南南路180号",
        "name": "淮云大厦",
        "lnglat": "121.481359,31.226566",
        "count": 27
    },
    {
        "address": "云屏路1033弄",
        "name": "嘉宝梦之缘景庭西区",
        "lnglat": "121.246432,31.336785",
        "count": 135
    },
    {
        "address": "云屏路1188弄",
        "name": "盘古天地二期（上海）",
        "lnglat": "121.247177,31.339738",
        "count": 42
    },
    {
        "address": "云屏路1199弄",
        "name": "盘古天地一期（上海）",
        "lnglat": "121.246372,31.339612",
        "count": 56
    },
    {
        "address": "云山路1039弄",
        "name": "陆家嘴新景园(1039弄)",
        "lnglat": "121.573260,31.248818",
        "count": 18
    },
    {
        "address": "云山路1050弄",
        "name": "陆家嘴新景园(1050弄)",
        "lnglat": "121.572141,31.248930",
        "count": 9
    },
    {
        "address": "云山路835弄，839弄",
        "name": "黄山新城上海未来",
        "lnglat": "121.572072,31.254774",
        "count": 248
    },
    {
        "address": "云山路999弄",
        "name": "云山星座苑",
        "lnglat": "121.572749,31.251187",
        "count": 53
    },
    {
        "address": "云台路183弄",
        "name": "昌里花园",
        "lnglat": "121.503895,31.177849",
        "count": 123
    },
    {
        "address": "云台路453号",
        "name": "金色国际公寓",
        "lnglat": "121.506701,31.171969",
        "count": 40
    },
    {
        "address": "云台路529弄",
        "name": "恒大广场国际公寓_爵仕悦",
        "lnglat": "121.507351,31.168699",
        "count": 58
    },
    {
        "address": "云台路80、86、92、98号",
        "name": "云台小区",
        "lnglat": "121.499780,31.182409",
        "count": 32
    },
    {
        "address": "云西路219弄",
        "name": "三花现代城二期（香梅苑）",
        "lnglat": "121.421565,28.670506",
        "count": 150
    },
    {
        "address": "运河北路258号",
        "name": "绿地方舟",
        "lnglat": "119.948389,31.742887",
        "count": 12
    },
    {
        "address": "运盐河路1255弄",
        "name": "妙虹新苑",
        "lnglat": "121.717499,31.181877",
        "count": 88
    },
    {
        "address": "蕴川路1498号",
        "name": "天馨花园",
        "lnglat": "121.432954,31.365532",
        "count": 125
    },
    {
        "address": "蕴川路516号",
        "name": "泰德科技园（二期）",
        "lnglat": "121.435145,31.351300",
        "count": 3
    },
    {
        "address": "薀川路516号",
        "name": "泰德商务大厦(上海)",
        "lnglat": "121.433641,31.365594",
        "count": 3
    },
    {
        "address": "枣阳路251弄80号2号楼",
        "name": "魔方公寓环球港店",
        "lnglat": "121.401213,31.234710",
        "count": 1
    },
    {
        "address": "枣阳路297弄",
        "name": "金阳怡景苑",
        "lnglat": "121.401467,31.234012",
        "count": 45
    },
    {
        "address": "枣阳路530弄",
        "name": "枣阳路530弄公寓楼",
        "lnglat": "121.401226,31.227380",
        "count": 8
    },
    {
        "address": "枣阳路891弄",
        "name": "冠龙家园（风华水岸）",
        "lnglat": "121.401838,31.223037",
        "count": 100
    },
    {
        "address": "枣庄路959号",
        "name": "锋巢宫寓(百舸商务酒店)",
        "lnglat": "121.583801,31.248736",
        "count": 5
    },
    {
        "address": "泽悦路211弄",
        "name": "兰花清苑",
        "lnglat": "121.246025,31.101595",
        "count": 22
    },
    {
        "address": "泽悦路212弄",
        "name": "水仙雅苑",
        "lnglat": "121.248415,31.101672",
        "count": 20
    },
    {
        "address": "泽悦路325弄1-30号",
        "name": "茉莉雅苑",
        "lnglat": "121.245660,31.103818",
        "count": 45
    },
    {
        "address": "泽悦路88弄",
        "name": "桂花锦苑",
        "lnglat": "121.248342,31.099506",
        "count": 48
    },
    {
        "address": "展凌路58弄",
        "name": "凌桥景园",
        "lnglat": "121.530279,31.359938",
        "count": 58
    },
    {
        "address": "张东路1158号礼德国际2号楼",
        "name": "礼德国际2号楼",
        "lnglat": "121.630458,31.221822",
        "count": 10
    },
    {
        "address": "张东路1761号",
        "name": "创企天地产业园",
        "lnglat": "121.634752,31.208777",
        "count": 36
    },
    {
        "address": "张衡路666弄",
        "name": "盛大全球研发中心",
        "lnglat": "121.596593,31.188247",
        "count": 32
    },
    {
        "address": "张家浜路37弄3号",
        "name": "京城大厦",
        "lnglat": "121.517129,31.215875",
        "count": 3
    },
    {
        "address": "张江高科技园区东区瑞庆路590号",
        "name": "7号地块张江东区现代医疗器械产业园",
        "lnglat": "121.705240,31.240865",
        "count": 11
    },
    {
        "address": "张江高科技园区张衡路500弄",
        "name": "人才城",
        "lnglat": "121.590122,31.185988",
        "count": 5
    },
    {
        "address": "张江路1206号",
        "name": "张江科创园",
        "lnglat": "121.622198,31.196727",
        "count": 6
    },
    {
        "address": "张江路665号",
        "name": "德宏大厦",
        "lnglat": "121.616490,31.204608",
        "count": 9
    },
    {
        "address": "张江路69号",
        "name": "张江路69号办公楼",
        "lnglat": "121.611819,31.212162",
        "count": 7
    },
    {
        "address": "张江路725号",
        "name": "德宏商务楼",
        "lnglat": "121.617581,31.203497",
        "count": 4
    },
    {
        "address": "张江路75号10幢",
        "name": "海德堡中心",
        "lnglat": "116.502290,31.762164",
        "count": 2
    },
    {
        "address": "张江镇郭守敬路351号",
        "name": "一标厂房（创e空间）",
        "lnglat": "121.595247,31.210887",
        "count": 7
    },
    {
        "address": "张江镇海趣路58号",
        "name": "海趣园",
        "lnglat": "121.603371,31.179545",
        "count": 13
    },
    {
        "address": "张翁庙路525号",
        "name": "晨日科技创意园",
        "lnglat": "121.437962,30.933002",
        "count": 39
    },
    {
        "address": "张扬路707号",
        "name": "生命人寿大厦",
        "lnglat": "115.018165,30.580081",
        "count": 26
    },
    {
        "address": "张杨北路2899弄",
        "name": "金地未未来",
        "lnglat": "121.588029,31.308144",
        "count": 47
    },
    {
        "address": "张杨北路555弄",
        "name": "同方锦城",
        "lnglat": "121.586792,31.267245",
        "count": 137
    },
    {
        "address": "张杨路1050弄3号",
        "name": "福竹大楼",
        "lnglat": "121.530363,31.229661",
        "count": 8
    },
    {
        "address": "张杨路1050弄5号",
        "name": "梅竹大楼",
        "lnglat": "121.530943,31.229693",
        "count": 4
    },
    {
        "address": "张杨路1328号",
        "name": "明竹公寓",
        "lnglat": "121.532415,31.231857",
        "count": 6
    },
    {
        "address": "张杨路1348号",
        "name": "春竹大楼",
        "lnglat": "121.533479,31.232193",
        "count": 10
    },
    {
        "address": "张杨路1500弄",
        "name": "证大宽域公寓",
        "lnglat": "121.539334,31.233743",
        "count": 30
    },
    {
        "address": "张杨路1515弄",
        "name": "陆家嘴国际华城",
        "lnglat": "121.535952,31.234304",
        "count": 94
    },
    {
        "address": "张杨路1518弄",
        "name": "金博尚品苑办公楼",
        "lnglat": "121.539968,31.234243",
        "count": 4
    },
    {
        "address": "张杨路1528弄",
        "name": "金博尚品苑大楼",
        "lnglat": "121.539877,31.233883",
        "count": 4
    },
    {
        "address": "张杨路1589、1591号",
        "name": "八方大厦",
        "lnglat": "121.538495,31.235243",
        "count": 9
    },
    {
        "address": "张杨路1619弄",
        "name": "东珂花苑",
        "lnglat": "121.538927,31.235466",
        "count": 44
    },
    {
        "address": "张杨路1667弄",
        "name": "金露苑",
        "lnglat": "121.541873,31.236057",
        "count": 32
    },
    {
        "address": "张杨路1673弄",
        "name": "生安花苑",
        "lnglat": "121.543060,31.236579",
        "count": 56
    },
    {
        "address": "张杨路1811弄",
        "name": "海上景庭",
        "lnglat": "121.548216,31.239619",
        "count": 106
    },
    {
        "address": "张杨路188号",
        "name": "汤臣中心",
        "lnglat": "121.511783,31.224888",
        "count": 5
    },
    {
        "address": "张杨路2100弄",
        "name": "华阳苑",
        "lnglat": "121.554673,31.239726",
        "count": 21
    },
    {
        "address": "张杨路2228弄",
        "name": "张杨花苑",
        "lnglat": "121.556755,31.239970",
        "count": 48
    },
    {
        "address": "张杨路2242弄",
        "name": "翡翠湾公寓",
        "lnglat": "121.557849,31.240921",
        "count": 24
    },
    {
        "address": "张杨路2389弄",
        "name": "置汇旭辉广场",
        "lnglat": "121.555146,31.242531",
        "count": 8
    },
    {
        "address": "张杨路2600弄",
        "name": "广洋华景苑",
        "lnglat": "121.560028,31.242116",
        "count": 44
    },
    {
        "address": "张杨路2771",
        "name": "信罗大厦",
        "lnglat": "121.561975,31.245473",
        "count": 12
    },
    {
        "address": "张杨路3080弄",
        "name": "名典苑",
        "lnglat": "121.570201,31.248565",
        "count": 24
    },
    {
        "address": "张杨路3083弄",
        "name": "广洋苑",
        "lnglat": "121.569474,31.249406",
        "count": 52
    },
    {
        "address": "张杨路501号",
        "name": "上海第一八佰伴（上海第一八佰伴新世纪商厦）",
        "lnglat": "121.517049,31.228211",
        "count": 1
    },
    {
        "address": "张杨路560、620号",
        "name": "恒瑞国际大厦",
        "lnglat": "121.518956,31.227589",
        "count": 64
    },
    {
        "address": "张杨路579号",
        "name": "三鑫世界商厦",
        "lnglat": "121.518373,31.228384",
        "count": 14
    },
    {
        "address": "张杨路628弄",
        "name": "东明广场",
        "lnglat": "121.520547,31.228144",
        "count": 23
    },
    {
        "address": "张杨路655号",
        "name": "福兴大厦",
        "lnglat": "121.519381,31.228601",
        "count": 13
    },
    {
        "address": "张杨路800号",
        "name": "长航大厦",
        "lnglat": "121.521911,31.228575",
        "count": 10
    },
    {
        "address": "张杨路828-838号",
        "name": "华都大厦(上海)",
        "lnglat": "121.523271,31.228757",
        "count": 10
    },
    {
        "address": "章练塘路880弄",
        "name": "旭辉朗悦庭",
        "lnglat": "121.051498,31.001588",
        "count": 112
    },
    {
        "address": "长安路1001号",
        "name": "长安大厦",
        "lnglat": "121.452218,31.244827",
        "count": 10
    },
    {
        "address": "长安路1050弄",
        "name": "安源大楼",
        "lnglat": "112.980354,23.095139",
        "count": 24
    },
    {
        "address": "长安路1138号",
        "name": "中房华东大厦",
        "lnglat": "121.451755,31.247066",
        "count": 12
    },
    {
        "address": "长安路550弄12号",
        "name": "安丰小区",
        "lnglat": "121.456289,31.239575",
        "count": 7
    },
    {
        "address": "长浜路330弄",
        "name": "江升公寓",
        "lnglat": "121.521586,31.272948",
        "count": 5
    },
    {
        "address": "长岛路1066弄",
        "name": "碧云新天地家园三期",
        "lnglat": "121.590004,31.259874",
        "count": 81
    },
    {
        "address": "长岛路1560弄",
        "name": "长岛花苑",
        "lnglat": "121.602708,31.264627",
        "count": 75
    },
    {
        "address": "长岛路625弄",
        "name": "同方锦城B区",
        "lnglat": "121.585196,31.262367",
        "count": 12
    },
    {
        "address": "长岛路638弄",
        "name": "龙腾苑",
        "lnglat": "121.583976,31.260413",
        "count": 14
    },
    {
        "address": "长虹路718弄",
        "name": "海上御景苑三期",
        "lnglat": "116.445099,23.263292",
        "count": 14
    },
    {
        "address": "长虹路779弄",
        "name": "海上御景苑一期",
        "lnglat": "108.382446,22.846988",
        "count": 104
    },
    {
        "address": "长江路392号",
        "name": "KEY设计园区",
        "lnglat": "106.710536,26.522706",
        "count": 4
    },
    {
        "address": "长江路43号",
        "name": "闿和长江源",
        "lnglat": "106.704071,26.522991",
        "count": 24
    },
    {
        "address": "长江路580号",
        "name": "宝地吴淞",
        "lnglat": "106.714656,26.523014",
        "count": 12
    },
    {
        "address": "长江南路180号",
        "name": "长江软件园",
        "lnglat": "108.091701,30.717693",
        "count": 82
    },
    {
        "address": "长江西路101号",
        "name": "上海节能环保园",
        "lnglat": "104.670681,31.022927",
        "count": 10
    },
    {
        "address": "长江西路1160弄",
        "name": "泗塘四村",
        "lnglat": "121.459464,31.338330",
        "count": 40
    },
    {
        "address": "长江西路1180号",
        "name": "泗塘大厦",
        "lnglat": "121.458977,31.338175",
        "count": 19
    },
    {
        "address": "长江西路1568号",
        "name": "通河二村",
        "lnglat": "121.450319,31.333449",
        "count": 72
    },
    {
        "address": "长江西路162、200号",
        "name": "湘源大厦",
        "lnglat": "119.014799,33.634248",
        "count": 24
    },
    {
        "address": "长江西路1952弄2号（通河四村69号）",
        "name": "骏利财智园",
        "lnglat": "121.445121,31.331135",
        "count": 5
    },
    {
        "address": "长江西路2036弄1、2号",
        "name": "汇秀公寓",
        "lnglat": "121.442437,31.330967",
        "count": 4
    },
    {
        "address": "长江西路255号",
        "name": "上海国际节能环保园",
        "lnglat": "118.831189,32.346515",
        "count": 9
    },
    {
        "address": "长江西路755号",
        "name": "碧家国际社区(长江西路店)",
        "lnglat": "121.471481,31.343358",
        "count": 8
    },
    {
        "address": "长乐路801号",
        "name": "华尔登广场",
        "lnglat": "121.447944,31.215718",
        "count": 9
    },
    {
        "address": "长乐路989号",
        "name": "THE_CENTER世纪商贸广场",
        "lnglat": "121.447012,31.215342",
        "count": 92
    },
    {
        "address": "长临路1318弄",
        "name": "九英里城",
        "lnglat": "121.430780,31.330174",
        "count": 184
    },
    {
        "address": "长柳路58号",
        "name": "证大立方大厦",
        "lnglat": "121.552265,31.224626",
        "count": 24
    },
    {
        "address": "长宁路1018号",
        "name": "龙之梦购物中心大厦",
        "lnglat": "121.416611,31.219131",
        "count": 77
    },
    {
        "address": "长宁路1027号",
        "name": "兆丰广场",
        "lnglat": "121.418312,31.217828",
        "count": 17
    },
    {
        "address": "长宁路1033号",
        "name": "联通大厦（上海）",
        "lnglat": "121.417104,31.217695",
        "count": 6
    },
    {
        "address": "长宁路1055号",
        "name": "汇都大楼",
        "lnglat": "121.416665,31.217740",
        "count": 4
    },
    {
        "address": "长宁路1189号",
        "name": "长宁来福士广场",
        "lnglat": "121.414394,31.216358",
        "count": 115
    },
    {
        "address": "长宁路1200号",
        "name": "贝多芬广场",
        "lnglat": "121.414145,31.217953",
        "count": 8
    },
    {
        "address": "长宁路1277弄",
        "name": "中山公寓",
        "lnglat": "121.418935,31.220760",
        "count": 44
    },
    {
        "address": "长宁路1318弄",
        "name": "城宁花苑",
        "lnglat": "120.947324,30.539665",
        "count": 42
    },
    {
        "address": "长宁路1387号",
        "name": "新发现梦园",
        "lnglat": "121.410569,31.216908",
        "count": 4
    },
    {
        "address": "长宁路1447号",
        "name": "遵义东大楼",
        "lnglat": "121.409767,31.216815",
        "count": 4
    },
    {
        "address": "长宁路1515号",
        "name": "星火大厦",
        "lnglat": "121.408292,31.216877",
        "count": 3
    },
    {
        "address": "长宁路1600弄",
        "name": "沈南小区",
        "lnglat": "121.410253,31.219119",
        "count": 3
    },
    {
        "address": "长宁路165号",
        "name": "华电商务楼",
        "lnglat": "120.468944,27.566211",
        "count": 1
    },
    {
        "address": "长宁路1666弄",
        "name": "虹桥馨苑",
        "lnglat": "121.408479,31.218784",
        "count": 61
    },
    {
        "address": "长宁路1898弄1-10号",
        "name": "虹桥河滨花园",
        "lnglat": "109.028116,25.992053",
        "count": 63
    },
    {
        "address": "长宁路269弄",
        "name": "静安风华苑",
        "lnglat": "102.218202,27.903971",
        "count": 29
    },
    {
        "address": "长宁路378号",
        "name": "长宁大厦",
        "lnglat": "121.426899,31.224194",
        "count": 3
    },
    {
        "address": "长宁路405弄2号",
        "name": "花园村雅苑",
        "lnglat": "102.218216,27.903832",
        "count": 13
    },
    {
        "address": "长宁路515号",
        "name": "兴联大厦",
        "lnglat": "121.425766,31.221883",
        "count": 18
    },
    {
        "address": "长宁路546号",
        "name": "尚街Loft长宁会馆",
        "lnglat": "121.424663,31.221757",
        "count": 5
    },
    {
        "address": "长宁路599号 ",
        "name": "长宁区机关大厦",
        "lnglat": "121.424624,31.220374",
        "count": 4
    },
    {
        "address": "长宁路855号",
        "name": "亨通国际大厦",
        "lnglat": "121.420236,31.218542",
        "count": 29
    },
    {
        "address": "长宁路888号",
        "name": "兆丰嘉园",
        "lnglat": "121.419517,31.219515",
        "count": 19
    },
    {
        "address": "长宁路888弄9号",
        "name": "兆丰嘉园二期",
        "lnglat": "120.800968,29.575497",
        "count": 12
    },
    {
        "address": "长宁路88号",
        "name": "长宁八八中心",
        "lnglat": "121.114330,28.610425",
        "count": 34
    },
    {
        "address": "长宁路969号",
        "name": "兆丰花园",
        "lnglat": "121.419253,31.217612",
        "count": 8
    },
    {
        "address": "长宁支路125弄",
        "name": "长宁88金廷",
        "lnglat": "121.426357,31.227985",
        "count": 64
    },
    {
        "address": "长宁支路237弄1号",
        "name": "长芝大厦",
        "lnglat": "121.424867,31.225970",
        "count": 9
    },
    {
        "address": "长清北路1号",
        "name": "国新控股大厦",
        "lnglat": "121.484053,31.185135",
        "count": 5
    },
    {
        "address": "长清路1200弄",
        "name": "森宏购物广场商务楼",
        "lnglat": "121.490991,31.149281",
        "count": 6
    },
    {
        "address": "长清路12号",
        "name": "长清教师公寓",
        "lnglat": "112.683640,22.374336",
        "count": 2
    },
    {
        "address": "长寿路1076号",
        "name": "飞雕商务大厦",
        "lnglat": "121.428108,31.232021",
        "count": 4
    },
    {
        "address": "长寿路1112弄",
        "name": "水岸茗苑",
        "lnglat": "102.721545,25.055813",
        "count": 68
    },
    {
        "address": "长寿路1118号",
        "name": "悦达国际大厦",
        "lnglat": "121.427170,31.230710",
        "count": 26
    },
    {
        "address": "长寿路137号",
        "name": "财富时代广场",
        "lnglat": "111.485587,30.536497",
        "count": 1
    },
    {
        "address": "长寿路237号",
        "name": "工商银行大楼",
        "lnglat": "117.126950,28.967363",
        "count": 1
    },
    {
        "address": "长寿路285号",
        "name": "恒达大厦A幢",
        "lnglat": "117.128192,28.967417",
        "count": 1
    },
    {
        "address": "长寿路28弄",
        "name": "秋水云庐",
        "lnglat": "112.617489,31.417685",
        "count": 105
    },
    {
        "address": "长寿路295弄8号",
        "name": "恒达公寓",
        "lnglat": "120.388992,31.805239",
        "count": 1
    },
    {
        "address": "长寿路360号",
        "name": "源达大厦",
        "lnglat": "117.132316,28.968459",
        "count": 43
    },
    {
        "address": "长寿路393号",
        "name": "昆仑商务大厦",
        "lnglat": "120.389969,31.802549",
        "count": 2
    },
    {
        "address": "长寿路457弄",
        "name": "锦海大厦(上海)",
        "lnglat": "102.724158,25.054965",
        "count": 14
    },
    {
        "address": "长寿路468号",
        "name": "中环商务大厦",
        "lnglat": "117.136861,28.965994",
        "count": 5
    },
    {
        "address": "长寿路518弄",
        "name": "纺鑫苑",
        "lnglat": "110.627025,21.665428",
        "count": 13
    },
    {
        "address": "长寿路633弄3号",
        "name": "长寿大厦",
        "lnglat": "111.485483,30.533241",
        "count": 10
    },
    {
        "address": "长寿路652号",
        "name": "景源时尚产业园",
        "lnglat": "117.139210,28.962848",
        "count": 12
    },
    {
        "address": "长寿路699号",
        "name": "国鑫大厦",
        "lnglat": "121.433044,31.237008",
        "count": 5
    },
    {
        "address": "长寿路748弄1号",
        "name": "湖南大厦",
        "lnglat": "121.874141,29.477110",
        "count": 7
    },
    {
        "address": "长寿路748弄2号",
        "name": "莘远大厦",
        "lnglat": "111.487100,30.530186",
        "count": 9
    },
    {
        "address": "长寿路800弄",
        "name": "苏堤春晓名苑",
        "lnglat": "120.904701,31.175442",
        "count": 110
    },
    {
        "address": "长寿路822弄45支弄",
        "name": "汇丽花园",
        "lnglat": "120.905059,31.175379",
        "count": 40
    },
    {
        "address": "长寿路868号",
        "name": "中港汇大厦",
        "lnglat": "121.430447,31.235385",
        "count": 20
    },
    {
        "address": "长寿路888号",
        "name": "大众河滨酒店公寓",
        "lnglat": "120.906134,31.175189",
        "count": 9
    },
    {
        "address": "长寿路97号",
        "name": "世纪商务大厦",
        "lnglat": "101.702585,26.569395",
        "count": 10
    },
    {
        "address": "长水街277弄",
        "name": "信达蓝尊（信达仁泰苑）",
        "lnglat": "121.254800,31.059028",
        "count": 105
    },
    {
        "address": "长顺路36号",
        "name": "紫勋雅苑",
        "lnglat": "118.928930,35.724383",
        "count": 58
    },
    {
        "address": "长阳路1080号",
        "name": "上海国际设计交流中心",
        "lnglat": "121.525019,31.263812",
        "count": 1
    },
    {
        "address": "长阳路1529弄",
        "name": "旺增公寓",
        "lnglat": "121.531053,31.268562",
        "count": 16
    },
    {
        "address": "长阳路1616号",
        "name": "互联网教育大厦",
        "lnglat": "121.534143,31.269090",
        "count": 4
    },
    {
        "address": "长阳路1687号",
        "name": "长阳谷创意园区",
        "lnglat": "121.533693,31.271783",
        "count": 26
    },
    {
        "address": "长阳路2080号",
        "name": "宁武小区",
        "lnglat": "121.541083,31.272424",
        "count": 18
    },
    {
        "address": "长阳路235号",
        "name": "鼎立大厦",
        "lnglat": "121.510944,31.256484",
        "count": 6
    },
    {
        "address": "长阳路2467号",
        "name": "铭大创意广场",
        "lnglat": "121.544452,31.276050",
        "count": 7
    },
    {
        "address": "长阳路2555号",
        "name": "海立大楼",
        "lnglat": "121.545239,31.276353",
        "count": 18
    },
    {
        "address": "长阳路288号",
        "name": "兰侨大厦",
        "lnglat": "121.512199,31.256905",
        "count": 9
    },
    {
        "address": "长阳路666号",
        "name": "燕舞东方保利广场M楼",
        "lnglat": "121.516860,31.260793",
        "count": 4
    },
    {
        "address": "长阳路758号",
        "name": "明德公寓",
        "lnglat": "121.518840,31.262070",
        "count": 8
    },
    {
        "address": "长阳路782号",
        "name": "明园公寓",
        "lnglat": "121.519332,31.262188",
        "count": 8
    },
    {
        "address": "长阳路812号",
        "name": "明阳公寓",
        "lnglat": "121.519740,31.262539",
        "count": 8
    },
    {
        "address": "长阳路8号",
        "name": "建爱大厦",
        "lnglat": "120.341153,36.075578",
        "count": 14
    },
    {
        "address": "长逸路15号",
        "name": "复旦软件园",
        "lnglat": "113.417308,22.487774",
        "count": 8
    },
    {
        "address": "长逸路180号",
        "name": "逸隆广场",
        "lnglat": "121.494531,31.338178",
        "count": 8
    },
    {
        "address": "长逸路188号",
        "name": "复旦软件园二期",
        "lnglat": "121.493903,31.338304",
        "count": 6
    },
    {
        "address": "长逸路301弄",
        "name": "新梅淞南苑",
        "lnglat": "121.490990,31.338220",
        "count": 17
    },
    {
        "address": "长逸路388弄",
        "name": "鹏程花苑（上海）",
        "lnglat": "121.490390,31.337026",
        "count": 44
    },
    {
        "address": "招贤路1181号",
        "name": "意安乐创中心",
        "lnglat": "121.235476,31.355167",
        "count": 32
    },
    {
        "address": "昭化路110号",
        "name": "增沁商务楼",
        "lnglat": "121.426213,31.211842",
        "count": 2
    },
    {
        "address": "昭化路118号",
        "name": "臻悦商苑",
        "lnglat": "121.425702,31.211809",
        "count": 2
    },
    {
        "address": "昭化路357号",
        "name": "昭化德必易园",
        "lnglat": "121.424036,31.212100",
        "count": 16
    },
    {
        "address": "昭化路488号",
        "name": "金森大厦",
        "lnglat": "121.422569,31.211245",
        "count": 9
    },
    {
        "address": "昭化路508号",
        "name": "新衡商务楼",
        "lnglat": "121.422110,31.211206",
        "count": 10
    },
    {
        "address": "昭化路68弄",
        "name": "晨飞公寓",
        "lnglat": "121.427821,31.212206",
        "count": 7
    },
    {
        "address": "赵屯浦路380弄",
        "name": "新塘苑",
        "lnglat": "121.084344,31.146678",
        "count": 200
    },
    {
        "address": "肇家浜路393号",
        "name": "兴南花园",
        "lnglat": "121.458835,31.201618",
        "count": 14
    },
    {
        "address": "肇家浜路407号",
        "name": "中科苑公寓",
        "lnglat": "121.458483,31.201497",
        "count": 9
    },
    {
        "address": "肇嘉浜路1033号",
        "name": "徐家汇国际大厦",
        "lnglat": "121.441939,31.194865",
        "count": 6
    },
    {
        "address": "肇嘉浜路1065号",
        "name": "飞雕国际大厦",
        "lnglat": "121.441315,31.194430",
        "count": 15
    },
    {
        "address": "肇嘉浜路1111号",
        "name": "美罗城",
        "lnglat": "121.439649,31.192944",
        "count": 4
    },
    {
        "address": "肇嘉浜路159号",
        "name": "友谊时代大厦",
        "lnglat": "121.464587,31.203103",
        "count": 4
    },
    {
        "address": "肇嘉浜路188弄",
        "name": "德玛公寓",
        "lnglat": "121.463055,31.204099",
        "count": 20
    },
    {
        "address": "肇嘉浜路201号",
        "name": "上海生产资料交易市场",
        "lnglat": "121.463916,31.203210",
        "count": 18
    },
    {
        "address": "肇嘉浜路201弄",
        "name": "衡园",
        "lnglat": "121.463849,31.201950",
        "count": 103
    },
    {
        "address": "肇嘉浜路258-268号",
        "name": "紫苑大厦",
        "lnglat": "121.461261,31.203541",
        "count": 6
    },
    {
        "address": "肇嘉浜路269弄 ",
        "name": "云福大厦",
        "lnglat": "121.462272,31.202678",
        "count": 16
    },
    {
        "address": "肇嘉浜路288弄2号",
        "name": "中福商务楼",
        "lnglat": "121.460279,31.203232",
        "count": 5
    },
    {
        "address": "肇嘉浜路301号",
        "name": "工商大厦",
        "lnglat": "121.461320,31.202355",
        "count": 1
    },
    {
        "address": "肇嘉浜路333号",
        "name": "亚太企业大楼",
        "lnglat": "121.460486,31.202261",
        "count": 2
    },
    {
        "address": "肇嘉浜路359号",
        "name": "航天科工集团大楼",
        "lnglat": "121.459944,31.202203",
        "count": 2
    },
    {
        "address": "肇嘉浜路366号",
        "name": "裕华大厦",
        "lnglat": "121.458078,31.202667",
        "count": 1
    },
    {
        "address": "肇嘉浜路376号",
        "name": "轻工大厦（上海）",
        "lnglat": "121.457438,31.202477",
        "count": 2
    },
    {
        "address": "肇嘉浜路383号",
        "name": "嘉乐公寓",
        "lnglat": "121.459310,31.201962",
        "count": 7
    },
    {
        "address": "肇嘉浜路433号",
        "name": "金兰花苑",
        "lnglat": "121.457511,31.201522",
        "count": 6
    },
    {
        "address": "肇嘉浜路446号",
        "name": "伊泰利大厦",
        "lnglat": "121.455111,31.201991",
        "count": 10
    },
    {
        "address": "肇嘉浜路539号",
        "name": "平华大厦",
        "lnglat": "121.456701,31.201321",
        "count": 7
    },
    {
        "address": "肇嘉浜路680号",
        "name": "上海金钟大厦",
        "lnglat": "121.449459,31.199542",
        "count": 14
    },
    {
        "address": "肇嘉浜路768号",
        "name": "欧江大厦",
        "lnglat": "121.446205,31.198813",
        "count": 8
    },
    {
        "address": "肇嘉浜路789号",
        "name": "均瑶国际广场",
        "lnglat": "121.448603,31.198065",
        "count": 25
    },
    {
        "address": "肇嘉浜路807号（东安路）",
        "name": "五洲国际大厦",
        "lnglat": "121.447929,31.197974",
        "count": 16
    },
    {
        "address": "肇嘉浜路96弄7号",
        "name": "沪筑汇",
        "lnglat": "121.450022,31.198958",
        "count": 4
    },
    {
        "address": "肇嘉浜路999弄",
        "name": "上海帝景苑",
        "lnglat": "121.442493,31.195156",
        "count": 10
    },
    {
        "address": "肇嘉浜路99弄",
        "name": "瑞嘉公寓",
        "lnglat": "121.465318,31.203629",
        "count": 20
    },
    {
        "address": "浙江南路78号",
        "name": "东新商务大厦",
        "lnglat": "121.482104,31.228504",
        "count": 21
    },
    {
        "address": "浙江中路188弄",
        "name": "中福城",
        "lnglat": "121.479242,31.233689",
        "count": 51
    },
    {
        "address": "浙江中路400号",
        "name": "春申江大厦",
        "lnglat": "121.478328,31.236296",
        "count": 1
    },
    {
        "address": "浙桥路277号",
        "name": "碧海现代苑",
        "lnglat": "121.600807,31.252279",
        "count": 24
    },
    {
        "address": "浙桥路289弄2号",
        "name": "碧云公馆",
        "lnglat": "121.601813,31.252818",
        "count": 9
    },
    {
        "address": "真北路2150号",
        "name": "光学科技园区(宝岛眼镜)",
        "lnglat": "121.392131,31.253454",
        "count": 3
    },
    {
        "address": "真北路2167号",
        "name": "鸿海大厦（上海）",
        "lnglat": "121.391103,31.253564",
        "count": 10
    },
    {
        "address": "真北路2500号",
        "name": "星河世纪广场",
        "lnglat": "121.393855,31.260492",
        "count": 6
    },
    {
        "address": "真北路3725弄11号",
        "name": "V领地青年社区真北路社区",
        "lnglat": "121.401790,31.284960",
        "count": 5
    },
    {
        "address": "真北路958号",
        "name": "天地科技广场",
        "lnglat": "121.384032,31.233182",
        "count": 4
    },
    {
        "address": "真陈路788号",
        "name": "陕外物流商务楼",
        "lnglat": "121.346400,31.300626",
        "count": 17
    },
    {
        "address": "真大路333弄",
        "name": "琉樽尚品",
        "lnglat": "121.402876,31.290494",
        "count": 312
    },
    {
        "address": "真大路358弄",
        "name": "欧泊花郡",
        "lnglat": "121.398958,31.289522",
        "count": 118
    },
    {
        "address": "真大路399弄1-20号",
        "name": "晶悦都汇(中环一号三期)",
        "lnglat": "121.401689,31.292029",
        "count": 15
    },
    {
        "address": "真大路450弄11号",
        "name": "中邮华东智能产业园",
        "lnglat": "121.401467,31.294334",
        "count": 6
    },
    {
        "address": "真大路520号",
        "name": "米谷创业园",
        "lnglat": "121.407878,31.296639",
        "count": 62
    },
    {
        "address": "真大路551号",
        "name": "华生创谷文化创意产业园",
        "lnglat": "121.410688,31.296854",
        "count": 38
    },
    {
        "address": "真大路560号",
        "name": "永久1940iHUB创意产业园",
        "lnglat": "121.409787,31.298495",
        "count": 14
    },
    {
        "address": "真光路1219号",
        "name": "新长征中环大厦",
        "lnglat": "121.380617,31.243297",
        "count": 3
    },
    {
        "address": "真光路1473弄3号",
        "name": "胜益商务中心",
        "lnglat": "121.381962,31.247041",
        "count": 5
    },
    {
        "address": "真光路539弄",
        "name": "长征坊",
        "lnglat": "121.372538,31.232240",
        "count": 5
    },
    {
        "address": "真华路157弄",
        "name": "万里一期157弄",
        "lnglat": "121.409662,31.265420",
        "count": 55
    },
    {
        "address": "真华路1600弄",
        "name": "玉华东苑",
        "lnglat": "121.412207,31.286889",
        "count": 24
    },
    {
        "address": "真华路1800弄",
        "name": "梧桐城邦一期",
        "lnglat": "121.411806,31.289618",
        "count": 43
    },
    {
        "address": "真华路1988弄、真华路1958弄",
        "name": "梧桐城邦三期",
        "lnglat": "121.411855,31.291539",
        "count": 56
    },
    {
        "address": "真华路1989弄",
        "name": "梧桐城邦四期",
        "lnglat": "121.409859,31.292350",
        "count": 32
    },
    {
        "address": "真华路388弄",
        "name": "中环锦园",
        "lnglat": "121.411421,31.269228",
        "count": 104
    },
    {
        "address": "真华路928号",
        "name": "大华虎城第三空间",
        "lnglat": "121.411674,31.271535",
        "count": 87
    },
    {
        "address": "真华路999弄",
        "name": "水岸蓝桥",
        "lnglat": "121.408977,31.275830",
        "count": 292
    },
    {
        "address": "真金路250弄",
        "name": "真金苑",
        "lnglat": "121.406456,31.267802",
        "count": 170
    },
    {
        "address": "真金路251弄",
        "name": "真欣园",
        "lnglat": "121.404576,31.268269",
        "count": 58
    },
    {
        "address": "真金路457弄",
        "name": "凯旋华庭",
        "lnglat": "121.404479,31.272359",
        "count": 30
    },
    {
        "address": "真金路577弄，武威东路477弄，武威东路479弄",
        "name": "颐和华城",
        "lnglat": "121.398039,31.274840",
        "count": 226
    },
    {
        "address": "真金路655弄",
        "name": "金华苑（上海）",
        "lnglat": "121.405383,31.275834",
        "count": 8
    },
    {
        "address": "真南路150号",
        "name": "沪西德必易园",
        "lnglat": "121.397607,31.267065",
        "count": 16
    },
    {
        "address": "真南路3435弄",
        "name": "安达家园",
        "lnglat": "121.343007,31.291260",
        "count": 10
    },
    {
        "address": "真南路3489弄",
        "name": "阳光水岸苑",
        "lnglat": "121.343272,31.290186",
        "count": 93
    },
    {
        "address": "真南路708号",
        "name": "申环商务大楼",
        "lnglat": "121.386663,31.269936",
        "count": 2
    },
    {
        "address": "真南路822弄129号",
        "name": "李子园同济科技园",
        "lnglat": "121.383632,31.272777",
        "count": 12
    },
    {
        "address": "真南路895弄",
        "name": "真南路895弄",
        "lnglat": "121.381143,31.269840",
        "count": 14
    },
    {
        "address": "振兴东路15弄",
        "name": "成发苑",
        "lnglat": "120.580821,30.628412",
        "count": 10
    },
    {
        "address": "振盈路87、63号",
        "name": "久业时代广场",
        "lnglat": "121.113428,31.189261",
        "count": 7
    },
    {
        "address": "镇宁路111号",
        "name": "万宝国际广场（王子晶品）",
        "lnglat": "121.436553,31.218097",
        "count": 2
    },
    {
        "address": "镇宁路168号",
        "name": "美丽园酒店公寓",
        "lnglat": "121.437816,31.218495",
        "count": 6
    },
    {
        "address": "镇宁路200号",
        "name": "欣安大厦",
        "lnglat": "121.437311,31.219076",
        "count": 16
    },
    {
        "address": "镇宁路233号",
        "name": "荣轩大厦",
        "lnglat": "121.436387,31.218867",
        "count": 13
    },
    {
        "address": "镇宁路525号",
        "name": "新东纺国际商务中心",
        "lnglat": "121.435138,31.224296",
        "count": 8
    },
    {
        "address": "镇宁路545弄7号",
        "name": "天星公寓（上海）",
        "lnglat": "121.434594,31.223922",
        "count": 12
    },
    {
        "address": "镇宁路90-98号",
        "name": "爱俪轩大厦",
        "lnglat": "121.437903,31.216640",
        "count": 4
    },
    {
        "address": "镇坪路176弄",
        "name": "秋月枫舍二期",
        "lnglat": "121.430351,31.250349",
        "count": 86
    },
    {
        "address": "镇坪路48号",
        "name": "嘉富利大厦",
        "lnglat": "121.428847,31.250717",
        "count": 20
    },
    {
        "address": "镇泰路111弄",
        "name": "上海四季花城二期",
        "lnglat": "106.070328,30.793675",
        "count": 284
    },
    {
        "address": "镇泽路18弄",
        "name": "万科锦源",
        "lnglat": "121.198822,31.160342",
        "count": 112
    },
    {
        "address": "正旭路333弄",
        "name": "泷悦和苑",
        "lnglat": "121.746785,30.871479",
        "count": 26
    },
    {
        "address": "正旭路599弄",
        "name": "凤凰城天境",
        "lnglat": "121.746103,30.875847",
        "count": 76
    },
    {
        "address": "正旭路733弄",
        "name": "凤凰城天悦",
        "lnglat": "121.746363,30.877845",
        "count": 22
    },
    {
        "address": "政旦东路8弄",
        "name": "财富商业广场",
        "lnglat": "121.518231,31.302200",
        "count": 30
    },
    {
        "address": "政德东路88号",
        "name": "椰泰公寓",
        "lnglat": "121.518756,31.308707",
        "count": 8
    },
    {
        "address": "政高路77号",
        "name": "同和国际大厦",
        "lnglat": "121.508251,31.309452",
        "count": 26
    },
    {
        "address": "政和路388弄",
        "name": "仁恒怡庭",
        "lnglat": "116.489757,23.511156",
        "count": 73
    },
    {
        "address": "政和路999弄",
        "name": "合生江湾国际公寓（上海合生江湾）",
        "lnglat": "121.515165,31.337995",
        "count": 430
    },
    {
        "address": "政恒路66号",
        "name": "凯迪立方大厦",
        "lnglat": "121.507457,31.310814",
        "count": 4
    },
    {
        "address": "政立路415号",
        "name": "天盛广场",
        "lnglat": "121.509779,31.309111",
        "count": 50
    },
    {
        "address": "政立路505弄",
        "name": "新江湾佳苑",
        "lnglat": "121.503730,31.309877",
        "count": 125
    },
    {
        "address": "政青路399弄",
        "name": "文化名邸",
        "lnglat": "121.497587,31.316650",
        "count": 5
    },
    {
        "address": "政青路599弄",
        "name": "三湘七星府邸",
        "lnglat": "121.497832,31.319600",
        "count": 7
    },
    {
        "address": "政通路95弄",
        "name": "文轩佳苑",
        "lnglat": "104.169228,24.051076",
        "count": 44
    },
    {
        "address": "政益路47号48号",
        "name": "五角丰达商务广场（二期）",
        "lnglat": "121.517284,31.302333",
        "count": 8
    },
    {
        "address": "政益路8号",
        "name": "五角丰达商务广场(五角丰达大厦)",
        "lnglat": "121.518581,31.303200",
        "count": 28
    },
    {
        "address": "政悦路88弄",
        "name": "涵碧景苑",
        "lnglat": "121.521391,31.325828",
        "count": 54
    },
    {
        "address": "芝川路100弄",
        "name": "芝川新苑（上海）",
        "lnglat": "121.402499,31.258037",
        "count": 16
    },
    {
        "address": "止园路577号",
        "name": "和兰苑",
        "lnglat": "121.467187,31.263911",
        "count": 19
    },
    {
        "address": "芷江西路488号",
        "name": "五月花生活广场",
        "lnglat": "121.457353,31.256578",
        "count": 4
    },
    {
        "address": "芷江西路593弄",
        "name": "锦福公寓",
        "lnglat": "121.454893,31.256927",
        "count": 9
    },
    {
        "address": "芷江西路788号",
        "name": "华舟大厦",
        "lnglat": "121.452858,31.255377",
        "count": 10
    },
    {
        "address": "志丹路10弄8号",
        "name": "长富大厦",
        "lnglat": "121.431294,31.258860",
        "count": 6
    },
    {
        "address": "志丹路155弄",
        "name": "西部名都花园",
        "lnglat": "121.430003,31.263407",
        "count": 24
    },
    {
        "address": "志丹路97弄",
        "name": "西部大楼",
        "lnglat": "121.430201,31.260435",
        "count": 32
    },
    {
        "address": "制造局路27号",
        "name": "紫宇大楼",
        "lnglat": "121.482506,31.210518",
        "count": 3
    },
    {
        "address": "制造局路287号",
        "name": "龙悦大厦",
        "lnglat": "121.484644,31.207460",
        "count": 2
    },
    {
        "address": "制造局路363弄",
        "name": "豫欣公寓",
        "lnglat": "121.485126,31.206115",
        "count": 15
    },
    {
        "address": "制造局路466号",
        "name": "裕和公寓",
        "lnglat": "121.484142,31.204906",
        "count": 14
    },
    {
        "address": "制造局路787号",
        "name": "黄浦区科技创业中心",
        "lnglat": "121.486291,31.199470",
        "count": 2
    },
    {
        "address": "制造局路833号",
        "name": "惠祥公寓",
        "lnglat": "121.487201,31.199609",
        "count": 1
    },
    {
        "address": "制造局路833弄8号",
        "name": "嘉登公寓",
        "lnglat": "121.486900,31.198878",
        "count": 4
    },
    {
        "address": "置旺路288弄",
        "name": "万科有山（博望苑）",
        "lnglat": "121.230059,31.125441",
        "count": 60
    },
    {
        "address": "中漕路20号",
        "name": "中漕小区",
        "lnglat": "121.435192,31.183633",
        "count": 3
    },
    {
        "address": "中创路266号",
        "name": "波汇科技园",
        "lnglat": "121.274025,31.045932",
        "count": 10
    },
    {
        "address": "中创路398号",
        "name": "融松科创园",
        "lnglat": "121.274992,31.047990",
        "count": 10
    },
    {
        "address": "中创路68号",
        "name": "上海启迪漕河泾(中山)科技园",
        "lnglat": "121.274189,31.042047",
        "count": 74
    },
    {
        "address": "中春路1088号",
        "name": "金地威新中科园",
        "lnglat": "121.401469,31.042850",
        "count": 29
    },
    {
        "address": "中春路1288号",
        "name": "金地威新闵行科创园(中春路)",
        "lnglat": "121.397543,31.044369",
        "count": 16
    },
    {
        "address": "中春路4999号",
        "name": "莘庄商务大楼",
        "lnglat": "121.375401,31.099998",
        "count": 2
    },
    {
        "address": "中春路6111号",
        "name": "慧峰商务大厦",
        "lnglat": "121.357137,31.125698",
        "count": 20
    },
    {
        "address": "中春路6818弄10号",
        "name": "海琪大厦",
        "lnglat": "121.350485,31.135178",
        "count": 30
    },
    {
        "address": "中春路7001号",
        "name": "明谷科技园一期",
        "lnglat": "121.346338,31.137034",
        "count": 9
    },
    {
        "address": "中春路7089号",
        "name": 7089,
        "lnglat": "121.345139,31.139401",
        "count": 20
    },
    {
        "address": "中春路7178号",
        "name": "欧西玛创新园区",
        "lnglat": "121.346704,31.140099",
        "count": 18
    },
    {
        "address": "中春路7198号",
        "name": "凯斯国际商务中心",
        "lnglat": "121.346247,31.140792",
        "count": 12
    },
    {
        "address": "中春路7628号",
        "name": "优房商务中心",
        "lnglat": "121.343337,31.145715",
        "count": 6
    },
    {
        "address": "中春路7658号",
        "name": "水清年华臻景苑",
        "lnglat": "121.345168,31.147759",
        "count": 89
    },
    {
        "address": "中春路8888弄",
        "name": "万科城市花园新区",
        "lnglat": "121.336990,31.157265",
        "count": 49
    },
    {
        "address": "中春路8889弄",
        "name": "万科城花新园",
        "lnglat": "121.336059,31.154357",
        "count": 281
    },
    {
        "address": "中华路1359号",
        "name": "康宁商厦（大厦）",
        "lnglat": "102.473783,24.919920",
        "count": 7
    },
    {
        "address": "中华路168弄",
        "name": "浦江公馆",
        "lnglat": "108.671654,34.310161",
        "count": 16
    },
    {
        "address": "中华路429弄1-5号",
        "name": "绿地名人坊",
        "lnglat": "109.028116,25.992053",
        "count": 48
    },
    {
        "address": "中华路868弄",
        "name": "明日星城二期",
        "lnglat": "102.473563,24.919916",
        "count": 18
    },
    {
        "address": "中华路88号",
        "name": "滨江名人苑",
        "lnglat": "104.773196,29.351943",
        "count": 48
    },
    {
        "address": "中华新路288号",
        "name": "绿洲雅宾利花园",
        "lnglat": "121.473953,31.258921",
        "count": 24
    },
    {
        "address": "中华新路588弄",
        "name": "中兴财富国际公寓",
        "lnglat": "121.462713,31.252530",
        "count": 25
    },
    {
        "address": "中华新路939弄",
        "name": "紫兰苑",
        "lnglat": "121.454776,31.255304",
        "count": 15
    },
    {
        "address": "中江路879号",
        "name": "天地软件园",
        "lnglat": "121.390677,31.234138",
        "count": 117
    },
    {
        "address": "中江路888号",
        "name": "五芳斋大厦",
        "lnglat": "121.392487,31.235112",
        "count": 12
    },
    {
        "address": "中江路889号",
        "name": "曹杨商务大厦",
        "lnglat": "121.391448,31.235648",
        "count": 48
    },
    {
        "address": "中江路938号",
        "name": "中天新世纪商务大厦",
        "lnglat": "121.392526,31.235530",
        "count": 11
    },
    {
        "address": "中山北二路1121号",
        "name": "同济科技大厦",
        "lnglat": "121.504219,31.286786",
        "count": 13
    },
    {
        "address": "中山北二路1631号",
        "name": "曲阳邮政大厦",
        "lnglat": "121.493546,31.285166",
        "count": 7
    },
    {
        "address": "中山北二路1800号",
        "name": "海鸥商务大厦",
        "lnglat": "121.494380,31.286295",
        "count": 18
    },
    {
        "address": "中山北路1017号",
        "name": "沪太办公楼",
        "lnglat": "121.449743,31.258844",
        "count": 5
    },
    {
        "address": "中山北路1238号",
        "name": "格林德必易园",
        "lnglat": "121.170932,30.060137",
        "count": 8
    },
    {
        "address": "中山北路1412号",
        "name": "远景大厦A座",
        "lnglat": "121.441692,31.255176",
        "count": 5
    },
    {
        "address": "中山北路1482号",
        "name": "远景大厦B座",
        "lnglat": "121.440712,31.254997",
        "count": 5
    },
    {
        "address": "中山北路1655弄10支弄1-6号",
        "name": "月亮湾小区",
        "lnglat": "121.435195,31.253345",
        "count": 5
    },
    {
        "address": "中山北路1777号",
        "name": "飞洲时代大厦",
        "lnglat": "121.433545,31.251438",
        "count": 22
    },
    {
        "address": "中山北路198号",
        "name": "申航大厦",
        "lnglat": "116.021997,25.878043",
        "count": 6
    },
    {
        "address": "中山北路2000号",
        "name": "中期大厦",
        "lnglat": "121.431993,31.248789",
        "count": 19
    },
    {
        "address": "中山北路2052号",
        "name": "振源大厦",
        "lnglat": "121.430988,31.248021",
        "count": 56
    },
    {
        "address": "中山北路2130号",
        "name": "万千大厦",
        "lnglat": "121.430344,31.247272",
        "count": 14
    },
    {
        "address": "中山北路2318号-2342号",
        "name": "中岚大楼",
        "lnglat": "112.613746,26.908495",
        "count": 19
    },
    {
        "address": "中山北路2438号",
        "name": "中瑞商务大厦（上海）",
        "lnglat": "121.424553,31.244022",
        "count": 26
    },
    {
        "address": "中山北路2550号",
        "name": "上海有色金属交易中心(物贸大厦)",
        "lnglat": "120.649207,31.206244",
        "count": 55
    },
    {
        "address": "中山北路2790号",
        "name": "上海杰地大厦",
        "lnglat": "121.418824,31.240669",
        "count": 20
    },
    {
        "address": "中山北路2900号",
        "name": "东方国际元中大厦",
        "lnglat": "121.417936,31.240146",
        "count": 45
    },
    {
        "address": "中山北路2911号",
        "name": "中关村科技大厦",
        "lnglat": "121.416738,31.240639",
        "count": 25
    },
    {
        "address": "中山北路3000号",
        "name": "上海长城大厦",
        "lnglat": "121.415664,31.238124",
        "count": 13
    },
    {
        "address": "中山北路3064号",
        "name": "绿洲广场",
        "lnglat": "121.414125,31.236047",
        "count": 20
    },
    {
        "address": "中山北路3300号",
        "name": "环球港",
        "lnglat": "121.412589,31.233328",
        "count": 110
    },
    {
        "address": "中山北路3323号",
        "name": "春之声大厦",
        "lnglat": "121.411482,31.234396",
        "count": 3
    },
    {
        "address": "中山北路3327弄",
        "name": "恒陇丽晶",
        "lnglat": "121.411070,31.233680",
        "count": 24
    },
    {
        "address": "中山北路3618弄",
        "name": "银城大厦(上海)",
        "lnglat": "112.613248,26.907672",
        "count": 10
    },
    {
        "address": "中山北路3751弄3号",
        "name": "悦樘公寓(华师大店)",
        "lnglat": "112.613197,26.907588",
        "count": 8
    },
    {
        "address": "中山北路3856弄2号",
        "name": "中环大厦",
        "lnglat": "121.411427,31.226825",
        "count": 21
    },
    {
        "address": "中山北路814弄",
        "name": "协和公寓",
        "lnglat": "121.458184,31.259443",
        "count": 60
    },
    {
        "address": "中山北路828号",
        "name": "科普大楼",
        "lnglat": "121.457141,31.259395",
        "count": 5
    },
    {
        "address": "中山北路831弄1-5号",
        "name": "吉兴大厦",
        "lnglat": "121.457634,31.260377",
        "count": 13
    },
    {
        "address": "中山北路835号",
        "name": "悦樘公寓(大宁店)",
        "lnglat": "121.457325,31.260221",
        "count": 4
    },
    {
        "address": "中山北路864号",
        "name": "金甸大楼（上海）",
        "lnglat": "121.456281,31.259149",
        "count": 7
    },
    {
        "address": "中山北路899弄",
        "name": "上海滩大宁城",
        "lnglat": "120.648143,31.176486",
        "count": 90
    },
    {
        "address": "中山北一路1100弄",
        "name": "新华一村干休所",
        "lnglat": "121.486237,31.289033",
        "count": 32
    },
    {
        "address": "中山北一路1200号",
        "name": "明道大楼",
        "lnglat": "121.487794,31.290180",
        "count": 26
    },
    {
        "address": "中山北一路1200号1号楼",
        "name": "魔方公寓大柏树店",
        "lnglat": "121.487794,31.290180",
        "count": 1
    },
    {
        "address": "中山北一路1230号",
        "name": "柏树大厦",
        "lnglat": "121.488646,31.290733",
        "count": 5
    },
    {
        "address": "中山北一路1250号",
        "name": "沪办大厦",
        "lnglat": "121.489644,31.291622",
        "count": 97
    },
    {
        "address": "中山北一路160号",
        "name": "久乐大厦",
        "lnglat": "121.477870,31.272837",
        "count": 8
    },
    {
        "address": "中山北一路184号",
        "name": "上海怡景大厦",
        "lnglat": "121.477915,31.273150",
        "count": 2
    },
    {
        "address": "中山北一路284号",
        "name": "上外中山大楼",
        "lnglat": "121.479744,31.277027",
        "count": 10
    },
    {
        "address": "中山北一路805号",
        "name": "805公安大楼",
        "lnglat": "121.483723,31.286802",
        "count": 9
    },
    {
        "address": "中山北一路82号",
        "name": "花园商务楼",
        "lnglat": "121.476667,31.270181",
        "count": 3
    },
    {
        "address": "中山北一路865弄21号",
        "name": "阜和综合楼",
        "lnglat": "121.483217,31.287612",
        "count": 1
    },
    {
        "address": "中山北一路9号",
        "name": "近铁虹口金融产业园",
        "lnglat": "121.473790,31.268759",
        "count": 11
    },
    {
        "address": "中山东二路8号",
        "name": "外滩8号",
        "lnglat": "121.172729,30.008028",
        "count": 5
    },
    {
        "address": "中山南二路1007号",
        "name": "中煌大厦",
        "lnglat": "121.446019,31.180987",
        "count": 4
    },
    {
        "address": "中山南二路1057弄2号",
        "name": "协昌小区",
        "lnglat": "121.444304,31.179398",
        "count": 6
    },
    {
        "address": "中山南二路900号",
        "name": "精文公寓",
        "lnglat": "121.449850,31.185079",
        "count": 7
    },
    {
        "address": "中山南二路932弄6号",
        "name": "龙山公寓",
        "lnglat": "121.448228,31.184059",
        "count": 9
    },
    {
        "address": "中山南二路999弄19号",
        "name": "中信中山大楼",
        "lnglat": "121.446451,31.181430",
        "count": 9
    },
    {
        "address": "中山南路1088号",
        "name": "南浦大楼",
        "lnglat": "120.645697,31.130468",
        "count": 3
    },
    {
        "address": "中山南路1228号",
        "name": "北方工业大厦",
        "lnglat": "121.501522,31.210561",
        "count": 3
    },
    {
        "address": "中山南路1358弄",
        "name": "中福花苑二期",
        "lnglat": "110.285095,25.264859",
        "count": 178
    },
    {
        "address": "中山南路1669弄69号",
        "name": "中山大楼",
        "lnglat": "110.285045,25.264390",
        "count": 5
    },
    {
        "address": "中山南路1877号",
        "name": "金中苑商务楼",
        "lnglat": "121.491651,31.202231",
        "count": 5
    },
    {
        "address": "中山南路200号",
        "name": "金外滩花园",
        "lnglat": "116.767898,23.454189",
        "count": 66
    },
    {
        "address": "中山南路268号",
        "name": "新源广场",
        "lnglat": "118.644056,34.914920",
        "count": 4
    },
    {
        "address": "中山南路318号",
        "name": "东方国际金融广场",
        "lnglat": "120.215824,27.317916",
        "count": 23
    },
    {
        "address": "中山南路398弄",
        "name": "海琪园",
        "lnglat": "87.258003,43.975279",
        "count": 103
    },
    {
        "address": "中山南路865号",
        "name": "临江花园大厦",
        "lnglat": "121.507049,31.213108",
        "count": 2
    },
    {
        "address": "中山南路969号",
        "name": "谷泰滨江大厦",
        "lnglat": "121.505913,31.211757",
        "count": 12
    },
    {
        "address": "中山南一路1065",
        "name": "天歌大地大厦",
        "lnglat": "121.472209,31.196080",
        "count": 6
    },
    {
        "address": "中山南一路528号",
        "name": "华西融创中心（上海滨江壹号院）",
        "lnglat": "121.482456,31.198441",
        "count": 1
    },
    {
        "address": "中山南一路721弄",
        "name": "江南造船新苑",
        "lnglat": "121.480138,31.198526",
        "count": 30
    },
    {
        "address": "中山南一路788号博荟广场",
        "name": "博荟广场商场",
        "lnglat": "121.480912,31.195910",
        "count": 24
    },
    {
        "address": "中山南一路892号",
        "name": "申龙大楼",
        "lnglat": "121.476211,31.196608",
        "count": 10
    },
    {
        "address": "中山南一路904号",
        "name": "中南公寓",
        "lnglat": "121.475535,31.196278",
        "count": 10
    },
    {
        "address": "中山西路1221号",
        "name": "锦绣花园（上海）",
        "lnglat": "121.417556,31.195068",
        "count": 7
    },
    {
        "address": "中山西路1231号",
        "name": "锦城公寓",
        "lnglat": "121.417867,31.194615",
        "count": 9
    },
    {
        "address": "中山西路1251弄",
        "name": "九九园",
        "lnglat": "118.744036,30.947086",
        "count": 20
    },
    {
        "address": "中山西路1279弄6号",
        "name": "国峰科技大厦（上海）",
        "lnglat": "121.420812,31.191955",
        "count": 5
    },
    {
        "address": "中山西路1281号",
        "name": "海螺大厦",
        "lnglat": "121.420155,31.191452",
        "count": 14
    },
    {
        "address": "中山西路1600-1602",
        "name": "宏汇国际广场",
        "lnglat": "118.744036,30.947086",
        "count": 16
    },
    {
        "address": "中山西路1790号",
        "name": "兆丰虹桥公寓",
        "lnglat": "120.690590,30.756870",
        "count": 3
    },
    {
        "address": "中山西路179号，189弄",
        "name": "虹桥世家花园",
        "lnglat": "107.233238,26.576576",
        "count": 8
    },
    {
        "address": "中山西路1800号",
        "name": "兆丰环球大厦",
        "lnglat": "120.690331,30.756841",
        "count": 54
    },
    {
        "address": "中山西路1878号",
        "name": "凯托大厦",
        "lnglat": "121.424988,31.183057",
        "count": 21
    },
    {
        "address": "中山西路1919号",
        "name": "北科徐汇商都",
        "lnglat": "121.425928,31.183751",
        "count": 2
    },
    {
        "address": "中山西路1号",
        "name": "水云间(上海)",
        "lnglat": "107.239570,26.574823",
        "count": 207
    },
    {
        "address": "中山西路2006号",
        "name": "百第宜山大楼",
        "lnglat": "121.425844,31.182718",
        "count": 14
    },
    {
        "address": "中山西路2020号",
        "name": "华宜大厦",
        "lnglat": "121.426786,31.181957",
        "count": 12
    },
    {
        "address": "中山西路2025号",
        "name": "永升大厦",
        "lnglat": "121.427784,31.182661",
        "count": 21
    },
    {
        "address": "中山西路2240号",
        "name": "鼎力创意园",
        "lnglat": "121.430198,31.181188",
        "count": 19
    },
    {
        "address": "中山西路2366号",
        "name": "华鼎广场",
        "lnglat": "121.432525,31.180126",
        "count": 6
    },
    {
        "address": "中山西路2368号",
        "name": "华鼎大厦",
        "lnglat": "121.432170,31.180543",
        "count": 4
    },
    {
        "address": "中山西路340号",
        "name": "科宁公寓",
        "lnglat": "105.231962,28.304566",
        "count": 12
    },
    {
        "address": "中山西路360号",
        "name": "宁定大楼",
        "lnglat": "105.231681,28.304695",
        "count": 4
    },
    {
        "address": "中山西路380号",
        "name": "家电大楼",
        "lnglat": "105.231191,28.304899",
        "count": 4
    },
    {
        "address": "中山西路483号",
        "name": "碧云公寓",
        "lnglat": "107.478771,27.760186",
        "count": 7
    },
    {
        "address": "中山西路555号",
        "name": "绿洲大厦（上海）",
        "lnglat": "114.363582,27.799196",
        "count": 17
    },
    {
        "address": "中山西路699弄",
        "name": "上海虹桥绿郡",
        "lnglat": "114.361828,27.798889",
        "count": 2
    },
    {
        "address": "中山西路750号",
        "name": "虹桥商务写字楼",
        "lnglat": "120.532858,30.639914",
        "count": 1
    },
    {
        "address": "中山西路800弄57号",
        "name": "紫虹大厦",
        "lnglat": "114.361075,27.799313",
        "count": 2
    },
    {
        "address": "中山西路930号",
        "name": "云都虹桥大厦",
        "lnglat": "121.412626,31.200446",
        "count": 4
    },
    {
        "address": "中山西路933号",
        "name": "虹桥银城",
        "lnglat": "120.902841,30.840791",
        "count": 25
    },
    {
        "address": "中山西路999号",
        "name": "华闻国际大厦",
        "lnglat": "114.353249,27.796349",
        "count": 45
    },
    {
        "address": "中潭路33/91/99/100弄，远景路97弄",
        "name": "中远两湾城",
        "lnglat": "121.448675,31.251755",
        "count": 761
    },
    {
        "address": "中心路1450弄",
        "name": "华亭茗苑",
        "lnglat": "113.940405,22.505453",
        "count": 62
    },
    {
        "address": "中兴路1101号",
        "name": "昆泰大厦",
        "lnglat": "121.465119,31.252638",
        "count": 10
    },
    {
        "address": "中兴路373号",
        "name": "兴园373号",
        "lnglat": "106.048544,29.836210",
        "count": 4
    },
    {
        "address": "中谊路1215号",
        "name": "福克斯商务大厦",
        "lnglat": "121.347588,31.135899",
        "count": 7
    },
    {
        "address": "中谊路699号",
        "name": "华友大厦（上海）",
        "lnglat": "121.358894,31.140970",
        "count": 4
    },
    {
        "address": "中谊路888弄86-136号",
        "name": "碧林湾",
        "lnglat": "121.353940,31.140553",
        "count": 74
    },
    {
        "address": "中谊路909弄",
        "name": "碧林湾摩登堂",
        "lnglat": "121.354157,31.138899",
        "count": 103
    },
    {
        "address": "众安路879弄",
        "name": "上海意得商城",
        "lnglat": "121.656346,31.029100",
        "count": 350
    },
    {
        "address": "众仁路375号",
        "name": "勇立大厦",
        "lnglat": "121.325376,31.288884",
        "count": 3
    },
    {
        "address": "众仁路399号",
        "name": "上海运通星财富广场",
        "lnglat": "121.324572,31.289859",
        "count": 39
    },
    {
        "address": "重固镇大街518号",
        "name": "逸皓华庭",
        "lnglat": "121.182144,31.192216",
        "count": 92
    },
    {
        "address": "重固镇大街588号",
        "name": "新世纪商业广场",
        "lnglat": "121.181678,31.193582",
        "count": 14
    },
    {
        "address": "重固镇大街666弄",
        "name": "锦绣雅苑",
        "lnglat": "121.181217,31.195209",
        "count": 21
    },
    {
        "address": "重庆南路310号",
        "name": "新电大厦",
        "lnglat": "121.472016,31.209555",
        "count": 7
    },
    {
        "address": "周邓公路6600弄",
        "name": "海尚乐苑",
        "lnglat": "121.603098,31.116331",
        "count": 140
    },
    {
        "address": "周东路782弄22支弄",
        "name": "日月星城（上海）",
        "lnglat": "121.583658,31.125172",
        "count": 18
    },
    {
        "address": "周家嘴路1299弄",
        "name": "上海大花园",
        "lnglat": "121.511064,31.264996",
        "count": 60
    },
    {
        "address": "周家嘴路2000弄",
        "name": "锦丽斯公寓",
        "lnglat": "121.516187,31.266389",
        "count": 14
    },
    {
        "address": "周家嘴路2001弄",
        "name": "东银茗苑",
        "lnglat": "121.515731,31.267516",
        "count": 81
    },
    {
        "address": "周家嘴路2188弄",
        "name": "泰鸿苑",
        "lnglat": "121.517512,31.267792",
        "count": 6
    },
    {
        "address": "周家嘴路2809号",
        "name": "凤城巷三期",
        "lnglat": "121.524178,31.272900",
        "count": 11
    },
    {
        "address": "周家嘴路3158弄",
        "name": "双阳公寓",
        "lnglat": "121.533424,31.275758",
        "count": 29
    },
    {
        "address": "周家嘴路3255号",
        "name": "上海船舶大楼",
        "lnglat": "121.534036,31.276663",
        "count": 1
    },
    {
        "address": "周家嘴路338弄",
        "name": "馨虹苑",
        "lnglat": "121.496871,31.253701",
        "count": 27
    },
    {
        "address": "周康路129弄",
        "name": "南郊花园东区",
        "lnglat": "121.572450,31.109956",
        "count": 34
    },
    {
        "address": "周康路869弄",
        "name": "御沁园（2地块）",
        "lnglat": "121.576018,31.103504",
        "count": 33
    },
    {
        "address": "周市路39弄",
        "name": "粤亮湾景苑",
        "lnglat": "121.581971,31.110367",
        "count": 68
    },
    {
        "address": "周市路416号",
        "name": "慧晶国际公寓",
        "lnglat": "121.580809,31.117662",
        "count": 24
    },
    {
        "address": "周园北路522弄",
        "name": "康湾苑",
        "lnglat": "121.587518,31.130648",
        "count": 48
    },
    {
        "address": "昼锦路180弄",
        "name": "复地雅园",
        "lnglat": "121.490908,31.223135",
        "count": 30
    },
    {
        "address": "朱家角路158弄",
        "name": "大发融悦华庭",
        "lnglat": "121.086243,31.135477",
        "count": 144
    },
    {
        "address": "朱家角路588弄",
        "name": "首创禧悦新苑",
        "lnglat": "121.079622,31.131307",
        "count": 151
    },
    {
        "address": "朱建路666弄1-35号",
        "name": "虹桥博雅苑",
        "lnglat": "121.262183,31.214190",
        "count": 196
    },
    {
        "address": "朱金公路801号",
        "name": "百士威大楼",
        "lnglat": "121.320706,31.108960",
        "count": 18
    },
    {
        "address": "珠城路118弄",
        "name": "新梅莘苑",
        "lnglat": "120.829734,27.995609",
        "count": 55
    },
    {
        "address": "珠城路158号",
        "name": "解放日报大厦C座",
        "lnglat": "121.388707,31.104144",
        "count": 2
    },
    {
        "address": "株洲路168弄",
        "name": "城城金岛苑",
        "lnglat": "120.464293,36.137675",
        "count": 16
    },
    {
        "address": "株洲路309号(近广中路)",
        "name": "宝华城立方",
        "lnglat": "121.471954,31.277752",
        "count": 3
    },
    {
        "address": "株洲路388弄",
        "name": "建明花苑",
        "lnglat": "121.464951,31.279357",
        "count": 16
    },
    {
        "address": "株洲路399弄",
        "name": "宝华城市花园",
        "lnglat": "121.465388,31.279434",
        "count": 72
    },
    {
        "address": "株洲路9弄",
        "name": "菁鸿锦庭",
        "lnglat": "121.466042,31.274279",
        "count": 21
    },
    {
        "address": "竹柏路500弄",
        "name": "保利蔚蓝林语",
        "lnglat": "121.903998,30.902703",
        "count": 81
    },
    {
        "address": "竹笛路388弄",
        "name": "宝菊清水园",
        "lnglat": "121.226752,31.373941",
        "count": 80
    },
    {
        "address": "竹林路101号",
        "name": "陆家嘴基金大厦",
        "lnglat": "115.940154,30.085724",
        "count": 1
    },
    {
        "address": "竹柳路50弄135号",
        "name": "安居锦竹苑",
        "lnglat": "121.347677,31.290063",
        "count": 78
    },
    {
        "address": "竹盈路160号",
        "name": "浪潮科创园",
        "lnglat": "121.107250,31.168930",
        "count": 4
    },
    {
        "address": "竹盈路339弄",
        "name": "卓越E时代创业中心",
        "lnglat": "121.099561,31.169093",
        "count": 16
    },
    {
        "address": "竹园路518号",
        "name": "德宏商务中心",
        "lnglat": "121.514167,31.070599",
        "count": 7
    },
    {
        "address": "祝潘公路699号",
        "name": "嘉荣商务广场",
        "lnglat": "121.773368,31.128137",
        "count": 20
    },
    {
        "address": "颛桥镇颛兴东路1559号万达广场(颛桥店)F1层",
        "name": "孩子王(上海颛桥万达店)",
        "lnglat": "121.397217,31.068340",
        "count": 12
    },
    {
        "address": "颛兴东路1058号",
        "name": "红园企业总部园",
        "lnglat": "121.423073,31.077009",
        "count": 2
    },
    {
        "address": "颛兴东路1280弄14号",
        "name": "南滨江科创园",
        "lnglat": "121.418803,31.075398",
        "count": 20
    },
    {
        "address": "颛兴东路1313号",
        "name": "云部落大厦",
        "lnglat": "121.417487,31.073669",
        "count": 16
    },
    {
        "address": "颛兴东路1331号",
        "name": "TMT大厦",
        "lnglat": "121.416596,31.073274",
        "count": 17
    },
    {
        "address": "颛兴东路1550弄",
        "name": "剑桥馨苑",
        "lnglat": "121.408852,31.072255",
        "count": 160
    },
    {
        "address": "颛兴东路745号",
        "name": "拉法叶园区",
        "lnglat": "121.426441,31.076993",
        "count": 7
    },
    {
        "address": "颛兴东路999弄",
        "name": "阳明创业园",
        "lnglat": "121.423692,31.075352",
        "count": 12
    },
    {
        "address": "颛兴路666弄",
        "name": "日月华城",
        "lnglat": "121.389193,31.065533",
        "count": 60
    },
    {
        "address": "梓康路580弄",
        "name": "双秀西园",
        "lnglat": "121.561418,31.121610",
        "count": 35
    },
    {
        "address": "紫乐路8号",
        "name": "魔方公寓虹中路店",
        "lnglat": "121.381812,31.181353",
        "count": 3
    },
    {
        "address": "紫龙路200弄",
        "name": "万科青藤公园",
        "lnglat": "121.470703,31.035035",
        "count": 72
    },
    {
        "address": "紫薇路667弄",
        "name": "阳光花城",
        "lnglat": "113.205703,23.405713",
        "count": 252
    },
    {
        "address": "紫秀路100号",
        "name": "虹桥总部1号",
        "lnglat": "121.381751,31.180251",
        "count": 30
    },
    {
        "address": "紫云路118号",
        "name": "虹桥豪苑",
        "lnglat": "118.415344,29.865041",
        "count": 16
    },
    {
        "address": "紫云西路28弄",
        "name": "翠庭",
        "lnglat": "121.405471,31.207320",
        "count": 43
    },
    {
        "address": "紫云西路50弄",
        "name": "虹桥紫云苑二期",
        "lnglat": "121.404488,31.207185",
        "count": 16
    },
    {
        "address": "紫云西路89弄",
        "name": "虹桥紫云苑",
        "lnglat": "121.403948,31.207063",
        "count": 24
    },
    {
        "address": "走马塘路1118弄",
        "name": "乾康苑",
        "lnglat": "121.313830,30.146218",
        "count": 14
    },
    {
        "address": "走马塘路1228弄",
        "name": "保利熙悦",
        "lnglat": "121.372140,31.304864",
        "count": 115
    },
    {
        "address": "祖冲之路1559号",
        "name": "创意大厦（上海）",
        "lnglat": "121.611915,31.207638",
        "count": 6
    },
    {
        "address": "祖冲之路2290号",
        "name": "展想广场",
        "lnglat": "121.628251,31.210452",
        "count": 36
    },
    {
        "address": "祖冲之路2305号",
        "name": "张江高科创新基地895孵化器",
        "lnglat": "121.628307,31.212716",
        "count": 10
    },
    {
        "address": "祖冲之路295号",
        "name": "夏新大楼",
        "lnglat": "121.582134,31.201634",
        "count": 2
    },
    {
        "address": "祖冲之路887弄",
        "name": "张江高科四标园区",
        "lnglat": "121.594264,31.205155",
        "count": 16
    },
    {
        "address": "遵义路107号",
        "name": "安泰大厦",
        "lnglat": "106.707832,26.563407",
        "count": 8
    },
    {
        "address": "遵义路797号",
        "name": "虹桥国际大厦",
        "lnglat": "121.408000,31.216470",
        "count": 8
    },
    {
        "address": "遵义南路88号",
        "name": "协泰中心",
        "lnglat": "121.406209,31.204319",
        "count": 6
    },
    {
        "address": "遵义南路8号",
        "name": "锦明大厦",
        "lnglat": "121.406670,31.203854",
        "count": 29
    }
]